Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: es, ja, pt_br, zh_hans

source: Which sites use Django?
es: ¿Qué sitios usan Django?
ja: Django を使っているサイトを教えてください。
pt_br: Quais sites usam Django?
zh_hans: 哪些站点使用Django?

source: `DjangoSites.org`_ features a constantly growing list of Django-powered sites.
es: `DjangoSites.org`_ cuenta con una lista cada vez mayor de sitios web que funcionan con Django.
ja: `DjangoSites.org`_ を見ると、Django で作られたサイトのリストが見られます。このリストはどんどん長くなっています。
pt_br: `DjangoSites.org`_ possui uma lista crescente de sites construídos utilizando Django.
zh_hans: `DjangoSites.org`的特色是提供一个不断增长的使用Django搭建的网站的列表。

source: Django appears to be a MVC framework, but you call the Controller the "view", and the View the "template". How come you don't use the standard names?
es: Django parece ser un framework MVC, pero llamas al Controlador "vista", y a la Vista "plantilla". ¿Cómo es que no usan los nombres estándares?
ja: Django は MVC フレームワークのように思えるのですが、コントローラ (Controller) を「ビュー (view)」と呼び、ビュー (View) を「テンプレート (template)」と呼んでいます。なぜ標準的な呼び方をしないのですか？
pt_br: Django afirma ser um framework MVC, mas ele chama o Controller de "view" e a View de "template". Por que não usar os nomes padrões?
zh_hans: Django 似乎是一个 MVC 框架，但是您将控制器称为“视图”，并视图称为“模板”。 为什么不使用标准命名？

source: Well, the standard names are debatable.
es: Bueno, los nombres estándar son debatibles.
ja: たしかに、標準的な名前については議論の余地があるかもしれません。
pt_br: Bem, os nomes padrões são discutíveis.
zh_hans: 当然，标准化的名称是有争议的。

source: In our interpretation of MVC, the "view" describes the data that gets presented to the user. It's not necessarily *how* the data *looks*, but *which* data is presented. The view describes *which data you see*, not *how you see it.* It's a subtle distinction.
es: En nuestra interpretación de MVC, la "vista" describe el dato que es presentado al usuario. No es necesariamente *cómo* se *ve* el dato, sino *cuál* es presentado. La vista describe *cuál dato ves*, no *cómo lo ves*. Es una distinción sutil.
ja: Django の MVC の解釈では、「ビュー」はユーザに表示するデータを記述します。つまり、ビューにはデータの *見せ方* を書く必要はなく、表示したいデータの *選び方* を書くものだと考えます。*ユーザが見るのはどのデータなのか*を書くのであって、*ユーザに対するデータの表示の仕方*を書くわけではないということです。この二つは明らかに違います。
pt_br: Em nosso entendimento de MVC, a "view" representa os dados que são apresentados ao usuário. Nao é necessariamente *como* a informação *é apresentada*, mas *qual* informação é mostrada. A view representa *qual informação você vê*, não *como você vê*. Há uma sutil diferença.
zh_hans: 在我们对MVC的解释中，“视图”描述了呈现给用户的数据。数据看起来怎么样并不重要，重要的是哪些数据被呈现。该视图描述了*您看到了哪些数据*，而不是*您怎么看到数据。*这是一个微妙的区别。

source: So, in our case, a "view" is the Python callback function for a particular URL, because that callback function describes which data is presented.
es: Así pues, en nuestro caso, una "vista" es la función de callback en Python para una URL en particular, porque esta función callback describe cuál dato es presentado.
ja: そのため、Django では「ビュー」は特定の URL に対する Python コールバック関数になっています。なぜなら、コールバック関数は、どのデータを提示するかということを書いているからです。
pt_br: Então, nesse caso, uma "view" é uma função de retorno para uma URL específica, por que esta função de retorno descreve qual informação é apresentada.

source: Furthermore, it's sensible to separate content from presentation -- which is where templates come in. In Django, a "view" describes which data is presented, but a view normally delegates to a template, which describes *how* the data is presented.
es: Por lo tanto, es delicado el separar contenido de la presentación -- lo cuál es donde entran las plantillas. En Django, una "vista" describe cual dato es presentado, pero una vista normalmente lo delega a una plantilla, la cual describe *cómo* es presentado el dato.
ja: さらに、テンプレートによってコンテンツとプレゼンテーションの分離がはっきり しています。Django では、ビューはどのデータを提示するかを決めていますが、 ビューは通常、*どのように*データを提示するかをテンプレートに委ねます。
pt_br: Além disso, é imprescindível separar conteúdo de apresentação -- onde os templates residem. No Django, uma "view' descreve qual informação é apresentada, mas uma view normalmalmente delega para um template, que descreve *como* a informação é apresentada.

source: Where does the "controller" fit in, then? In Django's case, it's probably the framework itself: the machinery that sends a request to the appropriate view, according to the Django URL configuration.
es: Entonces, ¿donde entra el "controlador"? En el caso de Django, es probable que en el mismo framework: la maquinaria que envía una petición a la vista apropiada, de acuerdo a la configuración de URL de Django.
ja: では、「コントローラ」はどこに入るのでしょうか。 Django の場合、おそらくフ レームワーク、すなわち URL 設定にしたがってリクエストを適切なビューに送信する機構自体がコントローラにあたるといえるでしょう。
pt_br: Onde o "controller" se encaixa, então? No caso do Django, é provavelmente o próprio framework - o maquinário que envia uma requisição para a "view" apropriada, de acordo com a configuração de URL do Django.

source: If you're hungry for acronyms, you might say that Django is a "MTV" framework -- that is, "model", "template", and "view." That breakdown makes much more sense.
es: Si tienes hambre de acrónimos, podrías decir que Django es un framework "MPV" -- esto es "modelo", "plantilla" y, "vista". Esa forma tiene mucho más sentido.
ja: 略語がお好みなら、 Django を “MTV” フレームワークと呼んでもよいでしょう。つ まり、モデル "Model"、テンプレート "Template"、そしてビュー "View" です。 こっちの方がよりしっくりきます。
pt_br: Se você está faminto por acrônimos, você deve dizer que Django é um framework "MTV" -- Isto é, "model", "template" e "view". Essa correspondência faz muito mais sentido.

source: At the end of the day, of course, it comes down to getting stuff done. And, regardless of how things are named, Django gets stuff done in a way that's most logical to us.
es: Al final del día, por supuesto, la cuestión es terminar las cosas. Independientemente de cómo se nombren las cosas, Django consigue terminar las cosas en una forma que es más lógica para nosotros.
ja: 最後に、結局重要なのは問題を解決することです。そして、呼び方は何であれ、 Django はわれわれにとって最も理にかなった方法で問題を解決しているのです。
pt_br: No final do dia, é claro, tudo se resume a conseguir fazer coisas. Independentemente de como as coisas são nomeadas, Django as executa da forma que é mais lógica para nós.

source: <Framework X> does <feature Y> -- why doesn't Django?
es: El <Framework X> hace <característica Y> -- ¿Por qué no lo hace Django?
ja: <フレームワーク X> には <機能 Y> がありますが、なぜ Django にはないのですか
pt_br: <Framework X> faz <feature Y> -- por que o Django não?

source: We're well aware that there are other awesome Web frameworks out there, and we're not averse to borrowing ideas where appropriate. However, Django was developed precisely because we were unhappy with the status quo, so please be aware that "because <Framework X> does it" is not going to be sufficient reason to add a given feature to Django.
es: Estamos conscientes de que hay otros impresionantes frameworks web por ahí, y no tenemos adversión a tomar prestadas ideas donde sea apropiado. Sin embargo, Django fue desarrollado precisamente porque no estabamos felices con el estatus quo, así que toman en cuenta que "porque <Framework X> lo hace" no va a hacer una razón suficiente para agregar dicha característica a Django.
ja: 世の中には他にも素晴らしい Web フレームワークがあるのは良く知っていますし、 必要であればそこからアイデアを借りるのにやぶさかではありません。とはいえ、 私たちが Django を開発した動機は、旧態然たる Web フレームワークに不満だった からこそなので、「<Framework X> でできるから」といって、同じ機能を Django に機能を追加する理由にはならないのです。
pt_br: Nós estamos bem conscientes de que existem outros frameworks para desenvolvimento web e nós não iremos nos opor a emprestar ideias quando apropriado. No entanto, Django foi desenvolvido exatamente porque nós estávamos infelizes com o status quo. Portanto, por favor note que "porquê o <Framework X> faz tal coisa" não vai ser razão suficiente para adicionar uma determinada funcionalidade ao Django.

source: Why did you write all of Django from scratch, instead of using other Python libraries?
es: ¿Por qué escribieron todo Django desde cero, en vez de usar otras bibliotecas Python?
ja: なぜ既存の Python ライブラリを使わずスクラッチで Django を作ったのですか？
pt_br: Por que você escreveu tudo no Django do zero, ao invés de usar outras bibliotecas Python?

source: When Django was originally written, Adrian and Simon spent quite a bit of time exploring the various Python Web frameworks available.
pt_br: Quando o Django foi originalmente escrito, Adrian e Simon gastaram um bom tempo explorando os vários frameworks Python disponíveis.

source: In our opinion, none of them were completely up to snuff.
es: En nuestra opinión, ninguno de ellos era completamente satisfactorio.
ja: その結果、十分な出来具合のものは一つもないという結論に達したのです。
pt_br: Em nossa opinião, nenhum deles era completamente satisfatório.

source: We're picky. You might even call us perfectionists. (With deadlines.)
es: Somos exigentes. Podrías incluso llamarnos perfeccionistas. (Con las fechas límite).
ja: 私達は好みにうるさいのです。(締め切りに追われる) 完璧主義者と呼んでもいいで しょう。
pt_br: Nós somos exigentes. Você pode até nos chamar de perfeccionistas. (Com prazos.)
zh_hans: 我们很挑剔。甚至你可以说我们是完美主义者。（有截止期限的）

source: Over time, we stumbled across open-source libraries that did things we'd already implemented. It was reassuring to see other people solving similar problems in similar ways, but it was too late to integrate outside code: We'd already written, tested and implemented our own framework bits in several production settings -- and our own code met our needs delightfully.
es: Con el paso del tiempo, nos topamos con bibliotecas open-source que hacían cosas que ya habíamos implementado. Era reconfortante ver a otras personas resolviendo problemas similares de maneras similares, probadas e implementadas en sus propios frameworks en varias configuraciones de producción -- y que nuestro propio código satisfacía nuestras necesidades deliciosamente.
ja: これまでずっと、私達は自分たちがすでに実装済みの機能を実現するオープンソースライブラリに出会ってきました。そうしたライブラリに、他の人達が同じ問題を同じ方法で解決しようとしているのを見ては元気づけられる思いでしたが、自分たちのコードの外側に組み込むにはもう遅すぎました。私達はすでにいくつもの運用 環境で独自のフレームワークを書き上げ、テストし、実装してきており、できたコー ドは快適なまでに要求を満たしていたのです。
pt_br: Ao longo do tempo nós esbarramos em bibliotecas open-source que faziam coisas que nós já havíamos implementado. Foi reconfortante ver outras pessoas resolvendo problemas de maneiras similares, no entanto, era tarde demais para integrar código externo - nós já havíamos escrito, testado e implementado nossos próprios pedaços de framework em diversas configurações de produção -- e nosso código atendia deliciosamente às nossas necessidades.

source: In most cases, however, we found that existing frameworks/tools inevitably had some sort of fundamental, fatal flaw that made us squeamish. No tool fit our philosophies 100%.
es: En la mayoría de los casos, sin embargo, encontramos que los frameworks/herramientas inevitablemente tenían algún tipo de error fatal fundamental que nos hacía remilgar. Ninguna herramienta encajaba con nuestra filosofía al 100%.
ja: 一方、ほとんどの場合、既存のフレームワークやツールは明らかにある主の根本的、致命的な欠陥があり、私達を神経質にさせました。結局、私達の哲学に100%合うものはなかったのです。
pt_br: Na maioria dos casos, no entanto, nós descobrimos que as ferramentas e frameworks existentes possuíam inevitavelmente algum tipo de falha fundamental que nos deixava enojados. Nenhuma ferramenta encaixava-se em nossa filosofia 100%.

source: Like we said: We're picky.
es: Como dijimos: Somos exigentes.
ja: 繰り返していいますが、私達は好みにうるさいのです。
pt_br: Como nós dissemos: Somos exigentes.
zh_hans: 正如我们所说的：我们很挑剔

source: We've documented our philosophies on the :doc:`design philosophies page </misc/design-philosophies>`.
ja: 私達の設計哲学は :doc:`設計哲学のページ</misc/design-philosophies>` に詳し く書いてあります。
pt_br: Nós documentamos nossas filosofias na documentação: :doc:`Página de filosofias de design </misc/design-philosophies>`.

source: Is Django a content-management-system (CMS)?
es: ¿Django es un Sistema de Administración de Contenidos (CMS)?
ja: Django はコンテンツ管理システム (CMS) なのでしょうか?
pt_br: O Django é um sistema de Gestão de Conteúdo (CMS)?
zh_hans: Django是个内容管理系统(CMS)吗?

source: No, Django is not a CMS, or any sort of "turnkey product" in and of itself. It's a Web framework; it's a programming tool that lets you build websites.
ja: いいえ。 Django は CMS ではありませんし、いわゆる「ターンキーシステム」のようなものでもありません。 Django は Web フレームワークであり、 Web サイトを構築する際に使えるプログラミングツールにすぎません。
pt_br: Não, Django não é um CMS, ou algum tipo de "turnkey product" de si mesmo. É um framework Web; É uma ferramenta de programação que te possibilita construir websites.

source: For example, it doesn't make much sense to compare Django to something like Drupal_, because Django is something you use to *create* things like Drupal.
es: Por ejemplo, no hace mucho sentido el comparar Django a algo como Drupal_, porque Django es algo que usas para *crear* cosas como Drupal.
ja: 例えば、 Django を Drupal_ のようなシステムと比較するのは無意味です。というのも、 Django はまさに Drupal のようなシステムを *作る* ためのものだからで す。
pt_br: Por exemplo, não faz muito sentido comparar Django com algo como Drupal_, porque Django é algo que você usa para *criar* coisas como Drupal.

source: Of course, Django's automatic admin site is fantastic and timesaving -- but the admin site is one module of Django the framework. Furthermore, although Django has special conveniences for building "CMS-y" apps, that doesn't mean it's not just as appropriate for building "non-CMS-y" apps (whatever that means!).
es: Por supuesto, el sitio de administración de Django creado automáticamente es fantástico y ahorra tiempo -- pero es sólo un módulo del framework. Además, a pesar de que Django tiene algunas ventajas para construir aplicaciones tipo "CMS", esto no significa que no es tan apropiado para construir aplicaciones "no CMS" (¡lo que sea que eso signifique!).
ja: もちろん、 Django の自動 admin サイトはすばらしく、開発時間の節約になります。 しかし、 admin サイトは Django というフレームワークのいちモジュールに過ぎません。もっと言うなら、 Django が「 CMS 的な」アプリケーションを作成する上でとりわけ便利な点を持ってはいますが、そのことが「 CMS 的でない」アプリケーショ ンの開発に向いていない、なんてことにつながったりはしないのです(とにかくDjangoはCMSじゃないってことです!)。
pt_br: É claro que o site automático de administração do Django é fantástico e economiza tempo -- no entanto, esse site é um módulo do framework Django. Além disso, apesar do Django ter facilidades especiais para construir aplicações que servem como gerenciadores de conteúdo (CMS) não significa que ele não é igualmente apropriado para construírem aplicações com outros propósitos.

source: How can I download the Django documentation to read it offline?
es: ¿Cómo puedo descargar la documentación de Django para leerla sin conexión?
ja: どうやれば Django のドキュメントをダウンロードしてオフラインで読めますか？
pt_br: Como posso baixar a documentação do Django para lê-la offline?
zh_hans: 我如何下载Django文档进行离线阅读?

source: The Django docs are available in the ``docs`` directory of each Django tarball release. These docs are in reST (reStructuredText) format, and each text file corresponds to a Web page on the official Django site.
es: La documentación de Django está disponible en la carpeta ``docs`` de cada publicación de Django. Estos documentos están en formato reST (reStructuredText), y cada archivo de texto corresponde a una página Web en el sitio oficial de Django.
ja: Django のドキュメントは Django tarball リリースの docs ディレクトリに あります。これらのドキュメントは reST (reStructuredText) 形式で書かれており、 各テキストファイルが Django 公式サイトのページに対応しています。
pt_br: A documentação do Django está disponível na pasta ``docs`` de cada distribuição em tarball. Essa documentação está no formato reST (reStructuredText) e cada arquivo de texto corresponde a uma página no site oficial do Django.

source: Because the documentation is `stored in revision control`_, you can browse documentation changes just like you can browse code changes.
es: Debido a que la documentación está `almacenada en un control de revisión`_, puedes revisar los cambios en la documentación de la misma forma en que revisas cambios en el código.
ja: ドキュメントは バージョン管理システム下にある `stored in revision control`_ ので、コードの変更状況を閲覧するのと同じようにしてドキュメントの変更状況を閲覧できます。
pt_br: Porque a documentação está `armazenada em controle de revisão`_. você pode navegar as mudanças na documentação da mesma forma que pode navegar em mudanças de código.

source: Technically, the docs on Django's site are generated from the latest development versions of those reST documents, so the docs on the Django site may offer more information than the docs that come with the latest Django release.
es: Técnicamente, la documentación en el sitio de Django es generada desde la última versión de desarrollo de esos documentos reST, así que la documentación en el sitio de Django puede ofrecer más información que los documentos que vienen con la última publicación de Django.
ja: 技術的には、 Django サイトのドキュメントは最新の開発版の reST ドキュメントから生成されます、従って、 Django サイトにあるドキュメントの方が、最新の Django リリースのドキュメントよりも多くの情報を提供していることがあります。
pt_br: Tecnicamente, a documentação no site do Django é gerada a partir da última versão de desenvolvimento dos documentos reST. Por conta disso, a documentação no site do Django pode oferecer mais informações do que a que vem com a última distribuição do Django.

source: How do I cite Django?
es: ¿Cómo puedo citar a Django?
pt_br: Como eu cito o Django?

source: It's difficult to give an official citation format, for two reasons: citation formats can vary wildly between publications, and citation standards for software are still a matter of some debate.
es: Es difícil dar un formato oficial de cita, esto por dos razones: los formatos de cita pueden variar salvajemente entre publicaciones, y los estándares para citar software son aún materia de debate.
pt_br: É difícil dar um formato oficial de citação por duas razões: os formatos podem variar bastante entre publicações e padrões de citação para software ainda é uma questão debatível.

source: For example, `APA style`_, would dictate something like::
es: Por ejemplo, el `estilo APA`_, dictaría algo como ::
pt_br: Por exemplo, o `estilo APA`_, ditaria algo como::

source: However, the only true guide is what your publisher will accept, so get a copy of those guidelines and fill in the gaps as best you can.
es: Sin embargo, la única real es lo que tu editor aceptará, así que obtén una de esas guías y llena los vacíos lo mejor que puedas.
pt_br: No entanto, a única orientação verdadeira é aquela que o seu editor irá aceitar, então pegue uma cópia dessas instruções e preencha as lacunas da melhor forma possível.

source: If your referencing style guide requires a publisher name, use "Django Software Foundation".
es: Si tu guía de estilo de refencias requiere un nombre de editor, usa "Django Software Foundation".
pt_br: Se o seu guia de referência requer o nome do editor, use "Django Software Foundation".

source: If you need a publishing location, use "Lawrence, Kansas".
es: Si necesitas un lugar de publicación, usa "Lawrence, Kansas".
pt_br: Se você precisa de um local de publicação, use "Lawrence, Kansas".

source: If you need a web address, use https://djangoproject.com.
es: Si necesitas una dirección web, usa https://djangoproject.com.
pt_br: Se você precisa de um endereço da Web, use https://djangoproject.com.
zh_hans: 如果你需要一个网址，使用https://djangoproject.com。

source: If you need a name, just use "Django", without any tagline.
es: Si necesitas un nombre, sólo usa "Django", sin ningún subtítulo.
pt_br: Se você precisa de um nome, basta usar "Django", sem qualquer slogan.
zh_hans: 如果你需要一个名字，只需使用“django”，没有任何修饰符号

source: If you need a publication date, use the year of release of the version you're referencing (e.g., 2013 for v1.5)
es: Si necesitas una fecha de publicación, usa el año de liberación de la versión que estás referenciando (por ejemplo, 2013 para v1.5)
pt_br: Se você precisa de uma data de publicação, utilize o ano de distribuição da versão a qual você está se referindo (por exemplo: 2013 para a versão 1.5).
zh_hans: 如果您需要发布日期，请使用您所引用版本的发布年份（例如，2013 for v1.5）

source: FAQ: Getting Help
es: FAQ: Obteniendo ayuda
ja: FAQ: 助けを求める
pt_br: FAQ: Obtendo ajuda
zh_hans: FAQ:获取帮助

source: How do I do X? Why doesn't Y work? Where can I go to get help?
es: ¿Cómo hago X cosa?¿Por qué Y no funciona?¿Dónde puedo obtener ayuda?
pt_br: Como faço X? Por que Y não funciona? Onde devo ir para conseguir ajuda?
zh_hans: 我该如何做x？Y为什么不工作？我可以去哪里寻求帮助？

source: If this FAQ doesn't contain an answer to your question, you might want to try the |django-users| mailing list. Feel free to ask any question related to installing, using, or debugging Django.
pt_br: Se esse FAQ não contém uma resposta para sua questão, você pode tentar a lista de e-mail |django-users|. Sinta-se à vontade para perguntar qualquer questão relacionada à: instalação, utilização e/ou depuração.
zh_hans: 如果FAQ没有包含对你问题的回答，你可以试试|django-users| 的邮件列表，随意问任何有关安装，使用或调试Django的问题。

source: If you prefer IRC, the `#django IRC channel`_ on the Freenode IRC network is an active community of helpful individuals who may be able to solve your problem.
es: Si prefieres el IRC, el `canal IRC #django`_ en la red IRC Freenode es una comunidad activa de personas útiles que te pueden ayudar a resolver tu problema.
pt_br: Se você prefere IRC o `canal IRC #django`_ na rede Freenode é uma comunidade ativa de indivíduos prestativos que podem conseguir resolver seu problema.
zh_hans: 如果你更喜欢IRC，Freenode IRC网络上的`#django IRC channel`_ 是一个有帮助的个人谁可能能够解决您的问题积极的社区。

source: Why hasn't my message appeared on `django-users`?
pt_br: Porque minha mensagem não apareceu no `django-users` ?
zh_hans: 为什么我的信息没有出现在 `django-users`上面？

source: |django-users| has a lot of subscribers. This is good for the community, as it means many people are available to contribute answers to questions. Unfortunately, it also means that |django-users| is an attractive target for spammers.
pt_br: |django-users| tem bastante assinantes. Isso é bom para a comunidade, uma vez que significa que existem diversas pessoas disponíveis para responder questões. Infelizmente, isso também significa que a lista |django-users| é um alvo atraente para spammers.

source: In order to combat the spam problem, when you join the |django-users| mailing list, we manually moderate the first message you send to the list. This means that spammers get caught, but it also means that your first question to the list might take a little longer to get answered. We apologize for any inconvenience that this policy may cause.
pt_br: Para combater o problema com spam, quando você se inscrever na lista de e-mail |django-users|, nós vamos moderar manualmente a primeira mensagem que você enviar para a lista. Isso significa que nós pegamos os spammers, mas também significa que a sua primeira pergunta na lista pode demorar um pouco mais do que o normal para ser respondida. Nós nos desculpamos por qualquer inconveniente que esta política possa causar.

source: Nobody on `django-users` answered my question! What should I do?
pt_br: Ninguém no `django-users` respondeu minha pergunta! O que devo fazer?

source: Try making your question more specific, or provide a better example of your problem.
es: Intenta hacer tu pregunta más específica o proveer un mejor ejemplo de tu problema.
pt_br: Tente fazer uma pergunta mais específica, ou apresente um exemplo melhor para o seu problema.
zh_hans: 试着更加具体地介绍你的问题，或提供一个关于你问题的更好的例子。

source: As with most open-source mailing lists, the folks on |django-users| are volunteers. If nobody has answered your question, it may be because nobody knows the answer, it may be because nobody can understand the question, or it may be that everybody that can help is busy. One thing you might try is to ask the question on IRC -- visit the `#django IRC channel`_ on the Freenode IRC network.
pt_br: Assim como a maioria das listas de e-mail de projetos open-source, as pessoas na |django-users| são voluntárias. Se ninguém respondeu a sua pergunta, isso pode ser poque ninguém sabe a resposta, porque ninguém entendeu a pergunta ou porque todos os que podem ajudar estão ocupados. Uma coisa que você pode tentar é realizar a pergunta no IRC -- visite o `canal IRC #django`_ na rede IRC Freenode.
