Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: es, ja, pt_br, zh_hans

source: It's important to understand there is a difference between "a ticket is being ignored" and "a ticket has not been attended to yet." Django's ticket system contains hundreds of open tickets, of various degrees of impact on end-user functionality, and Django's developers have to review and prioritize.
es: Es importante entender que existe una diferencia entre "un reporte siendo ignorado" y "un reporte que no ha sido atendido aún". El sistema de reportes de Django contiene cientos de reportes abiertos, de varios grados de impacto en la funcionalidad del usuario final, y los desarrolladores de Django necesitan revisar y priorizar.
ja: 「チケットが無視されていること」と「チケットがまだ通っていないこと」との間には違いがあることを理解することが重要です。Djangoのチケットシステムには数百もの未解決のチケットがあり、機能の点でエンドユーザに与える影響の度合いも様々です。そのため、Djangoの開発者はそれらをレビューして優先順位付けをする必要があります。
pt_br: É importante entender que existe uma diferença entre: "um tíquete está sendo ignorado" e "um tíquete ainda não foi atendido". O sistema de tíquetes do Django contém centenas de tíquetes abertos com diferentes graus de impacto na funcionalidade para o usuário final, e os desenvolvedores do Django precisam revê-los e priorizá-los.
zh_hans: 重要的是要明白，“票被忽略”和“票还没有出席”是有区别的。 Django的门票系统包含数百个打开的门票，对最终用户功能有不同程度的影响，Django的开发人员必须检查并确定优先级。

source: On top of that: the people who work on Django are all volunteers. As a result, the amount of time that we have to work on the framework is limited and will vary from week to week depending on our spare time. If we're busy, we may not be able to spend as much time on Django as we might want.
es: Además de eso: las personas que trabajan en Django son todos voluntarios. Como resultado, el tiempo que tenemos para trabajar en el framework es limitado y variará de semana en semana en dependencia de nuestro tiempo libre. Si estamos ocupado, es posible que no podamos emplear todo el tiempo en Django como quisiéramos.
pt_br: Acima de tudo: as pessoas que trabalham com o Django são voluntários. Como resultado, a quantidade de tempo disponível que nós temos para trabalhar no framework é limitado e irá variar de semana a semana dependendo de nosso tempo livre. Se estivermos ocupados, nós não estaremos disponíveis para dedicar tanto tempo com o Django quanto gostaríamos.
zh_hans: 另外：所有的Django工作都是由志愿者完成的。因此，我们花在这个框架上的总时间是有限的，它取决于我们的空闲时间，并且每周都会有所不同。如果我们很忙，我们可能无法在Django上花费太多的时间，尽管我们不愿如此。

source: The best way to make sure tickets do not get hung up on the way to checkin is to make it dead easy, even for someone who may not be intimately familiar with that area of the code, to understand the problem and verify the fix:
es: La mejor forma de asegurarse que los reportes no quedan colgados en el camino a ser chequeados es resolviéndolo, incluso para algunos que podrían no estar familiarizados con esa área del código, para entender el problema y verificar el arreglo:
pt_br: A melhor maneira de ter certeza de que os tíquetes não vão ficar parados no caminho para o check-in é deixá-los bem fáceis, mesmo para alguém que pode não ser intimamente familiar com aquela área do código, para compreender o problema e verificar a solução:
zh_hans: 确保工单在签入过程中不被挂起的最佳方法是让它变得非常易于理解问题并验证修复程序，甚至是对于那些可能不熟悉该代码领域的人来说：

source: Are there clear instructions on how to reproduce the bug? If this touches a dependency (such as Pillow), a contrib module, or a specific database, are those instructions clear enough even for someone not familiar with it?
es: ¿Existen instrucciones claras sobre cómo reproducir el error? Si esto toca alguna dependencia (como Pillow), un módulo de contribución o base de dato específica. ¿Son lo suficientemente claras esas instrucciones incluso para alguien no familiarizado con ello?
pt_br: Existem instruções claras de como reproduzir o bug? Se isso envolve uma dependência (como o Pillow), um módulo de terceiros ou um banco de dados específico, essas instruções são claras o suficiente? Mesmo para alguém não familiar com isso?
zh_hans: 是否有明确的用以重现bug的说明？ 是否触及依赖项（如Pillow），contrib模块或特定数据库？这些说明对于不熟悉它的人是否也足够明确？

source: If there are several patches attached to the ticket, is it clear what each one does, which ones can be ignored and which matter?
es: Si existen varios parches adjuntados al reporte, ¿Se tiene claro qué hace cada uno, cuáles pueden ser ignorados y cuál importa?
pt_br: Se existirem diversos reparos anexados ao tíquete... Está claro o que cada um faz? Quais podem ser ignorados e quais importam?
zh_hans: 如果工单附有多个补充，是否能够明确每个补充是做什么的、哪些补充可以忽略，哪些补充很重要？

source: Does the patch include a unit test? If not, is there a very clear explanation why not? A test expresses succinctly what the problem is, and shows that the patch actually fixes it.
es: ¿Incluye el parche las pruebas unitarias? Si no, ¿existe una muy clara explicación de por qué no? Una prueba expresa de forma resumida cuál es el problema y muestra que el parche realmente lo arregla.
pt_br: O reparo inclui um teste unitário? Em caso negativo, existe uma explicação bem clara sobre o motivo? Um teste expressa do que se trata o problema de forma sucinta e demonstra que o reparo realmente o corrige.
zh_hans: 补丁是否包括单元测试？如果没有，那么是否可以解释清楚原因？测试可以简洁地表达了问题所在，并显示补丁真的修复了问题。

source: If your patch stands no chance of inclusion in Django, we won't ignore it -- we'll just close the ticket. So if your ticket is still open, it doesn't mean we're ignoring you; it just means we haven't had time to look at it yet.
es: Si tu parche no tiene posibilidad de ser incluido en Django, no lo ignoraremos -- simplemente cerraremos el reporte. Así que si tu reporte todavía permanece abierto, no significa que te estamos ignorando; es solo que no hemos tenido tiempo de mirarlo aún.
pt_br: Se sua sugestão não tiver nenhuma possibilidade de inclusão no Django, não vamos ignorá-la - Vamos apenas fechar o tíquete. Portanto, se o seu tíquete ainda está aberto, isso não significa que estamos te ignorando; significa apenas que não tivemos tempo de verificar ele ainda.
zh_hans: 如果你的补丁没有被加入到Django，并不意味我们忽视它了——我们只是关闭这个工单。所以如果你的工单一直处于开启状态，也并不意味着我们忽视了你；这只是意味着我们还没来得及看它。

source: When and how might I remind the team of a patch I care about?
pt_br: Quando e como posso lembrar ao time sobre um "patch" que me interessa?
zh_hans: 何时以及如何提醒团队我所关注的补丁？

source: A polite, well-timed message to the mailing list is one way to get attention. To determine the right time, you need to keep an eye on the schedule. If you post your message right before a release deadline, you're not likely to get the sort of attention you require.
pt_br: Uma mensagem educada e no tempo certo à lista de emails é uma maneira de ter atenção. Para determinar a hora certa, você precisa ficar de olho no cronograma. Se você enviar uma mensagem logo antes de uma data final de publicação, você pode não ter a atenção desejada.
zh_hans: 一种获得关注的方式是向邮件列表发送一个礼貌的，适时的消息。为了确保时间合适，你需要留意时间表。如果你在发布截止日期之前发送消息，则不太可能获得您需要的关注。

source: Gentle IRC reminders can also work -- again, strategically timed if possible. During a bug sprint would be a very good time, for example.
es: Ligeros recordatorios por IRC también pueden funcionar -- nuevamente, estatégicamente cronometrado si es posible. Durante un sprint de reparación de fallos sería un buen momento.
pt_br: Lembretes no IRC também podem funcionar - vale lembrar, faça-os num momento estratégico, se possível. Durante um sprint para correção de bugs seria um ótimo momento, por exemplo.
zh_hans: 温和的IRC提醒也可以发挥作用——还是如此：如果可能的话，选取一个合适的时间。 例如，在修复bug的冲刺期间就是一个不错的时机。

source: Please refrain from emailing anyone personally or repeatedly raising the same issue over and over. This sort of behavior will not gain you any additional attention -- certainly not the attention that you need in order to get your issue addressed.
pt_br: Por favor evite enviar e-mails pessoais a qualquer um ou repetidamente sobre a mesma "issue". Este tipo de comportamento não irá lhe dar nenhum tipo de atenção adicional -- e certamente não a atenção que você precisa para ter seu problema encaminhado.
zh_hans: 请不要通过电子邮件向任何人发邮件或反复提出同样的问题。 这种行为不会让你有任何额外的关注——当然也不会给你带来解决问题所需的关注。

source: But I've reminded you several times and you keep ignoring my patch!
es: ¡Pero te lo he recordado varias veces y sigues ignorando mi parche!
pt_br: Mas eu os lembrei diversas vezes e vocês continuam ignorando meu patch!
zh_hans: 但是我已经提醒你好几遍了，你依然继续忽略我的补丁！

source: Seriously - we're not ignoring you. If your patch stands no chance of inclusion in Django, we'll close the ticket. For all the other tickets, we need to prioritize our efforts, which means that some tickets will be addressed before others.
es: En serio - no te estamos ignorando. Si tu parche no tiene la posibilidad de ser incluido en Django, cerraremos el reporte. Para todos los otros reportes, necesitamos priorizar nuestros esfuerzos, lo que significa que algunos reportes serán atendidos antes que otros.
pt_br: Sério, não estamos lhe ignorando. Se o seu "reparo" não tem chance de inclusão no Django, fecharemos o tíquete. Para todos os outros tíquetes, precisamos priorizar esforços, o que significa que alguns tíquetes serão encaminhados antes de outros.
zh_hans: 说真的 - 我们不会无视你的。 如果你的补丁没有包含在Django的工单，我们将关闭工单。 对于所有其他的工单，我们需要优先考虑我们的努力，这意味着一些工单将在其他人之前解决。

source: One of the criteria that is used to prioritize bug fixes is the number of people that will likely be affected by a given bug. Bugs that have the potential to affect many people will generally get priority over those that are edge cases.
es: Uno de los criterios usados para priorizar el arreglo de fallas es el número de personas que son afectadas por la misma. Las fallas que tienen el potencial de afectar a muchas personas, generalmente tienen mayor prioridad respecto a los casos esporádicos.
pt_br: Um dos critérios que é usado para priorizar correções de um bug é o número de pessoas que provavelmente serão afetadas pelo bug informado. Bugs que tem potencial de afetar mais pessoas irão geralmente ter prioridade sobre os que são casos marginais.
zh_hans: 确定bug修复优先级的标准之一是对于特定bug而言，可能会受到影响的人数。有可能影响许多人的bug一般会优先于那些边缘情况下的bug。

source: Another reason that bugs might be ignored for while is if the bug is a symptom of a larger problem. While we can spend time writing, testing and applying lots of little patches, sometimes the right solution is to rebuild. If a rebuild or refactor of a particular component has been proposed or is underway, you may find that bugs affecting that component will not get as much attention. Again, this is just a matter of prioritizing scarce resources. By concentrating on the rebuild, we can close all the little bugs at once, and hopefully prevent other little bugs from appearing in the future.
es: Otra razón por la que los fallos pueden ser ignorados por un tiempo es que este sea síntoma de un problema mayor. Mientras podemos pasar tiempo escribiendo, probando y aplicando grandes cantidades de parches pequeños, algunas veces la solución correcta es reconstruir. Si la reconstrucción o refactorización de un componente en particular ha sido propuesta o está en marcha, notarás que los fallos que afectan a ese componente no tendrán mucha atención. Nuevamente, esto es solo una cuestión de priorizar los escasos recursos con los que contamos. Al concentrarnos en la reconstrucción, podemos cerrar todos los pequeños fallos de una vez y afortunadamente prevenir la prevención de otros pequeños fallos en un futuro.
pt_br: Outra razão para um bug ser momentaneamente ignorado é se ele for um sintoma de um problema maior. Enquanto gastamos tempo escrevendo, testando e aplicando várias pequenas correções, às vezes a solução correta é a reconstrução. Se a reconstrução ou refatoração de um componente em particular foi proposta ou está em andamento, você pode achar que os bugs afetando tal componente não estejam tendo atenção. Novamente, isso é somente uma questão de priorização de recursos escassos. Nos concentrando na reconstrução podemos corrigir todos os bugs de uma vez, e esperamos prevenir outros pequenos bugs de aparecerem no futuro.
zh_hans: 错误可能会被忽略的另一个原因是，如果错误是一个更大的问题的表现。 虽然我们可以花时间编写，测试和应用大量的小补丁，但有时候正确的解决方案是重建。 如果某个特定组件的重建或重构已经提出或正在进行中，那么您可能会发现影响该组件的错误不会得到太多关注。 再次，这只是优先考虑稀缺资源的问题。 通过集中重建，我们可以一次性关闭所有的 BUG，并且希望能够防止未来出现其他小 BUG。

source: Whatever the reason, please keep in mind that while you may hit a particular bug regularly, it doesn't necessarily follow that every single Django user will hit the same bug. Different users use Django in different ways, stressing different parts of the code under different conditions. When we evaluate the relative priorities, we are generally trying to consider the needs of the entire community, not just the severity for one particular user. This doesn't mean that we think your problem is unimportant -- just that in the limited time we have available, we will always err on the side of making 10 people happy rather than making 1 person happy.
es: Cualquiera que sea la razón, por favor tenga en cuenta que aunque usted puede obtener un error en particular con regularidad, no significa necesariamente que cada usuario de Django obtendrá el mismo error. Los diferentes usuarios utilizan Django de diferentes maneras, dando prioridad a diferentes partes del código en diferentes condiciones. Cuando evaluamos las prioridades relativas, por lo general tratamos de tener en cuenta las necesidades de toda la comunidad, no sólo la gravedad para un usuario en particular. Esto no quiere decir que creemos que su problema no es importante, sólo que en el poco tiempo que tenemos disponible, siempre vamos a decantarnos por hacer felices a 10 personas en lugar de hacer feliz a 1 persona.
pt_br: Qualquer que seja o motivo, lembre-se que enquanto você pode estar sendo afetado por um bug específico com regularidade, não significa necessariamente que cada usuário de Django será afetado pelo mesmo bug. Diferentes usuários utilizam Django de diferentes formas, sobrecarregando partes diferentes do código em diferentes condições. Quando avaliamos as prioridades correspondentes, geralmente tentamos levar em conta as necessidades de toda a comunidade, não somente a gravidade para um usuário específico. Isso não significa que nós achamos que seu problema não é importante - somente que no tempo limitado que dispomos, vamos sempre escolher fazer 10 pessoas felizes ao invés de 1 pessoa feliz.
zh_hans: 不管什么原因，请记住，你可能会经常碰到一个特定的 bug，但并不一定每个Django用 户都会遇到同样的 bug。 不同的用户以不同的方式使用 Django，在不同的条件下执行代码的不同部分。 我们评估相对优先事项时，会考虑整个社区的需求，而不仅仅是一个特定用户的问题严重程度。 当然，这并不意味着我们认为你的问题不重要，只是在有限的可用时间内，我们总是希望让 10 个人的问题得到解决，而不是只解决 1 个人的问题。

source: FAQ: General
ja: FAQ: 一般的な質問
pt_br: FAQ: Geral
zh_hans: FAQ: 概述

source: Why does this project exist?
es: ¿Por qué existe este proyecto?
ja: Django というプロジェクトが作られた経緯を教えてください。
pt_br: Por que esse projeto existe?
zh_hans: 这个项目因何存在。

source: Django grew from a very practical need: World Online, a newspaper Web operation, is responsible for building intensive Web applications on journalism deadlines. In the fast-paced newsroom, World Online often has only a matter of hours to take a complicated Web application from concept to public launch.
ja: Django は極めて実践的な要求のもとで作られてきました。Web 新聞を発行している World Online では、効果的な Web アプリケーションを、ジャーナリズムの世界の短い締め切りに間に合うように構築しなければなりません。ニュースルームというのは非常に変化の早い場所です。そのため、World Online では、複雑な Web アプリケーションをコンセプトを構想してからそれを公開するまでに、たった数時間の猶予しかないということがよくあります。
pt_br: Django surgiu de uma necessidade muito prática: World Online, um jornal com atividade Web que é responsável por construir aplicações Web complexas nos prazos do jornalismo. Na redação em ritmo acelerado, World Online muitas vezes tinha apenas algumas horas para criar uma aplicação Web complexa, desde o escopo até ao lançamento.
zh_hans: Django从一个非常实际的需求成长而来：World Web 是一家新闻网站，负责在新闻截止期限内建立密集的Web应用程序。 在快节奏的新闻编辑室，World Online 往往需要几个小时内将一个复杂的 Web 应用程序从概念推向发布上线。

source: At the same time, the World Online Web developers have consistently been perfectionists when it comes to following best practices of Web development.
es: Al mismo tiempo, los desarrolladores de la web World Online han sido consistentemente rigurosos cuando se trata de seguir las mejores prácticas para el desarrollo web.
ja: しかし同時に、WorldOnline の Web 開発者たちは、特に Web 開発のベストプラクティスに従うことに関しては、一貫して完璧主義者でした。
pt_br: Ao mesmo tempo, os desenvolvedores web do World Online têm sido consistentemente perfeccionistas quando se trata de seguir as melhores práticas do desenvolvimento Web.
zh_hans: 与此同时，World Online 的 Web开发者在 Web 开发的最佳实践方面一直是完美主义者。

source: In fall 2003, the World Online developers (Adrian Holovaty and Simon Willison) ditched PHP and began using Python to develop its websites. As they built intensive, richly interactive sites such as Lawrence.com, they began to extract a generic Web development framework that let them build Web applications more and more quickly. They tweaked this framework constantly, adding improvements over two years.
ja: 2003年の秋、World Online の開発者 (Adrian Holovaty と Simon Willison) は PHP に 見切りをつけ、Python による Web 開発に取り組みはじめました。集約的で高い双方向性を備えた Lawrence.com のようなサイトの開発の中で、彼らは Web アプリケーションをより迅速に開発できるように、サイトのコードから汎用の Web 開発フレー ムワークを切り出し、 2 年近くの間ずっと改良を加えながら使い込んできました。
pt_br: No outono de 2003, os desenvolvedores do World Online (Adrian Holovaty e Simon Willison) abandonaram o PHP e começaram a usar Python para desenvolver seus websites. Enquanto desenvolviam intensivamente sites ricamente interativos tais como Lawrence.com eles começaram a extrair um framework de desenvolvimento web genérico que os permitia construir aplicações Web mais e mais rápido. Eles melhoravam este framework constantemente, adicionando novas melhorias ao longo de dois anos.
zh_hans: 在2003年秋季，世界在线开发者（Adrian Holovaty和Simon Willison）放弃PHP而开始使用Python开发网站。 当他们构建了密集的，强互动性的网站时（如Lawrence.com），他们开始提取一个通用的Web开发框架，使他们可以更快地构建Web应用程序。 他们经常调整这个框架，并在两年内进行改进。

source: In summer 2005, World Online decided to open-source the resulting software, Django. Django would not be possible without a whole host of open-source projects -- `Apache`_, `Python`_, and `PostgreSQL`_ to name a few -- and we're thrilled to be able to give something back to the open-source community.
ja: 2005年の夏、World Online は、これまでの開発の成果を Django としてオープンソー ス化する決定を下しました。 Django は `Apache`_, `Python`_, そして `PostgreSQL`_ をはじめとする様々なオープンソースプロジェクトなしでは実現しませんでした。そして今、私たちはオープンソースコミュニティに多少なりともお返しできることにワクワクしているのです。
pt_br: No verão de 2005, World Online decidiu abrir o código-fonte do software resultante, Django. Django não existiria sem um uma série de outros projetos open-source -- `Apache`_, `Python`_, e `PostgreSQL`_ apenas para citar alguns -- e estamos muito animados por sermos capazes de dar algo de volta para a comunidade open-source.
zh_hans: 在2005年夏天，World Online决定开源Django。如果没有大量的开源项目 - “Apache”，“Python”和“PostgreSQL”等等，Django是不可能完成的 - 我们很高兴能够回馈一些东西给开源社区。

source: What does "Django" mean, and how do you pronounce it?
es: ¿Qué significa "Django" y cómo se pronuncia?
ja: “Django” とはどういう意味で、どのように発音するのですか？
pt_br: O que significa e como se pronuncia "Django"?
zh_hans: “Django”是什么意思，怎么发音？

source: Django is named after `Django Reinhardt`_, a jazz manouche guitarist from the 1930s to early 1950s. To this day, he's considered one of the best guitarists of all time.
ja: Django は、1930年代から1950年初頭に活躍した、ジャズの伝説のギタリスト `Django Reinhardt`_ にちなんで名付けられました。今日では、Django は史上最高のギタリストの1人と評価されています。
pt_br: Django leva o nome de `Django Reinhardt`_, um guitarrista de jazz manouche de 1930 até início de 1950. Até hoje, ele é considerado um dos melhores guitarristas de todos os tempos.
zh_hans: Django的名字来源于Django Reinhardt，一个吉普赛吉他工作室从1930年到50年代初期，直到今天，他们依然被认为是史上最好的吉他手之一。

source: Listen to his music. You'll like it.
es: Escucha su música. Te va a gustar.
ja: 彼の曲を聞いてみてください。きっと気に入ることでしょう。
pt_br: Ouça a música dele. Você vai gostar.
zh_hans: 聆听他的音乐. 你会喜欢它的.

source: Django is pronounced **JANG**-oh. Rhymes with FANG-oh. The "D" is silent.
es: Django se pronuncia **JANG**-o. Rima con FANG-o. La "D" es muda.
ja: Django は **JANG**-oh (‘a’ は伸ばす) と発音します。韻は FANG-oh と同じです。 “D” は発音しません。
pt_br: Django é pronunciado **JANG**-oh. Rima com FANG-oh. O "D" é mudo.
zh_hans: Django发音为**JANG**-噢. 使用FANG来押韵-噢. 字母 "D"是不发声的.

source: We've also recorded an `audio clip of the pronunciation`_.
es: También hemos grabado un `audio clip de la pronunciación`_.
ja: 音声ファイル `audio clip of the pronunciation`_ に発音を録音しておいたので、参考にしてください。
pt_br: Nós também gravamos um `clipe de áudio da pronúncia`_.
zh_hans: 我们也记录了一段 `发音的音频片段`_.

source: Is Django stable?
es: ¿Es estable Django?
ja: Django は安定したプロジェクトですか？
pt_br: Django é estável?
zh_hans: Django稳定吗?

source: Yes, it's quite stable. Companies like Disqus, Instagram, Pinterest, and Mozilla have been using Django for many years. Sites built on Django have weathered traffic spikes of over 50 thousand hits per second.
ja: はい、とても安定しています。Disqus、Instagram、Pinterest、Mozilla といった企業が、長年 Django を使っています。Django 上に構築されたサイトは、5万ヒット/秒を超えるトラフィックスパイクにも耐えることができます。
pt_br: Sim, é bastante estável. Empresas como Disqus, Instagram, Pinterest e Mozilla têm usado Django por muito anos. Sites desenvolvidos em Django resistem a picos de tráfego de mais de 50 mil acessos por segundo.
zh_hans: 是的，它相当稳定。 Disqus, Instagram, Pinterest, 还有 Mozilla等公司使用Django很多年了。使用Django搭建的网站能承受每秒50000次点击的流量峰值。

source: Does Django scale?
es: ¿Puede escalar Django?
ja: Django はスケールしますか？
pt_br: Django escala?
zh_hans: Django可扩展吗?

source: Yes. Compared to development time, hardware is cheap, and so Django is designed to take advantage of as much hardware as you can throw at it.
es: Sí. Comparado con el tiempo de desarrollo, el hardware es barato, por lo que Django está diseñado para tomar ventaja de tanto hardware como le puedas dar.
ja: はい。ハードウェアというものは、開発時間に比べて安いものですし、それゆえ Django はユーザが投入可能なハードウェアをできるだけ活用できるように設計されてい ます。
pt_br: Sim. Comparado com o tempo de desenvolvimento, hardware é barato, por isso, Django é projetado para aproveitar o máximo de hardware quanto você pode dar a ele.
zh_hans: 是的，与程序调试时间相比，硬件很便宜，所以Djiango被设计的尽可能多的利用硬件的性能。

source: Django uses a "shared-nothing" architecture, which means you can add hardware at any level -- database servers, caching servers or Web/application servers.
es: Django usa una arquitectura "shared-nothing", lo cual significa que puedes agregar hardware en cualquier nivel -- servidores de base de datos, de caching o Web/Aplicaciones.
ja: Django は「レイヤ間で何も共有しない (shared-nothing)」アーキテクチャを採用しています。そのため、データベースサーバ、キャッシュサーバ、 Web/アプリケーションサーバのどのレベルにでもハードウェアを追加することができます。
pt_br: Django usa uma arquitetura "shared-nothing", que siginfica que você pode adicionar hardware em qualquer nível -- servidores de banco de dados, servidores de cache ou servidores de aplicação/web.
zh_hans: Django使用“无共享”体系结构，这意味着您可以在任何级别添加硬件——数据库服务器，缓存服务器或Web/应用程序服务器。

source: The framework cleanly separates components such as its database layer and application layer. And it ships with a simple-yet-powerful :doc:`cache framework </topics/cache>`.
ja: Django のフレームワークは、データベースレイヤやアプリケーションレイヤなどの各コンポーネントをきれいに分離しています。また、シンプルながら強力な :doc:`キャッシュフレームワーク</topics/cache>` を備えています。
pt_br: O framework separa os componentes organizadamente como a sua camada de banco de dados e a camada de aplicação. Além disso, ele provém um simples e poderoso :doc:`framework de cache </topics/cache>`.
zh_hans: 该框架将组件完全分离，如数据库层和应用程序层。它附带了一个简单但强大的: doc : `缓存框架`。

source: Who's behind this?
es: ¿Quién está detrás de esto?
ja: Django はどんな組織が支援しているのですか？
pt_br: Quem está por trás disso?
zh_hans: 谁在这背后？

source: Django was originally developed at World Online, the Web department of a newspaper in Lawrence, Kansas, USA. Django's now run by an international `team of volunteers <https://www.djangoproject.com/foundation/teams/>`_.
pt_br: O Django foi desenvolvido originalmente no World Online, o departamento WEB de um jornal em Lawrence, Kansas, USA. O Django agora é mantido por um `time internacional de voluntários <https://www.djangoproject.com/foundation/teams/>`_.
zh_hans: Django最初是在美国堪萨斯州劳伦斯市一家报纸的网络部门World Online开发的。Django现在由一个国际`志愿者小组<https://www.djangoproject.com/foundation/teams/>`运行。
