Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: es, ja, pt_br, zh_hans

source: You might notice we have a second mailing list, called |django-developers| -- but please don't email support questions to this mailing list. This list is for discussion of the development of Django itself. Asking a tech support question there is considered quite impolite.
pt_br: Você pode ter notado que nós temos uma segunda lista de e-mail, chamada |django-developers| -- mas, por favor, não envie perguntas de suporte para essa lista. Ela é dedicada para questões referentes ao desenvolvimento do Django em si. Pedir por suporte técnico nela é considerado um tanto indelicado.

source: I think I've found a bug! What should I do?
es: ¡Creo que he hallado un fallo!¿Qué debo hacer?
pt_br: Eu acho que achei um bug! O que devo fazer?
zh_hans: 我认为我找到了个bug！我应该做什么呢？

source: Detailed instructions on how to handle a potential bug can be found in our :ref:`Guide to contributing to Django <reporting-bugs>`.
es: Las instrucciones detalladas sobre cómo manipular un fallo potencial se encuentran en nuestra :ref:`Guía para contribuir con Django <reporting-bugs>`.
pt_br: Instruções detalhadas sobre como lidar com um bug em potencial podem ser encontradas no nosso :ref:`Guia para contribuir com o Django <reporting-bugs>`.

source: I think I've found a security problem! What should I do?
es: ¡Creo que he hallado un problema de serguridad!¿Qué debo hacer?
pt_br: Eu acho que achei uma falha de segurança! O que devo fazer?
zh_hans: 我认为我已经发现了个安全问题！我应该做什么？

source: If you think you've found a security problem with Django, please send a message to security@djangoproject.com. This is a private list only open to long-time, highly trusted Django developers, and its archives are not publicly readable.
es: Si usted piensa que ha encontrado un problema de seguridad con Django, por favor envíe un mensaje a security@djangoproject.com. Esta es una lista privada que sólo está accesible para los desarrolladores de Django altamente confiables desde hace tiempo, y sus archivos no son pueden ser leídos por el público.
pt_br: Se você acredita ter encontrado um problema de segurança no Django, por favor, envie uma mensagem para security@djangoproject.com. Essa é uma lista privada, aberta apenas para desenvolvedores antigos e altamente confiáveis do Django e seus arquivos não são acessíveis ao público.

source: Due to the sensitive nature of security issues, we ask that if you think you have found a security problem, *please* don't send a message to one of the public mailing lists. Django has a :ref:`policy for handling security issues <reporting-security-issues>`; while a defect is outstanding, we would like to minimize any damage that could be inflicted through public knowledge of that defect.
es: Dado el caracter sensible de los problemas de seguridad, le pedimos que si usted cree haber encontrado un problema de seguridad, * por favor * no envíe un mensaje a una de las listas de correo públicas. Django tiene una: ref: `política para la gestión de los problemas de seguridad <reporting-security-issues> `; aunque un defecto esté pendiente, nos gustaría reducir al mínimo los daños que podrían infligirse a través del conocimiento público de este.
pt_br: Por conta da natureza sensível de problemas de segurança, nós pedimos que caso você pense ter encontrado um problema, *por favor*, não mande uma mensagem para uma das listas de e-mail públicas. O Django tem uma :ref:`política para lidar com problemas de segurança <reporting-security-issues>`; E, por mais que um defeito seja marcante, nós gostaríamos de minimizar quaisquer danos que possam ocorrer por conta da divulgação deste defeito.

source: Django FAQ
es: FAQ de Django
ja: Django FAQ よくある質問
pt_br: Django - Perguntas e dúvidas frequentes.

source: FAQ: Installation
es: FAQ: Instalación
ja: FAQ: インストール
pt_br: FAQ: Instalação
zh_hans: FAQ: 安装

source: How do I get started?
es: ¿Cómo comienzo?
ja: まずは何をすればよいですか？
pt_br: Como eu posso começar?
zh_hans: 我如何开始?

source: `Download the code`_.
es: `Descarga el código`_.
ja: コードをダウンロード `Download the code`_ してください。
pt_br: `Baixando o código`_.
zh_hans: `下载代码`_.

source: Install Django (read the :doc:`installation guide </intro/install>`).
es: Instala Django (lee la :doc:`guía de instalación </intro/install>`).
ja: Django をインストールしてください ( :doc:`インストールガイド</intro/install>` を読みましょう)。
pt_br: Instalando o Django (leia a :doc:`guia de instalação </intro/install>`).
zh_hans: 安装 Django (阅读 :doc:`安装指南 </intro/install>`).

source: Walk through the :doc:`tutorial </intro/tutorial01>`.
es: Date una vuelta por el :doc:`tutorial </intro/tutorial01>`.
ja: :doc:`チュートリアル</intro/tutorial01>` を一通りやってみてください。
pt_br: Navegue pelo :doc:`tutorial </intro/tutorial01>`.
zh_hans: 查看 :doc:`tutorial 1`

source: Check out the rest of the :doc:`documentation </index>`, and `ask questions`_ if you run into trouble.
es: Revisa el resto de la :doc:`documentación </index>`, y `has preguntas`_ si tienes algún problema.
ja: 他の :doc:`ドキュメント</index>` にも目を通して下さい。何か問題が起きたら、 質問 `ask questions`_ してみましょう。
pt_br: Confira o resto da :doc:`documentação </index>` e `faça perguntas`_ se você tiver problemas.
zh_hans: 如果你遇到问题，请阅读:doc:`文档 </index>`的剩余部分和`提问`_。

source: What are Django's prerequisites?
es: ¿Qué son los requisitos previos de Django?
ja: Django を動かすには何が必要ですか？
pt_br: Quais são os pré-requisitos do Django?
zh_hans: Django 的先决条件是什么？

source: Django requires Python. See the table in the next question for the versions of Python that work with each version of Django. Other Python libraries may be required for some uses, but you'll receive an error about it as they're needed.
es: Django requiere Python. Consulte el cuadro en la siguiente pregunta para las versiones de Python que trabajan con cada versión de Django. Otras bibliotecas Python pueden resultar necesarias para algunos usos, pero usted recibirá un error sobre ello cuando sean necesarias.
pt_br: Django requer Python. Veja a tabela na próxima seção para saber quais versões de Python funcionam com as versões de Django. Outras bibliotecas Python podem ser solicitadas para alguns usuários, mas você receberá um aviso de erro se for necessário.
zh_hans: Django 要求先安装 Python。参见下个问题中的表格，它介绍了各个 Django 版本所支持的 Python 版本。某些情况下可能需要一些额外的 Python 库，如果未安装，你会在这些库被用到时获得一个错误提示。

source: For a development environment -- if you just want to experiment with Django -- you don't need to have a separate Web server installed; Django comes with its own lightweight development server. For a production environment, Django follows the WSGI spec, :pep:`3333`, which means it can run on a variety of server platforms. See :doc:`Deploying Django </howto/deployment/index>` for some popular alternatives.
es: Para un entorno de desarrollo - si usted simplemente quiere experimentar con Django - usted no necesita tener instalado un servidor Web independiente; Django viene con su propio servidor de desarrollo ligero. Para un entorno de producción, Django sigue la especificación WSGI,: pep: `3333, lo que significa que puede funcionar en una variedad de plataformas de servidores. Consulte: doc: `La implementación de Django </howto/deployment/index> ` para algunas alternativas populares.
ja: 開発環境を使う場合、つまり Django を試したいだけの場合は、 Web サーバを別に インストールしておく必要はありません。 Django には簡単な開発用サーバが付属 しています。 Django は WSGI 仕様 :pep:`3333` に準拠しています。 従って、様々なサーバプラットフォームで運用環境を構築できます。 いくつか選択肢を紹介しているので、 :doc:`Django のデプロイ方法 </howto/deployment/index>` を参照してください。
pt_br: Para o ambiente de desenvolvimento -- Se você quiser apenas testar o Django -- Você não precisa ter instalado um servidor Web separado; Django já vem com seu próprio servidor de desenvolvimento leve. Para um ambiente de produção, Django segue a especificação do WSGI, :pep:`3333`, o que significa que ele funciona em uma variedade de plataforma de servidores. Veja :doc:`Implantando Django </howto/deployment/index>` para outras alternativas populares.

source: If you want to use Django with a database, which is probably the case, you'll also need a database engine. PostgreSQL_ is recommended, because we're PostgreSQL fans, and MySQL_, `SQLite 3`_, and Oracle_ are also supported.
es: Si necesitas usar Django con una base de datos, el cual es probablemente el caso, necesitarás también un motor de base de datos. PostgreSQL_ es recomendado porque somos fans de PostgreSQL y MySQL_, `SQLite 3`_ y Oracle_ también son compatibles.
ja: Django をデータベースと合わせて使うならデータベースエンジンも必要です。 我々は PostgreSQL_ ファンなので PostgreSQL をお勧めしますが、 MySQL_ や `SQLite 3`_, Oracle_ もサポートしています。
pt_br: Se você quer usar o Django com um banco de dados - o que provavelmente é o caso - você vai precisar de um sistema de banco de dados. PostgreSQL_ é o recomendado - porquê nós somos fãs de PostgreSQL - mas MySQL_. `SQLite3`_, e Oracle_ também são suportados.

source: What Python version can I use with Django?
es: ¿Qué versión de Python puedo usar con Django?
ja: どのバージョンの Python でどのバージョンの Django が使えますか?
pt_br: Qual versão do Python eu posso usar com Django?
zh_hans: 我应该使用哪个版本的Python来配合Django?

source: Django version
es: Versión de Django
ja: Django バージョン
pt_br: Versão do Django
zh_hans: Django版本

source: Python versions
es: Versiones de Python
ja: Python バージョン
pt_br: Versões do Python
zh_hans: Python版本

source: 2.7, 3.2 (until the end of 2016), 3.3, 3.4, 3.5
es: 2.7, 3.2 (hasta finales de 2016), 3,3, 3,4, 3,5
ja: 2.7, 3.2 (2016年末まで ), 3.3, 3.4, 3.5
pt_br: 2.7, 3.2 (até o fim de 2016), 3.3, 3.4, 3.5
zh_hans: 2.7, 3.2 (截至2016年底), 3.3, 3.4, 3.5

source: For each version of Python, only the latest micro release (A.B.C) is officially supported. You can find the latest micro version for each series on the `Python download page <https://www.python.org/downloads/>`_.
es: Para cada versión de Python, sólo la última version micro (A.B.C) es oficialmente compatible. Puede encontrar la última versión micro de cada serie en la página de descarga de Python <https://www.python.org/downloads/>`.
pt_br: Para cada versão do Python, apenas a micro versão (A.B.C) é oficialmente suportada. Você pode encontrar a micro versão mais recente para cada série na `Página de downloads do Python <https://www.python.org/downloads/>`_.

source: Typically, we will support a Python version up to and including the first Django LTS release whose security support ends after security support for that version of Python ends. For example, Python 3.3 security support ends September 2017 and Django 1.8 LTS security support ends April 2018. Therefore Django 1.8 is the last version to support Python 3.3.
es: Por lo general, vamos a soportar una versión de Python hasta e incluyendo la primera versión LTS de Django cuyo soporte de seguridad finalice después de que el soporte de seguridad para esa versión de Python finalice. Por ejemplo, el soporte de seguridad de Python 3.3 termina en septiembre 2017 y el soporte de seguridad LTS de Django 1.8 finaliza en abril de 2018. Por lo tanto, Django 1.8 es la última versión compatible con Python 3.3.
pt_br: Tipicamente, nós daremos suporte para uma versão de Python até a primeira distribuição Django LTS, cujo suporte de segurança temine após o término do suporte de segurança para aquela versão do Python. Por exemplo, o suporte de segurança do Python 3.3 termina em setembro de 2017 e o suporte de segurança do Django 1.8 LTS encerra em abril de 2018. Portanto o Django 1.8 é a última versão a suportar Python 3.3

source: What Python version should I use with Django?
es: ¿Qué versión de Python debería usar con Django?
pt_br: Qual versão do Python eu devo usar com Django?

source: As of Django 1.6, Python 3 support is considered stable and you can safely use it in production. See also :doc:`/topics/python3`. However, the community is still in the process of migrating third-party packages and applications to Python 3.
es: Para Django 1.6, el soporte de Python 3 se considera estable y puedes usarlo con seguridad en el ambiente de producción. Mira también :doc: `/topics/python3`. Sin embargo, la comunidad está aún en el proceso de migrar paquetes de terceros y aplicaciones a Python 3.
pt_br: Assim como o Django 1.6, o suporte do Python 3 é considerado estável e você pode usá-lo com segurança em produção. Veja também :doc:`/topics/python3`. No entanto, a comunidade ainda está em processo de migração de pacotes e aplicações de terceiros para o Python 3.

source: If you're starting a new project, and the dependencies you plan to use work on Python 3, you should use Python 3. If they don't, consider contributing to the porting efforts, or stick to Python 2.
es: Si estás iniciando un nuevo proyectos, y las dependencias que planeas usar funcionan con Python 3, deberías usar Python 3. De lo contrario, considera contribuir a los esfuerzos de portabilidad, o mantente en Python 2.
pt_br: Se você estiver iniciando um novo projeto e as dependências que você planeja usar funcionam em Python 3, você deveria utilizar Python 3. Se elas não funcionam, considere contribuir para os esforços de portabilidade, ou fique com o Python 2.

source: Since newer versions of Python are often faster, have more features, and are better supported, all else being equal, we recommend that you use the latest 2.x.y or 3.x.y release.
es: Debido a que las nuevas versiones de Python son frecuentemente más rápidas, tienen más características y, son mejor soportadas, todas siendo igual, recomendamos que uses la última publicación de la serie 2.x.y o 3.x.y.
pt_br: Como as versões mais recentes do Python são frequentemente mais rápidas, têm mais funcionalidades e são melhores suportadas, considerando tudo isso, nós recomendamos que você use no mínimo o release 2.x.y ou 3.x.y mais recente.

source: You don't lose anything in Django by using an older release, but you don't take advantage of the improvements and optimizations in newer Python releases. Third-party applications for use with Django are, of course, free to set their own version requirements.
es: No pierdes nada en Django al usar una versión antigua, pero no tomarás ventaja de las mejoras y optimizaciones en las nuevas versiones de Python. Las aplicaciones de terceros que se usan en Django son, por supuesto, libres de establecer su propios requerimientos de versiones.
pt_br: Você não perde nada no Django por usar uma distribuição antiga, mas você não usufruirá das melhorias e otimizações das versões mais recentes de Python. As aplicações de terceiros para uso com Django são, claramente, livres para definir os seus próprios requisitos de versão.

source: Should I use the stable version or development version?
es: ¿Debería usar la versión estable o la de desarrollo?
ja: 安定版と開発版のどちらを使うべきなのでしょうか？
pt_br: Eu devo usar a versão estável ou a versão de desenvolvimento?
zh_hans: 我应该使用稳定版本还是开发版本？

source: Generally, if you're using code in production, you should be using a stable release. The Django project publishes a full stable release every nine months or so, with bugfix updates in between. These stable releases contain the API that is covered by our backwards compatibility guarantees; if you write code against stable releases, you shouldn't have any problems upgrading when the next official version is released.
es: Generalmente, si estás usando código en producción, deberías estar usando un release estable. El projecto Django publica una versión estable cada nueve meses mas o menos, con actualización y correcciones de errores en el proceso. Estas versiones estables contienen el API cubiertas por nuestras grarantías de compatibilidad en retroceso; si escribes código para la versión estable, no debería tener ningún problema actualizadola cuando la siguiente versión oficial sea liberada.
ja: 一般的に、もしあなたがコードを製品で使っているのなら、安定版を使うべきで しょう。 Django はおよそ 9 ヶ月ごとに、バグフィックスを含めた安定版をリリースしています。これらの安定版は後方互換を保証した API も提供していますので、もし次の新しい安定版では使用できないコードを書いていても、アップグレードにおいて問題は無いはずです。
pt_br: Geralmente, se você estiver usando um código em produção, você deveria usar uma distribuição estável. O projeto do Django publica uma distribuição completa estável há aproximadamente cada nove meses com atualizações para correções de bugs. Essas distribuições estáveis têm uma API que é garantidamente compatível com a versão anterior; se você escrever código em distribuições estáveis você não deverá ter problemas para atualizar quando a próxima versão oficial for distribuída.

source: FAQ: Databases and models
es: FAQ: Bases de Datos y modelos
ja: FAQ: データベースとモデル
pt_br: FAQ: Bancos de Dados e modelos
zh_hans: FAQ：数据库和模型

source: How can I see the raw SQL queries Django is running?
es: ¿Cómo puedo ver las consultas SQL plano que Django está ejecutando?
ja: Django が実行している生の SQL クエリを見られますか？
pt_br: Como posso ver as consultas SQL que o Django está executando?
zh_hans: 我该如何在Django运行的过程中看到SQL查询？

source: Make sure your Django :setting:`DEBUG` setting is set to ``True``. Then, just do this::
ja: Djangoの設定ファイルの :setting:`DEBUG` が ``True`` になっていることを確認します。次に、以下のコードを実行します::
pt_br: Verifique se o seu Django :setting:`DEBUG` está setado como "True". Em seguida, basta fazer::
zh_hans: 首先确保你的Django设置中的`DEBUG`选项为``True``. 然后， 这样做：

source: ``connection.queries`` is only available if :setting:`DEBUG` is ``True``. It's a list of dictionaries in order of query execution. Each dictionary has the following::
ja: ``connection.queries`` は :setting:`DEBUG` が ``True`` の場合のみに、利用することができます。これはクエリの実行順に辞書を並べたリストです。各辞書には以下の項目が入っています::
pt_br: "connection.queries" só está disponível se nas configurações a variável :setting:`DEBUG` for ``True``. É uma lista de dicionários em ordem de execução da querie. Cada dicionário possui o seguinte:
zh_hans: ``connection.queries`` 只有在 :setting:`DEBUG` 为 ``True``时才可用. 它是按顺序执行的字典列表，每个字典包括::

source: ``connection.queries`` includes all SQL statements -- INSERTs, UPDATES, SELECTs, etc. Each time your app hits the database, the query will be recorded.
ja: ``connection.queries`` にはINSERT, UPDATE, SELECTなどの全てのSQL文が記録されています。アプリケーションがデータベースを操作するたびに、クエリが記録されてゆきます。
pt_br: ``connection.queries`` incluem todas as instruções SQL - INSERTs, UPDATEs, SELECTs etc. Cada vez que seu aplicativo atinge o banco de dados a consulta será gravada.
zh_hans: ``connection.queries`` 包含了所有的SQL 语句 -- INSERT, UPDATES, SELECT, 等. 每次你的应用访问了数据库，查询都会被记录下来。

source: If you are using :doc:`multiple databases</topics/db/multi-db>`, you can use the same interface on each member of the ``connections`` dictionary::
ja: もし :doc:`複数のデータベース</topics/db/multi-db>` を利用している場合、 ``connections`` の辞書の各要素に対して、同じコードを実行できます::
pt_br: Se você estiver usando :doc:`múltiplos banco de dados</topics/db/multi-db>`, você pode usar a mesma interface em cada membro de ``dicionário de conexões``::
zh_hans: 如果你在使用:doc:`multiple databases1`,， 你可以对``connections`` 字典::中每个成员使用相同的接口。

source: If you need to clear the query list manually at any point in your functions, just call ``reset_queries()``, like this::
ja: もし、何らかの機能の中で、クエリのリストをクリアする必要がある場合は、以下のように ``reset_queries()`` を実行します::
pt_br: Se você precisar limpar a lista de consultas manualmente em qualquer momento nas suas funções, basta chamar ``reset_queries()``, dessa forma::
zh_hans: 如果你需要在你的函数中去手动的清空所有的查询点，只需要调用``reset_queries()``, 像这样::

source: Can I use Django with a pre-existing database?
es: ¿Puedo usar Django con una base de datos ya existente?
ja: 既存のデータベースで Django を使えますか？
pt_br: Posso usar o Django em um banco de dados pré-existente?
zh_hans: 我可以让Django用一个之前已经存在的数据库吗？

source: Yes. See :doc:`Integrating with a legacy database </howto/legacy-databases>`.
ja: 使えます。:doc:`古いデータベースの組み込み方 </howto/legacy-databases>` を参照してください。
pt_br: Sim. Veja a documentação: :doc:`Integrando com um banco de dados legado </howto/legacy-databases>`.
zh_hans: 是的，可以看这篇文档： :doc:`Integrating with a legacy database 1`。

source: If I make changes to a model, how do I update the database?
es: Si hago cambios en un modelo, ¿cómo actualizo la base de datos?
ja: モデルを変更した時、どのようにデータベースを更新すればよいですか？
pt_br: Como eu faço para atualizar o banco de dados, se eu fizer alterações em um modelo?
zh_hans: 如果我对一个模型做了改动，我该如何去更新数据库？

source: Take a look at Django's support for :mod:`schema migrations <django.db.migrations>`.
ja: :mod:`スキーママイグレーション <django.db.migrations>` に関するページを参照してください。
pt_br: Dê uma olhada no suporte do Django para :mod:`migrações de schema <django.db.migrations>`.
zh_hans: 看看Django对数据模型改动的支持：:mod:`schema migrations <django.db.migrations>` （模型迁移）

source: If you don't mind clearing data, your project's ``manage.py`` utility has a :djadmin:`flush` option to reset the database to the state it was in immediately after :djadmin:`migrate` was executed.
ja: データが消えてもかまわないのなら、 ``manage.py`` ユーティリティの :djadmin:`flush` オプションを利用することで、データベースを :djadmin:`migrate` コマンドが実行された直後と同じ状態にすることができます。
pt_br: Se você não se importa de limpar os dados, o utilitário ``manage.py`` do seu projeto tem uma opção :djadmin:`flush` para redefinir o banco de dados para o estado em que estava imediatamente depois que o :djadmin:`migrate` foi executado.
zh_hans: 如果你不介意清除数据，工程目录下的``manage.py`` 工具使用 :djadmin:`flush` 选项去立即重置数据库到 执行 :djadmin:`migrate` 后的状态

source: Do Django models support multiple-column primary keys?
es: ¿Django soporta modelos de múltiples columnas en llaves primarias?
ja: Django のモデルは複合主キーをサポートしますか？
pt_br: O modelo do Django suporta chaves primárias de várias colunas?
zh_hans: Django支持多列主键吗？

source: No. Only single-column primary keys are supported.
es: No. Sólo son soportadas llaves primarias de columna única.
ja: いいえ。単一の主キーのみをサポートします。
pt_br: Não. Apenas chaves primárias de coluna única são suportadas.
zh_hans: 不，只支持单列主键。

source: But this isn't an issue in practice, because there's nothing stopping you from adding other constraints (using the ``unique_together`` model option or creating the constraint directly in your database), and enforcing the uniqueness at that level. Single-column primary keys are needed for things such as the admin interface to work; e.g., you need a simple way of being able to specify an object to edit or delete.
pt_br: Mas isso não é o problema na prática, porque nada impede você de adicionar outras constraints (usando a opção ``unique_together`` do modelo ou criando sua constraint diretamente no seu banco de dados), e reforçando a unicidade naquele nivel. Chaves-primárias de coluna única são necessárias para coisas tais que a interface de admin funcione; e.x: você precisa de um caminho simples para ser possivel especificar um objeto para editar ou deletar.

source: Does Django support NoSQL databases?
es: ¿Soporta Django bases de datos NoSQL?
ja: Django で NoSQL データベースは利用できますか？
pt_br: Django suporta banco de dados NoSQL?
zh_hans: Django支持NoSQL数据库吗？

source: NoSQL databases are not officially supported by Django itself. There are, however, a number of side project and forks which allow NoSQL functionality in Django, like `Django non-rel`_.
ja: NoSQL データベースは Django で公式にはサポートされていません。しかし、`Django non-rel`_ など、多くのプロジェクトが NoSQL を Django で利用できるような機能を提供しています。
pt_br: Bancos de dados NoSQL não são oficialmente suportados pelo próprio Django. No entanto, há uma série de projetos e forks que, permitem o funcionamento do NoSQL no Django, como `Django non-rel`_.
zh_hans: NoSQL数据库在Django中没有官方支持，不过有一些工程和拷贝向Django中添加了NoSQL的功能，如：`Django non-rel`_

source: You can also take a look on `the wiki page`_ which discusses some alternatives.
es: También puedes echar un vistazo en la 'página Wiki'_ que discute algunas alternativas.
pt_br: Você também pode dar uma olhada na `página Wiki`_ que discute algumas alternativas.
zh_hans: 你也可以看一下`the wiki page`_ 来讨论一些替代方案。

source: How do I add database-specific options to my CREATE TABLE statements, such as specifying MyISAM as the table type?
pt_br: Como eu adiciono uma opção específica de base de dados à minha cláusula CREATE TABLE, tipo especificando MyISAM como tipo de tabela?
