Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: es, ja, pt_br, zh_hans

source: FAQ: The admin
es: FAQ: El sitio de administración
ja: FAQ: 管理サイト"admin"について
pt_br: FAQ: O admin
zh_hans: FAQ: 管理

source: I can't log in. When I enter a valid username and password, it just brings up the login page again, with no error messages.
es: No puedo ingresar. Cuando uso un usuario y contraseña válidos, me regresa a la página de ingreso, sin ningún mensaje de error.
ja: ログインできません。正しいユーザ名とパスワードを入力したのに、再度ログインページが表示されます。エラーメッセージも出ません。
pt_br: Eu não consigo me autenticar. Quando eu entro com um nome de usuário e senha válidos mostra apenas a página de autenticação novamente, sem mensagens de erro.
zh_hans: 无法登录。当我输入有效的用户名和密码后，只是跳转到登录页面，没有显示任何错误信息。

source: The login cookie isn't being set correctly, because the domain of the cookie sent out by Django doesn't match the domain in your browser. Try setting the :setting:`SESSION_COOKIE_DOMAIN` setting to match your domain. For example, if you're going to "https://www.example.com/admin/" in your browser, set ``SESSION_COOKIE_DOMAIN = 'www.example.com'``.
pt_br: O cookie de login não foi definido corretamente pois o domínio do cookie enviado pelo Django não confere com o domínio do seu navegador. Tente alterar as configurações em: setting: `SESSION_COOKIE_DOMAIN` para que coincidam com seu domínio. Por exemplo, se você está acessando "https://www.example.com/admin/" em seu navegador, defina ``SESSION_COOKIE_DOMAIN = 'www.example.com'``.
zh_hans: 登陆 cookie 没有被正确设置，因为由 Django 发出的 cookie 中的域名和浏览器中输入的域名不匹配。可以修改设置中的 "SESSION_COOKIE_DOMAIN" 选项来匹配你的域名。例如，如果你需要在浏览器中访问 "https://www.example.com/admin/"，设置 ``SESSION_COOKIE_DOMAIN = 'www.example.com'``。

source: I can't log in. When I enter a valid username and password, it brings up the login page again, with a "Please enter a correct username and password" error.
es: No puedo ingresar. Cuando uso un usuario y contraseña válidos, me muestra la página de ingreso de nuevo, con un mensaje de error de "Por favor introduzca un usuario y contraseña correctos".
ja: ログインできません。正しいユーザ名とパスワードを入力したはずなのに、再度ログインページが開き、「正しいユーザ名とパスワードを入力してください」というエラーメッセージが表示されます。
pt_br: Eu não consigo me autenticar. Quando eu entro com um nome de usuário e senha válidos, apenas retorno para a página de autenticação novamente, com o erro: "Por favor informe o nome de usuário e senha corretos".
zh_hans: 我无法登陆。当我输入有效的用户名和密码后，它又跳转到了登录界面，并且显示一个“请输入正确的用户名和密码”的错误。

source: If you're sure your username and password are correct, make sure your user account has :attr:`~django.contrib.auth.models.User.is_active` and :attr:`~django.contrib.auth.models.User.is_staff` set to True. The admin site only allows access to users with those two fields both set to True.
es: Si estás seguro de que tus datos son correctos, asegúrate de que la cuenta de usuario tenga :attr:`~django.contrib.auth.models.User.is_active` y :attr:`~django.contrib.auth.models.User.is_staff` establecidos como True. El sitio administrativo solo permite el acceso a los usuarios que tengan ambos campos en True.
ja: ユーザ名とパスワードが本当に正しい場合、ユーザアカウントが :attr:`~django.contrib.auth.models.User.is_active` で、かつ :attr:`~django.contrib.auth.models.User.is_staff` が True になっているか確認してください。管理サイトにアクセスできるのは、is_active と is_staff がともに True のユーザだけです。
pt_br: Se você está certo que o nome de usuário e senha estão corretos, assegure-se que esta conta de usuário possua :attr:`~django.contrib.auth.models.User.is_active` e :attr:`~django.contrib.auth.models.User.is_staff` definidos como True. A página de administração só permite acesso a usuários com esses dois campos definidos como Verdadeiro.
zh_hans: 如果你确定你的用户名和密码都是对的，确保你的用户账户中的“django.contrib.auth.models.User.is_active”和“django.contrib.auth.models.User.is_staff”被设为True。管理员页面只允许这两项被设为True的用户访问。

source: How do I automatically set a field's value to the user who last edited the object in the admin?
es: ¿Cómo establezco automáticamente el valor de un campo con el último usuario que editó el objeto en el sitio de administración?
ja: 管理サイト上でオブジェクトを編集した時、オブジェクトを最後に編集したユーザの情報を特定のフィールドに自動的に入力する方法はありませんか？
pt_br: Como eu atribuo o valor de um campo automaticamente para conter o usuário que editou um objeto por último no admin?
zh_hans: 在管理面板中如何自动将字段的值设置为最后编辑的用户？

source: The :class:`~django.contrib.admin.ModelAdmin` class provides customization hooks that allow you to transform an object as it saved, using details from the request. By extracting the current user from the request, and customizing the :meth:`~django.contrib.admin.ModelAdmin.save_model` hook, you can update an object to reflect the user that edited it. See :ref:`the documentation on ModelAdmin methods <model-admin-methods>` for an example.
es: La clase :class:`~django.contrib.admin.ModelAdmin` provee métodos de personalización que te permiten transformar un objeto al ser guardado usando detalles de la petición. Mediante la extracción del usuario actual desde la petición y personalizando el método :meth:`~django.contrib.admin.ModelAdmin.save_model`, puedes actualizar un objeto para reflejar el usuario que lo editó. Para ver ejemplos remítete a :ref:`la documentación de los métodos del ModelAdmin <model-admin-methods>`.
ja: :class:`~django.contrib.admin.ModelAdmin` クラスが用意しているカスタマイズ用のフックを利用すれば、オブジェクトを保存するときに、リクエストから取り出した情報に基づいてフィールドの値を変更できます。具体的には、 meth:`~django.contrib.admin.ModelAdmin.save_model` フックをカスタマイズして、 リクエストから取り出した現在のユーザをオブジェクトのフィールド値に反映させることができます。 :ref:`ModelAdmin メソッドのドキュメント<model-admin-methods>` にサンプルがあるので参考にしてください。
pt_br: A classe :class:`~django.contrib.admin.ModelAdmin` possui métodos customizáveis que te permitem tratar um objeto a ser salvo, usando detalhes da requisição. Reescrevendo o método :meth:`~django.contrib.admin.ModelAdmin.save_model` e extraindo o usuário atual da requisição, você pode atualizar um objeto informando qual usuário fez a ação. Veja :ref:`a documentação sobre os métodos do ModelAdmin <model-admin-methods>` para um exemplo.
zh_hans: :class:`~django.contrib.admin.ModelAdmin`类提供了自定义钩子（hooks），它允许你使用请求中的详细数据来保存一个对象。你可以从request中取出当前的用户对象，然后通过自定义 :meth:`~django.contrib.admin.ModelAdmin.save_model`钩子（hook）来更新一个反映用户编辑了的对象。 参见：ref:`the documentation on ModelAdmin methods 1` 中的示例。

source: How do I limit admin access so that objects can only be edited by the users who created them?
es: ¿Cómo limito el acceso en el sitio administrativo de manera que los objetos solo puedan ser modificados por los usuarios que los crearon?
ja: 管理サイト上で、オブジェクトを最初に作成したユーザだけがオブジェクトを編集できるようにアクセス権を制限するにはどうすればよいですか？
pt_br: Como eu limito o acesso ao admin para que objetos possam ser editados apenas pelos usuários que os criaram?
zh_hans: 如何限制管理员访问权限，以便对象只能由创建它们的用户进行编辑？

source: The :class:`~django.contrib.admin.ModelAdmin` class also provides customization hooks that allow you to control the visibility and editability of objects in the admin. Using the same trick of extracting the user from the request, the :meth:`~django.contrib.admin.ModelAdmin.get_queryset` and :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` can be used to control the visibility and editability of objects in the admin.
es: La clase :class:`~django.contrib.admin.ModelAdmin` también permite formas de personalización que te permiten controlar la visibilidad y edición de objetos en el sitio de administración. Mediante el mismo truco de extraer el usuario de la petición, los métodos :meth:`~django.contrib.admin.ModelAdmin.get_queryset` y :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` pueden ser usados para controlar la visibilidad y la edición de los objetos en el sitio de administración.
ja: :class:`~django.contrib.admin.ModelAdmin` クラスが、管理サイト上の任意のオブジェクトの表示と編集の権限をコントロールするためのカスタマイズ用のフックを提供してくれています。同様のトリックを使ってリクエストから現在のユーザ情報を取り出せば、 :meth:`~django.contrib.admin.ModelAdmin.get_queryset` と :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` を使って、管理サイト上でのオブジェクトの表示と編集の権限をコントロールできます。
pt_br: A classe :class:`~django.contrib.admin.ModelAdmin` possui métodos customizáveis que permitem o controle de visibilidade e edição de objetos no admin. Da mesma forma utilizada para extrair o usuário de uma requisição, os métodos :meth:`~django.contrib.admin.ModelAdmin.get_queryset` e :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` podem ser usados para controlar a visibilidade e edição de objetos no admin.
zh_hans: :class:`~django.contrib.admin.ModelAdmin`类也提供了自定义Hook来控制管理面板中的对象是否可见以及可修改。使用相同的技巧从request中提取出当前用户对象，然后自定义:meth:`~django.contrib.admin.ModelAdmin.get_queryset` 和 :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` 来控制管理面板中的对象是否可见以及可修改。

source: My admin-site CSS and images showed up fine using the development server, but they're not displaying when using mod_wsgi.
es: Las CSS e imágenes de mi sitio de administración se muestran bien mientras uso el servidor de desarrollo, pero no se muestran cuando uso mod_wsgi.
ja: 開発サーバでは管理サイトの CSS や画像がうまく表示されるのに、mod_wsgi を使った場合には表示されません。
pt_br: O CSS e as imagens da interface de admin do meu site são exibidos corretamente quando uso o servidor de desenvolvimento, no entanto eles não estão sendo exibidos quando utilizo mod_wsgi.
zh_hans: 管理员站点CSS和图像在开发服务器显示正常，但使用mod_wsgi时不显示？

source: See :ref:`serving the admin files <serving-the-admin-files>` in the "How to use Django with mod_wsgi" documentation.
es: Ve :ref:`Publicación de archivos del sitio de administración <serving-the-admin-files>` en la documentación "¿Cómo usar Django con mod_wsgi?".
ja: 「Django を Apache と ``mod_swgi`` とともに使うには？」内の :ref:`管理サイト用のファイルを公開する方法 <serving-the-admin-files>` を参照してください。
pt_br: Veja: :ref:`servindo os arquivos de administração <serving-the-admin-files>` na documentação: "Como usar Django com mod_wsgi".
zh_hans: 请仔细阅读“如何通过 mod_wsgi 部署 Django”下的<serving-the-admin-files>“部署admin模块的静态文件”

source: My "list_filter" contains a ManyToManyField, but the filter doesn't display.
es: Mi "list_filter" contiene un campo ManyToManyField, pero el filtro no se visualiza.
ja: “list_filter” に ManyToManyField を入れたのに、管理サイトがフィルタを表示しません。
pt_br: Meu "list_filter" contém um campo ManyToManyField, mas o filtro não é exibido.
zh_hans: 我的“list_filter”包含一个ManyToManyField(过滤对象)，但过滤器不显示

source: Django won't bother displaying the filter for a ``ManyToManyField`` if there are fewer than two related objects.
es: Django no se molestará en visualizar el filtro para un campo ``ManyToManyField`` si hay menos de dos objetos relacionados.
ja: Django が ``ManyToManyField`` に対してフィルタを表示するのは、リレーション 先のオブジェクトが複数のときだけです。
pt_br: Django não irá se incomodar em mostrar o filtro para um ``ManyToManyField`` se existerem menos que dois objetos relacionados.
zh_hans: 如果相关联对象少于2个，Django则不会显示``ManyToManyField(多对多字段)``的过滤器

source: For example, if your :attr:`~django.contrib.admin.ModelAdmin.list_filter` includes :doc:`sites </ref/contrib/sites>`, and there's only one site in your database, it won't display a "Site" filter. In that case, filtering by site would be meaningless.
es: Por ejemplo, si tu :attr:`~django.contrib.admin.ModelAdmin.list_filter` incluye :doc:`sitios </ref/contrib/sites>`, y solo hay un sitio en tu base de datos, no mostrará un filtro "Sitio". En ese caso, filtrar por sitio no tendría objetivo.
ja: 例えば、 :attr:`~django.contrib.admin.ModelAdmin.list_filter` に :doc:`sites </ref/contrib/sites>` が含まれていて、かつデータベースに1個しかsiteのデータが無い場合はSiteによるフィルタリングは表示されません。この場合Siteによるフィルタリングは無意味だからです。
pt_br: Por exemplo, se o seu :attr:`~django.contrib.admin.ModelAdmin.list_filter` incluir :doc:`sites </ref/contrib/sites>`, e existir apenas um site no seu banco de dados, não será exibido o filtro "Site". Neste caso, filtrar por site se tornou sem sentido.
zh_hans: 例如，如果您的：attr：`~django.contrib.admin.ModelAdmin.list_filter`包含：doc：`sites 1`，并且你的数据库中只有一个站点，则不会显示“站点”过滤器。在这种情况下，按网站过滤将毫无意义。

source: Some objects aren't appearing in the admin.
es: Algunos objetos no están apareciendo en el sitio de administración.
ja: admin画面でいくつかのオブジェクトが表示されません。
pt_br: Alguns objetos não estão aparecendo na página de administração.
zh_hans: 有些对象没有在管理中出现.

source: Inconsistent row counts may be caused by missing foreign key values or a foreign key field incorrectly set to :attr:`null=False <django.db.models.Field.null>`. If you have a record with a :class:`~django.db.models.ForeignKey` pointing to a non-existent object and that foreign key is included is :attr:`~django.contrib.admin.ModelAdmin.list_display`, the record will not be shown in the admin changelist because the Django model is declaring an integrity constraint that is not implemented at the database level.
es: El conteo inconsistente de filas puede ser causa de valores de llaves foráneas que faltan o un campo de tipo llave foránea incorrectamente establecido como :attr:`null=False <django.db.models.Field.null>`. Si tienes un registro con un campo :class:`~django.db.models.ForeignKey` apuntando a un objeto inexistente y esa llave foránea incluida es :attr:`~django.contrib.admin.ModelAdmin.list_display`, el registro no se mostrará en la lista de cambios del sitio de administración porque el modelo está declarando una restricción de integridad que no está implementada a nivel de base de datos.
ja: おかしな行数カウントが発生するのは、ForeignKeyの値が抜けている場合、又はForeignKeyであるフィールドが間違って :attr:`null=False <django.db.models.Field.null>` に設定されている事が原因です。 もし :class:`~django.db.models.ForeignKey` が存在しないオブジェクトを指しているデータがあり、そのフィールドが :attr:`~django.contrib.admin.ModelAdmin.list_display` に含まれている場合、adminのchangelistには表示されません。なぜならばDjangoのモデルが宣言している整合性制約はデータベースレベルまでは実装されていないからです。
pt_br: Contagens inconsistentes de linhas podem ser causadas por chaves estrangeiras ausentes ou um campo de chave estrangeira configurado incorretamente para :attr:`null=False <django.db.models.Field.null>`. Se você possui um registro com :class:`~django.db.models.ForeignKey` apontando para um objeto inexistente e a chave estrangeira inserida for :attr:`~django.contrib.admin.ModelAdmin.list_display`, o registro não será mostrado na administração de lista de mudanças porque o modelo do Django está declarando uma restrição de integridade que não é implementada a nível de banco de dados.

source: How can I customize the functionality of the admin interface?
es: ¿Cómo puedo personalizar la funcionalidad de la interfaz de administración?
ja: admin インターフェイスの機能をカスタマイズしたい場合にはどうすればいいですか？
pt_br: Como consigo personalizar a funcionalidade da interface de administração?
zh_hans: 如何个性化管理界面的功能？

source: You've got several options. If you want to piggyback on top of an add/change form that Django automatically generates, you can attach arbitrary JavaScript modules to the page via the model's class Admin :ref:`js parameter <modeladmin-asset-definitions>`. That parameter is a list of URLs, as strings, pointing to JavaScript modules that will be included within the admin form via a ``<script>`` tag.
es: Tienes muchas opciones. Si deseas trabajar encima del formulario generado automáticamente por Django, puedes agregar módulos JavaScript a la página por medio de la clase modelo Admin :ref:`parámetro js <modeladmin-asset-definitions>`. Ese parámetro es una lista de URLs, en forma de cadenas, que apuntan a los módulos de JavaScript que serán incluidos en el formulario de administración mediante la etiqueta ``<script>``.
ja: いくつかの方法があります。まず、Django が自動的に生成する追加/変更フォームに修正を加えたい場合には、モデルクラス Admin の :ref:`js パラメータ <modeladmin-asset-definitions>` を介して、ページに好きな JavaScript モジュールを組み込むことができます。このパラメータには、JavaScript モジュールへの URL を表す文字列のリストを指定します。各 URL は、<script> タグを使って admin のフォームに埋め込まれます。
pt_br: Você tem várias opções. Se você quiser adicionar em um formulário de adição/alteração que o Django gera automaticamente, você pode incluir módulos JavaScript arbitrários para a página através da classe Admin do modelo :ref:`parâmetro js <modeladmin-asset-definitions>`. Esse parâmetro é uma lista de URLs, como strings, apontando para módulos JavaScript que serão incluídos dentro do formulário da administração pela tag ``<script>``.
zh_hans: 你有几个选择。 如果您想要在Django自动生成的添加/更改表单上加载，您可以通过模型的类Admin：ref：`js parameter <modeladmin-asset-definitions>`将任意JavaScript模块附加到页面上。 该参数是一个URL列表，作为字符串，指向将通过“<script>”标签包含在管理表单中的JavaScript模块。

source: If you want more flexibility than simply tweaking the auto-generated forms, feel free to write custom views for the admin. The admin is powered by Django itself, and you can write custom views that hook into the authentication system, check permissions and do whatever else they need to do.
es: Si deseas más flexibilidad que simplemente ajustar los formularios generados automáticamente, siéntete libre de crear vistas personalizadas para el sitio de administración. Este sitio está motorizado por el propio Django y puedes crear vistas personalizadas que se acoplen al sistema de autenticación, chequear permisos y hacer cualquier otra cosa que se necesite.
ja: 自動生成されたフォームをただ修正するのではなく、より柔軟なカスタマイズをしたければ、管理サイト用のカスタムビューを自分で書くことができます。管理サイト自体が Django で動いているので、自分でカスタムビューを書くことで、認証システムやパーミッションのチェック、その他なんでも好きなことができます。
pt_br: Se você quer mais flexibilidade além de simplesmente ajustar os formulários automaticamente gerados, sinta-se a vontade para escrever views customizadas para a parte administrativa. A parte administrativa é feita do Django também, e com isso você pode escrever views personalizadas que se acoplem ao sistema de autenticação, ou chequem permissões ou façam qualquer outra coisa que elas precisam fazer.
zh_hans: 如果您想要比简单调整后自动生成的表单更灵活，请随时为admin模块编写自定义视图。 admin 模版是由Django 官方提供支持的模块，你可以编写自定义的视图关联到认证，检查权限，并完成任何他们需要做的业务逻辑。

source: If you want to customize the look-and-feel of the admin interface, read the next question.
es: Si deseas personalizar la apariencia de la interfaz de administración, lee la siguiente pregunta:
ja: 管理サイトのデザインをカスタマイズしたいならば、次の質問が参考になります。
pt_br: Se você quer personalizar a aparência da interface de administração, leia a próxima pergunta.
zh_hans: 如果您想自定义管理界面的外观，请阅读下一个问题

source: The dynamically-generated admin site is ugly! How can I change it?
es: ¡El sitio de administración generado de forma dinámica luce feo! ¿Cómo puedo cambiarlo?
ja: 動的に生成された管理サイトが見難いのですが、どうすれば修正できますか？
pt_br: O site de administração gerado dinamicamente é feio! Como posso modificá-lo?
zh_hans: 动态生成的管理页面太丑了。我该怎么换掉它？

source: We like it, but if you don't agree, you can modify the admin site's presentation by editing the CSS stylesheet and/or associated image files. The site is built using semantic HTML and plenty of CSS hooks, so any changes you'd like to make should be possible by editing the stylesheet.
es: A nosotros nos gusta, pero si a ti no, puedes modificar la presentación del sitio de administración editando las hojas de estilo y/o los archivos de imágenes asociados. El sitio está construido usando HTML semántico y personalizaciones de CSS, así que cualquier cambio que quieras hacer sería posible editando las hojas de estilo.
ja: デフォルトのデザインが好みでなければ、CSS や関連する画像ファイルを編集することで管理サイトの見栄えを変更することができます。サイトは、構造化された HTML とたくさんの CSS のフックを使って構築されているので、スタイルシートを編集すれば、どんな場所であっても自由にカスタマイズすることができるはずです。
pt_br: Nós gostamos disso, mas, se você não concorda, você pode modificar a apresentação do site da administração ao editar as folhas de estilo CSS e/ou os arquivos de imagem associados. O site é feito usando HTML semântico e muitas regras CSS, então qualquer mudança que você quiser fazer deve ser possível ao editar as folhas de estilo.
zh_hans: 我们喜欢他，但如果你不同意，你可以修改管理员主页的展示通过编辑css样式表并且/或者关联图片文件。这个网站使用HTML语法和大量的css钩子，所以任何你想要的改变都应该可以通过修改css样式表来实现。

source: What browsers are supported for using the admin?
es: ¿Qué navegadores están soportados para usar el sitio de administración?
ja: 管理サイトをサポートしているブラウザを教えてください。
pt_br: Quais navegadores são suportados para uso da interface de administração?
zh_hans: 使用admin支持哪些浏览器？

source: The admin provides a fully-functional experience to `YUI's A-grade`_ browsers, with the notable exception of IE6, which is not supported.
es: El sitio de administración provee una experiencia completamente funcional para navegadores `Categoría A de YUI`_, con la notable excepción de IE6, que no está soportado.
ja: 管理サイトは、よく知られた例外である IE6 を除く `YUI's A-grade`_ のブラウザ上で、すべての機能が完全に動作します。
pt_br: A parte administrativa fornece uma experiência totalmente funcional em navegadores `YUI's A-grade`_ , com a notável exceção do IE6, que não é suportado.
zh_hans: 管理员为`YUI's A-grade`浏览器提供了一个全功能的体验，除了IE6不支持。

source: There *may* be minor stylistic differences between supported browsers—for example, some browsers may not support rounded corners. These are considered acceptable variations in rendering.
es: *Pueden* haber menores diferencias de estilo entre los navegadores soportados—por ejemplo, algunos navegadores pueden no soportar esquinas redondeadas. Estas variaciones son consideradas aceptables en la visualización.
ja: スタイル上の細かい違いはある可能性があります。たとえば、いくつかのブラウザでは、テキストボックスなどの角を丸くする機能がサポートされていません。また、レンダリングの結果、ブラウザ間で多少の際はあるかもしれません。いずれも許容範囲内であるはずです。
pt_br: Podem ocorrer diferenças de estilos mínimas entre os navegadores suportados — por exemplo, alguns navegadores podem não suportar cantos arredondados. Essas são consideradas variações aceitáveis de renderização.
zh_hans: 在支持的浏览器之间可能会有细微的风格差异，例如，某些浏览器可能不支持圆角。在渲染中这些认为是可接受的差异。

source: FAQ: Contributing code
es: FAQ: Aportar código
ja: FAQ: コードへの貢献
pt_br: FAQ: Contribuindo com o código
zh_hans: FAQ: 贡献代码

source: How can I get started contributing code to Django?
es: ¿Cómo puedo iniciar a aportar código para Django?
ja: Django のコードに貢献するにはどうすればいいですか？
pt_br: Como eu posso começar a contribuir com código para o Django?
zh_hans: 如何为Django贡献代码?

source: Thanks for asking! We've written an entire document devoted to this question. It's titled :doc:`Contributing to Django </internals/contributing/index>`.
es: ¡Gracias por preguntar! Hemos redactado un documento entero para esta pregunta. Se titula :doc:`Contribuyendo con Django </internals/contributing/index>`.
ja: 聞いてくれてありがとうございます！この質問に答えるための完全なドキュメントがあります。:doc:`Contributing to Django </internals/contributing/index>` をお読みください。
pt_br: Obrigado por perguntar! Nós escrevemos um documento inteiro para esta questão. É intitulado: :doc:`Contribuindo com o Django </internals/contributing/index>`.
zh_hans: 感谢反馈！我们已经写了一个专门讨论这个问题的整个文件。它的标题是:doc:`Contributing to Django 1`.

source: I submitted a bug fix in the ticket system several weeks ago. Why are you ignoring my patch?
es: He presentado una corrección de fallo en el sistema de reportes hace varias semanas. ¿Por qué ignoran mi parche?
ja: 数週間前、チケットシステムでバグフィックスを送ったのですが、どうして私が送ったパッチは無視されてしまうのでしょうか？
pt_br: Há semanas atrás eu submeti uma correção para um bug no sistema de tíquetes. Por que vocês estão ignorando a minha correção?
zh_hans: 我几周之前提交了一张bug修正的表格。为什么我的修正提议被忽视了？

source: Don't worry: We're not ignoring you!
es: ¡No te preocupes: No te estamos ignorando!
ja: 心配しないでください。私たちはあなたを無視していません！
pt_br: Não se preocupe: Nós não estamos te ignorando!
zh_hans: 别担心:我们不会忽略你!
