Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: es, ja, pt_br, zh_hans

source: We try to avoid adding special cases in the Django code to accommodate all the database-specific options such as table type, etc. If you'd like to use any of these options, create a migration with a :class:`~django.db.migrations.operations.RunSQL` operation that contains ``ALTER TABLE`` statements that do what you want to do.
pt_br: Nós tentamos evitar ao adicionar casos excepcionais ao código do Django para acomodar todas as opções específicas de cada banco de dados, como: tipo de tabela e etc. . Se você quiser usar qualquer uma destas opções específicas crie uma rotina de migração com a classe :class:`~django.db.migrations.operations.RunSQL` contendo a instrução ``ALTER TABLE`` e realizando a operação que você deseja.

source: For example, if you're using MySQL and want your tables to use the MyISAM table type, use the following SQL::
es: Por ejemplo, si está usando MySQL y quiere que sus tablas usen el tipo de tabla MyISAM, use la siguiente sentencia SQL::
pt_br: Por exemplo, se você está usando MySQL e quiser que suas tabelas usem a tabela do tipo MyISAM, use a seguinte instrução SQL:

source: Troubleshooting
es: Solución de problemas
ja: トラブルシューティング
pt_br: Soluções de Problemas
zh_hans: 错误调试

source: This page contains some advice about errors and problems commonly encountered during the development of Django applications.
es: Esta página contiene algunos consejos sobre los errores y problemas que se encuentran comúnmente durante el desarrollo de las aplicaciones de Django.
pt_br: Essa página contém alguns conselhos sobre erros e problemas comumente encontrados durante o desenvolvimento de aplicações em Django.

source: Problems running ``django-admin``
pt_br: Problemas ao rodar o ``django-admin``
zh_hans: 运行``django-admin``时遇到的问题

source: "command not found: `django-admin`"
pt_br: "comando não encontrado: `django-admin`"
zh_hans: “未找到`django-admin`命令”

source: :doc:`django-admin </ref/django-admin>` should be on your system path if you installed Django via ``python setup.py``. If it's not on your path, you can find it in ``site-packages/django/bin``, where ``site-packages`` is a directory within your Python installation. Consider symlinking to :doc:`django-admin </ref/django-admin>` from some place on your path, such as :file:`/usr/local/bin`.
pt_br: O :doc:`django-admin </ref/django-admin>` deve estar no caminho do seu sistema caso tenha instalado o Django via: ``python setup.py``. Caso ele não esteja no seu caminho você pode encontrá-lo em ``site-packages/django/bin``, onde ``site-packages`` é um diretório dentro do seu projeto em Python. Considere criar um link simbólico :doc:`django-admin </ref/django-admin>` a partir de algum lugar em seu caminho, tal como :file:`/usr/local/bin`.

source: If ``django-admin`` doesn't work but ``django-admin.py`` does, you're probably using a version of Django that doesn't match the version of this documentation. ``django-admin`` is new in Django 1.7.
pt_br: Se o ``django-admin`` não funciona mas, ``django-admin.py`` sim, você provavelmente está usando uma versão antiga do Django que não coincide com a versão desta documentação. ``django-admin`` é novo no Django 1.7.

source: Miscellaneous
es: Miscelánea
pt_br: Variados
zh_hans: 杂项

source: I'm getting a ``UnicodeDecodeError``. What am I doing wrong?
es: Estoy obteniendo "UnicodeDecodeError". ¿Qué estoy haciendo mal?
pt_br: Estou recebendo um ``UnicodeDecodeError``. O que estou fazendo de errado?
zh_hans: 我遇到了错误信息 ``UnicodeDecodeError``。 我哪里做错了？

source: This class of errors happen when a bytestring containing non-ASCII sequences is transformed into a Unicode string and the specified encoding is incorrect. The output generally looks like this::
pt_br: Estas classes de erros acontecem quando um bytestring contendo sequências não-ASCII é transformado em uma sequência de caracteres Unicode e a codificação especificada está incorreta. A saída geralmente se parece com isso::
zh_hans: 当包含非ASCII序列的字符串被转换为Unicode字符串，并且指定的编码不正确时，会发生此类错误。 输出一般看起来像这样::

source: The resolution mostly depends on the context, however here are two common pitfalls producing this error:
pt_br: A resolução depende principalmente do contexto, entretanto aqui estão as duas armadilhas comuns que produzem este erro:

source: Your system locale may be a default ASCII locale, like the "C" locale on UNIX-like systems (can be checked by the ``locale`` command). If it's the case, please refer to your system documentation to learn how you can change this to a UTF-8 locale.
pt_br: O locale padrão do sistema pode estar definido como ASCII, como o locale "C" nos sistemas baseados em UNIX (você pode checar com o comando ``locale``). Se este é o caso, por favor, consulte a documentação do sistema para aprender como mudar para o locale: UTF-8.

source: You created raw bytestrings, which is easy to do on Python 2::
pt_br: Você criou um raw bytestrings, o que é fácil de fazer em Python 2::

source: Either use the ``u''`` prefix or even better, add the ``from __future__ import unicode_literals`` line at the top of your file so that your code will be compatible with Python 3.2 which doesn't support the ``u''`` prefix.
pt_br: Use o prefixo ``u''`` ou até melhor, adicione a linha ``from __future__ import unicode_literals`` no topo do arquivo para torná-lo compatível com Python 3.2, que não suporta o prefixo ``u''``.

source: Related resources:
es: Recursos relacionados:
pt_br: Recursos relacionados:
zh_hans: 关联资源：

source: :doc:`Unicode in Django </ref/unicode>`
es: :doc:`Unicode en Django </ref/unicode>`
pt_br: :doc:`Unicode em Django </ref/unicode>`

source: FAQ: Using Django
es: FAQ: Usando Django
ja: FAQ: Django を使う
pt_br: FAQ: Usando o Django
zh_hans: FAQ: 使用Django

source: Why do I get an error about importing DJANGO_SETTINGS_MODULE?
es: ¿Por qué me aparece un importando un error importando DJANGO_SETTINGS_MODULE?
ja: DJANGO_SETTINGS_MODULE の import にまつわるエラーが出るのですが、なぜですか？
pt_br: Por que recebo um erro sobre importar o DJANGO_SETTINGS_MODULE?
zh_hans: 为什么我在导入 DJANGO_SETTINGS_MODULE 时收到错误提示？

source: Make sure that:
es: Asegúrese de que:
ja: 以下の点を確認してください:
pt_br: Certifique-se de que:
zh_hans: 保证：

source: The environment variable DJANGO_SETTINGS_MODULE is set to a fully-qualified Python module (i.e. "mysite.settings").
ja: 環境変数 DJANGO_SETTINGS_MODULE が完全指定の Python モジュール名になっていますか (たとえば “mysite.settings”)。
pt_br: A variavél de ambiente DJANGO_SETTINGS_MODULE é definida como um módulo Python reconhecido (i.e. "meuSite.settings").

source: Said module is on ``sys.path`` (``import mysite.settings`` should work).
ja: 設定モジュールは sys.path の上にありますか (import mysite.settings はうまくいきますか)。
pt_br: O módulo citado está em ``sys.path`` (``import meuSite.settings`` deve funcionar).

source: The module doesn't contain syntax errors (of course).
es: El módulo no tiene errores de sintaxis (por supuesto).
ja: (言うまでもなく) モジュールに構文エラーはありませんか。
pt_br: O módulo não contém erros de sintaxe (é claro).
zh_hans: 模块未包含语法错误（当然啦）。

source: I can't stand your template language. Do I have to use it?
es: No puedo soportar su lenguaje de plantillas. Tengo que usarlo?
ja: テンプレート言語を好きになれません。どうしても使わないとだめですか？
pt_br: Eu não gosto da sua linguagem de template. Eu preciso usá-la?
zh_hans: 我不喜欢django的模板语言，能不能不使用它？

source: We happen to think our template engine is the best thing since chunky bacon, but we recognize that choosing a template language runs close to religion. There's nothing about Django that requires using the template language, so if you're attached to Jinja2, Mako, or whatever, feel free to use those.
es: Nosotros pensamos que nuestro motor de plantillas es la mejor cosa después de la tocineta en trozos, pero reconocemos que escoger un lenguaje de plantillas es cercano a la religión. No hay nada acerca de Django que requiera usar el lenguaje de plantillas, si estás apegado a Jinja2, Mako, o lo que sea, siéntete libre de usarlos.
ja: 私達はこのテンプレートエンジンをchunky bacon 以来の傑作だと思っているんで すが、テンプレート言語の選択というものは宗教に近いものがあるということは認識しています。 Django では、テンプレート言語に対する制限はなんらありません。 ですから、 Jinja2 や Mako などを使いたいのなら、それは自由です。
pt_br: Nós pensamos que nosso mecanismo de template é a melhor do mundo mas, reconhecemos que escolher uma linguagem de template é quase como escolher uma religião. Django não força nenhuma linguagem de template, então se você gosta de: Jinja2, Mako ou qualquer outra, sinta-se livre para utilizá-las.

source: Do I have to use your model/database layer?
es: ¿Tengo que utilizar su modelo/capa de base de datos?
ja: 付属のモデル／データベースレイヤを使わねばならないのですか？
pt_br: Eu tenho que usar o seu modelo/camada de banco de dados?
zh_hans: 我是否必须使用你的模型/数据库层？

source: Nope. Just like the template system, the model/database layer is decoupled from the rest of the framework.
ja: いいえ、テンプレートシステムと同様、モデル／データベースレイヤはフレームワー クの他の部分と脱カップリングしています。
pt_br: Não. Tal qual o sistema de template, a camada de modelos/banco de dados é desacoplada do resto da estrutura.

source: The one exception is: If you use a different database library, you won't get to use Django's automatically-generated admin site. That app is coupled to the Django database layer.
ja: 唯一の例外: 別のデータベースライブラリを使った場合には、 Django の自動生成 admin サイトを利用できなくなります。 admin だけは Django のデータベースレイ ヤとカップリングしています。
pt_br: A única exceção é: se você usar uma biblioteca diferente de banco de dados você não conseguirá usar o admin do Django gerado de forma automática. Ele é fortemente acoplado a camada de banco de dados do Django

source: How do I use image and file fields?
es: ¿Cómo uso los campos de imagenes y archivos?
ja: 画像やファイルのフィールドはどう使うのですか？
pt_br: Como eu utilizo campos de imagem e de arquivo?
zh_hans: 我要怎么使用图片和文件字段？

source: Using a :class:`~django.db.models.FileField` or an :class:`~django.db.models.ImageField` in a model takes a few steps:
es: Utilizar una:class:`~django.db.models.FileField` o una :class:`~django.db.models.ImageField`en un modelo toma unos pocos pasos:
ja: モデルで :class:`~django.db.models.FileField` や :class:`~django.db.models.ImageField` を使うには、いくつかのステップを踏む 必要があります:
pt_br: Usando um :class:`~django.db.models.FileField` ou um :class:`~django.db.models.ImageField` em um modelo, seguido pelos passos:

source: In your settings file, you'll need to define :setting:`MEDIA_ROOT` as the full path to a directory where you'd like Django to store uploaded files. (For performance, these files are not stored in the database.) Define :setting:`MEDIA_URL` as the base public URL of that directory. Make sure that this directory is writable by the Web server's user account.
ja: 設定ファイル内で :setting:`MEDIA_ROOT` を指定します。この値は、 Django がアップロードされたファイルを置く場所にします (パフォーマン ス上の理由から、ファイルをデータベースに置くことはありません)。 :setting:`MEDIA_URL` をそのディレクトリの公開 URL にします。ディレク トリは Web サーバのユーザアカウントに対して書き込み可能にしておかね ばなりません。
pt_br: Em seu arquivo de configurações, você vai precisar definir :setting:`MEDIA_ROOT` com o caminho completo para o diretório onde você gostaria que o Django fizesse o upload de seus arquivos. (Para performance, esses arquivos não são armazenados no banco de dados.) Define :setting:`MEDIA_URL` como a URL pública desse diretório. Tenha certeza que esse diretório seja gravável pelo usuário da conta referente ao servidor Web.

source: Add the :class:`~django.db.models.FileField` or :class:`~django.db.models.ImageField` to your model, defining the :attr:`~django.db.models.FileField.upload_to` option to specify a subdirectory of :setting:`MEDIA_ROOT` to use for uploaded files.
ja: モデルに :class:`~django.db.models.FileField` や :class:`~django.db.models.ImageField` を追加し、 :attr:`~django.db.models.FileField.upload_to` オプションを定義して、 :setting:`MEDIA_ROOT` のどのサブディレクトリにファイルをアップロードさせるのかを Django に教えます。
pt_br: Adicione a classe :class:`~django.db.models.FileField` ou :class:`~django.db.models.ImageField` no seu modelo, definindo a opção :attr:`~django.db.models.FileField.upload_to` para especificar o subdiretório da configuração :setting:`MEDIA_ROOT` para usar para arquivos enviados.

source: All that will be stored in your database is a path to the file (relative to :setting:`MEDIA_ROOT`). You'll most likely want to use the convenience :attr:`~django.db.models.fields.files.FieldFile.url` attribute provided by Django. For example, if your :class:`~django.db.models.ImageField` is called ``mug_shot``, you can get the absolute path to your image in a template with ``{{ object.mug_shot.url }}``.
ja: データベースに保存されるのは、ファイルの (:setting:`MEDIA_ROOT` からの相対で表した) パスだけです。 URL を調べるには、 Django の提供し ている属性 :attr:`~django.db.models.fields.files.FieldFile.url` を使うことになるでしょう。例えば、 ``mug_shot` という名前の :class:`~django.db.models.ImageField` を作ったなら、テンプレートで画像の URL を指定するには ``{{ object.mug_shot.url }}`` と書きます。
pt_br: Tudo que vai ser armazenado no seu banco de dados será o caminho para o arquivo (referente a configuração :setting:`MEDIA_ROOT`). Você vai poder usar o atributo :attr:`~django.db.models.fields.files.FieldFile.url` provido pelo Django. Por exemplo, se sua classe :class:`~django.db.models.ImageField` se chama ``mug_shot``, você pode pegar o caminho absoluto para sua imagem no template com: ``{{ object.mug_shot.url }}``.

source: How do I make a variable available to all my templates?
es: ¿Cómo hago que una variable esté disponible en todas mis plantillas?
ja: どうやったら、全てのテンプレートで使えるような変数を定義できますか？
pt_br: Como eu torno uma variável disponível para todos os meus templates?

source: Sometimes your templates just all need the same thing. A common example would be dynamically-generated menus. At first glance, it seems logical to simply add a common dictionary to the template context.
ja: どのテンプレートでも同じデータを扱うことがたまにあります。よくあるのは、メニューを動的に生成して出す場合です。この手の例では、どのテンプレートでも使えるデータの入った辞書をテンプレートコンテキストに入れておくのが合理的ですね。
pt_br: As vezes todos os seus templates precisam das mesmas coisas. Um exemplo comum seria menus gerados dinamicamente. Em uma primeira olhada parece lógico simplesmente adicionar um dicionário comum ao contexto do template.

source: The correct solution is to use a ``RequestContext``. Details on how to do this are here: :ref:`subclassing-context-requestcontext`.
es: La solución correcta es usar un ``RequestContext``. Los detalles de cómo hacer esto están aquí: :ref:`subclassing-context-requestcontext`.
ja: ``RequestContext`` を使うのが正解です。詳しくは コンテキストのサブクラス: :ref:`subclassing-context-requestcontext` を参照してください。
pt_br: A solução correta é usar um ``RequestContext``. Detalhes em como utilizá-lo: :ref:`subclassing-context-requestcontext`.

source: The login cookie isn't being set correctly, because the domain of the cookie sent out by Django doesn't match the domain in your browser. Try these two things:
es: La cookie de ingreso no está siendo debidamente almacenada, pues el dominio de la cookie enviado por Django no coincide con el de tu navegador. Intenta estas dos cosas:
ja: Django の発行するクッキーのドメインと、ブラウザに格納されたドメインが一致していないために、ログインクッキーが正しく設定されていない場合に起きる症状です。以下の二つの対策を試してみてください。

source: Set the :setting:`SESSION_COOKIE_DOMAIN` setting in your admin config file to match your domain. For example, if you're going to "https://www.example.com/admin/" in your browser, in "myproject.settings" you should set :setting:`SESSION_COOKIE_DOMAIN` = 'www.example.com'.
es: Ajuste la: configuración: opción `Dominio de la cookie de sesión` en su archivo de configuración del sitio administrativo para que coincida con su dominio. Por ejemplo, si usted va a "https://www.example.com/admin/" con su navegador, en "myproject.settings" usted debe colocar: configuración: `Dominio de la cookie de sesión` = 'www.example.com'.
ja: 設定ファイルの :setting:`SESSION_COOKIE_DOMAIN` に正しいドメインを設定します。たとえば、Django のサイトにアクセスするときにブラウザに “https://www.example.com/admin/” と入力している場合、“myproject.settings” には set :setting:`SESSION_COOKIE_DOMAIN = 'www.example.com' と設定する必要があります。

source: When and how might I remind the core team of a patch I care about?
es: ¿Cuándo y cómo podría recordarle al equipo principal sobre un parche que me preocupa?

source: A polite, well-timed message to the mailing list is one way to get attention. To determine the right time, you need to keep an eye on the schedule. If you post your message when the core developers are trying to hit a feature deadline or manage a planning phase, you're not going to get the sort of attention you require. However, if you draw attention to a ticket when the core developers are paying particular attention to bugs -- just before a bug fixing sprint, or in the lead up to a beta release for example -- you're much more likely to get a productive response.
es: Un mensaje cortés y a tiempo a la lista de correos es una forma de ser atendido. Para determinar el momento adecuado necesitas vigilar calendario. Si publicas tu mensaje cuando los desarrolladores principales intentan resolver una funcionalidad con plazo o gestionar una fase planificada, no recibirás el tipo de atención requerida. Sin embargo, si centras la atención en un reporte cuando los desarrolladores principales prestan particular atención a los fallos -- antes del sprint de arreglo de falllos, o en la preparación para una liberación beta, por ejemplo -- probablemente tendrás una respuesta productiva.

source: Another way to get traction is to pull several related tickets together. When the core developers sit down to fix a bug in an area they haven't touched for a while, it can take a few minutes to remember all the fine details of how that area of code works. If you collect several minor bug fixes together into a similarly themed group, you make an attractive target, as the cost of coming up to speed on an area of code can be spread over multiple tickets.
es: Otra forma de ganar terreno es agrupar varias incidencias relacionadas. Cuando los desarrolladores principales se sientan a corregir un error en un área con la que no han tenido contacto durante un tiempo, puede tomar unos minutos recordar todos los pequeños detalles de cómo funciona esa área de código. Si usted agrupa varias correcciones de errores menores en un grupo temático similar, usted lo hace un blanco atractivo, ya que el esfuerzo de proponer acelerar en un área de código se puede extender a diferentes incidencias.

source: Please refrain from emailing core developers personally, or repeatedly raising the same issue over and over. This sort of behavior will not gain you any additional attention -- certainly not the attention that you need in order to get your pet bug addressed.
es: Por favor, abstente de enviar correos personales a los desarrolladores principales, o exponer el mismo problema una y otra vez. Este tipo de comportamiento no te permitirá obtener algún tipo de atencióñ -- ciertamente no la atención que necesitas para tu fallo.

source: When Django was originally written a couple of years ago, Adrian and Simon spent quite a bit of time exploring the various Python Web frameworks available.
es: Cuando Django fue escrito originalmente, hace un par de años, Adrian y Simon gastaron bastante tiempo explorando varios frameworks Web de Python disponibles.
ja: Django を書き始めた数年前、 Adrian と Simon は少し時間を取って、当時利用できた様々な Python ウェブフレームワークを試してみました。

source: Where can I find Django developers for hire?
es: ¿Dónde puedo encontrar desarrolladores de Django para contratarlos?
ja: Django 開発者はどこで雇えますか？

source: Consult our `developers for hire page`_ for a list of Django developers who would be happy to help you.
es: Consulte nuestra página `desarrolladores disponibles para empleo`_ para encontrar una lista de desarrolladores Django quienes estarían felices de ayudarte.
ja: 求職中の開発者リスト `developers for hire page`_ には、喜んであなたの力になってくれる Django 開発者 のリストがあります。

source: Why hasn't my message appeared on django-users?
es: ¿Por qué mi mensaje no ha aparecido en django-users?

source: Nobody on django-users answered my question! What should I do?
es: ¡Nadie de django-users ha respondido mi pregunta!¿Qué debo hacer?

source: Problems running django-admin
es: Problemas ejecutando django-admin

source: "command not found: django-admin"
es: "comando no encontrado: django-admin"

source: Mac OS X permissions
es: Permisos Mac OS X

source: Django was originally developed at World Online, the Web department of a newspaper in Lawrence, Kansas, USA. Django's now run by an international :doc:`team of volunteers </internals/team>`.
ja: Django はもともと、アメリカのカンザス州ローレンス (Lawrence, Kansas, USA) にある、World Online という新聞社の Web 開発部門で開発されました。現在は、国際的な :doc:`ボランティアのチーム</internals/team>` が開発を続けています。

source: You might also be interested in posting a job to https://djangogigs.com/ . If you want to find Django-capable people in your local area, try https://people.djangoproject.com/ .
ja: また、求人を https://djangogigs.com/ に出してみるのもよいでしょう。 地元で Django を扱える人を探しているなら、 https://people.djangoproject.com/ を調べてみてください。

source: Inconsistent row counts may be caused by missing foreign key values or a foreign key field incorrectly set to :attr:`null=False <django.db.models.Field.null>`. If you have a record with a :class:`~django.db.models.ForeignKey` pointing to a nonexistent object and that foreign key is included is :attr:`~django.contrib.admin.ModelAdmin.list_display`, the record will not be shown in the admin changelist because the Django model is declaring an integrity constraint that is not implemented at the database level.
zh_hans: 不一致的行计数可能由缺少外键值或由将外键字段错误地设置为：attr：`null = False <django.db.models.Field.null>`造成。如果你有一个指向不存在对象的class：`~django.db.models.ForeignKey`的记录，并且包含的​​外键是：attr：`~django.contrib.admin.ModelAdmin.list_display`，将不会显示在管理更改列表中，因为Django模型正在声明未在数据库级别实施的完整性约束。

source: Another way to get traction is to pull several related tickets together. When the someone sits down to review a bug in an area they haven't touched for a while, it can take a few minutes to remember all the fine details of how that area of code works. If you collect several minor bug fixes together into a similarly themed group, you make an attractive target, as the cost of coming up to speed on an area of code can be spread over multiple tickets.
zh_hans: 另一种方法获得关注的方法是将几个相关的工单放在一起。当某人坐下来审阅一个他们已经有一段时间没有接触的区域中的bug时，可能需要几分钟的时间来想起该区域代码如何工作的所有细节。如果您将几个小错误的修复集中到一个类似主题的组中，那么您将成为一个有吸引力的目标，因为在一个区域的代码上提速工作的成本可以被用到多个工单上。

source: macOS permissions
zh_hans: macOS的权限问题
