Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/glossary.po
Languages: el, id, ko, pt_br

source: Glossary
el: Λεξιλόγιο
id: Glosarium
ko: 용어
pt_br: Glossário

source: concrete model
el: Μη αφηρημένο μοντέλο
id: model berwujud
ko: 구상 모델
pt_br: modelo concreto

source: A non-abstract (:attr:`abstract=False <django.db.models.Options.abstract>`) model.
el: Ένα μη αφηρημένο (:attr:`abstract=False <django.db.models.Options.abstract>`) μοντέλο
id: Model (:attr:`abstract=False <django.db.models.Options.abstract>`) bukan-abstrak.
ko: 비추상(:attr: `abstract=False <django.db.models.Options.abstract>`) 모델
pt_br: Um modelo não abstrato (:attr:`abstract=False <django.db.models.Options.abstract>`).

source: field
el: πεδίο
id: bidang
ko: 필드
pt_br: campo

source: An attribute on a :term:`model`; a given field usually maps directly to a single database column.
el: Ένα attribute ενός :term:`μοντέλου <model>`. Ένα πεδίο, συνήθως, αντιστοιχεί σε μια στήλη στη βάση δεδομένων.
id: Sebuah atribut pada :term:`model`; bidang yang diberikan biasanya memetakan langsung ke kolom basisdata tunggal.
ko: :term:`model` 의 어트리뷰트. 하나의 field는 종종 데이터베이스의 한 컬럼에 대응됨.
pt_br: Um atributo em um :term:`model`; um dado campo normalmente se relaciona diretamente com uma única coluna do banco de dados.

source: See :doc:`/topics/db/models`.
el: Δείτε στο άρθρο :doc:`Μοντέλα </topics/db/models>`.
id: Lihat :doc:`/topics/db/models`.
ko: :doc:`/topics/db/models` 참조.
pt_br: Veja :doc:`/topics/db/models`.

source: generic view
id: pandangan umum

source: A higher-order :term:`view` function that provides an abstract/generic implementation of a common idiom or pattern found in view development.
el: Μια συνάρτηση :term:`view` η οποία παρέχει μια αφηρημένη/γενική υλοποίηση κοινών πρακτικών ή μοτίβων τα οποία εμφανίζονται κατά την ανάπτυξη ενός view.
id: Fungsi :term:`view` urutan-tertinggi yang menyediakan sebuah penerapan abstrak/umum dari dialek atau corak umum ditemukan dalam pengembangan tampilan.
ko: 뷰 개발에 있어 일반적인 idiom 또는 패턴에 대한 추상적/일반적 구현을 제공하는 보다 높은 order의 :term:`view` 함수.
pt_br: Uma função de maior ordem :term:`view` que prove uma implementação abstrata/genérica de um idioma comum ou padrão encontrado no desenvolvimento de view.

source: See :doc:`/topics/class-based-views/index`.
el: Δείτε στο άρθρο :doc:`/topics/class-based-views/index`.
id: Lihat :doc:`/topics/class-based-views/index`.
ko: :doc:`/topics/class-based-views/index` 참조.
pt_br: Veja :doc:`/topics/class-based-views/index`.

source: Models store your application's data.
el: Τα μοντέλα αποθηκεύουν τα δεδομένα της εφαρμογής σας.
id: Model menyimpan data aplikasi Anda.
ko: 모델은 애플리케이션의 데이터를 저장합니다.
pt_br: Models armazenam os dados da sua aplicação.

source: "Model-template-view"; a software pattern, similar in style to MVC, but a better description of the way Django does things.
el: "Model-template-view"; ένα μοτίβο του software, σχεδιαστικά όμοιο με το MVC, αλλά πιο περιγραφικό και συνδεδεμένο με το Django.
id: "Model-template-view"; pola perangkat lunak, mirip dengan gaya pada MVC, tetapi gambaran lebih baik dari Django lakukan.
ko: "모델-템플릿-뷰". 소프트웨어의 패턴으로서, MVC와 유사하지만, 그보다 Django의 방식을 더 잘 설명하는 용어.
pt_br: "Model-template-view"; um padrão de software, parecido com o estilo do MVC, mas é uma descrição melhor para o jeito que o Django funciona.

source: See :ref:`the FAQ entry <faq-mtv>`.
el: Δείτε τις διαφορές στις :ref:`συχνές ερωτήσεις <faq-mtv>`.
id: Lihat :ref:`Masukan FAQ <faq-mtv>`.
ko: :ref:`the FAQ entry <faq-mtv>` 참조.
pt_br: Veja :ref:`na FAQ <faq-mtv>`.

source: `Model-view-controller`__; a software pattern. Django :ref:`follows MVC to some extent <faq-mtv>`.
el: `Model-view-controller`__; ένα μοτίβο του software. Το Django :ref:`ακολουθεί το MVC μέχρι ένα σημείο <faq-mtv>`.
id: `Model-view-controller`__; pola perangkat lunak :ref:`mengikuti MVC ke beberapa tingkatan <faq-mtv>`.
ko: `모델-뷰-컨트롤러`__. 소프트웨어 패턴. Django는 :ref:`MVC를 따름 <faq-mtv>`.
pt_br: `Model-view-controller`__; um padrão de desenvolvimento de software. Django :ref:`segue o MVC até certo ponto <faq-mtv>`.

source: project
id: proyek
ko: 프로젝트
pt_br: projeto

source: A Python package -- i.e. a directory of code -- that contains all the settings for an instance of Django. This would include database configuration, Django-specific options and application-specific settings.
el: Ένα Python πακέτο -- π.χ ένας φάκελος με αρχεία που περιέχουν τις απαραίτητες ρυθμίσεις για να ένα instance του Django. Αυτές οι ρυθμίσεις περιλαμβάνουν τη ρύθμιση της βάσης δεδομένων, επιλογές αποκλειστικά για να τρέξει το Django και διάφορες ρυθμίσεις για να τρέξει η εφαρμογή σας.
id: Sebuah Paket Phyton -- yaitu direktori kode -- yang mengandung semua pengaturan dari instance Django. Ini akan memasukkan konfigurasi basisdata, pilihan spesifik-Django dan pengaturan spesidik-aplikasi.
ko: Django의 인스턴스에 대한 모든 설정을 담은 파이썬 패키지 -- 디렉토리 또는 코드 --. 데이터베이스 설정, Django 설정 및 애플리케이션 설정 등을 포함.
pt_br: Um pacote Python -- isto é. um diretório de código -- que contém todas as configurações para uma instância do Django. Isto pode incluir configuração de banco de dados, opções especificas do Django e configurações especificas da aplicação.

source: property
id: properti
ko: 속성
pt_br: propriedade

source: Also known as "managed attributes", and a feature of Python since version 2.2. This is a neat way to implement attributes whose usage resembles attribute access, but whose implementation uses method calls.
el: Επίσης γνωστό και ως "managed attributes". Αποτελεί feature της Python από την έκδοση 2.2. Αυτός είναι ένας ωραίος τρόπος να υλοποιηθούν τα attributes των οποίων η χρήση μοιάζει με την πρόσβαση σε attribute αλλά η υλοποίηση τους χρησιμοποιεί κλήσεις μεθόδων.
id: Juga dikenal sebagai "mengelola atribut", dan sebuah fitur Phyton sejak versi 2.2. Ini adalah cara serasi untuk menerapkan atribut yang penggunaannya menyerupai akses atribut, tetapi yang penerapannya menggunakan metode pemanggilan.
ko: "managed attributes"라고도 하며, 파이썬 버전 2.2부터 제공되는 기능. 어트리뷰트 접근과 유사한 사용법을 갖는 어트리뷰트를 구현하는 깔끔한 방법이지만, 그 구현은 함수 호출을 사용함.
pt_br: Também conhecida como "atributos gerenciados" e um recurso do Python desde a versão 2.2. Esta é uma maneira elegante de implementar atributos cujo uso se assemelha a acesso de atributos, mas cuja implementação utiliza chamadas de método.

source: See :class:`property`.
el: Δείτε στο :class:`property`.
id: Lihat :class:`property`.
ko: :class:`property` 참조
pt_br: Veja :class:`property`.

source: An object representing some set of rows to be fetched from the database.
el: Ένα object το οποίο αναπαριστά ένα σετ από γραμμές (rows) που θα ληφθούν από τη βάση δεδομένων.
id: Sebuah obyek mewakili beberapa kumpulan baris untuk diambil dari basisdata.
ko: 데이터베이스로부터 얻어낸 행의 집합을 나타내는 개체.
pt_br: Um objeto que representa um conjunto de linhas a ser obtido a partir da base de dados.

source: See :doc:`/topics/db/queries`.
el: Δείτε στο άρθρο :doc:`Πραγματοποιώντας queries </topics/db/queries>`.
id: Lihat :doc:`/topics/db/queries`.
ko: :doc:`/topics/db/queries` 참조.
pt_br: Veja :doc:`/topics/db/queries`.

source: A short label for something, containing only letters, numbers, underscores or hyphens. They're generally used in URLs. For example, in a typical blog entry URL:
el: Μια μικρή ετικέτα για κάτι που αποτελείται μόνο από γράμματα, αριθμούς, κάτω παύλες ή παύλες. Συνήθως χρησιμοποιούνται στα URLs. Για παράδειγμα, σε ένα τυπικό blog URL:
id: Label pendek untuk sesuatu, mengandung hanya huruf, angka, garis bawah atau penghubung. Mereka umumnya digunakna dalam URL. Sebagai contoh, dalam URL masukan blok yang khas:
ko: 짧은 라벨로서, 문자, 숫자, 밑줄 또는 하이픈만을 포함. 일반적으로 URL에 사용. 예를 들어, 블로그 엔트리 URL은 다음과 같다고 할 때,
pt_br: Um pequeno rótulo para alguma coisa contendo apenas letras, números, traços ou underscores. São geralmente usados em URLs. Por exemplo, em uma típica URL de postagem de blog:

source: the last bit (``spring``) is the slug.
el: η τελευταία λέξη (``spring``) αποτελεί το slug.
id: bit terakhir (``spring``) adalah slug.
ko: 마지막 부분(``spring``)이 슬러그입니다.
pt_br: a última parte (``spring``) é o slug.

source: template
id: cetakan
ko: 템플릿

source: A chunk of text that acts as formatting for representing data. A template helps to abstract the presentation of data from the data itself.
el: Ένα κομμάτι κειμένου το οποίο μορφοποιεί τα δεδομένα προς εμφάνιση. Ένα template βοηθά στο διαχωρισμό της εμφάνισης των δεδομένων από τα ίδια τα δεδομένα.
id: Sebuah potongan teka yang bertindak sebagai membentuk untuk mewakili data. Sebuah cetakan membantu untuk membentuk kehadiran data dari data itu sendiri.
ko: 데이터를 표현하기 위한 형식으로서 쓰이는 텍스트의 덩어리. 템플릿은 데이터 자체와 그에 대한 표현을 분리하여 추상화하는 데에 도움이 됨.
pt_br: Um pedaço de texto que atua como formatador para representar dados. Um template que ajuda a abstrair a apresentação de dados a partir dos seus dados.

source: See :doc:`/topics/templates`.
el: Δείτε στο άρθρο :doc:`/topics/templates`.
id: Lihat :doc:`/topics/templates`.
ko: :doc:`/topics/templates` 참조.
pt_br: Veja :doc:`/topics/templates`.

source: view
id: lihat
ko: 뷰

source: A function responsible for rendering a page.
el: Μια συνάρτηση η οποία είναι υπεύθυνη για να κάνει render μια σελίδα.
id: Sebuah fungsi bertangguna jawab untuk membuat halaman.
ko: 페이지 렌더링를 담당하는 함수.
pt_br: Uma função responsável por renderizar a página.

source: model
el: μοντέλο
ko: 모델
