Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Give Django your database parameters
el: Δώστε στο Django τις παραμέτρους της βάσης δεδομένων σας
id: Berikan Django parameter basisdata anda

source: You'll need to tell Django what your database connection parameters are, and what the name of the database is. Do that by editing the :setting:`DATABASES` setting and assigning values to the following keys for the ``'default'`` connection:
el: Θα χρειαστεί να πείτε στο Django ποιες είναι οι παράμετροι για σύνδεση με την βάση δεδομένων καθώς και το όνομα της βάσης. Αυτό το κάνετε επεξεργάζοντας τη ρύθμιση :setting:`DATABASES` και ορίζοντας τιμές στα ακόλουθα keys για την σύνδεση ``'default'``:
id: Anda akan butuh memberitahu Django apa parameter hubungan basisdata anda, dan apa nama dari basisdatanya. Lakukan itu dengan menyunting pengaturan :setting:`DATABASES` dan tetapkan nilai-nilai pada kunci-kunci berikut untuk hubungan ``'default'``:

source: Auto-generate the models
el: Αυτόματη δημιουργία των μοντέλων
id: Model yang dibangun otomatis

source: Django comes with a utility called :djadmin:`inspectdb` that can create models by introspecting an existing database. You can view the output by running this command::
el: Το Django έρχεται με μια λειτουργία-εντολή με το όνομα :djadmin:`inspectdb` η οποία μπορεί να δημιουργήσει μοντέλα κοιτάζοντας μια υπάρχουσα βάση δεδομένων. Μπορείτε να δείτε την έξοδο αυτής της εντολής τρέχοντας την::
id: Django datang dengan peralatan dipanggil :djadmin:`inspectdb` yang dapat membuat model dengan menginterospeksi sebuah basisdata yang ada. Anda dapat melihat keluaran dengan menjalankan perintah ini::

source: Save this as a file by using standard Unix output redirection::
el: Σώστε την έξοδο σε ένα αρχείο χρησιμοποιώντας τη στάνταρντ ανακατεύθυνση εξόδου του Unix::
id: Simpan ini sebagai sebuah berkas dengan menggunakan pengalihan standar keluaran Unix::

source: This feature is meant as a shortcut, not as definitive model generation. See the :djadmin:`documentation of inspectdb <inspectdb>` for more information.
el: Αυτή η λειτουργία προορίζεται ως μια συντόμευση, όχι ως παραγωγή οριστικών μοντέλων. Δείτε στο :djadmin:`εγχειρίδιο του inspectdb <inspectdb>` για περισσότερες πληροφορίες.
id: Fitur ini berarti sebagai sebuah jalan pintas, bukan sebagai generasi model tetap. Lihat :djadmin:`documentation of inspectdb <inspectdb>` untuk informasi lebih.

source: Once you've cleaned up your models, name the file ``models.py`` and put it in the Python package that holds your app. Then add the app to your :setting:`INSTALLED_APPS` setting.
el: Αφού κάνετε τυχόν εκκαθαρίσεις-αναδιατάξεις στα μοντέλα σας, ονομάστε το αρχείο ``models.py`` και βάλτε το μέσα στο φάκελο της εφαρμογής σας. Κατόπιν, προσθέστε την εφαρμογή αυτή στη ρύθμιση :setting:`INSTALLED_APPS`.
id: Sekali anda telah membersihkan model anda, namai berkas ``models.py`` dan taruh dia di paket Python yang menampung aplikasi anda. Kemudian tambah aplikasi ke pengaturan :setting:`INSTALLED_APPS` anda.

source: By default, :djadmin:`inspectdb` creates unmanaged models. That is, ``managed = False`` in the model's ``Meta`` class tells Django not to manage each table's creation, modification, and deletion::
el: Από προεπιλογή, η εντολή :djadmin:`inspectdb` δημιουργεί αδιαχείριστα μοντέλα (unmanaged models). Δηλαδή, το attribute μέσα στην κλάση ``Meta`` του μοντέλου ``managed = False``, λέει στο Django να μην διαχειριστεί τη δημιουργία, επεξεργασία και διαγραφή αυτού του πίνακα::
id: Secara awal, djadmin:`inspectdb` membuat model tidak terkelola. Yaitu, ``managed = False`` dalam kelas ``Meta`` model memberitahu Django tidak mengelola setiap pembuatan tabel, perubahan, dan penghapusan::

source: If you do want to allow Django to manage the table's lifecycle, you'll need to change the :attr:`~django.db.models.Options.managed` option above to ``True`` (or simply remove it because ``True`` is its default value).
el: Αν θέλετε να επιτρέψετε στο Django να διαχειριστεί τον κύκλο ζωής αυτού του πίνακα, θα χρειαστεί να αλλάξετε το attribute :attr:`~django.db.models.Options.managed` σε ``True`` (ή απλά αφαιρέστε το επειδή η προεπιλεγμένη τιμή του είναι ``True``).
id: Jika anda ingin mengizinkan untuk mengelola daur hidup tabel, anda akan butuh merubah pilihan :attr:`~django.db.models.Options.managed` diatas menjadi ``True`` (atau mudahnya pindahkan dia karena ``True`` adalan nilai awalnya).

source: Install the core Django tables
el: Εγκατάσταση των βασικών πινάκων Django
id: Pasang tabel inti Django

source: Next, run the :djadmin:`migrate` command to install any extra needed database records such as admin permissions and content types::
el: Επόμενο βήμα, είναι να τρέξετε την διαχειριστική εντολή :djadmin:`migrate` για την εγκατάσταση τυχόν επιπλέον database records όπως τα admin permissions και τα content types::
id: Selanjutnya, jalankan perintah :djadmin:`migrate` untuk memasang setiap tambahan yang diperlukan rekaman basisdata seperti perizinan admin dan jenis-jenis isi::

source: Test and tweak
el: Δοκιμές και αλλαγές
id: Uji dan ubah

source: Those are the basic steps -- from here you'll want to tweak the models Django generated until they work the way you'd like. Try accessing your data via the Django database API, and try editing objects via Django's admin site, and edit the models file accordingly.
el: Αυτά είναι τα βασικά βήματα -- από δω και μπρος θα θέλετε να πειράξετε τα μοντέλα που δημιούργησε το Django για εσάς για να δουλεύουν όπως ακριβώς θέλετε. Προσπαθήστε να προσπελάσετε τα δεδομένα σας μέσω του Django database API και επίσης προσπαθήσετε να επεξεργαστείτε τα objects σας μέσω του Django admin site και επεξεργαστείτε το αρχείο του μοντέλου σας καταλλήλως.
id: Itu adalah langkah-langkah awal -- dari sini anda akan ingin menyesuaikan model DJango dibangkitkan sampai mereka bekerja dengan cara yang anda inginkan. Coba mengakses data melalui API basisdata Django, dan coba menyunting obyek melalui situs admin Django, dan menyunting berkas model.

source: Outputting CSV with Django
el: Εξάγοντας αρχεία CSV με το Django
id: Mengeluarkan CSV dengan Django

source: This document explains how to output CSV (Comma Separated Values) dynamically using Django views. To do this, you can either use the Python CSV library or the Django template system.
el: Αυτό το άρθρο εξηγεί πως να εξάγετε αρχεία CSV (Comma Separated Values), δυναμικά, χρησιμοποιώντας τα Django views. Για να το κάνετε αυτό, μπορείτε είτε να χρησιμοποιήσετε την βιβλιοθήκη CSV της Python ή το σύστημα template του Django.
id: Dokumen ini menjelaskan bagaimana keluaran CSV (Comma Separated Values) secara dinamis menggunakan tampilan Django. Untuk melakukan ini, anda dapat salah satu menggunakan pustaka CSV Python atau sistem cetakan Django.

source: Using the Python CSV library
el: Χρησιμοποιώντας τη βιβλιοθήκη CSV της Python
id: Menggunakan pustaka CSV Python

source: Python comes with a CSV library, :mod:`csv`. The key to using it with Django is that the :mod:`csv` module's CSV-creation capability acts on file-like objects, and Django's :class:`~django.http.HttpResponse` objects are file-like objects.
el: Η Python έρχεται με μια βιβλιοθήκη, :mod:`csv`. Το κλειδί για να την χρησιμοποιήσετε με το Django είναι ότι η δυνατότητα της δημιουργίας CSV του module :mod:`csv` ενεργεί πάνω σε objects που μοιάζουν με αρχεία και τα objects της κλάσης :class:`~django.http.HttpResponse` του Django είναι objects που μοιάζουν με αρχεία.
id: Python datang dengan pustaka CSV, :mod:`csv`. Kunci menggunakannya dengan Django adalah :mod:`csv` kemampuan modul pembuatan-CSV bertindak pada obyek seperti-berkas, dan obyek :class:`~django.http.HttpResponse` Django adalah obyek seperti-berkas.

source: Here's an example::
el: Ορίστε ένα παράδειγμα::
id: Ini adalah sebuah contoh::

source: The code and comments should be self-explanatory, but a few things deserve a mention:
el: Παρόλο που ο κώδικας και τα σχόλια είναι αρκετά επεξηγηματικά, θα πρέπει να αναφέρουμε μερικά πράγματα:
id: Kode dan komentar seharunya sudah cukup jelas, tetapi sedikit hal pantas disebut:

source: The response gets a special MIME type, :mimetype:`text/csv`. This tells browsers that the document is a CSV file, rather than an HTML file. If you leave this off, browsers will probably interpret the output as HTML, which will result in ugly, scary gobbledygook in the browser window.
el: Το response παίρνει έναν ειδικό τύπο MIME, :mimetype:`text/csv`. Αυτό λέει στους browsers ότι το έγγραφο είναι ένα αρχείο CSV, παρά ένα αρχείο HTML. Αν δεν το προσδιορίσετε, οι browsers, πιθανόν, να ερμηνεύσουν το reponse ως ένα αρχείο HTML, που σημαίνει ότι το αποτέλεσμα θα είναι όχι μόνο άσχημο αλλά δεν θα καταλαβαίνετε τίποτα!
id: Tanggapan mendapatkan jenis MIME khusus, mimetype:`text/csv`. Ini memberitahu perambah bahwa dokumen adalah sebuah berkas CSV, daripada sebuah berkas HTML. Jika anda mengosongkan ini, perambah akan kemungkinan mentafsirkan keluaran sebagai HTML, yang akan menghasilkan buruk, uraian berbelit-belit yang menakutkan dalam jendela perambah.

source: The response gets an additional ``Content-Disposition`` header, which contains the name of the CSV file. This filename is arbitrary; call it whatever you want. It'll be used by browsers in the "Save as..." dialog, etc.
el: Το response παίρνει έναν επιπλέον header με το όνομα ``Content-Disposition``, ο οποίος περιέχει το όνομα του αρχείου CSV. Αυτό το όνομα είναι αυθαίρετο. Μπορείτε να το ονομάσετε όπως εσείς θέλετε. Θα χρησιμοποιηθεί από τους browsers στο παράθυρο διαλόγου "Αποθήκευση ως..." κλπ.
id: Tanggapan mendapatkan sebuah kepala ``Content-Disposition`` tambahan, yang mengandung nama dari berkas CSV. Berkas nama ini berubah-ubah; panggil dia kapanpun anda inginkan. DIa akan digunakan oleh perambah dalam dialog "Save as...", dll.

source: Hooking into the CSV-generation API is easy: Just pass ``response`` as the first argument to ``csv.writer``. The ``csv.writer`` function expects a file-like object, and :class:`~django.http.HttpResponse` objects fit the bill.
el: Η σύνδεση με το CSV-generation API είναι εύκολη: Απλώς περάστε το ``response`` ως πρώτο όρισμα στη μέθοδο ``csv.writer``. Η μέθοδος ``csv.writer`` περιμένει ένα object τύπου αρχείου και τα objects της κλάσης :class:`~django.http.HttpResponse` θα αναλάβουν τα υπόλοιπα.
id: Mengait kedalam API pembangkitan-CSV adalah mudah: Cukup lewatkan ``response`` sebagai argumen eprtama pada ``csv.writer``. Fungsi ``csv.writer`` mengharapkan obyek berkas-seperti, dan obyek :class:`~django.http.HttpResponse` cocok dengan tagihan.

source: For each row in your CSV file, call ``writer.writerow``, passing it an iterable object such as a list or tuple.
el: Για κάθε γραμμή μέσα στο αρχείο σας CSV, καλέστε τη μέθοδο ``writer.writerow``, περνώντας της ένα iterable object όπως μια λίστα ή ένα tuple.
id: Untuk setiap baris di berkas CSV anda, panggil ``writer.writerow``, lewatkan dia obyek berputar seperti sebuah daftar atau tuple.

source: The CSV module takes care of quoting for you, so you don't have to worry about escaping strings with quotes or commas in them. Just pass ``writerow()`` your raw strings, and it'll do the right thing.
el: Το CSV module τακτοποιεί τους χαρακτήρες των εισαγωγικών (``’’`` ή ``””``) για εσάς. Οπότε, δεν χρειάζεται να ανησυχείτε για τυχόν escaping των strings σας με εισαγωγικά ή κόμματα μέσα σε αυτά. Απλώς, περάστε τα στη μέθοδο ``writerow()`` ως έχουν και όλα θα τακτοποιηθούν αυτόματα.
id: Modul CSV merawat dari mengutip untuk anda, jadi jangan khawatir tentang pelolosan deretan karakter dengan kutip atau koma di dalamnya. Cukup lewatkan `writerow()`` deretan karakter mentah anda, dan dia akan melakukan hal benar.

source: Handling Unicode on Python 2
el: Δουλεύοντας με Unicode στην Python 2
id: Menangani Unicode di Python 2

source: Python 2's :mod:`csv` module does not support Unicode input. Since Django uses Unicode internally this means strings read from sources such as :class:`~django.http.HttpRequest` are potentially problematic. There are a few options for handling this:
el: Το :mod:`csv` module της Python 2 δεν υποστηρίζει Unicode εισόδους (ήτοι χαρακτήρες εκτός ASCII κώδικα). Αφού το Django χρησιμοποιεί, εσωτερικώς, Unicode, αυτό σημαίνει ότι τα strings που διαβάζονται από διάφορες πηγές, όπως το :class:`~django.http.HttpRequest` θα είναι πιθανόν προβληματικά. Υπάρχουν μερικοί τρόποι επίλυσης αυτού:
id: Modul :mod:`csv` Python2 tidak mendukung masukan Unicode. Sejak Django menggunakan Unicode secara internal in iberarti deretan karakter dibaca dari sumber seperti class:`~django.http.HttpRequest` adalah berpotensi bermasalah. Ada sedikit pilihan untuk menangani ini:

source: Manually encode all Unicode objects to a compatible encoding.
el: Κωδικοποιήστε χειροκίνητα όλα τα Unicode objects σε μια συμβατική κωδικοποίηση.
id: Secara manual menyandi semua obyek Unicode ke penyandian yang cocok.

source: Use the ``UnicodeWriter`` class provided in the `csv module's examples section`_.
el: Χρησιμοποιήστε την κλάση ``UnicodeWriter`` που παρέχετε από την `ενότητα παραδειγμάτων του module csv <https://docs.python.org/2/library/csv.html#examples>`_.
id: Gunakan kelas ``UnicodeWriter`` disediakan di `csv module's examples section`_.

source: Use the `python-unicodecsv module`_, which aims to be a drop-in replacement for :mod:`csv` that gracefully handles Unicode.
el: Χρησιμοποιήστε το `python-unicodecsv module`_, το οποίο εκτός του ότι στοχεύει να αντικαταστήσει το module :mod:`csv`, μπορεί να χειριστεί το Unicode πολύ καλά.
id: Gunakan `python-unicodecsv module`_, yang menuju untuk menjadi pengganti untuk :mod:`csv` yang anggun menangani Unicode.

source: For more information, see the Python documentation of the :mod:`csv` module.
el: Για περισσότερες πληροφορίες, δείτε στο εγχειρίδιο της Python σχετικά με το :mod:`csv` module.
id: Untuk info lebih lanjut, lihat dokumentasi Python di modul :mod:`csv`.

source: Streaming large CSV files
el: Κάνοντας streaming σε μεγάλα αρχεία CSV
id: Mengalirkan berkas-berkas CSV besar

source: When dealing with views that generate very large responses, you might want to consider using Django's :class:`~django.http.StreamingHttpResponse` instead. For example, by streaming a file that takes a long time to generate you can avoid a load balancer dropping a connection that might have otherwise timed out while the server was generating the response.
el: Όταν έχουμε views τα οποία παράγουν πολύ μεγάλα responses, ίσως θα θέλατε να χρησιμοποιήσετε το :class:`~django.http.StreamingHttpResponse` του Django. Για παράδειγμα, όταν κάνετε streaming ένα αρχείο το οποίο παίρνει αρκετή ώρα για να παραχθεί, μπορείτε να αποφύγετε την διακοπή σύνδεσης του load balancer (Error 522: Connection timed out) που θα προέκυπτε όσο ο server σας παράγει το response.
id: Ketika berurusan dengan tampilan yang membangkitkan tanggapan yang sangat besar, anda mungkin ingin mempertimbangkan menggunakan :class:`~django.http.StreamingHttpResponse` Django. Sebagai contoh, dengan mengalirkan sebuah berkas yang memakan waktu lama untuk membangkitkan anda dapat menghindari penyeimbang memuat menjatuhkan hubungan yang mungkin telah dinyatakan habis selagi peladen membangkitkan tanggapan.

source: In this example, we make full use of Python generators to efficiently handle the assembly and transmission of a large CSV file::
el: Σε αυτό το παράδειγμα, χρησιμοποιούμε αμιγώς τους Python generators για να χειριστούμε αποδοτικά την συναρμολόγηση και εκπομπή ενός μεγάλου, σε μέγεθος, αρχείου CSV::
id: Dalam contoh ini, kami membuat penggunaan penuh dari pembangkit Python untuk secara efisien menangani rakitan dan perpindahan dari berkas CSV besar::

source: Using the template system
el: Χρησιμοποιώντας το σύστημα template του Django
id: Menggunakan sistem cetakan

source: Alternatively, you can use the :doc:`Django template system </topics/templates>` to generate CSV. This is lower-level than using the convenient Python :mod:`csv` module, but the solution is presented here for completeness.
el: Εναλλακτικά, μπορείτε να χρησιμοποιήσετε το :doc:`σύστημα template του Django </topics/templates>` για να δημιουργήσετε CSV αρχεία. Αυτή η μέθοδος είναι χαμηλού επιπέδου (low-level) εν συγκρίσει με τη χρήση του, βολικού, module :mod:`csv` της Python, αλλά παρουσιάζεται εδώ για λόγους πληρότητας.
id: Kalau tidak, anda dapat menggunakan :doc:`Django template system </topics/templates>` untuk membangkitkan CSV. Ini adalah tingkatan lebih rendah daripada menggunakan modul :mod:`csv` mudah Python, tetapi pemecahannya adalah membawakannya kesini untuk kelengkapan.

source: The idea here is to pass a list of items to your template, and have the template output the commas in a :ttag:`for` loop.
el: Η ιδέα εδώ είναι να περάσετε μια λίστα από items στο template σας και να βάλετε το template να εισάγει τα κόμματα μέσα σε ένα βρόγχο επανάληψης, :ttag:`for`.
id: Ide disini adalah melewatkan sebuah daftar dari barang-barang ke cetakan anda, dan mempunyai keluaran cetakan koma di :ttag:`for` untuk berulang.

source: Here's an example, which generates the same CSV file as above::
el: Εδώ φαίνεται ένα παράδειγμα, στο οποίο παράγεται το ίδιο αρχείο CSV όπως παραπάνω::
id: Ini adalah contoh, yang akan membangkitkan berkas CSV sama seperti diatas::

source: The only difference between this example and the previous example is that this one uses template loading instead of the CSV module. The rest of the code -- such as the ``content_type='text/csv'`` -- is the same.
el: Η μόνη διαφορά αυτού του παραδείγματος με το προηγούμενο είναι ότι αυτό χρησιμοποιεί το template loading αντί του CSV module. Ο υπόλοιπος κώδικας -- όπως το ``content_type='text/csv'`` -- παραμένει ο ίδιος.
id: Satu-satunya perbedaan diantara contoh ini dan contoh sebelumnya adalah bahwa satu ini menggunakan cetakan memuat daripada modul CSV. Sisa dari kode -- seperti ``content_type='text/csv'`` -- adalah sama.

source: Then, create the template ``my_template_name.txt``, with this template code:
el: Έπειτα, δημιουργήστε ένα template ``my_template_name.txt``, με τον template κώδικα, ως εξής:
id: Kemudian, buat cetakan ``my_template_name.txt``, dengan kode cetakan ini:

source: This template is quite basic. It just iterates over the given data and displays a line of CSV for each row. It uses the :tfilter:`addslashes` template filter to ensure there aren't any problems with quotes.
el: Αυτό το template είναι αρκετά απλό. Απλώς κάνει iterate πάνω στα δοσμένα δεδομένα (``data``) και εμφανίζει μια γραμμή CSV για κάθε γραμμή. Χρησιμοποιεί το φίλτρο :tfilter:`addslashes` για την επιβεβαίωση μη ύπαρξης προβλημάτων με τυχόν μονά ή διπλά εισαγωγικά.
id: Cetakan ini sangat dasar. Dia hanya berulang terhadap data yang diberikan dan menampilkan sebauh baris dari CSV untuk setiap baris. Dia menggunakan cetakan penyaring :tfilter:`addslashes` untuk memastikan tidak ada masalah dengan kutipan.

source: Other text-based formats
el: Άλλες μορφές τύπου κειμένου
id: Format berbasis teks lainnya

source: Notice that there isn't very much specific to CSV here -- just the specific output format. You can use either of these techniques to output any text-based format you can dream of. You can also use a similar technique to generate arbitrary binary data; see :doc:`/howto/outputting-pdf` for an example.
el: Όπως είδατε, δεν υπάρχει κάτι συγκεκριμένο με το CSV εδώ -- απλώς μια συγκεκριμένη μορφή εξόδου. Μπορείτε να χρησιμοποιήσετε τις ανωτέρω τεχνικές για να εξάγετε οποιαδήποτε μορφή τύπου κειμένου εσείς θέλετε. Μπορείτε, επίσης, να χρησιμοποιήσετε μια παρόμοια τεχνική για να παράγετε αυθαίρετα δυαδικά δεδομένα. Δείτε στο άρθρο :doc:`εξάγοντας αρχεία PDF με το Django </howto/outputting-pdf>` για ένα παράδειγμα.
id: Perhatikan bahwa tidak ada banyak spesifik pada CSV disini -- cukup bentuk keluaran spesifik. Anda dapat menggunakan salah satu dari teknik ini untuk mengeluarkan bentuk berdasarkan-teks apapun anda impikan. Anda dapat juga menggunakan teknik yang mirip untuk membangkitkan data biner berubah-ubah; lihat :doc:`/howto/outputting-pdf` untuk sebuah contoh.

source: Outputting PDFs with Django
el: Εξάγοντας αρχεία PDF με το Django
id: Mengeluarkan PDF dengan Django

source: This document explains how to output PDF files dynamically using Django views. This is made possible by the excellent, open-source ReportLab_ Python PDF library.
el: Αυτό το άρθρο εξηγεί πως να εξάγετε αρχεία PDF, δυναμικά, χρησιμοποιώντας τα Django views. Αυτό είναι εφικτό, με τη χρήση της εξαιρετικής, ανοιχτού λογισμικου PDF βιβλιοθήκης της Python, ReportLab_.
id: Dokumen ini menjelaskan bagaimana mengeluarkan berkas-berkas PDF secara dinamis menggunakan tampilan Django. Ini dibuat mungkin oleh istimewa, sumber terbuka pustaka PDF Python ReportLab_.

source: The advantage of generating PDF files dynamically is that you can create customized PDFs for different purposes -- say, for different users or different pieces of content.
el: Το πλεονέκτημα της παραγωγής δυναμικών αρχείων PDF είναι ότι μπορείτε να δημιουργείτε παραμετροποιήσιμα PDFs για διαφορετικούς σκοπούς -- πχ, για διαφορετικούς χρήστες ή διαφορετικά κομμάτια δεδομένων.
id: Keuntungan dari membangkitkan berkas-berkas PDF secara dinamis adalah bahwa anda dapat membuat penyesuaian PDF untuk tujuan berbeda -- katakan, untuk pengguna berbeda atau potongan berbeda dari isi.

source: For example, Django was used at kusports.com_ to generate customized, printer-friendly NCAA tournament brackets, as PDF files, for people participating in a March Madness contest.
el: Για παράδειγμα, το Django χρησιμοποιήθηκε στο kusports.com_ για να παράγει παραμετροποιήσιμα, φιλικά προς εκτύπωση αποτελέσματα αγώνων μπάσκετ (NCAA tournament brackets), ως αρχεία PDF, για αυτούς που συμμετέχουν στον διαγωνισμό March Madness.
id: Sebagai contoh, Django telah digunakan pada kusports.com_ untuk membangkitkan penyesuaian, kurung turnamen NCAA ramah-mencetak, sebagai berkas-berkas PDF, untuk orang yang ikut serta di perlombaan March Madness.

source: Install ReportLab
el: Εγκατάσταση της βιβλιοθήκης ReportLab
id: Pasang ReportLab

source: The ReportLab library is `available on PyPI`_. A `user guide`_ (not coincidentally, a PDF file) is also available for download. You can install ReportLab with ``pip``:
el: Η βιβλιοθήκη ReportLab είναι `διαθέσιμη στο PyPI <https://pypi.python.org/pypi/reportlab>`_. Ένας `οδηγός χρήστη <http://www.reportlab.com/docs/reportlab-userguide.pdf>`_ (όχι τυχαία, ένα PDF αρχείο) είναι επίσης διαθέσιμο για download. Μπορείτε να εγκαταστήσετε το ReportLab με το ``pip``:
id: Pustaka ReportLab adalah `available on PyPI`_. Sebuah `user guide`_ (tidak secara kebetulan, sebuah berkas PDF) juga tersedia untuk unduhan. Anda dapat memasang ReportLab dengan ``pip``:

source: Test your installation by importing it in the Python interactive interpreter::
el: Ελέγξτε την εγκατάσταση της βιβλιοθήκης κάνοντας την import στο Python interactive shell σας (αν την έχετε εγκαταστήσει globally, τότε σε κονσόλα γράψτε πρώτα ``python`` ή ``python3.x`` όπου ``x`` η έκδοση Python που χρησιμοποιείτε)::
id: Ujikan pemasangan anda dengan mengimpornya dalam penterjemah interaktif Python::

source: If that command doesn't raise any errors, the installation worked.
el: Αν αυτό δεν σας εμφανίσει κάποιο σφάλμα, η βιβλιοθήκη έχει εγκατασταθεί επιτυχώς.
id: Jika perintah itu tidak menimbulkan kesalahan apapun, pemasangan bekerja.

source: Write your view
el: Γράψτε το view
id: Tulis tampilan anda
