Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Make sure you know what you are doing if you decide to change the value of this option in your custom command if it creates database content that is locale-sensitive and such content shouldn't contain any translations (like it happens e.g. with django.contrib.auth permissions) as making the locale differ from the de facto default 'en-us' might cause unintended effects. Seethe `Management commands and locales`_ section above for further details.
el: Σιγουρευτείτε ότι γνωρίζετε τι κάνετε αν αποφασίσετε να αλλάξετε την τιμή αυτού του attribute μέσα στην εντολή σας. Για παράδειγμα, ας υποθέσουμε ότι δημιουργείτε κάποιο περιεχόμενο (κάποια δεδομένα, αν θέλετε) το οποίο προορίζεται για τη βάση δεδομένων και επηρεάζεται από το locale. Αυτό το περιεχόμενο όμως δεν πρέπει να έχει μεταφράσεις (όπως συμβαίνει με τα perimissions του πχ django.contrib.auth). Αν αλλάξετε το locale σε κάτι διαφορετικό από το προεπιλεγμένο (‘en-us’), τότε ίσως να προκληθούν ακούσιες συνέπειες. Δείτε στην ενότητα `Εντολές διαχείρισης και locales`_ παραπάνω για περισσότερες λεπτομέρειες.
id: Pastikan anda mengetahui apa yang anda sedang mengerjakan jika anda memutuskan nilai dari pilihan ini dalam penyesuaian perintah anda jika dia dibuat basisdata yang bersifat sensitif-lokal dan isi seperti itu tidak harus mengandung terjemahan apapun (seperti itu terjadi sebagai contoh dengan django.contrib.auth permissions) ketika membuat perbedaan lokal dari standar sebenarnya 'en-us' mungkin menyebabkan efek yang tidak diinginkan. Lihat bagian `Management commands and locales`_ diatas untuk lebih lanjut.

source: This option can't be ``False`` when the :data:`~BaseCommand.can_import_settings` option is set to ``False`` too because attempting to set the locale needs access to settings. This condition will generate a :exc:`CommandError`.
el: Αυτή η επιλογή δεν μπορεί να είναι ``False`` όταν η επιλογή :data:`~BaseCommand.can_import_settings` είναι, επίσης, ``False`` επειδή η απόπειρα να οριστεί το locale χρειάζεται πρόσβαση στα settings. Σε αυτή την περίπτωση θα γίνει raise ένα :exc:`CommandError`.
id: Pilihan ini tidak dapat ``False`` ketika pilihan :data:`~BaseCommand.can_import_settings` disetel menjadi ``False`` juga karena mencoba menyetel lokal butuh akses ke pengaturan. Kondisi ini akan membangkitkan sebuah :exc:`CommandError`.

source: An instance attribute that helps create colored output when writing to ``stdout`` or ``stderr``. For example::
el: Ένα attribute που βοηθά στο να χρωματίσει την έξοδο (δηλαδή το κείμενο) όταν γράφετε στο ``self.stdout`` ή στο ``self.stderr``. Για παράδειγμα::
id: Sebuah atribut instance yang membantu membuat keluaran bewarna ketika menulis ke ``stdout`` atau ``stderr``. Sebagai contoh::

source: See :ref:`syntax-coloring` to learn how to modify the color palette and to see the available styles (use uppercased versions of the "roles" described in that section).
el: Δείτε στο :ref:`χρωματίζοντας την έξοδο <syntax-coloring>` για να μάθετε πως να τροποποιείτε την παλέτα των χρωμάτων και να δείτε τα διαθέσιμα στυλ (χρήση της έκδοσης των κεφαλαίων γραμμάτων των "ρόλων" όπως περιγράφονται σε αυτή την ενότητα).
id: Lihat :ref:`syntax-coloring` untuk mempelajari bagaimana merubah papan warna dan melihat gaya tersedia (gunakan versi huruf besar dari "roles" yang digambarkan dalam bagian itu).

source: If you pass the :option:`--no-color` option when running your command, all ``self.style()`` calls will return the original string uncolored.
el: Αν δηλώσετε την επιλογή :option:`--no-color` όταν τρέχετε την εντολή σας, όλες οι κλήσεις της ``self.style()`` θα επιστρέψουν το αρχικό string χωρίς κάποιο χρώμα.
id: Jika anda melewati pilihan :option:`--no-color` ketika menjalankan perintah anda, semua pemanggilan ``self.style()`` akan mengembalikan deretan karakter asli tidak bewarna.

source: Methods
el: Μέθοδοι
id: Cara

source: :class:`BaseCommand` has a few methods that can be overridden but only the :meth:`~BaseCommand.handle` method must be implemented.
el: Η κλάση :class:`BaseCommand` έχει μερικές μεθόδους οι οποίες μπορούν να παρακαμφθούν (overridden) αλλά μόνο η μέθοδος :meth:`~BaseCommand.handle` πρέπει να υλοποιηθεί υποχρεωτικά.
id: :class:`BaseCommand` mempunyai beberapa cara yang dapat dikesampingkan tetapi hanya cara :meth:`~BaseCommand.handle` harus diterapkan.

source: Implementing a constructor in a subclass
el: Υλοποίηση ενός constructor μέσα σε μια subclass
id: Menerapkan constructor dalam subkelas

source: If you implement ``__init__`` in your subclass of :class:`BaseCommand`, you must call :class:`BaseCommand`’s ``__init__``::
el: Αν υλοποιήσετε την ``__init__`` μέσα σε μια subclass της :class:`BaseCommand` θα πρέπει πρώτα να καλέσετε την ``__init__`` της κλάσης :class:`BaseCommand`, όπως φαίνεται παρακάτω::
id: Jika anda menerapkan ``__init__`` dalam subkelas anda dari :class:`BaseCommand`, anda harus memanggil ``__init__`` dari :class:`BaseCommand::

source: Entry point to add parser arguments to handle command line arguments passed to the command. Custom commands should override this method to add both positional and optional arguments accepted by the command. Calling ``super()`` is not needed when directly subclassing ``BaseCommand``.
el: Σημείο εισόδου για να προσθέσετε arguments στο μεταφραστή (parser) για τον χειρισμό των arguments που εισάγονται στη γραμμή εντολών (όπως το argument ``--delete`` που αναφέραμε παραπάνω). Τυχόν δικές σας διαχειριστικές εντολές θα πρέπει να παρακάμπτουν αυτή τη μέθοδο για να προσθέσουν positional και optional arguments που θα δέχεται η εντολή. Η κλήση της ``super()`` δεν είναι απαραίτητη όταν κάνετε απ’ ευθείας subclass την κλάση ``BaseCommand``.
id: Titik masukan untuk menambahkan pengurai argumen untuk menangani argumen baris perintah dilewati ke perintah. Penyesuaian perintah harus mengesampingkan cara ini untuk menambah kedua argumen penempatan dan pilihan yang diterima oleh perintah. Memanggil ``super()`` tidak dibutuhkan ketika pengsubkelasan secara langsung ``BaseCommand``.

source: Returns the Django version, which should be correct for all built-in Django commands. User-supplied commands can override this method to return their own version.
el: Επιστρέφει την έκδοση του Django, η οποία θα πρέπει να είναι η σωστή για όλες τις προεγκατεστημένες εντολές του Django. Τυχόν δικές σας διαχειριστικές εντολές μπορούν να παρακάμψουν αυτή τη μέθοδο για να επιστρέφουν τη δική τους έκδοση.
id: Mengembalikan versi Django, yang seharusnya benar untuk semua perintah Django siap pakai. Perintah pasokan-pengguna dapat mengesampingkan cara ini untuk mengembalikan versi mereka sendiri.

source: Tries to execute this command, performing system checks if needed (as controlled by the :attr:`requires_system_checks` attribute). If the command raises a :exc:`CommandError`, it's intercepted and printed to stderr.
el: Προσπαθεί να εκτελέσει την εντολή που γράψατε, πραγματοποιεί τυχόν τεστ που αφορά το σύστημα (ανάλογα την τιμή του attribute :attr:`requires_system_checks`). Αν η εντολή κάνει raise το exception :exc:`CommandError`, τότε θα εμφανιστεί ανάλογο σφάλμα στο ``stderr``.
id: Coba untuk menjalankan perintah ini, melakukan pemeriksaan sistem jika dibutuhkan (sebagai pengendalian oleh :attr:`requires_system_checks` attribute). Jika perintah muncul sebuah :exc:`CommandError`, Dia dicegat dan dicetak ke stderr.

source: Calling a management command in your code
el: Καλώντας μια εντολή διαχείρισης μέσα από τον κώδικα σας
id: Memanggil perintah pengelolaan di kode anda

source: ``execute()`` should not be called directly from your code to execute a command. Use :func:`~django.core.management.call_command` instead.
el: Η μέθοδος ``execute()`` δεν θα πρέπει να καλείται απ' ευθείας από τον κώδικα σας για την εκτέλεση μιας εντολής. Αντί αυτής, χρησιμοποιήστε τη συνάρτηση :func:`~django.core.management.call_command`.
id: ``execute()`` jangan dipanggil secara langsung dari kode anda untuk menjalankan sebuah perintah. Lebih baik gunakan :func:`~django.core.management.call_command`.

source: The actual logic of the command. Subclasses must implement this method.
el: Η πραγματική λογική της εντολής. Όλες οι subclasses πρέπει να υλοποιήσουν αυτή τη μέθοδο.
id: Logika sebenarnya dari perintah. Subkelas harus menerapkan cara ini.

source: It may return a Unicode string which will be printed to ``stdout`` (wrapped by ``BEGIN;`` and ``COMMIT;`` if :attr:`output_transaction` is ``True``).
el: Μπορεί να επιστρέψει ένα Unicode string το οποίο θα εκτυπωθεί στο ``stdout`` (συμπεριλαμβανόμενο μέσα στα ``BEGIN;`` και ``COMMIT;``, αν το attribute :attr:`output_transaction` είναι ``True``).
id: Dia mungkin mengembalikan sebuah deretan karakter Unicode yang akan dicetak ke ``stdout`` (dibungkus oleh ``BEGIN;`` dan ``COMMIT;`` jika :attr:`output_transaction` adalah ``True``).

source: Uses the system check framework to inspect the entire Django project for potential problems. Serious problems are raised as a :exc:`CommandError`; warnings are output to stderr; minor notifications are output to stdout.
el: Χρησιμοποιεί το σύστημα ελέγχου του framework για να επιθεωρήσει ολόκληρο το Django project για τυχόν προβλήματα. Τα σοβαρά προβλήματα γίνονται raised ως :exc:`CommandError`. Τα warnings εκτυπώνονται στο ``stderr``. Τυχόν δευτερεύουσες ειδοποιήσεις εκτυπώνονται στο ``stdout``.
id: Gunakan kerangka pemeriksaan sistem untuk memeriksa keseluruhan proyek Django untuk masalah potensial. Masalah serius muncul seperti sebuah :exc:`CommandError`; peringatan dikeluarkan ke stderr; pemberitahuan kecil dikeluarkan pada stdout.

source: If ``app_configs`` and ``tags`` are both ``None``, all system checks are performed. ``tags`` can be a list of check tags, like ``compatibility`` or ``models``.
el: Αν τα ορίσματα ``app_configs`` και ``tags`` είναι και τα δύο τύπου ``None``, τότε θα γίνουν όλα τα συστήματα ελέγχου. Το όρισμα ``tags`` μπορεί να είναι μια λίστα από check tags, όπως ``compatibility`` ή ``models``.
id: Jika ``app_configs`` dan ``tags`` keduanya ``None``, semua pemeriksaan sistem dilakukan. ``tags`` dapat menjadi daftar dari etiket pemeriksaan, seperti ``compatibility`` atau ``models``.

source: ``BaseCommand`` subclasses
id: Subkelas ``BaseCommand``

source: A management command which takes one or more installed application labels as arguments, and does something with each of them.
el: Μια εντολή διαχείρισης η οποία δέχεται ως arguments (όπως το ``<poll_id>`` στην εντολή που γράψαμε παραπάνω ``python manage.py closepoll <poll_id>``) ένα ή περισσότερα labels εφαρμογών και κάνει κάτι με καθένα από αυτά.
id: Sebuah pengelolaan perintah yang mengambil satu atau lebih label aplikasi terpasang sebagai argumen, dan melakukan sesuatu dengan masing-masing dari mereka.

source: Rather than implementing :meth:`~BaseCommand.handle`, subclasses must implement :meth:`~AppCommand.handle_app_config`, which will be called once for each application.
el: Αντί της υλοποίησης της μεθόδου :meth:`~BaseCommand.handle`, οι subclasses πρέπει να υλοποιούν τη μέθοδο :meth:`~AppCommand.handle_app_config` η οποία θα καλείται μια φορά για κάθε εφαρμογή.
id: Daripada menerapkan :meth:`~BaseCommand.handle`, subkelas harus menerapkan :meth:`~AppCommand.handle_app_config`, yang akan dipanggil sekali untuk setiap aplikasi.

source: Perform the command's actions for ``app_config``, which will be an :class:`~django.apps.AppConfig` instance corresponding to an application label given on the command line.
el: Εκτελεί τις ενέργειες της εντολής για το ``app_config`` το οποίο θα είναι ένα instance της κλάσης :class:`~django.apps.AppConfig` που αντιστοιχεί στο label της εφαρμογής που δόθηκε στη γραμμή εντολών.
id: Melakukan tindakan perintah untuk ``app_config``, yang akan menjadi sebuah instance :class:`~django.apps.AppConfig` terhubung ke sebuah label aplikasi yang diberikan pada baris perintah.

source: A management command which takes one or more arbitrary arguments (labels) on the command line, and does something with each of them.
el: Μια εντολή διαχείρισης η οποία δέχεται ένα η περισσότερα arguments (labels) μέσω της γραμμής εντολών και κάνει κάτι με καθένα από αυτά.
id: Sebuah pengelolaan perintah yang mengambil satu atau lebih argumen (label) yang berubah-ubah pada baris perintah, dan melakukan sesuatu dengan masing-masing dari mereka.

source: Rather than implementing :meth:`~BaseCommand.handle`, subclasses must implement :meth:`~LabelCommand.handle_label`, which will be called once for each label.
el: Αντί της υλοποίησης της μεθόδου :meth:`~BaseCommand.handle`, οι subclasses πρέπει να υλοποιούν τη μέθοδο :meth:`~LabelCommand.handle_label`, η οποία θα καλείται μια φορά για κάθε label.
id: Daripada menerapkan :meth:`~BaseCommand.handle`, subkelas harus menerapkan :meth:`~LabelCommand.handle_label`, yang akan dipanggil sekali untuk setiap label.

source: Perform the command's actions for ``label``, which will be the string as given on the command line.
el: Εκτελεί τις ενέργειες της εντολής για το ``label``, το οποίο θα είναι ένα string όπως δόθηκε στη γραμμή εντολών.
id: Melakukan tindakan perintah untuk ``label``, yang akan menjadi deretan karakter seperti yang diberikan pada baris perintah.

source: Use :class:`BaseCommand` instead, which takes no arguments by default.
id: Gunakan :class:`BaseCommand`, yang tidak mengambil argumen secara awal.

source: A command which takes no arguments on the command line.
id: Sebuah perintah yang tidak mengambil argumen dalam baris perintah.

source: Rather than implementing :meth:`~BaseCommand.handle`, subclasses must implement :meth:`~NoArgsCommand.handle_noargs`; :meth:`~BaseCommand.handle` itself is overridden to ensure no arguments are passed to the command.
id: Daripada menerapkan :meth:`~BaseCommand.handle`, subkelas harus menerapkan :meth:`~NoArgsCommand.handle_noargs`; :meth:`~BaseCommand.handle` itu sendiri dikesampingkan untuk memastikan tidak ada argumen dilewatkan ke perintah.

source: Perform this command's actions
id: Melakukan tindakan perintah ini

source: Command exceptions
el: Exceptions εντολής
id: Perintah pengecualian

source: Exception class indicating a problem while executing a management command.
el: Μια κλάση Exception που υποδεικνύει ότι προέκυψε κάποιο πρόβλημα κατά τη διάρκεια εκτέλεσης της εντολής διαχείρισης.
id: Kelas pengecualian mengindikasikan sebuah masalah selama menjalankan perintah pengelolaan.

source: If this exception is raised during the execution of a management command from a command line console, it will be caught and turned into a nicely-printed error message to the appropriate output stream (i.e., stderr); as a result, raising this exception (with a sensible description of the error) is the preferred way to indicate that something has gone wrong in the execution of a command.
el: Αν αυτό το exception γίνει raised κατά τη διάρκεια της εκτέλεσης, μέσω της κονσόλας, μιας διαχειριστικής εντολής, θα “πιαστεί” (caught) και θα μετατραπεί σε ένα όμορφα εκτυπώσιμο μήνυμα σφάλματος το οποίο θα προωθηθεί στην ανάλογη έξοδο προβολής (πχ stderr, stdout κλπ). Επομένως, ο καλύτερος τρόπος για να υποδείξετε ότι κάτι πήγε στραβά κατά τη διάρκεια της εκτέλεσης της εντολής σας, είναι κάνοντας raise αυτό το exception (με μια λογική περιγραφή του σφάλματος που προέκυψε, φυσικά).
id: Jika pengecualian ini muncul selama peerjalanan dari pengelolaan perintah dari sebuah perintah baris tempat tuts, dia akan ditangkap dan dirubah menjadi pesan kesalahan tercetak yang bagus ke aliran keluaran yang sesuai (yaitu, stderr); sebagai sebuah hasil, memunculkan pengecualian ini (dengan sebuah gambaran yang mudah dimengerti dari kesalahan) adalah jalan yang dipilih untuk menunjukkan bahwa sesuatu telah salah dalam menjalankan sebuah perintah.

source: If a management command is called from code through :func:`~django.core.management.call_command`, it's up to you to catch the exception when needed.
el: Αν η εντολή διαχείρισης καλείται μέσα από τον κώδικα σας μέσω της συνάρτησης :func:`~django.core.management.call_command`, τότε είναι δικό σας θέμα να κάνετε catch, όποτε το κρίνετε απαραίτητο, αυτό το exception.
id: Jika sebuah pengelolaan perintah dipanggil dari kode melalui :func:`~django.core.management.call_command`, itu terserah kamu untuk menangkap pengecualian ketika dibutuhkan.

source: Writing custom model fields
el: Γράφοντας δικά σας πεδία μοντέλων
id: Menulis bidang model penyesuaian

source: Introduction
el: Εισαγωγή
id: Kata Pengantar

source: The :doc:`model reference </topics/db/models>` documentation explains how to use Django's standard field classes -- :class:`~django.db.models.CharField`, :class:`~django.db.models.DateField`, etc. For many purposes, those classes are all you'll need. Sometimes, though, the Django version won't meet your precise requirements, or you'll want to use a field that is entirely different from those shipped with Django.
el: Το άρθρο :doc:`μοντέλα </topics/db/models>` εξηγεί πως να χρησιμοποιήσετε τις στάνταρντ κλάσεις πεδίων του Django -- :class:`~django.db.models.CharField`, :class:`~django.db.models.DateField` κλπ. Στις περισσότερες περιπτώσεις αυτές οι κλάσεις θα σας είναι αρκετές. Ωστόσο, η έκδοση του Django που χρησιμοποιείτε ίσως να μην καλύπτει τις ανάγκες και τις απαιτήσεις σας ή θα θέλατε να χρησιμοποιήσετε ένα πεδίο μοντέλου το οποίο είναι εντελώς διαφορετικό από αυτά που έρχονται με το Django.
id: Dokumentasi :doc:`model acuan</topics/db/models>` menjelaskan bagaimana menggunakan kelas-kelas bidang standar Django -- :class:`~django.db.models.CharField`, :class:`~django.db.models.DateField`, dll. Untuk banyak tujuan, kelas-kelas tersebut adalah yang anda akan butuhkan. Terkadang, meskipun, versi DJango tidak akan bertemu persyaratan tepat anda, atau anda akan menggunakan sebuah bidang yang seluruhnya berbeda dari yang dikemas dengan Django.

source: Django's built-in field types don't cover every possible database column type -- only the common types, such as ``VARCHAR`` and ``INTEGER``. For more obscure column types, such as geographic polygons or even user-created types such as `PostgreSQL custom types`_, you can define your own Django ``Field`` subclasses.
el: Οι τύποι των προεγκατεστημένων πεδίων του Django δεν καλύπτουν όλους τους πιθανούς τύπους στηλών μιας βάσης δεδομένων (υπόψιν ότι μερικές βάσεις έχουν αποκλειστικά δικούς τους τύπους στηλών που δεν βρίσκονται σε κάποια άλλη βάση) -- μόνο τους βασικούς τύπους, όπως ``VARCHAR`` και ``INTEGER``. Για περισσότερους τύπους στηλών, όπως γεωγραφικά πολύγονα ή ακόμη και τύπους που μπορεί να δημιουργήσει ο χρήστης όπως οι `PostgreSQL custom types`_, μπορείτε να ορίσετε τις δικές σας Django ``Field`` subclasses.
id: Jenis bidang siap pakai Django tidak mencangkup setiap jenis kolom basisdata yang mungkin -- hanya jenis umum, seperti ``VARCHAR`` dan ``INTEGER``. Untuk lebih mengaburkan jenis kolom, seperti poligon geografis atau bahkan jenis dibuat-pengguna seperti `PostgreSQL custom types`_, anda dapat menentukan subkelas-subkelas ``Field`` Django and sendiri.

source: Alternatively, you may have a complex Python object that can somehow be serialized to fit into a standard database column type. This is another case where a ``Field`` subclass will help you use your object with your models.
el: Εναλλακτικά, μπορείτε να έχετε ένα πολύπλοκο Python object το οποίο να μπορεί κάπως να γίνει serialized για να μπορέσει να αναπαρασταθεί ως στάνταρντ στήλη στη βάση δεδομένων. Αυτή είναι μια άλλη περίπτωση όπου μια subclass της ``Field`` θα σας βοηθήσει να χρησιμοποιήσετε το object σας με τα μοντέλα σας.
id: Jalan lain, anda mungkin mempunyai obyek Python rumit yang dapat entah bagaimana disambungkan untuk cocok kedalam jenis kolom basisdata standar. Ini adalah kasus lain dimana sebuah subkelas ``Field`` akan membantu anda menggunakan obyek anda dengan model anda.

source: Our example object
el: Το object του παραδείγματος μας
id: Obyek contoh kami

source: Creating custom fields requires a bit of attention to detail. To make things easier to follow, we'll use a consistent example throughout this document: wrapping a Python object representing the deal of cards in a hand of Bridge_. Don't worry, you don't have to know how to play Bridge to follow this example. You only need to know that 52 cards are dealt out equally to four players, who are traditionally called *north*, *east*, *south* and *west*. Our class looks something like this::
el: Η δημιουργία δικών μας παραμετροποιήσιμων πεδίων απαιτεί προσοχή στη λεπτομέρεια. Για να κάνουμε τα πράγματα πιο εύκολα, θα χρησιμοποιήσουμε το ίδιο παράδειγμα σε όλο αυτό το άρθρο: θα δημιουργήσουμε ένα Python object που θα αναπαριστά το μοίρασμα των χαρτιών σε μια παρτίδα Bridge_. Μην ανησυχείτε, όμως, δεν χρειάζεται να γνωρίζετε πως παίζεται το Bridge για να καταλάβετε αυτό το παράδειγμα. Το μόνο που χρειάζεται να ξέρετε είναι ότι απαιτούνται 52 χαρτιά να μοιραστούν ισομερώς σε τέσσερις παίκτες, οι οποίοι ονομάζονται, παραδοσιακά, *north*, *east*, *south* και *west*. Η κλάση μας θα μοιάζει κάπως έτσι::
id: Membuat penyesuaian bidang membuatuhkan sedikit perhatian ke rincian. Untuk membuat hal-hal lebih mudah utnuk diikuti, kami akan menggunakan contoh tetap melalui dokumen ini: membungkus sebuah obyek Python mewakili persetujuan dari kartu-kartu dalam sebuah tangan dari Bridge_. Jangan khawatir, anda tidak perlu mengetahui bagaimana bermain Bridge untuk mengikuti contoh ini. Anda hanya perlu mengetahui bahwa 52 kartu dibagikan sama ke empat pemain, yang secara tradisional dipanggil *utara*, *timur*, *selatan* dan *barat*. Kelas kami kelihatan seperti ini::

source: This is just an ordinary Python class, with nothing Django-specific about it. We'd like to be able to do things like this in our models (we assume the ``hand`` attribute on the model is an instance of ``Hand``)::
el: Η κλάση που γράψαμε δεν είναι τίποτε άλλο παρά μια συνηθισμένη κλάση Python, χωρίς να την συνδέει κάτι με το Django. Θα θέλαμε να κάνουμε πράγματα, όπως αυτό, στα Django μοντέλα μας (υποθέτουμε ότι το attribute ``hand`` του μοντέλου είναι ένα instance της κλάσης ``Hand``)::
id: Ini hanyalah kelas Python asli, dengan tidak ada spesifik-Django tentangnya. Kami akan dapat melakukan hal-hal seperti ini dalam model kami (kami menganggap atribut ``hand`` pada model adalah sebuah instance dari ``Hand``)::

source: We assign to and retrieve from the ``hand`` attribute in our model just like any other Python class. The trick is to tell Django how to handle saving and loading such an object.
el: Εκχωρούμε στο και ανακτούμε από το attribute ``hand`` του μοντέλου μας όπως ακριβώς θα κάναμε με κάθε άλλη κλάση της Python. Το κόλπο είναι να πούμε στο Django πως να διαχειριστεί την αποθήκευση στην και τη φόρτωση από τη βάση δεδομένων αυτού του object.
id: Kami memberikan dan mengambil dari atribut ``hand`` dalam model kami seperti kelas Python lainnya. Tipuannya adalah mengatakan Django bagaimana menangani penyimpanan dan memuat sebuah obyek seperti itu.

source: In order to use the ``Hand`` class in our models, we **do not** have to change this class at all. This is ideal, because it means you can easily write model support for existing classes where you cannot change the source code.
el: Για να χρησιμοποιήσουμε την κλάση ``Hand`` στα μοντέλα μας, **δεν χρειάζεται** να αλλάξουμε αυτή την κλάση καθόλου. Αυτό είναι ιδανικό, καθώς σημαίνει ότι μπορείτε να γράψετε Django μοντέλα για ήδη υπάρχουσες κλάσεις χωρίς να χρειαστεί να πειράξετε τον πηγαίο κώδικα.
id: Agar menggunakan kelas ``Hand`` di model kami, kami **tidak** harus merubah kelas ini sama sekali. Ini adalah cocok, karena dia berarti anda dapat dengan mudah menulis model mendukung kelas-kelas yang ada dimana anda tidak dapat merubah sumber kode.
