Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: You might only be wanting to take advantage of custom database column types and deal with the data as standard Python types in your models; strings, or floats, for example. This case is similar to our ``Hand`` example and we'll note any differences as we go along.
el: Ίσως να θέλετε, μόνο, να επωφεληθείτε από τους δικούς σας τύπους στηλών στη βάση δεδομένων και να διαχειριστείτε τα δεδομένα σας ως στάνταρντ τύπους Python objects στα μοντέλα σας, πχ strings, floats κλπ. Αυτή η περίπτωση είναι παρόμοια με το παράδειγμα μας, ``Hand``, όπου θα υποδεικνύουμε τυχόν διαφορές καθώς προχωράμε.
id: Anda mungkin hanya menginginkan untuk mengambil keuntungan dari penyesuaian jenis kolom basisdata dan berhubungan dengan data sebagai jenis Python standar dalam model anda; string, atau float, sebagai contoh. Kasus ini mirip pada contoh ``hand`` kami dan kami akan mencatat perbedaan ketika kita pergi bersama.

source: Background theory
el: Βασική θεωρία
id: Latar belakang teori

source: Database storage
el: Αποθηκευτικός χώρος στη βάση δεδομένων
id: Penyimpanan basisdata

source: The simplest way to think of a model field is that it provides a way to take a normal Python object -- string, boolean, ``datetime``, or something more complex like ``Hand`` -- and convert it to and from a format that is useful when dealing with the database (and serialization, but, as we'll see later, that falls out fairly naturally once you have the database side under control).
el: Ο πιο απλός τρόπος για να σκεφτείτε έναν τύπο μοντέλου (model field) είναι ότι προσφέρει έναν τρόπο ενός συνηθισμένου Python object -- string, boolean, ``datetime``, ή κάτι πιο περίπλοκο όπως το ``Hand`` -- να μετατραπεί σε και από μια μορφή η οποία είναι χρήσιμη όταν επικοινωνούμε με τη βάση δεδομένων (και με το serialization, αλλά, όπως θα δούμε αργότερα, αυτό δεν θα σας απασχολήσει όταν έχετε τακτοποιήσει τη βάση).
id: Jalan paling sederhana memikirkan sebuah bidang model adalah dia menyediakan sebuah jalan untuk mengambil sebuah obyek Pyton biasa -- string, boolean, ``datetime``, atau sesuatu lebih rumit seperti ``Hand`` -- dan merubahnya ke dan dari sebuah bentuk yang berguna ketika berhubungan dengan basisdata (dan penyambungan, tetapi, seperti yang akan kita lihat nanti, yang jatuh keluar secara alami sekali anda mempunyai sisi basisdata dibawah kendali).

source: Fields in a model must somehow be converted to fit into an existing database column type. Different databases provide different sets of valid column types, but the rule is still the same: those are the only types you have to work with. Anything you want to store in the database must fit into one of those types.
el: Τα πεδία σε ένα μοντέλο πρέπει με κάποιο τρόπο να μετατραπούν ούτως ώστε να μπορέσει να τα δεχτεί ο αντίστοιχος τύπος στήλης της βάσης δεδομένων. Διαφορετικές βάσεις δεδομένων προσφέρουν διαφορετικά σετ από έγκυρους τύπους στηλών, αλλά ο κανόνας είναι ο ίδιος: αυτοί είναι οι μοναδικοί τύποι με τους οποίους θα μπορείτε να δουλεύετε. Οτιδήποτε θέλετε να αποθηκεύσετε στη βάση δεδομένων, πρέπει να προσαρμοστεί σε έναν από αυτούς τους τύπους.
id: Bidang dalam sebuah model harus bagaimanapun dipindahkan untuk cocok kedalam jenis kolom basisdata yang ada. Basisdata yang berbeda menyediakan kumpulan berbeda dari jenis kolom sah, tetapi aturan masih sama: yaitu hanya jenis anda harus bekerja dengannya. Apapun anda ingin simpan dalam basisdata harus cocok kedalam satu dari jenis itu.

source: Normally, you're either writing a Django field to match a particular database column type, or there's a fairly straightforward way to convert your data to, say, a string.
el: Συνήθως, είτε θα γράφετε ένα πεδίο Django για να ταιριάζει με έναν συγκεκριμένο τύπο στήλης της βάσης είτε θα μετατρέπετε σε μορφή string, με κάποιον τρόπο, τα δεδομένα προς αποθήκευση στη βάση.
id: Biasanya, anda antara menulis sebuah bidang Django untuk mencocokkan jenis kolom basisdata tertentu, atau ada jalan cukup mudah untuk merubah data anda menjadi, katakan, sebuah deretan karakter.

source: For our ``Hand`` example, we could convert the card data to a string of 104 characters by concatenating all the cards together in a pre-determined order -- say, all the *north* cards first, then the *east*, *south* and *west* cards. So ``Hand`` objects can be saved to text or character columns in the database.
el: Για το δικό μας παράδειγμα ``Hand``, θα μπορούσαμε να μετατρέψουμε τα δεδομένα των χαρτιών της τράπουλας σε ένα string 104 χαρακτήρων ενώνοντας (concatenating) όλα τα χαρτιά μεταξύ τους σε μια προκαθορισμένη σειρά -- πχ, όλα τα *north* χαρτιά πρώτα, μετά τα *east*, μετά τα *south* και τέλος τα *west*. Επομένως, τα objects τύπου ``Hand`` θα μπορούσαν να αποθηκευτούν ως στήλη κειμένου (text) ή ως στήλη χαρακτήρων (character) στη βάση δεδομένων. Για άλλη μια φορά, επειδή η βάση δεν καταλαβαίνει την γλώσσα Python, θα πρέπει να μετατρέψουμε τα δεδομένα μας σε κάποια μορφή που η βάση καταλαβαίνει. Αντίστροφα, όταν αντλούμε δεδομένα από τη βάση, θα πρέπει να τα μετατρέψουμε σε Python objects για να τα διαχειριστούμε, ανάλογα τις ανάγκες μας.
id: Untuk contoh ``Hand`` kami, kami dapat merubah kartu data menjadi deretan karakter dari 104 karakter dengan menambah semua kartu bersama-sama dalam yang telah ditetapkan sebelumnya -- katakan, semua kartu *utara* dahulu, kemudian kartu *timur*, *selatan* dan *barat*. Hadi obyek ``Hand`` dapt disimpan ke kolom teks atau karakter dalam basisdata.

source: What does a field class do?
el: Τι κάνει μια κλάση τύπου Field;
id: Apakah yang kelas bidang lakukan?

source: All of Django's fields (and when we say *fields* in this document, we always mean model fields and not :doc:`form fields </ref/forms/fields>`) are subclasses of :class:`django.db.models.Field`. Most of the information that Django records about a field is common to all fields -- name, help text, uniqueness and so forth. Storing all that information is handled by ``Field``. We'll get into the precise details of what ``Field`` can do later on; for now, suffice it to say that everything descends from ``Field`` and then customizes key pieces of the class behavior.
el: Όλα τα πεδία του Django (και όταν λέμε *πεδία* σε αυτό το άρθρο, εννοούμε πάντα πεδία μοντέλων και όχι :doc:`πεδία φορμών </ref/forms/fields>`) είναι subclasses της κλάσης :class:`django.db.models.Field`. Οι περισσότερες πληροφορίες που καταγράφει το Django σχετικά με ένα πεδίο είναι κοινές για όλα τα πεδία -- όνομα, βοηθητικό κείμενο, μοναδικότητα κοκ. Η αποθήκευση όλων αυτών των πληροφοριών γίνεται από την κλάση ``Field``. Θα πούμε με λεπτομέρειες τι μπορεί να κάνει η ``Field`` σε λίγο. Για τώρα, αρκεί να πούμε ότι όλα τα πεδία κληρονομούν από την κλάση ``Field`` και παραμετροποιούν διάφορα βασικά κομμάτια της συμπεριφοράς της.
id: Semua bidang Django (dan ketika kami katakan *bidang* dalam dokumen ini, kami selalu berarti bidang model dan bukan :doc:`bidang formulir </ref/forms/fields>`) adalah subkelas dari :class:`django.db.models.Field`. Kebanyakan informasi yang Django rekam mengenai sebuah bidang adalah umum bagi semua teman -- nama, bantuan, teks, keunikan dan sebagainya. Menyimpan semua informasi itu yang ditangani oleh ``Field``. Kami akan memasuki rincian tepat dari ``Field`` apa yang dapat dilakukan kemudian; untuk sekarang, cukuplah untuk mengatakan bahwa segala sesuatu turun dari ``Field`` dan kemudian menyesuaian potongan kunci dari kebiasaan kelas.

source: It's important to realize that a Django field class is not what is stored in your model attributes. The model attributes contain normal Python objects. The field classes you define in a model are actually stored in the ``Meta`` class when the model class is created (the precise details of how this is done are unimportant here). This is because the field classes aren't necessary when you're just creating and modifying attributes. Instead, they provide the machinery for converting between the attribute value and what is stored in the database or sent to the :doc:`serializer </topics/serialization>`.
el: Είναι σημαντικό να συνειδητοποιήσετε ότι η κλάση ενός πεδίου του Django (πχ ``CharField``, ``BooleanField`` κλπ) δεν αποθηκεύεται στα attributes των μοντέλων σας. Τα attributes του μοντέλου περιέχουν συνηθισμένα Python objects. Η κλάσεις των πεδίων που ορίζετε σε ένα μοντέλο αποθηκεύονται στην ουσία σε μια ``Meta`` κλάση όταν δημιουργείται το μοντέλο (οι ακριβείς λεπτομέρειες του πως γίνεται αυτό, δεν έχουν σημασία τώρα). Αυτό γίνεται επειδή οι κλάσεις των πεδίων δεν είναι απαραίτητες όταν απλώς δημιουργείτε και αλλάζετε τα attributes. Αντ’ αυτού οι κλάσεις προσφέρουν τον μηχανισμό για την μετατροπή μεταξύ του attribute και αυτού που είναι αποθηκευμένο στη βάση δεδομένων ή για την αποστολή στον :doc:`serializer </topics/serialization>`.
id: Adalah penting untuk menyadari bahwa sebuah kelas bidang Django bukan apa yang disimpan dalam atribut model anda. Pengaturan model mengandung obyek Python biasa. Kelas-kelas bidang yang anda tentukan dalam sebuah model sebenarnya disimpan dalam kelas ``Meta`` ketika kelas model dibuat (rincian tepatnya bagaimana ini dilakukan adalah tidak penting disini). Ini karena kelas-kelas bidang tidak perlu ketika anda hanya membuat dan merubah atribut. Sebagai gantinya, mereka menyediakan mesin-mesin untuk merubah diantara nilai atribut dan apa yang disimpan dalam basisdata atau dikirim ke :doc:`serializer </topics/serialization>`.

source: Keep this in mind when creating your own custom fields. The Django ``Field`` subclass you write provides the machinery for converting between your Python instances and the database/serializer values in various ways (there are differences between storing a value and using a value for lookups, for example). If this sounds a bit tricky, don't worry -- it will become clearer in the examples below. Just remember that you will often end up creating two classes when you want a custom field:
el: Κρατήστε στο μυαλό σας τα ακόλουθα, όταν δημιουργείτε δικά σας πεδία. Η subclass ``Field`` του Django που γράφετε, σας προσφέρει έναν μηχανισμό μετατροπής μεταξύ Python instances και τιμών database/serializer με διάφορους τρόπους (πχ, υπάρχουν διαφορές μεταξύ της αποθήκευσης της τιμής και της χρησιμοποίησης της στα lookups). Αν αυτό ακούγεται κάπως περίπλοκο, μην ανησυχείτε -- θα γίνει κατανοητό στα παραδείγματα παρακάτω. Να θυμάστε, μόνο, ότι συχνά θα καταλήγετε με τη δημιουργία δύο κλάσεων, όταν γράφετε δικά σας πεδία:
id: Ingatlah ini ketika membuat penyesuaian bidang sendiri. Subkelas ``Field`` Django anda tulis menyediakan mesin-mesin untuk merubah diantara instance Python anda dan nilai database/serializer dalam beragam cara (ada perbedaan diantara menyimpan sebuah nilai dan menggunakan sebuah nilai untuk pencarian, sebagai contoh). Jika ini terdengar sedikit rumit, jangan khawatir -- dia akan menjadi lebih jelas dalam contoh dibawah ini. Ingatlah bahwa anda akan sering membuat dua kelas ketika anda ingin penyesuaian bidang:

source: The first class is the Python object that your users will manipulate. They will assign it to the model attribute, they will read from it for displaying purposes, things like that. This is the ``Hand`` class in our example.
el: Η πρώτη κλάση θα είναι το Python object που θα χρησιμοποιούν οι χρήστες. Θα το αναθέσουν σε ένα attribute του μοντέλου, θα διαβάζουν από αυτό για να βλέπουν τα δεδομένα που αντιστοιχούν σε αυτό, θα αποθηκεύουν δεδομένα μέσω αυτού κλπ. Αυτή η κλάση είναι η ``Hand`` στο παράδειγμα μας.
id: Kelas pertama adalah obyek Python dimana pengguna anda akan merubah. Mereka akan menetapkannya ke atribut model, mereka akan membaca darinya untuk menampilkan tujuan, hal-hal seperti itu. ini adalah kelas ``hand`` dalam contoh kami.

source: The second class is the ``Field`` subclass. This is the class that knows how to convert your first class back and forth between its permanent storage form and the Python form.
el: Η δεύτερη κλάση θα είναι μια subclass της ``Field``. Αυτή είναι μια κλάση η οποία ξέρει πως να μετατρέψει την πρώτη σας κλάση σε δεδομένα που καταλαβαίνει η βάση δεδομένων και αντίστροφα τα δεδομένα που είναι αποθηκευμένα στη βάση δεδομένων σε object που καταλαβαίνει η Python.
id: Kelas kedua adalah subkelas ``Field``. Ini adalah kelas yang diketahui bagaimana merubah kelas pertama anda ke belakang dan seterusnya diantara bentuk penyimpanan tetap dan bentuk Python.

source: Writing a field subclass
el: Γράφοντας μια subclass ενός πεδίου
id: Menulis sebuah subkelas bidang

source: When planning your :class:`~django.db.models.Field` subclass, first give some thought to which existing :class:`~django.db.models.Field` class your new field is most similar to. Can you subclass an existing Django field and save yourself some work? If not, you should subclass the :class:`~django.db.models.Field` class, from which everything is descended.
el: Όταν σχεδιάζετε τη subclass της κλάσης :class:`~django.db.models.Field` (το δικό σας νέο πεδίο, αν θέλετε), θα πρέπει πρώτα να σκεφτείτε με ποια από τις ήδη υπάρχουσες κλάσεις :class:`~django.db.models.Field` το νέο σας πεδίο μοιάζει περισσότερο. Ίσως να μπορείτε να κάνετε subclass ένα ήδη υπάρχον Django πεδίο και να γλυτώσετε τον εαυτό σας πολύτιμο χρόνο. Αν όχι, θα πρέπει να κάνετε subclass την κλάση :class:`~django.db.models.Field`, απ' όπου όλα κληρονομούν.
id: Ketika merencanakan subkelas :class:`~django.db.models.Field` anda, pertama berikan beberapa diduga yang mana ada kelas :class:`~django.db.models.Field` bidang baru anda yang paling mirip. Dapatkah anda mensubkelaskan bidang Django yang ada dan menyimpan diri anda beberapa pekerjaan? Jika tidak, anda harus mensubkelaskan kelas :class:`~django.db.models.Field`, yang semuanya turun.

source: Initializing your new field is a matter of separating out any arguments that are specific to your case from the common arguments and passing the latter to the ``__init__()`` method of :class:`~django.db.models.Field` (or your parent class).
el: Η αρχικοποίηση (initialization) του νέου σας πεδίου έχει να κάνει με τον διαχωρισμό των arguments που είναι συγκεκριμένα για αυτό που θέλετε να κάνει το πεδίο σας και των συνηθισμένων arguments. Στην μέθοδο ``__init__()`` της κλάσης :class:`~django.db.models.Field` (ή στην parent κλάση) περνάτε τα arguments που είναι συγκεκριμένα για το πεδίο σας.
id: Inisialisasi bidang baru anda adalah sebuah masalah dari memisahkan argumen apapun yang khusus pada kasus anda dari argumen umum dan melewatkannya ke cara `__init__()`` dari :class:`~django.db.models.Field` (atau kelas induk anda).

source: In our example, we'll call our field ``HandField``. (It's a good idea to call your :class:`~django.db.models.Field` subclass ``<Something>Field``, so it's easily identifiable as a :class:`~django.db.models.Field` subclass.) It doesn't behave like any existing field, so we'll subclass directly from :class:`~django.db.models.Field`::
el: Στο παράδειγμα μας, θα ονομάσουμε το πεδίο μας ``HandField``. (Είναι, γενικά, καλή πρακτική να καλείτε τη subclass της :class:`~django.db.models.Field` ως ``<Something>Field``, ούτως ώστε να εύκολα αναγνωρίσιμη ως μια subclass της :class:`~django.db.models.Field`). Η ``HandField`` δεν συμπεριφέρεται ως ένα ήδη υπάρχον Django πεδίο (πχ ``CharField`` ή ``TextField``), οπότε θα κάνουμε subclass απ’ ευθείας από την :class:`~django.db.models.Field`::
id: Dalam contoh kami, kami akan memanggil bidang ``HandField``. (Adalah ide bagus untuk memanggil subkelas :class:`~django.db.models.Field` anda ``<Something>Field``, sehingga sangat mudah dicirikan sebagai sebuah subkelas :class:`~django.db.models.Field`.) Dia tidak berperilaku seperti bidang lainnya yang ada, jadi kami akan mensubkelaskan secara langsung dari :class:`~django.db.models.Field`::

source: Our ``HandField`` accepts most of the standard field options (see the list below), but we ensure it has a fixed length, since it only needs to hold 52 card values plus their suits; 104 characters in total.
el: Η ``HandField`` δέχεται τις περισσότερες από τις στάνταρντ επιλογές πεδίων (δείτε τη λίστα παρακάτω), αλλά εδώ εξασφαλίζουμε ότι έχει ένα συγκεκριμένο μέγιστο μήκος, αφού το μέγιστο που χρειάζεται είναι 52 τιμές φύλλων μαζί με το χρώμα του καθενός, πχ άσσος μπαστούνι (As, ace of spades) ή τρία κούπα (3h, 3 of hearts) κλπ: 104 χαρακτήρες στο σύνολο.
id: ``HandField`` kami menerima kebanyakan pilihan bidang standar (lihat daftar dibawah ini), tetapi kami memastikan dia mempunyai panjang tetap, sejak dia hanya butuh menampung 52 nilai kartu ditambah pasangan mereka; 104 karakter jumlahnya.

source: Many of Django's model fields accept options that they don't do anything with. For example, you can pass both :attr:`~django.db.models.Field.editable` and :attr:`~django.db.models.DateField.auto_now` to a :class:`django.db.models.DateField` and it will simply ignore the :attr:`~django.db.models.Field.editable` parameter (:attr:`~django.db.models.DateField.auto_now` being set implies ``editable=False``). No error is raised in this case.
el: Πολλά από τα πεδία των μοντέλων του Django δέχονται μερικές επιλογές με τις οποίες δεν κάνουν τίποτα, απλώς τις αγνοούν. Για παράδειγμα, μπορείτε να περάσετε την παράμετρο :attr:`~django.db.models.Field.editable` και την :attr:`~django.db.models.DateField.auto_now` σε μια κλάση τύπου :class:`django.db.models.DateField` και η παράμετρος :attr:`~django.db.models.Field.editable` απλά θα αγνοηθεί (όταν το :attr:`~django.db.models.DateField.auto_now` είναι ``True`` προϋποθέτει ότι ``editable=False``). Κανένα σφάλμα δεν θα γίνει raised σε αυτή την περίπτωση.
id: Banyak bidang model Django menerima pilihan dimana mereka tidak melakukan apapun. Sebagai contoh, anda dapat melewatkan kedua :attr:`~django.db.models.Field.editable` dan :attr:`~django.db.models.DateField.auto_now` ke a :class:`django.db.models.DateField` dan dia dengan mudah mengabaikan parameter :attr:`~django.db.models.Field.editable` (:attr:`~django.db.models.DateField.auto_now` menjadi disiratkan ``editable=False``). Tidak ada kesalahan dimunculkan dalam kasus ini.

source: This behavior simplifies the field classes, because they don't need to check for options that aren't necessary. They just pass all the options to the parent class and then don't use them later on. It's up to you whether you want your fields to be more strict about the options they select, or to use the simpler, more permissive behavior of the current fields.
el: Αυτή η συμπεριφορά απλοποιεί τις κλάσεις των πεδίων επειδή δεν χρειάζεται να ελέγχουν για επιλογές (παραμέτρους) οι οποίες δεν είναι απαραίτητες. Απλώς, περνούν όλες τις επιλογές στην parent class και στη συνέχεια δεν τις χρησιμοποιούν. Από σας εξαρτάται αν θέλετε τα πεδία σας να είναι αυστηρά (strict) σε σχέση με τις παραμέτρους που επιλέγουν, ή να είναι πιο απλά, δηλαδή να δέχονται περισσότερες επιλογές.
id: Kebiasaan ini menyederhanakan kelas-kelas bidang, karena mereka tidak butuh memeriksa untuk pilihan yang tidak dibutuhkan. Mereka hanya melewatkan semua pilihan ke kelas induk dan kemudian tidak menggunakan mereka kemudian. Itu terserah anda apakah anda ingin bidang anda lebih tegas tentang pilihan mereka pilih, atau menggunakan lebih sederhana, kebiasaan yang tidak wajib dari bidang saat ini.

source: The ``Field.__init__()`` method takes the following parameters:
el: Η μέθοδος ``Field.__init__()`` δέχεται τις ακόλουθες παραμέτρους:
id: Cara ``Field.__init__()`` mengambil parameter berikut:

source: ``name``
id: ``nama``

source: ``rel``: Used for related fields (like :class:`ForeignKey`). For advanced use only.
el: ``rel``: Χρησιμοποιείται για συσχετισμένα πεδία (όπως το :class:`ForeignKey`). Για προχωρημένους χρήστες μόνο.
id: ``rel``: Digunakan untuk bidang terkait (seperti :class:`ForeignKey`). Hanya untuk penggunaan lanjut.

source: ``serialize``: If ``False``, the field will not be serialized when the model is passed to Django's :doc:`serializers </topics/serialization>`. Defaults to ``True``.
el: ``serialize``: Αν είναι ``False``, το πεδίο δεν θα γίνει serialized όταν το μοντέλο περάσει στους :doc:`serializers </topics/serialization>` του Django. Η προεπιλεγμένη τιμή είναι ``True``.
id: ``serialize``: Jika ``False``, bidang tidak akan didisambungkan ketika model dilewatkan ke :doc:`serializers </topics/serialization>` Django. Nilai awal ke ``True``.

source: :attr:`~django.db.models.Field.db_tablespace`: Only for index creation, if the backend supports :doc:`tablespaces </topics/db/tablespaces>`. You can usually ignore this option.
el: :attr:`~django.db.models.Field.db_tablespace`: Μόνο για τη δημιουργία περιεχομένων (indexes), αν η βάση δεδομένων υποστηρίζει τα :doc:`tablespaces </topics/db/tablespaces>`. Τις πιο πολλές φορές, μπορείτε να αγνοείτε αυτή την επιλογή.
id: :attr:`~django.db.models.Field.db_tablespace`: hanya untuk pembuatan indeks, jika dukungan backend :doc:`tablespaces </topics/db/tablespaces>`. Anda dapat biasanya mengabaikan pilihan ini.

source: :attr:`~django.db.models.Field.auto_created`: ``True`` if the field was automatically created, as for the :class:`~django.db.models.OneToOneField` used by model inheritance. For advanced use only.
el: :attr:`~django.db.models.Field.auto_created`: Είναι ``True`` αν το πεδίο δημιουργήθηκε αυτόματα, όπως το :class:`~django.db.models.OneToOneField` που χρησιμοποιείται από την κληρονομικότητα των μοντέλων. Για προχωρημένους χρήστες μόνο.
id: :attr:`~django.db.models.Field.auto_created`: ``True`` jika bidang otomatis telah dibuat, adapun :class:`~django.db.models.OneToOneField` digunakan oleh warisan model. Untuk penggunaan hanya tingkat lanjut.

source: All of the options without an explanation in the above list have the same meaning they do for normal Django fields. See the :doc:`field documentation </ref/models/fields>` for examples and details.
el: Όλες οι επιλογές χωρίς εξήγηση, στην ανωτέρω λίστα, έχουν την ίδια έννοια με τα συνηθισμένα πεδία του Django. Δείτε στο άρθρο :doc:`εγχειρίδιο πεδίων των μοντέλων </ref/models/fields>` για παραδείγματα και λεπτομέρειες.
id: Semua pilihan tanpa sebuah penjelasan dalam daftar diatas mempunyai arti yang sama mereka lakukan untuk bidang Django biasa. Lihat :doc:`field documentation </ref/models/fields>` untuk contoh dan rincian.

source: Field deconstruction
el: Deconstruction του πεδίου
id: Membongkar bidang

source: The counterpoint to writing your ``__init__()`` method is writing the ``deconstruct()`` method. This method tells Django how to take an instance of your new field and reduce it to a serialized form - in particular, what arguments to pass to ``__init__()`` to re-create it.
el: Όταν υλοποιείτε τη μέθοδο ``__init__()`` θα πρέπει να υλοποιήσετε και τη μέθοδο ``deconstruct()``. Αυτή η μέθοδος λέει στο Django πως να μετατρέψει το instance του καινούργιου σας πεδίου σε μια σειριακή μορφή (serialized form) - πιο συγκεκριμένα, ποια arguments θα πρέπει να περαστούν στη μέθοδο ``__init__()`` για να ξαναφτιαχτεί το instance.
id: Kontrapung untuk menulis cara ``__init__()`` anda adalah menulis cara ``deconstruct()``. Cara ini mengatakan Django bagaimana mengambil instance dari bidang baru anda dan menguranginya untuk sebuah formulir yang disambungkan - khususnya, argumen apa utnuk dilewatkan ke ``__init__()`` untuk membuatnya kembali.
