Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Once a node is parsed, its ``render`` method may be called any number of times. Since Django is sometimes run in multi-threaded environments, a single node may be simultaneously rendering with different contexts in response to two separate requests. Therefore, it's important to make sure your template tags are thread safe.
el: Όταν ένα node γίνει parsed, η ``render`` μέθοδος του μπορεί να καλεστεί πολλές φορές. Επειδή το Django, μερικές φορές, τρέχει σε περιβάλλοντα multi-threaded, ένα απλό node μπορεί ταυτοχρόνως να γίνει rendering με διαφορετικά contexts ως response για δύο ξεχωριστά requests. Επομένως, είναι σημαντικό να εξασφαλίσετε ότι τα template tags σας είναι thread safe.
id: Sekali node diuraikan, cara ``render`` dia mungkin dipanggil sejumlah kali. Sejak Django terkadang berjalan dalam lingkungan banyak-rangkaian, sebuah node tunggal mungkin secara berkelanjutan membangun dengan konteks berbeda dalam menjawab ke dua permintaan terpisah. Oleh sebab itu, sangat penting untuk memastikan cetakan etiket anda adalah aman.

source: To make sure your template tags are thread safe, you should never store state information on the node itself. For example, Django provides a builtin :ttag:`cycle` template tag that cycles among a list of given strings each time it's rendered:
el: Για να το εξασφαλίσετε αυτό, δεν θα πρέπει να αποθηκεύετε ποτέ τις πληροφορίες της κατάστασης στο ίδιο το node. Για παράδειγμα, το Django παρέχει ένα προεγκατεστημένο template tag :ttag:`cycle` το οποίο ανατρέχει μια λίστα από δοθέντα strings κάθε φορά που γίνεται rendered:
id: Untuk memastikan cetakan etiket anda thread safe, anda harus jangan menyimpan informasi keadaan pada node itu sendiri. Sebagai contoh, Django menyediakan cetakan etiket :ttag:`cycle` siap pakai yang berputar terhadap sebuah daftar dari deretan karakter yang diberikan setiap kali dia dibangun:

source: A naive implementation of ``CycleNode`` might look something like this::
el: Μια απλοϊκή υλοποίηση του ``CycleNode`` θα έμοιαζε κάπως έτσι::
id: Sebuah penerapan yang dibuat-buat dari ``CycleNode`` mungkin kelihatan kurang lebih seperti ini::

source: But, suppose we have two templates rendering the template snippet from above at the same time:
el: Αλλά, ας υποθέσουμε ότι την ίδια χρονική στιγμή, δύο templates κάνουν rendering το κομμάτι του template παραπάνω:
id: Tetapi, seandainya kami mempunyai dua cetakan membangun potongan cetakan dari atas pada waktu bersamaan:

source: Thread 1 performs its first loop iteration, ``CycleNode.render()`` returns 'row1'
el: Το Thread 1 πραγματοποιεί την πρώτη επανάληψη του βρόγχου, η μέθοδος ``CycleNode.render()`` επιστρέφει 'row1'
id: Urutan 1 melakukan pengulangan pertamanya, ``CycleNode.render()`` mengembalikan 'row1'

source: Thread 2 performs its first loop iteration, ``CycleNode.render()`` returns 'row2'
el: Το Thread 2 πραγματοποιεί την πρώτη επανάληψη του βρόγχου, η μέθοδος ``CycleNode.render()`` επιστρέφει 'row2'
id: Urutan 2 melakukan pengulangan pertamanya, ``CycleNode.render()`` mengembalikan 'row2'

source: Thread 1 performs its second loop iteration, ``CycleNode.render()`` returns 'row1'
el: Το Thread 1 πραγματοποιεί την δεύτερη επανάληψη του βρόγχου, η μέθοδος ``CycleNode.render()`` επιστρέφει 'row1'
id: Urutan 1 melakukan pengulangan keduanya, ``CycleNode.render()`` mengembalikan 'row1'

source: Thread 2 performs its second loop iteration, ``CycleNode.render()`` returns 'row2'
el: Το Thread 2 πραγματοποιεί την δεύτερη επανάληψη του βρόγχου, η μέθοδος ``CycleNode.render()`` επιστρέφει 'row2'
id: Urutan 2 melakukan pengulangan keduanya, ``CycleNode.render()`` mengembalikan 'row2'

source: The CycleNode is iterating, but it's iterating globally. As far as Thread 1 and Thread 2 are concerned, it's always returning the same value. This is obviously not what we want!
el: Το CycleNode κάνει την επανάληψη (iterating), αλλά την κάνει καθολικά (globally). Όσον αφορά τα Thread 1 και Thread 2, το καθένα επιστρέφει πάντα την ίδια τιμή. Αυτό, φυσικά, δεν είναι αυτό που θέλουμε!
id: CycleNode berulang-ulang, tetapi perulangannya secara umum. Sejauh Thread 1 dan Thread 2 dirisaukan, dia selalu mengembalikan nilai sama. Ini jelas bukan apa kami inginkan!

source: To address this problem, Django provides a ``render_context`` that's associated with the ``context`` of the template that is currently being rendered. The ``render_context`` behaves like a Python dictionary, and should be used to store ``Node`` state between invocations of the ``render`` method.
el: Για την αποφυγή τέτοιων καταστάσεων, το Django παρέχει ένα ``render_context`` το οποίο σχετίζεται με το ``context`` του template το οποίο γίνεται εκείνη τη στιγμή rendered. Το ``render_context`` συμπεριφέρεται όπως ένα Python dictionary και θα πρέπει να χρησιμοποιείται για να αποθηκεύονται οι καταστάσεις του ``Node`` μεταξύ κλήσεων της μεθόδου ``render``.
id: Untuk mengalamatkan masalah ini, Django menyediakan sebuah ``render_context`` yang terhubung dengan ``context`` dari cetakan yang saat ini sedang dibangun. ``render_context`` berperilaku seperti sebuah kamus Python, dan harus digunakan untuk menyimpan keadaan ``Node`` diantara permohonan dari cara ``render``.

source: Let's refactor our ``CycleNode`` implementation to use the ``render_context``::
el: Ας αλλάξουμε την υλοποίηση της κλάσης ``CycleNode`` για να χρησιμοποιεί το ``render_context``::
id: Mari kita refactor penerapan ``CycleNode`` kami untuk menggunakan ``render_context``::

source: Note that it's perfectly safe to store global information that will not change throughout the life of the ``Node`` as an attribute. In the case of ``CycleNode``, the ``cyclevars`` argument doesn't change after the ``Node`` is instantiated, so we don't need to put it in the ``render_context``. But state information that is specific to the template that is currently being rendered, like the current iteration of the ``CycleNode``, should be stored in the ``render_context``.
el: Σημειώστε ότι δεν είναι καθόλου λάθος να αποθηκεύετε ως attribute καθολικές πληροφορίες οι οποίες δεν αλλάζουν κατά τη διάρκεια της ζωής ενός ``Node``. Στην περίπτωση του ``CycleNode``, το argument ``cyclevars`` δεν αλλάζει μετά την αρχικοποίηση του ``Node``, οπότε δεν χρειάζεται να το βάλουμε μέσα στο ``render_context``. Αλλά η πληροφορία της κατάστασης η οποία είναι συγκεκριμένη στο template το οποίο γίνεται rendered, όπως η τρέχουσα επανάληψη βρόγχου του ``CycleNode``, θα πρέπει να αποθηκευτεί μέσα στο ``render_context``.
id: Catat bahwa ini sangat aman untuk menyimpan informasi umum yang tidak akan merubah keseluruhan hidup dari ``Node`` sebagai sebuah atribut. Dalam kasus ``CycleNode``, argumen ``cyclevars`` tidak berubah setelah ``Node`` dipakai, jadi kami tidak butuh menaruhnya ke dalam ``render_context``. Tetapi keadaan informasi yang khusus pada cetakan yang saat ini sedang dibangun, seperti putaran saat ini dari ``CycleNode``, harus disimpan dalam ``render_context``.

source: Notice how we used ``self`` to scope the ``CycleNode`` specific information within the ``render_context``. There may be multiple ``CycleNodes`` in a given template, so we need to be careful not to clobber another node's state information. The easiest way to do this is to always use ``self`` as the key into ``render_context``. If you're keeping track of several state variables, make ``render_context[self]`` a dictionary.
el: Σημειώστε το πως χρησιμοποιήσαμε το ``self`` για να έχουμε πρόσβαση σε συγκεκριμένη πληροφορία του ``CycleNode`` μέσα από το ``render_context``. Μπορεί να υπάρχουν πολλαπλά ``CycleNodes`` μέσα σε ένα template, οπότε πρέπει να είμαστε προσεκτικοί να μην αφαιρέσουμε την πληροφορία της κατάστασης άλλου node. Ο πιο εύκολος τρόπος για να επιτευχθεί κάτι τέτοιο είναι πάντα να χρησιμοποιείτε το ``self`` ως το key μέσα στο ``render_context``. Αν παρακολουθείτε πολλές ματαβλητές κατάστασης (state variables), κάντε το ``render_context[self]`` ένα dictionary.
id: Perhatikan bagaimana kami menggunakan ``self`` untuk menjangkau ``CycleNode`` informasi tertentu dalam ``render_context``. Disana mungkin banyak ``CycleNodes`` dalam cetakan yang diberikan, jadi kami butuh berhati-hati tidak megnkritik informasi keadaan node lainnya. Cara termudah melakukan ini adalah selalu menggunakan ``self`` sebagai kunci kedalam ``render_context``. Jika anda sedang menjaga jalur dari beberapa variabel keadaan, buat ``render_context[self]`` sebuah kamus.

source: Registering the tag
el: Κάνοντας register το tag
id: Mendaftarkan etiket

source: Finally, register the tag with your module's ``Library`` instance, as explained in :ref:`writing custom template filters<howto-writing-custom-template-tags>` above. Example::
el: Τέλος, κάντε register το tag με το instance του module ``Library``, όπως εξηγήθηκε στην ενότητα :ref:`γράφοντας δικά σας template φίλτρα <howto-writing-custom-template-tags>` παραπάνω. Παράδειγμα::
id: Akhirnya, daftarkan etiket dengan instance ``Library`` modul, sesuai penjelasan dalam :ref:`menulis penyesuaian cetakan penyaring<howto-writing-custom-template-tags>` diatas. Contoh::

source: The ``tag()`` method takes two arguments:
el: Η μέθοδος ``tag()`` λαμβάνει δύο arguments:
id: Cara ``tag()`` mengambil dua argumen:

source: The name of the template tag -- a string. If this is left out, the name of the compilation function will be used.
el: Το όνομα του template tag -- ένα string. Αν αυτό παραλειφθεί, θα χρησιμοποιηθεί το όνομα της συνάρτησης του compilation.
id: Nama dari cetakan etiket -- sebuah deretan karakter. Jika ini dihilangkan dari fungsi penyusunan akan digunakan.

source: As with filter registration, it is also possible to use this as a decorator::
el: Όπως και με το registration των φιλτρών, μπορείτε να χρησιμοποιήσετε έναν decorator::
id: Dengan pendaftaran penyaring, dia juga memungkinkan menggunakan ini sebagai decorator::

source: If you leave off the ``name`` argument, as in the second example above, Django will use the function's name as the tag name.
el: Αν παραλείψετε την παράμετρο ``name``, όπως στο δεύτερο παράδειγμα παραπάνω, το Django θα χρησιμοποιήσει το όνομα της συνάρτησης ως το όνομα του tag.
id: Jika anda meninggalkan argumen ``name``, seperti dalam contoh kedud diatas, Django akan menggunakan nama fungsi sebagai nama etiket.

source: Passing template variables to the tag
el: Περνώντας template μεταβλητές στο tag
id: Melewatkan variabel cetakan ke etiket

source: Although you can pass any number of arguments to a template tag using ``token.split_contents()``, the arguments are all unpacked as string literals. A little more work is required in order to pass dynamic content (a template variable) to a template tag as an argument.
el: Όπως γνωρίζετε μπορείτε να περάσετε οποιοδήποτε αριθμό από παραμέτρους σε ένα template tag και χρησιμοποιώντας τη μέθοδο ``token.split_contents()`` οι παράμετροι θα είναι διαθέσιμες σε εσάς ως strings. Ωστόσο, χρειάζεται λίγη περισσότερη δουλειά για να περάσετε δυναμικό περιεχόμενο (μια template μεταβλητή) στο template tag ως παράμετρο.
id: Meskipun anda dapat melewatkan angka apapun dari argumen ke etiket cetakan menggunakan ``token.split_contents()``, argumen semua tidak dipaketkan sebagai harfiah string. Sedikit kerja lebih dibutuhkan untuk melewatkan isi dinamis (variabel cetakan) ke etiket cetakan sebagai sebuah argumen.

source: While the previous examples have formatted the current time into a string and returned the string, suppose you wanted to pass in a :class:`~django.db.models.DateTimeField` from an object and have the template tag format that date-time:
el: Ενώ τα προηγούμενα παραδείγματα μορφοποιούσαν την τρέχουσα ώρα σε ένα string και επέστρεφαν το string, υποθέστε τώρα ότι θέλετε να περάσετε ένα :class:`~django.db.models.DateTimeField` από ένα object και θέλετε το template tag να μορφοποιήσει αυτό το object (αυτή την ημερομηνία-ώρα, αν θέλετε):
id: Selagi contoh sebelumnya telah membentuk waktu saat ini ke dalam string dan mengembalikan string, misalkan anda ingin melewatkan di :class:`~django.db.models.DateTimeField` dari sebuah obyek dan mempunyai bentuk etiket cetakan yang tanggal-waktu:

source: Initially, ``token.split_contents()`` will return three values:
el: Αρχικά, η μέθοδος ``token.split_contents()`` θα επιστρέψει τρεις τιμές:
id: Mulanya, ``token.split_contents()`` akan mengembalikan tiga nilai:

source: The tag name ``format_time``.
el: Το όνομα του tag, ``format_time``.
id: Nama etiket ``format_time``.

source: The string ``'blog_entry.date_updated'`` (without the surrounding quotes).
el: Το string ``'blog_entry.date_updated'`` (χωρίς τα μονά εισαγωγικά).
id: String ``'blog_entry.date_updated'`` (tanpa dikelilingi kutip).

source: The formatting string ``'"%Y-%m-%d %I:%M %p"'``. The return value from ``split_contents()`` will include the leading and trailing quotes for string literals like this.
el: Το string που θα χρησιμοποιηθεί για την μορφοποίηση ``'"%Y-%m-%d %I:%M %p"'``. Η επιστρεφόμενη τιμή από τη μέθοδο ``split_contents()`` θα συμπεριλάβει τα διπλά εισαγωγικά στην αρχή και το τέλος των strings (όπως ακριβώς εισήχθησαν στο tag μέσα στο template).
id: Pembentukan deretan karakter ``'"%Y-%m-%d %I:%M %p"'``. Mengembalikan nilai dari ``split_contents()`` akan menyertakan kutipan awal dan akhir untuk deretan karakter persis seperti ini.

source: Now your tag should begin to look like this::
el: Τώρα το tag θα αρχίσει να μοιάζει κάπως έτσι::
id: Sekarang etiket anda harus kelihatan seperti ini::

source: You also have to change the renderer to retrieve the actual contents of the ``date_updated`` property of the ``blog_entry`` object. This can be accomplished by using the ``Variable()`` class in ``django.template``.
el: Θα χρειαστεί επίσης να αλλάξετε και τον renderer για να λάβει τα πραγματικά περιεχόμενα του ``date_updated`` property του object ``blog_entry``. Αυτό μπορεί να επιτευχθεί χρησιμοποιώντας την κλάση ``Variable()`` μέσα στο ``django.template``.
id: Anda juga mempunyai kesemparan pembangun untuk mengambil isi sebenarnya dari sifat ``date_updated`` dari obyek ``blog_entry``. Ini dapat diselesaikan dengan menggunakan kelas ``Variable()`` dalam ``django.template``.

source: To use the ``Variable`` class, simply instantiate it with the name of the variable to be resolved, and then call ``variable.resolve(context)``. So, for example::
el: Για να χρησιμοποιήσετε την κλάση ``Variable``, απλώς αρχικοποιήστε τη με το όνομα της μεταβλητής η οποία θα γίνει resolved και μετά καλέστε τη μέθοδο ``variable.resolve(context)``. Άρα, για παράδειγμα::
id: Untuk menggunakan kelas ``Variable``, berikan contoh dia dengan nama dari variabel untuk di selesaikan dan kemudian panggil ``variable.resolve(context)``. Jadi, sebagai contoh::

source: Variable resolution will throw a ``VariableDoesNotExist`` exception if it cannot resolve the string passed to it in the current context of the page.
el: Η αναζήτηση της μεταβλητής (variable resolution) θα κάνει throw ένα exception ``VariableDoesNotExist`` αν δεν μπορεί να γίνει resolve το string (``'blog_entry.date_updated'``) που περάστηκε στο τρέχων context της σελίδας.
id: Keputusan variabel akan melempar sebuah pengecualian ``VariableDoesNotExist`` jika dia tidak dapat menyelesaikan deretan karakter dilewatkan ke dia dalam konteks saat ini dari halaman.

source: Setting a variable in the context
el: Θέτοντας μια μεταβλητή στο context
id: Menyetel sebuah variabel di konteks

source: The above examples simply output a value. Generally, it's more flexible if your template tags set template variables instead of outputting values. That way, template authors can reuse the values that your template tags create.
el: Το παραπάνω παράδειγμα απλώς εξάγει μια τιμή. Γενικότερα, είναι περισσότερο ευέλικτο αν τα template tags σας θέτουν template μεταβλητές αντί να εξάγουν (εκτυπώνουν) τις τιμές τους. Με αυτό τον τρόπο, οι συντάκτες των template θα μπορούν να επαναχρησιμοποιούν τις τιμές τις οποίες δημιούργησαν τα template tags σας.
id: Contoh diatas mengeluarkan sebuah nilai. Umumnya, dia lebih fleksibel jika cetakan etiket anda mengatur cetakan variabel daripada mengeluarkan nilai. Cara tersebut, penulis cetakan dapat menggunakan nilai yang cetakan etiket anda buat.

source: To set a variable in the context, just use dictionary assignment on the context object in the ``render()`` method. Here's an updated version of ``CurrentTimeNode`` that sets a template variable ``current_time`` instead of outputting it::
el: Για να θέσετε μια μεταβλητή στο context, απλώς χρησιμοποιήστε την εκχώρηση της στο dictionary του context object μέσα στη μέθοδο ``render()``. Παρακάτω φαίνεται μια ενημερωμένη έκδοση της κλάσης ``CurrentTimeNode`` η οποία θέτει την template μεταβλητή ``current_time`` αντί απλώς να την εκτυπώνει::
id: Untuk mengatur sebuah variabel dalam konteks, cukup gunakan penugasan kamus pada obyek konteks dalam cara ``render()``. Ini adalah versi terperbaharui dari ``CurrentTimeNode`` yang mengatur sebuah variabel cetakan ``current_time`` daripada mengeluarkannya::

source: Note that ``render()`` returns the empty string. ``render()`` should always return string output. If all the template tag does is set a variable, ``render()`` should return the empty string.
el: Σημειώστε ότι η μέθοδος ``render()`` επιστρέφει ένα κενό string. Η ``render()`` θα πρέπει πάντα να επιστρέφει ένα string. Αν το μόνο που κάνει ένα template tag είναι να ορίζει μια μεταβλητή, τότε η ``render()`` θα πρέπει να επιστρέφει ένα κενό string.
id: Catat bahwa ``render()`` mengembalikan deretan karakter kosong. ``render() harus selalu mengembalikan keluaran deretan karakter. Jika semua cetakan etiket disetel variabel, ``render()`` harus mengembalikan deretan karakter kosong.

source: Here's how you'd use this new version of the tag:
el: Παρακάτω φαίνεται πως μπορείτε να χρησιμοποιείτε τη νέα αυτή έκδοση του tag:
id: Ini adalah bagaimana anda akan menggunakan versi baru dari etiket:

source: Variable scope in context
el: Το variable scope του context
id: Lingkup variabel di konteks

source: Any variable set in the context will only be available in the same ``block`` of the template in which it was assigned. This behavior is intentional; it provides a scope for variables so that they don't conflict with context in other blocks.
el: Οποιαδήποτε μεταβλητή οριστεί στο context, θα είναι διαθέσιμη στο ίδιο ``block`` του template στο οποίο ορίστηκε. Αυτή η συμπεριφορά είναι σκόπιμη. Παρέχει ένα scope για μεταβλητές ούτως ώστε να μην συγκρούονται με κάποιο context από άλλα blocks.
id: Apapun kumpulan variabel dalam konteks akan hanya tersedua dalam ``block`` yang sama dari cetakan dimana dia ditetapkan. Perilaku ini adalah disengaja; dia menyediakan cakupan untuk variabel sehingga mereka tidak bertentangan dengan konteks di blok lainnya.

source: But, there's a problem with ``CurrentTimeNode2``: The variable name ``current_time`` is hard-coded. This means you'll need to make sure your template doesn't use ``{{ current_time }}`` anywhere else, because the ``{% current_time %}`` will blindly overwrite that variable's value. A cleaner solution is to make the template tag specify the name of the output variable, like so:
el: Αλλά υπάρχει ένα πρόβλημα με την κλάση ``CurrentTimeNode2``: Το όνομα της μεταβλητής ``current_time`` είναι γραμμένο hard-coded. Αυτό σημαίνει ότι πρέπει να σιγουρευτείτε πως το template σας δεν χρησιμοποιεί πουθενά αλλού το ``{{ current_time }}``, επειδή το ``{% current_time %}`` θα έκανε overwrite την τιμή της μεταβλητής. Μια πιο καθαρή λύση είναι να κάνετε το template tag να προσδιορίσει ένα όνομα για τη μεταβλητή, ως εξής:
id: Tetapi, ada masalah dengan ``CurrentTimeNode2``: Nama variabel ``current_time`` adalah dikode keraskan. Ini berarti anda akan butuh untuk memastikan cetakan anda tidak menggunakan ``{{ current_time }}`` dimanapun juga, karena ``{% current_time %}`` akan membabi buta meniban nilai variabel itu. Sebuah solusi pembersih adalah membuat cetakan etiket menentukan nama dari variabel keluaran, seperti begitu:

source: To do that, you'll need to refactor both the compilation function and ``Node`` class, like so::
el: Για να το κάνετε αυτό, θα χρειαστεί να αλλάξετε και τη συνάρτηση του compilation και την κλάση ``Node``, ως εξής::
id: Untuk melakukannya, anda akan butuh me refaktor kedua fungsi penyusun dan kelas ``Node``, seperti begitu::

source: The difference here is that ``do_current_time()`` grabs the format string and the variable name, passing both to ``CurrentTimeNode3``.
el: Η διαφορά εδώ είναι ότι η μέθοδος ``do_current_time()`` παίρνει το format μορφοποίησης και το όνομα της μεταβλητής και δίνει και τα δύο στην κλάση ``CurrentTimeNode3``.
id: Perbedaan disini adalah bahwa ``do_current_time()`` mengambil bentuk deretan karakter dan nama variabel, melewatkan keduanya ke ``CurrentTimeNode3``.

source: Finally, if you only need to have a simple syntax for your custom context-updating template tag, consider using the :meth:`~django.template.Library.simple_tag` shortcut, which supports assigning the tag results to a template variable.
el: Τέλος, αν θέλετε μόνο να έχετε μια απλή σύνταξη για το δικό σας template tag που αλληλεπιδρά με το context και το ενημερώνει, σκεφτείτε να χρησιμοποιήσετε τη συντόμευση :meth:`~django.template.Library.simple_tag`, η οποία υποστηρίζει τον ορισμό μεταβλητής της εξόδου ενός tag (μέσω της λέξη-κλειδί ``as``, όπως είδαμε παραπάνω).
id: Akhirnya, jika anda hanya butuh mempunyai sintaksis sederhana untuk penyesuaian pembaharuan-konteks cetakan etiket, pertimbangkan menggunakan jalan pintas :meth:`~django.template.Library.simple_tag`, yang mendukung menetapkan hasil etiket ke cetakan variabel.

source: Parsing until another block tag
el: Κάνοντας parsing μέχρι να βρεθεί κάποιο άλλο block tag
id: Menguraikan sampai blok etiket lain

source: Template tags can work in tandem. For instance, the standard :ttag:`{% comment %}<comment>` tag hides everything until ``{% endcomment %}``. To create a template tag such as this, use ``parser.parse()`` in your compilation function.
el: Τα template tags μπορούν να δουλέψουν αλυσιδωτά. Για παράδειγμα, το στάνταρντ tag :ttag:`{% comment %} <comment>` αγνοεί τα πάντα μέχρι να βρει το tag ``{% endcomment %}``. Για να δημιουργήσετε ένα template tag όπως αυτό, χρησιμοποιήστε τη μέθοδο ``parser.parse()`` μέσα στη συνάρτηση του compilation.
id: Cetakan etiket dapat bekerja dalam berduaan. Sebagai contoh, standar etiket :ttag:`{% comment %}<comment>` menyembunyikan semua sampai ``{% endcomment %}``. Untuk membuat sebuah cetakan etiket seperti ini, gunakan ``parser.parse()`` dalam fungsi penyusun anda

source: Here's how a simplified ``{% comment %}`` tag might be implemented::
el: Εδώ φαίνεται η υλοποίηση της απλοποιημένης έκδοσης του tag ``{% comment %}``::
id: Ini adalah bagaimana menyederhanakan etiket ``{% comment %}`` mungkin diterapkan::
