Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: For ``to_python()``, if anything goes wrong during value conversion, you should raise a :exc:`~django.core.exceptions.ValidationError` exception.
el: Όσον αφορά τη μέθοδο ``to_python()``, αν κάτι πάει στραβά κατά τη μετατροπή της τιμής, θα πρέπει να κάνετε raise ένα :exc:`~django.core.exceptions.ValidationError` exception (όπως κάνουμε μέσα στην ``parse_hand ``).
id: Untuk ``to_python()``, jika apapun berjalan salah selama perubahan nilai, anda harus memunculkan pengecualian :exc:`~django.core.exceptions.ValidationError`.

source: Converting Python objects to query values
el: Μετατρέποντας τα Python objects σε query values
id: Mengubah obyek Python ke nilai pencarian

source: Since using a database requires conversion in both ways, if you override :meth:`~Field.to_python` you also have to override :meth:`~Field.get_prep_value` to convert Python objects back to query values.
el: Εφόσον χρησιμοποιούμε μια βάση δεδομέμων θα πρέπει, όπως είπαμε, η μετατροπή των δεδομένων να γίνεται μεταξύ Python και βάσης και αντίστροφα. Αν παρακάμψετε (override) τη μέθοδο :meth:`~Field.to_python` θα χρειαστεί, επίσης, να παρακάμψετε τη μέθοδο :meth:`~Field.get_prep_value` για να μετατρέψετε τα Python objects σε query values, δηλαδή τιμές που καταλαβαίνει η βάση δεδομένων. Η μέθοδος αυτή θα καλείται κάθε φορά που θα ερωτάται η βάση, μέσω κάποιου query, πχ ``MyModel.objects.filter(...)`` ή ``MyModel.objects.get(...)`` κλπ. Με άλλα λόγια, η μέθοδος αυτή προετοιμάζει την τιμή που δόθηκε στο query (η οποία είναι ένα Python object, πχ ``MyModel.objects.filter(hand=Hand('...26chars', '...26chars', '...26chars', '...26chars')``) σε μια τιμή που καταλαβαίνει η βάση δεδομένων (στην προκειμένη, ένα string με όλα τα φύλλα της τράπουλας ανά παίκτη, πχ 'Js6h3s5d6d...').
id: Sejak menggunakan sebuah basisdata membutuhkan perubahan dalam kedua jalan, jika anda mengesampingkan :meth:`~Field.to_python` anda juga harus mengesampingkan :meth:`~Field.get_prep_value` untuk merubah obyek Python kembali ke nilai permintaan.

source: If your custom field uses the ``CHAR``, ``VARCHAR`` or ``TEXT`` types for MySQL, you must make sure that :meth:`.get_prep_value` always returns a string type. MySQL performs flexible and unexpected matching when a query is performed on these types and the provided value is an integer, which can cause queries to include unexpected objects in their results. This problem cannot occur if you always return a string type from :meth:`.get_prep_value`.
el: Αν τα δικά σας πεδία χρησιμοποιούν του τύπους ``CHAR``, ``VARCHAR`` ή ``TEXT`` της MySQL, θα πρέπει να σιγουρευτείτε ότι η μέθοδος :meth:`.get_prep_value` επιστρέφει πάντα μεταβλητές τύπου string. Όταν κάνετε ένα ερώτημα στη MySQL σχετικά με αυτά τα πεδία και η τιμή που δίνετε στο query είναι τύπου integer τότε η MySQL συμπεριφέρεται κάπως αναπάντεχα και τα αποτελέσματα από το query να μην είναι αυτά που περιμένετε. Αυτό το πρόβλημα δεν θα υπάρξει αν επιστρέφετε, πάντα, μια μεταβλητή τύπου string στη μέθοδο :meth:`.get_prep_value`.
id: Jika bidang penyesuaian anda menggunakan jenis ``CHAR``, ``VARCHAR`` atau ``TEXT`` untuk MySQL, anda harus memastikan bahwa :meth:`.get_prep_value` selalu mengembalikan jenis string. MySQL melakukan luwas dan pencocokan tidak diharapkan ketika sebuah permintaan dilakukan pada jenis ini dan nilai yang disediakan adalah sebauh integer, yang dapat menyebabkan permintaan untuk menyertakan obyek tidak diharapkan dalam pencarian mereka. Masalah ini tidak dapat timbul jika anda selalu mengembalikan jenis string dari :meth:`.get_prep_value`.

source: Converting query values to database values
el: Μετατρέποντας τα query values σε database values
id: Mengubah nilai pencarian ke nilai basisdata

source: Some data types (for example, dates) need to be in a specific format before they can be used by a database backend. :meth:`~Field.get_db_prep_value` is the method where those conversions should be made. The specific connection that will be used for the query is passed as the ``connection`` parameter. This allows you to use backend-specific conversion logic if it is required.
el: Κάποιοι τύποι δεδομένων (πχ ημερομηνίες) χρειάζεται να είναι σε κάποια συγκεκριμένη μορφή πριν χρησιμοποιηθούν με κάποια βάση δεδομένων. Η μέθοδος :meth:`~Field.get_db_prep_value` είναι το μέρος όπου αυτές οι μετατροπές πρέπει να γίνουν. Η σύνδεση (της βάση δεδομένων) που χρησιμοποιείται με το query περνάει ως το όρισμα με το όνομα ``connection``. Αυτό σας επιτρέπει να χρησιμοποιείτε διαφορετική λογική μετατροπής με διαφορετικούς τύπους βάσης δεδομένων, αν αυτό είναι απαραίτητο.
id: Beberapa jenis data (sebagai contoh, tanggal) butuh dalam bentuk yang khusus sebelum mereka dapat digunakan oleh backend basisdata. :meth:`~Field.get_db_prep_value` adalah cara dimana perubahan tersebut harus dibuat. Hubungan khusus yang akan digunakan untuk permintaan dilewati sebagai parameter ``connection``. Ini mengizinkan anda menggunakan logika perubahan khusus-backend jika dia diwajibkan.

source: For example, Django uses the following method for its :class:`BinaryField`::
el: Για παράδειγμα, το Django χρησιμοποιεί την ακόλουθη μέθοδο για πεδία τύπου :class:`BinaryField`::
id: Sebagai contoh, Django menggunakan cara berikut untuk :class:`BinaryField` nya::

source: In case your custom field needs a special conversion when being saved that is not the same as the conversion used for normal query parameters, you can override :meth:`~Field.get_db_prep_save`.
el: Σε περίπτωση που το δικό σας πεδίο χρειάζεται μια ξεχωριστή μετατροπή όταν αποθηκεύεται, δηλαδή όχι την ίδια μετατροπή που χρησιμοποιείται για συνηθισμένες παραμέτρους ενός query, μπορείτε να παρακάμψετε (override) τη μέθοδο :meth:`~Field.get_db_prep_save`.
id: Dalam kasus bidang penyesuaian anda butuh perubahan khusus ketika sedang disimpan yang tidak sama seperti perubahan digunakan untuk parameter permintaan biasa, anda dapat mengesampingkan :meth:`~Field.get_db_prep_save`.

source: Preprocessing values before saving
el: Επεξεργασία τιμών πριν την αποθήκευση
id: Mengolah nilai sebelum menyimpan

source: If you want to preprocess the value just before saving, you can use :meth:`~Field.pre_save`. For example, Django's :class:`~django.db.models.DateTimeField` uses this method to set the attribute correctly in the case of :attr:`~django.db.models.DateField.auto_now` or :attr:`~django.db.models.DateField.auto_now_add`.
el: Αν θέλετε να επεξεργαστείτε την τιμή ακριβώς πριν την αποθήκευση της (στη βάση δεδομένων), μπορείτε να χρησιμοποιήσετε τη μέθοδο :meth:`~Field.pre_save`. Για παράδειγμα, η κλάση του Django :class:`~django.db.models.DateTimeField` χρησιμοποιεί αυτή τη μέθοδο για να θέσει το attribute στη σωστή τιμή, όταν το :attr:`~django.db.models.DateField.auto_now` ή το :attr:`~django.db.models.DateField.auto_now_add` είναι ``True``.
id: Jika anda ingin prapengolahan nilai sebelum menyimpan, anda dapat menggunakan :meth:`~Field.pre_save`. Sebagai contoh, :class:`~django.db.models.DateTimeField` Django menggunakan cara ini untuk menyetel atribut dengan benar dalam kasus dari :attr:`~django.db.models.DateField.auto_now` atau :attr:`~django.db.models.DateField.auto_now_add`.

source: If you do override this method, you must return the value of the attribute at the end. You should also update the model's attribute if you make any changes to the value so that code holding references to the model will always see the correct value.
el: Αν παρακάμψετε αυτή τη μέθοδο, θα πρέπει να επιστρέψετε στο τέλος την τιμή του attribute. Θα πρέπει, επίσης, να ενημερώσετε το αντίστοιχο attribute του μοντέλου σας αν κάνετε τυχόν αλλαγές στην τιμή ούτως ώστε τυχόν κώδικας που αναφέρεται στο μοντέλο θα βλέπει πάντα τη σωστή τιμή.
id: Jika anda melakukan mengesampingkan cara ini, anda harus mengembalikan nilai dari atribut di akhirnya. Anda harus juga memperbaharui atribut model jika anda membuat perubahan apapun ke nilai sehingga kode menahan acuan ke model akan selalu melihat nilai benar.

source: Preparing values for use in database lookups
id: Mempersiapkan nilai untuk digunakan dalam pencaian basisdata

source: As with value conversions, preparing a value for database lookups is a two phase process.
id: Seperti perubahan nilai, menyiapkan sebauh nilai untuk pencarian basisdata adalah dua tingkatan pengolahan.

source: :meth:`.get_prep_lookup` performs the first phase of lookup preparation: type conversion and data validation.
id: :meth:`.get_prep_lookup` melakukan tingkatan pertama dari persiapan pencarian: mengetik perubahan dan menmeriksa data.

source: Prepares the ``value`` for passing to the database when used in a lookup (a ``WHERE`` constraint in SQL). The ``lookup_type`` parameter will be one of the valid Django filter lookups: ``exact``, ``iexact``, ``contains``, ``icontains``, ``gt``, ``gte``, ``lt``, ``lte``, ``in``, ``startswith``, ``istartswith``, ``endswith``, ``iendswith``, ``range``, ``year``, ``month``, ``day``, ``isnull``, ``search``, ``regex``, and ``iregex``.
id: Menyiapkan ``value`` untuk dilewatkan ke basisdata ketika digunakan dalam pencarian (sebuah pembatas ``WHERE`` dalam SQL). Parameter ``lookup_type`` akan menjadi satu dari pencarian penyaring Django sah: ``exact``, ``iexact``, ``contains``, ``icontains``, ``gt``, ``gte``, ``lt``, ``lte``, ``in``, ``startswith``, ``istartswith``, ``endswith``, ``iendswith``, ``range``, ``year``, ``month``, ``day``, ``isnull``, ``search``, ``regex``, dan ``iregex``.

source: If you are using :doc:`custom lookups </howto/custom-lookups>`, the ``lookup_type`` can be any ``lookup_name`` used by the project's custom lookups.
id: Jika anda sedang menggunakan :doc:`pencarian penyesuaian </howto/custom-lookups>`, ``lookup_type`` dapat menjadi ``lookup_name`` apapun digunakan oleh pencarian penyesuaian proyek.

source: Your method must be prepared to handle all of these ``lookup_type`` values and should raise either a ``ValueError`` if the ``value`` is of the wrong sort (a list when you were expecting an object, for example) or a ``TypeError`` if your field does not support that type of lookup. For many fields, you can get by with handling the lookup types that need special handling for your field and pass the rest to the :meth:`~Field.get_db_prep_lookup` method of the parent class.
id: Cara anda harus dipersiapkan untuk menangani semua nilai ``lookup_type`` ini dan harus menampilkan salah satu sebuah ``ValueError`` jika ``value`` dari urutan salah (sebuah daftar anda harapkan sebuah obyek, sebagai contoh) atau ``TypeError`` jika bidang anda tiadk mendukung jenis tersebut dari pencarian. Untuk banyak bidang-bidang, anda dapat mendapatkannya dengan menangani jenis pencarian yang butuh penanganan khusus untuk bidang anda dan sisa ke cara :meth:`~Field.get_db_prep_lookup` dari kelas induk.

source: If you needed to implement :meth:`.get_db_prep_save`, you will usually need to implement :meth:`.get_prep_lookup`. If you don't, :meth:`.get_prep_value` will be called by the default implementation, to manage ``exact``, ``gt``, ``gte``, ``lt``, ``lte``, ``in`` and ``range`` lookups.
id: Jika anda butuh untuk menerapkan :meth:`.get_db_prep_save`, anda akan biasanya butuh menerapkan :meth:`.get_prep_lookup`. Jika anda tidak, :meth:`.get_prep_value` akan dipanggil secara awal penerapan, untuk mengelola pencarian ``exact``, ``gt``, ``gte``, ``lt``, ``lte``, ``in`` dan ``range``.

source: You may also want to implement this method to limit the lookup types that could be used with your custom field type.
id: Anda juga ingin menerapkan cara ini untuk membatasi jensi pencarian yang dapat digunakan dengan jenis bidang penyesuaian anda.

source: Note that, for ``"range"`` and ``"in"`` lookups, ``get_prep_lookup`` will receive a list of objects (presumably of the right type) and will need to convert them to a list of things of the right type for passing to the database. Most of the time, you can reuse ``get_prep_value()``, or at least factor out some common pieces.
id: Catat bahwa, untuk pencarian ``"jangkauan"`` dan ``"dalam"``, ``get_prep_lookup`` akan menerima sebuah daftar dari obyek (barangkali dari jenis yang benar) dan akan merubah mereka ke sebuah daftar dari jenis benar untuk melewatkan ke basisdata. Kebanyakan dari waktu, anda dapat menggunakan kembali ``get_prep_value()``, atau setidaknya faktor luar beberapa potongan umum.

source: For example, the following code implements ``get_prep_lookup`` to limit the accepted lookup types to ``exact`` and ``in``::
id: Sebagai contoh, kode berikut menerapkan ``get_prep_lookup`` untuk membatasi jenis pencarian yang diterima terhadap ``exact`` dan ``in``::

source: For performing database-specific data conversions required by a lookup, you can override :meth:`~Field.get_db_prep_lookup`.
id: Untuk melakukan perubahan data basisdata-khusus dibuatuhkan oleh sebauh pencarian, anda dapat mengesampingkan :meth:`~Field.get_db_prep_lookup`.

source: Specifying the form field for a model field
el: Προσδιορίζοντας το πεδίο της φόρμας για ένα πεδίο μοντέλου
id: Menentukan bidang formulir untuk sebuah bidang model

source: To customize the form field used by :class:`~django.forms.ModelForm`, you can override :meth:`~Field.formfield`.
el: Για να παραμετροποιήσετε το πεδίο της φόρμας (form field) που χρησιμοποιείται από την κλάση :class:`~django.forms.ModelForm`, μπορείτε να παρακάμψετε (override) τη μέθοδο :meth:`~Field.formfield`.
id: Untuk menyesuaiakan bidang formulir digunakan oleh :class:`~django.forms.ModelForm`, anda dapat mengesampingkan :meth:`~Field.formfield`.

source: The form field class can be specified via the ``form_class`` and ``choices_form_class`` arguments; the latter is used if the field has choices specified, the former otherwise. If these arguments are not provided, :class:`~django.forms.CharField` or :class:`~django.forms.TypedChoiceField` will be used.
el: Η κλάση του πεδίου της φόρμας μπορεί να οριστεί μέσω των arguments ``form_class`` και ``choices_form_class``. Το τελευταίο χρησιμοποιείται σε περίπτωση που το πεδίο έχει ορίσει την παράμετρο choices, ενώ το πρώτο όχι. Αν αυτά τα arguments δεν δηλωθούν, τότε το πεδίο :class:`~django.forms.CharField` ή :class:`~django.forms.TypedChoiceField` θα χρησιμοποίηθεί.
id: Kelas bidang formulir dapat ditentukan melalui argumen ``form_class`` dan ``choices_form_class``; yang terakhir digunakan jika bidang mempunyai pilihan yang ditentukan, yang depan kebalikannya. Jika argumen ini tidak disediakan, :class:`~django.forms.CharField` atau :class:`~django.forms.TypedChoiceField` akan digunakan.

source: All of the ``kwargs`` dictionary is passed directly to the form field's ``__init__()`` method. Normally, all you need to do is set up a good default for the ``form_class`` (and maybe ``choices_form_class``) argument and then delegate further handling to the parent class. This might require you to write a custom form field (and even a form widget). See the :doc:`forms documentation </topics/forms/index>` for information about this.
el: Ολόκληρο το ``kwargs`` dictionary περνάει ως όρισμα απ' ευθείας στη μέθοδο ``__init__()`` του πεδίου της φόρμας. Συνήθως, το μόνο που πρέπει να κάνετε είναι να θέσετε ένα καλό ``kwargs`` ως προεπιλογή για το argument ``form_class`` (και ίσως για το ``choices_form_class``) και μετά να δώσετε τον έλεγχο στην parent class. Αυτό ίσως απαιτήσει να γράψετε ένα δικό σας πεδίο φόρμας (και ίσως ένα widget φόρμας). Δείτε στο :doc:`εγχειρίδιο για φόρμες </topics/forms/index>`, για πληροφορίες σχετικά με αυτό.
id: Semua kamus ``kwargs`` dilewatkan secara langsung ke formulir cara ``__init__()`` bidang. Biasanya, semua anda butuh lakukan adalah menyetel nilai awal bagus untuk ``form_class`` argumen (dan mungkin ``choices_form_class``) dan kemudian mengutus penanganan lebih lanjut untuk kelas induk. Ini mungkin membutuhkan anda menulis bidang formulir penyesuaian (dan bahkan sebuah widget formulir). Lihat :doc:`forms documentation </topics/forms/index>` untuk informasi tentang ini.

source: Continuing our ongoing example, we can write the :meth:`~Field.formfield` method as::
el: Συνεχίζοντας το παράδειγμα μας, μπορούμε να γράψουμε τη μέθοδο :meth:`~Field.formfield` ως εξής::
id: Melanjutkan contoh berlangsung kita, kami dapat menulis cara :meth:`~Field.formfield` sebagai::

source: This assumes we've imported a ``MyFormField`` field class (which has its own default widget). This document doesn't cover the details of writing custom form fields.
el: Αυτό προϋποθέτει ότι έχουμε κάνει import μια κλάση φόρμας ``MyFormField`` (η οποία έχει το δικό της προεπιλεγμένο widget). Το παρών άρθρο δεν καλύπτει τη συγγραφή δικών σας πεδίων για φόρμες.
id: Ini menganggap kami telah mengimpor kelas bidang ``MyFormField`` (yang mempunyai widget awal sendiri). Dokumen ini tidak mencakup rincian dari penulisan bidang formulir penyesuaian.

source: Emulating built-in field types
el: Προσομοιώνοντας προεγκατεστημένους (built-in) τύπους πεδίων
id: Menyamai jenis bidang siap pakai

source: If you have created a :meth:`.db_type` method, you don't need to worry about :meth:`.get_internal_type` -- it won't be used much. Sometimes, though, your database storage is similar in type to some other field, so you can use that other field's logic to create the right column.
el: Αν έχετε δημιουργήσει μια μέθοδο :meth:`.db_type`, δεν θα χρειαστεί να ανησυχείτε για τη μέθοδο :meth:`.get_internal_type` -- δεν θα χρησιμοποιηθεί πολύ. Μερικές φορές, όμως, η μονάδα αποθήκευσης της βάσης δεδομένων σας είναι παρόμοια, σε επίπεδο τύπου, με κάποιο άλλο πεδίο, οπότε μπορείτε να χρησιμοποιήσετε τη λογική αυτού του άλλου πεδίου για να δημιουργήσετε τη σωστή τύπου στήλη.
id: Jika anda telah membuat cara :meth:`.db_type`, anda tidak butuh khawatir tentang :meth:`.get_internal_type` -- dia tidak akan digunakan. Terkadang, meskipun, penyimpanan basisdata anda mirip dalam jenis pada beberapa bidang lain, jadi anda dapat menggunakan logika bidang lain itu untuk membuat kolum yang benar.

source: No matter which database backend we are using, this will mean that :djadmin:`migrate` and other SQL commands create the right column type for storing a string.
el: Ανεξαρτήτως της βάσης δεδομένων που χρησιμοποιούμε, αυτό θα σημαίνει ότι η εντολή :djadmin:`migrate` και άλλες SQL εντολές, θα χρησιμοποιούν τη σωστή τύπου στήλη για την αποθήκευση ενός string.
id: Tidak penting backend basisdata anda kami gunakan, ini akan berarti bahwa :djadmin:`migrate` dan perintah SQL lainnya membuat jenis kolom benar untuk menyimpan sebuah deretan karakter.

source: If :meth:`.get_internal_type` returns a string that is not known to Django for the database backend you are using -- that is, it doesn't appear in ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` -- the string will still be used by the serializer, but the default :meth:`~Field.db_type` method will return ``None``. See the documentation of :meth:`~Field.db_type` for reasons why this might be useful. Putting a descriptive string in as the type of the field for the serializer is a useful idea if you're ever going to be using the serializer output in some other place, outside of Django.
el: Αν η μέθοδος :meth:`.get_internal_type` επιστρέφει ένα string το οποίο δεν είναι γνωστό στο Django για την βάση δεδομένων που χρησιμοποιείται -- δηλαδή, δεν εμφανίζεται στο ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` -- το string θα εξακολουθήσει να χρησιμοποιείται από τον serializer, αλλά η προεπιλεγμένη μέθοδος :meth:`~Field.db_type` θα επιστρέψει ``None``. Δείτε το εγχειρίδιο της μεθόδου :meth:`~Field.db_type` για περιπτώσεις που αυτό μπορεί να φανεί χρήσιμο. Είναι μια καλή ιδέα να θέσετε ένα όμορφα περιγραφικό string ως τύπο πεδίου για τον serializer αν πρόκειται να χρησιμοποιήσετε την έξοδο του serializer σε κάποιο άλλο μέρος, εκτός του Django.
id: Jika :meth:`.get_internal_type` megembalikan sebuah deretan karakter yang tidak diketahui ke Django untuk backend basisdata anda sedang gunakan -- yaitu, dia tidak muncul dalam ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` -- deretan karakter akan masih digunakan oleh penyambung, tetapi cara :meth:`~Field.db_type` awal akan mengembalikan ``None``. Lihat dokumentasi dari :meth:`~Field.db_type` untuk alasan mengapa ini mungkin berguna. menaruh sebuah gambaran deretan karakter kedalam sebagai jenis dari bidang untuk penyambung adalah ide berguna jika anda sedang akan menggunakan keluaran penyambung dalam beberapa tempat lainnya, diluar Django.

source: Converting field data for serialization
el: Μετατρέποντας τα δεδομένα του πεδίου για το serialization
id: Mengubah data field untuk serialisasi

source: To customize how the values are serialized by a serializer, you can override :meth:`~Field.value_to_string`. Using ``value_from_object()`` is the best way to get the field's value prior to serialization. For example, since our ``HandField`` uses strings for its data storage anyway, we can reuse some existing conversion code::
el: Για την παραμετροποίηση των τιμών ούτως ώστε να γίνουν serialized από τον serializer, μπορείτε να παρακάμψετε (override) τη μέθοδο :meth:`~Field.value_to_string`. Η χρήση της ``value_from_object()`` είναι ο καλύτερος τρόπος να πάρετε την τιμή του πεδίου πριν το serialization. Για παράδειγμα, εφόσον το ``HandField`` χρησιμοποιεί strings για την αποθήκευση των δεδομένων του, μπορούμε να επαναχρησιμοποιήσουμε τον ήδη υπάρχον κώδικα που θα κάνει τη μετατροπή (``get_prep_value()``)::
id: Untuk menyesuaikan bagaimana nilai disambung oleh penyambung, anda dapat mengesampingkan :meth:`~Field.value_to_string`. Menggunakan ``value_from_object()`` adalah jalan terbaik untuk mendapatkan nilai bidang sebelum penyambungan. Sebagai contoh, sejak ``HandField`` kami menggunakan deretan karakter untuk penyimpanan datanya, kami dapat menggunakan kembali beberapa kode perubahan yang ada::

source: Some general advice
el: Μερικές γενικές συμβουλές
id: Beberapa saran umum

source: Writing a custom field can be a tricky process, particularly if you're doing complex conversions between your Python types and your database and serialization formats. Here are a couple of tips to make things go more smoothly:
el: Η συγγραφή ενός δικού σας πεδίου μπορεί να είναι μια περίπλοκη διαδικασία, ειδικά όταν πραγματοποιείτε περίπλοκες μετατροπές μεταξύ Python objects και μορφών της βάσης δεδομένων και του serialization. Παρακάτω παρουσιάζονται δύο συμβουλές για να ομαλοποιήσουν τα πράγματα:
id: Menulis sebuah bidang penyesuaian dapat menjadi pengolahan yang rumit, khususnya jika anda sedang melakukan perubahan rumit diantara jenis Python anda dan basisdata anda dan bentuk penyambungan. Ini adalah sepasang tip utnuk membuat hal-hal berjalan lebih halus::

source: Look at the existing Django fields (in :file:`django/db/models/fields/__init__.py`) for inspiration. Try to find a field that's similar to what you want and extend it a little bit, instead of creating an entirely new field from scratch.
el: Κοιτάξτε στα ήδη υπάρχοντα πεδία του Django (μέσα στο αρχείο :file:`django/db/models/fields/__init__.py`) για έμπνευση. Προσπαθήστε να βρείτε ένα πεδίο που να έχει ομοιότητες με αυτό που προσπαθήστε να επεκτείνετε, αντί να δημιουργήσετε ένα εντελώς νέο πεδίο από την αρχή.
id: Lihat bidang Django yang ada (dalam :file:`django/db/models/fields/__init__.py`) untuk inspirasi. Coba temukan bidang yang mirip pada apa anda inginkan dan perpanjang dia sedikit, daripada membuat sebuah keseluruhan bidang baru dari awal.
