Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: The key to generating PDFs dynamically with Django is that the ReportLab API acts on file-like objects, and Django's :class:`~django.http.HttpResponse` objects are file-like objects.
el: Το κλειδί για να παράγετε PDFs δυναμικά με το Django είναι ότι το ReportLab API ενεργεί σε objects που μοιάζουν με αρχεία και τα objects της κλάσης :class:`~django.http.HttpResponse` του Django μοιάζουν με αρχεία.
id: Kunci untuk membangkitkan PDF secara dinamis dengan Django adalah bahwa API ReportLab bertindak pada obyek seperti-berkas, dan obyek :class:`~django.http.HttpResponse` Django adalah obyek seperti-berkas.

source: Here's a "Hello World" example::
el: Εδώ φαίνεται το κλασικό παράδειγμα "Hello World"::
id: Ini adalah contoh "Hello World" ::

source: The response gets a special MIME type, :mimetype:`application/pdf`. This tells browsers that the document is a PDF file, rather than an HTML file. If you leave this off, browsers will probably interpret the output as HTML, which would result in ugly, scary gobbledygook in the browser window.
el: Το response παίρνει έναν ειδικό τύπο MIME, :mimetype:`application/pdf`. Αυτό λέει στους browsers ότι το έγγραφο είναι ένα PDF αρχείο, αντί ένα HTML αρχείο. Αν δεν το προσδιορίσετε, οι browsers θα ερμηνεύσουν την έξοδο ως HTML, που σημαίνει ότι όχι μόνο η έξοδος θα είναι άσχημη αλλά δεν θα καταλαβαίνετε τίποτα!
id: Tanggapan mendapatkan jenis MIME khusus, :mimetype:`application/pdf`. Ini memberitahu perambah bahwa dokumen adalah sebuah berkas PDF, daripada sebuah berkas HTML. Jika anda mengosongkan ini, perambah akan kemungkinan pentafsirkan keluaran sebagai HTML, yang akan menghasilkan buruk, uraian berbelit-belit yang menakutkan dalam jendela perambah.

source: The response gets an additional ``Content-Disposition`` header, which contains the name of the PDF file. This filename is arbitrary: Call it whatever you want. It'll be used by browsers in the "Save as..." dialog, etc.
el: Το response παίρνει ένα επιπλέον header με το όνομα ``Content-Disposition``, ο οποίος περιέχει το όνομα του αρχείου PDF. Το όνομα αυτό είναι αυθαίρετο: Μπορείτε να το ονομάσετε όπως εσείς θέλετε. Θα χρησιμοποιηθεί από τους browsers στο παράθυρο διαλόγου "Αποθήκευση ως..." κλπ.
id: Tanggapan mendapatkan sebuah tambahan kepala ``Content-Disposition``, yang mengandung nama dari berkas PDF. Nama berkas ini berubah-ubah: Panggil dia kapanpun anda ingin. Dia akan digunakan oleh perambah dalam dialog "Save as...", dll.

source: The ``Content-Disposition`` header starts with ``'attachment; '`` in this example. This forces Web browsers to pop-up a dialog box prompting/confirming how to handle the document even if a default is set on the machine. If you leave off ``'attachment;'``, browsers will handle the PDF using whatever program/plugin they've been configured to use for PDFs. Here's what that code would look like::
el: Σε αυτό το παράδειγμα, ο header ``Content-Disposition`` ξεκινά με τη λέξη ``'attachment; '``. Αυτό αναγκάζει τους Web browsers να εμφανίσουν ένα pop-up παράθυρο διαλόγου ρωτώντας τον χρήστη πως να χειριστεί το έγγραφο ακόμη και αν μια προεπιλεγμένη ενέργεια είναι ρυθμισμένη στον browser. Αν το παραλείψετε αυτό, οι browsers θα χειριστούν το PDF χρησιμοποιώντας οποιοδήποτε πρόγραμμα/plugin είναι ρυθμισμένοι να χρησιμοποιούν όταν έρχονται αντιμέτωποι με τέτοιου είδους αρχεία. Ο κώδικας θα φαίνεται κάπως έτσι::
id: Kepala ``Content-Disposition`` dimulai dengan ``'attachment; '`` dalam contoh ini. Ini memaksa perambah Jaringan memunculkan kotak dialog menunjuk/memastikan bagaimana menangani dokumen bahkan jika nilai awal disetel pada mesin. Jika anda meninggalkan ``'attachment; '``, perambah akan menangani PDF menggunakan program/tambahan apapun mereka telah konfigurasikan digunakan untuk PDF. Ini adalah apa kode kelihatan seperti::

source: Hooking into the ReportLab API is easy: Just pass ``response`` as the first argument to ``canvas.Canvas``. The ``Canvas`` class expects a file-like object, and :class:`~django.http.HttpResponse` objects fit the bill.
el: Η επικοινωνία με το ReportLab API είναι εύκολη: Απλώς περάστε το ``response`` ως πρώτο όρισμα στην κλάση ``canvas.Canvas``. Η κλάση ``Canvas`` περιμένει ένα object που μοιάζει με αρχείο και τα objects της κλάσης :class:`~django.http.HttpResponse` ταιριάζουν ακριβώς με την περιγραφή.
id: Mengaitkan kedalam API ReportLab adalah mudah: Cukup lewatkan ``response`` sebagai argumen pertama pada ``canvas.Canvas``. Kelas ``Canvas`` kecuali obyek seperti-berkas, dan obyek :class:`~django.http.HttpResponse` sesuai dengan tagihan.

source: Note that all subsequent PDF-generation methods are called on the PDF object (in this case, ``p``) -- not on ``response``.
el: Σημειώστε ότι όλες οι ακόλουθες μέθοδοι που δημιουργούν PDF, καλούνται πάνω στο PDF object (σε αυτή την περίπτωση, στο ``p``) -- όχι πάνω στο ``response``.
id: Catat bahwa semua cara pembangkitan-PDF berikutnya dipanggil pada obyek PDF (dalam kasus ini, ``p``) -- bukan pada ``response``.

source: Finally, it's important to call ``showPage()`` and ``save()`` on the PDF file.
el: Στο τέλος είναι σημαντικό να καλέσετε τις μεθόδους ``showPage()`` και ``save()`` στο PDF object.
id: Akhirnya, sangatlah penting memanggil ``showPage()`` dan ``save()`` pada berkas PDF.

source: ReportLab is not thread-safe. Some of our users have reported odd issues with building PDF-generating Django views that are accessed by many people at the same time.
el: Η βιβλιοθήκη ReportLab δεν είναι ασφαλής από πολλαπλά threads. Μερικοί από τους χρήστες ανέφεραν κάποια περίεργα προβλήματα όταν πολλοί χρήστες είχαν πρόσβαση, ταυτόχρονα, στα Django views που χρησιμοποιούνταν για να παράξουν PDF αρχεία.
id: ReportLab tidak thread-safe. Beberapa dari pengguna kami telah melaporkan masalah-masalah ganjil dengan membangun tampilan Django pembangkitan-PDF yang diakses oleh banyak orang pada waktu yang sama.

source: Complex PDFs
el: Περίπλοκα PDFs
id: PDF rumit

source: If you're creating a complex PDF document with ReportLab, consider using the :mod:`io` library as a temporary holding place for your PDF file. This library provides a file-like object interface that is particularly efficient. Here's the above "Hello World" example rewritten to use :mod:`io`::
el: Αν δημιουργείτε ένα περίπλοκο έγγραφο PDF με το ReportLab, σκεφτείτε να χρησιμοποιήσετε τη βιβλιοθήκη :mod:`io` ως ένα προσωρινό μέρος για να κρατάτε το PDF αρχείο σας. Αυτή η βιβλιοθήκη παρέχει ένα interface που μοιάζει με file object το οποίο είναι ιδιαίτερα αποδοτικό. Παρακάτω φαίνεται το παράδειγμα "Hello World" χρησιμοποιώντας, αυτή τη φορά, τη βιβλιοθήκη :mod:`io`::
id: Jika anda sedang membuat dokumen PDF rumit dengan ReportLab, pertimbangkan menggunakan pustaka :mod:`io` sebagai tempat menampung sementara untu berkas PDF anda. Pustaka ini menyediakan antarmuka obyek seperti-berkas yang khususnya efisien. Ini adalah contoh "Hello World" diatas ditulis kembali untuk menggunakan :mod:`io`::

source: Further resources
el: Επιπλέον πηγές
id: Sumberdaya lebih lanjut

source: PDFlib_ is another PDF-generation library that has Python bindings. To use it with Django, just use the same concepts explained in this article.
el: Η PDFlib_ είναι άλλη μια βιβλιοθήκη για παραγωγή PDF αρχείων που συνδέεται με την Python. Για να τη χρησιμοποιήσετε με το Django, απλώς χρησιμοποιήστε τις ίδιες τεχνικές που περιγράφτηκαν σε αυτό το άρθρο.
id: PDFlib_ adalah pustaka pembangkitan-PDF lainnya yang mempunyai ikatan Python. Untuk menggunakannya dengan Django, cukup gunakan konsep sama dijelaskan dalam artikel ini.

source: `XHTML2PDF`_ is yet another PDF-generation library. It ships with an example of how to integrate it with Django.
el: Άλλη μια βιβλιοθήκη παραγωγής PDF αρχείων είναι και η `XHTML2PDF`_. Έρχεται με ένα παράδειγμα ενσωμάτωσης της με το Django.
id: `XHTML2PDF`_ adalah pustaka generasi-PDF lainnya. Dia dibungkus denngan sebuah contoh dari bagaimana menggabungkannya dengan Django.

source: HTMLdoc_ is a command-line script that can convert HTML to PDF. It doesn't have a Python interface, but you can escape out to the shell using ``system`` or ``popen`` and retrieve the output in Python.
el: Η HTMLdoc_ είναι μια εντολή κονσόλας η οποία μετατρέπει την HTML σε PDF. Δεν έχει κάποιο Python interface, αλλά μπορείτε να βγείτε στο shell (στην κονσόλα σας, αν θέλετε) χρησιμοποιώντας τη μέθοδο ``system`` ή ``popen`` του module subprocess της Python για να έχετε πρόσβαση στην έξοδο της εντολής μέσω της Python.
id: HTMLdoc_ adalah tulisan baris-perintah yang dapat merubah HTML ke PDF. Dia tidak mempunyai antarmuka Python, tetapi anda dapat meloloskan ke shell menggunakan ``system`` atau ``popen`` dan mengambil keluaran di Python.

source: Other formats
el: Άλλες μορφές τύπου κειμένου
id: Bentuk lain

source: Notice that there isn't a lot in these examples that's PDF-specific -- just the bits using ``reportlab``. You can use a similar technique to generate any arbitrary format that you can find a Python library for. Also see :doc:`/howto/outputting-csv` for another example and some techniques you can use when generated text-based formats.
el: Όπως είδατε, δεν υπάρχει κάτι συγκεκριμένο με το PDF εδώ -- μόνο τα κομμάτια που χρησιμοποιούν τη βιβλιοθήκη ``reportlab``. Μπορείτε να χρησιμοποιήσετε κάποια παρόμοια τεχνική για να εξάγετε οποιαδήποτε μορφή τύπου κειμένου, αρκεί να υπάρχει μια Python βιβλιοθήκη που να την υποστηρίζει. Δείτε στο άρθρο :doc:`εξάγοντας αρχεία CSV με το Django </howto/outputting-csv>` για ένα άλλο παράδειγμα και μερικές τεχνικές που μπορείτε να χρησιμοποιήσετε όταν παράγετε αρχεία με μορφή τύπου κειμένου.
id: Perhatikan bahwa tidak ada banyak di contoh ini yaitu spesifik-PDF -- cukup bit menggunakan ``reportlab``. Anda dapat menggunakan teknik mirip untuk membangkitkan bentuk berubah-ubah yang anda dapat temukan pustaka Python. Juga lihat :doc:`/howto/outputting-csv` untuk contoh lainnya dan beberapa teknik anda dapat gunakan ketika membangkitkan bentuk berbasis-teks.

source: Deploying static files
el: Ανεβάζοντας τα static files
id: menyebarkan berkas tetap

source: For an introduction to the use of :mod:`django.contrib.staticfiles`, see :doc:`/howto/static-files/index`.
el: Για μια εισαγωγή στη χρήση του module :mod:`django.contrib.staticfiles`, δείτε στο άρθρο :doc:`Διαχειρίζοντας τα static files (πχ εικόνες, JavaScript, CSS κλπ) </howto/static-files/index>`.
id: Untuk perkenalan ke penggunaan :mod:`django.contrib.staticfiles`, lihat :doc:`/howto/static-files/index`.

source: Serving static files in production
el: Εξυπηρετώντας τα static files στην παραγωγή
id: Melayani berkas statis di produksi

source: The basic outline of putting static files into production is simple: run the :djadmin:`collectstatic` command when static files change, then arrange for the collected static files directory (:setting:`STATIC_ROOT`) to be moved to the static file server and served. Depending on :setting:`STATICFILES_STORAGE`, files may need to be moved to a new location manually or the :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` method of the ``Storage`` class might take care of that.
el: Τα βασικά βήματα για να εξυπηρετήσετε τα static files σας από κάποιον server και όχι, φυσικά, τοπικά από τον υπολογιστή σας (όπως γίνεται αυτόματα με το ``runserver``) είναι απλά: τρέξτε την διαχειριστική εντολή :djadmin:`collectstatic` όταν αλλάζουν τα static files και μετά δείτε πως μπορείτε να μεταφέρετε τα static files που έχουν συλλεχθεί στον προκαθορισμένο, από εσάς, φάκελο (:setting:`STATIC_ROOT`) στον server που θα χειρίζεται τα static files και θα τα εξυπηρετεί. Αναλόγως τη ρύθμιση :setting:`STATICFILES_STORAGE`, τα αρχεία ίσως χρειαστεί να μετακινηθούν χειροκίνητα στη νέα τοποθεσία ή αυτό μπορεί να το τακτοποιήσει η μέθοδος :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` της κλάσης ``Storage``.
id: Garis besar dasar dari menaruh berkas-berkas tetap kedalam produksi adalah sederhana: jalankan perintah :djadmin:`collectstatic` ketika berkas-berkas tetap berubah, kemudian atur untuk direktori berkas-berkas tetap yang dikumpulkan. Tergantung pada :setting:`STATICFILES_STORAGE`, berkas-berkas mungkin butuh dipindahkan ke tempat baru secara manual atau cara :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` dari kelas ``Storage`` mungkin mengurusinya.

source: Of course, as with all deployment tasks, the devil's in the details. Every production setup will be a bit different, so you'll need to adapt the basic outline to fit your needs. Below are a few common patterns that might help.
el: Φυσικά, όπως με όλες τις διαδικασίες μετάβασης από το development στο production περιβάλλον, ο διάβολος κρύβεται στις λεπτομέρειες. Κάθε εγκατάσταση-ρύθμιση ενός production περιβάλλοντος είναι διαφορετική, που σημαίνει ότι θα πρέπει να προσαρμόσετε τα ανωτέρω βασικά βήματα για να ταιριάζουν με τις ανάγκες σας. Παρακάτω φαίνονται μερικά συνηθισμένα παραδείγματα που μπορεί να βοηθήσουν.
id: Tentu saja, seperti semua tugas-tugas penyebaran, jahat adalah di dalam rincian. Setiap pengaturan produksi akan sedikit berbeda, jadi anda akan butuh mengadaptasi garis besar dasar untuk menyesuaikan kebutuhan anda. Dibawah ini adalah sedikit corak umum yang mungkin membantu.

source: Serving the site and your static files from the same server
el: Εξυπηρετώντας το site και τα static files σας από τον ίδιο server
id: Melayani situs dan berkas-berkas tetap anda dari peladen sama

source: If you want to serve your static files from the same server that's already serving your site, the process may look something like:
el: Αν θέλετε να εξυπηρετήσετε τα static files σας από τον ίδιο server ο οποίος εξυπηρετεί ήδη το site σας, η διαδικασία θα μοιάζει κάπως έτσι:
id: Jika anda ingin melayani berkas-berkas tetap anda dari peladen sama yang sudah melayani situs anda, pengolahan mungkin terlihat sesuatu seperti:

source: Push your code up to the deployment server.
el: Ανεβάστε τον κώδικα σας στον deployment server.
id: Dorong kode anda ke atas ke peladen penyebaran.

source: On the server, run :djadmin:`collectstatic` to copy all the static files into :setting:`STATIC_ROOT`.
el: Στον server, τρέξτε την εντολή :djadmin:`collectstatic` για να αντιγραφτούν όλα τα static files μέσα στο φάκελο :setting:`STATIC_ROOT`.
id: Di peladen, jalankan :djadmin:`collectstatic` untuk menyalin semua berkas statis kedalam :setting:`STATIC_ROOT`.

source: Configure your web server to serve the files in :setting:`STATIC_ROOT` under the URL :setting:`STATIC_URL`. For example, here's :ref:`how to do this with Apache and mod_wsgi <serving-files>`.
el: Παραμετροποιήστε τον Web server σας για να εξυπηρετεί τα αρχεία του φακέλου :setting:`STATIC_ROOT` στο URL :setting:`STATIC_URL`. Για παράδειγμα, δείτε :ref:`πως μπορείτε να το κάνετε αυτό με τον Apache και το mod_wsgi <serving-files>`.
id: Konfigurasikan peladen jaringan anda untuk melayani berkas-berkas dalam :setting:`STATIC_ROOT` dibawah URL :setting:`STATIC_URL`. Sebagai contoh, ini :ref:`how to do this with Apache and mod_wsgi <serving-files>`.

source: You'll probably want to automate this process, especially if you've got multiple web servers. There's any number of ways to do this automation, but one option that many Django developers enjoy is `Fabric <http://fabfile.org/>`_.
el: Το πιο πιθανό είναι, ίσως, να αυτοματοποιήσετε την παραπάνω διαδικασία, ειδικά όταν έχετε πολλούς Web servers. Υπάρχουν πολλοί τρόποι να πραγματοποιήσετε αυτόν τον αυτοματισμό, αλλά μια επιλογή που απολαμβάνουν πολλοί Django developers είναι το `Fabric <http://fabfile.org/>`_.
id: Anda akan mungkin ingin mengotomatisasi pengolahan ini, khususnya jika anda mendapatkan banyak peladen jaringan. Ada banyak sejumlah cara melakukan otomatisasi ini, tetapi satu pilihan yang banyak pengembang Django nikmati adalah `Fabric <http://fabfile.org/>`_.

source: Below, and in the following sections, we'll show off a few example fabfiles (i.e. Fabric scripts) that automate these file deployment options. The syntax of a fabfile is fairly straightforward but won't be covered here; consult `Fabric's documentation <http://docs.fabfile.org/>`_, for a complete explanation of the syntax.
el: Παρακάτω και στις επόμενες ενότητες, θα σας δείξουμε μερικά παραδείγματα των fabfiles αρχείων (δηλαδή, Fabric scripts) τα οποία αυτοματοποιούν την παραπάνω διαδικασία του deployment των static files (και όχι μόνο). Η σύνταξη ενός fabfile είναι αρκετά επεξηγηματική αλλά δεν θα καλυφθεί εδώ. Συμβουλευτείτε το `Fabric's documentation <http://docs.fabfile.org/>`_, για μια πλήρη εξήγηση της σύνταξης fabfile αρχείων.
id: Dibawah ini, dan di bagian berikutnya, kami akan menampilkan sedikit contoh fabfile (yaitu tulisan Fabric) yang mengotomatisasi pilihan penyebaran berkas. Sintaksis dari fabfile adalah cukup mudah tetapi tidak akan dicakup disini; konsultasikan `Fabric's documentation <http://docs.fabfile.org/>`_, untuk penjelasan lengkap dari sintaksis.

source: So, a fabfile to deploy static files to a couple of web servers might look something like::
el: Οπότε, ένα fabfile για να ανεβάσει τα static files σε μερικούς Web servers, θα μοιάζει κάπως έτσι::
id: Jadi, sebuah fabfile untuk menyebar berkas-berkas tetap ke sepasang peladen jaringan mungkin terlihat seperti ini::

source: Serving static files from a dedicated server
el: Εξυπηρετώντας τα static files από έναν dedicated server
id: Melayani berkas statis dari sebuah server tersendiri

source: Most larger Django sites use a separate Web server -- i.e., one that's not also running Django -- for serving static files. This server often runs a different type of web server -- faster but less full-featured. Some common choices are:
el: Τα περισσότερα μεγάλα Django sites χρησιμοποιούν ένα ξεχωριστό Web server -- πχ κάποιον ο οποίος δεν τρέχει ήδη το Django – για να εξυπηρετήσουν τα static files. Αυτός ο server συνήθως τρέχει έναν διαφορετικού τύπου web server -- γρηγορότερος αλλά με λιγότερες λειτουργίες. Μερικές κοινές επιλογές είναι:
id: Kebanyakan situs Django besar menggunakan peladen Jaringan terpisah -- yaitu, satu yang tidak juga menjalankan Django -- untuk melayani berkas-berkas tetap. Peladen ini sering berjalan jenis berbeda dari peladen jaringan -- lebih cepat tetapi sedikit fitur-penuh. Beberapa pilihan umum adalah:

source: Configuring these servers is out of scope of this document; check each server's respective documentation for instructions.
el: Η παραμετροποίηση αυτών των servers είναι εκτός του πεδίου εφαρμογής του παρόντος άρθρου. Συμβουλευτείτε το εγχειρίδιο καθενός από τους παραπάνω servers για λεπτομέρειες και οδηγίες.
id: Konfigurasi peladen ini diluar cakupan dari dokumen ini; periksa setiap dokumentasi masing-masing peladen untuk perintah.

source: Since your static file server won't be running Django, you'll need to modify the deployment strategy to look something like:
el: Εφόσον ο static file server δεν θα τρέχει το Django, θα χρειαστεί να αλλάξετε τη στρατηγική του deployment για να μοιάζει κάπως έτσι:
id: Sejak peladen berkas tetap anda tidak akan menjalankan Django, anda akan butuh merubah strategi penyebaran menjadi kelihatan sesuatu seperti:

source: When your static files change, run :djadmin:`collectstatic` locally.
el: Όταν τα static files αλλάζουν, τρέξτε την εντολή :djadmin:`collectstatic` τοπικά στον υπολογιστή σας.
id: Ketika berkas statis anda berubah, jalankan :djadmin:`collectstatic` secara lokal.

source: Push your local :setting:`STATIC_ROOT` up to the static file server into the directory that's being served. `rsync <https://rsync.samba.org/>`_ is a common choice for this step since it only needs to transfer the bits of static files that have changed.
el: Ανεβάστε τον τοπικό σας φάκελο :setting:`STATIC_ROOT` στον static file server μέσα στο φάκελο όπου εξυπηρετείται. Η εντολή `rsync <https://rsync.samba.org/>`_ είναι μια κοινή λύση για αυτό το βήμα καθώς δεν αντιγράφει κάθε φορά όλο το φάκελο, παρά μόνο τις αλλαγές που έγιναν.
id: Dorong :setting:`STATIC_ROOT` lokal anda sampai pada peladen berkas tetap kedalam direktori yang sedang dilayani. `rsync <https://rsync.samba.org/>`_ adalah sebuah pilihan umum untuk langkah ini sejak dia hanya butuh memindahkan bit ke berkas-berkas tetap yang telah berubah.

source: Here's how this might look in a fabfile::
el: Δείτε πως φαίνεται η παραπάνω διαδικασία, μέσα σε ένα fabfile::
id: Ini adalah bagaimana ini mungkin kelihatan dalam fabfile::

source: Serving static files from a cloud service or CDN
el: Εξυπηρετώντας τα static files από μια υπηρεσία cloud ή CDN
id: Melayani berkas statis dari layanan cloud atau CDN

source: Another common tactic is to serve static files from a cloud storage provider like Amazon's S3 and/or a CDN (content delivery network). This lets you ignore the problems of serving static files and can often make for faster-loading webpages (especially when using a CDN).
id: Taktik umum lainnya adalah melayani berkas-berkas tetap dari penyedia penyimpanan awan seperti S3 Amazon dan/atau CDN (content delivery network). Ini membuat anda mengabaikan masalah dari melayani berkas-berkas tetap dan sering membuat untuk memuat-cepat halaman jaringan (khususnya ketika menggunakan CDN).

source: When using these services, the basic workflow would look a bit like the above, except that instead of using ``rsync`` to transfer your static files to the server you'd need to transfer the static files to the storage provider or CDN.
el: Όταν χρησιμοποιείτε αυτές τις υπηρεσίες, η βασική διαδικασία θα μοιάζει λίγο-πολύ με την παραπάνω, εκτός του ότι αντί να χρησιμοποιείτε την εντολή ``rsync`` για να μεταφέρετε τα static files στον server, θα χρειαστεί να μεταφέρετε τα static files στον πάροχο αποθήκευσης αρχείων ή στο CDN.
id: Ketika menggunakan layanan ini, alurkerja dasar akan kelihatan sedikit seperti diatas, kecuali bahwa daripada menggunakan ``rsync`` untuk memindahkan berkas-berkas tetap anda ke peladen anda akan butuh untuk memindahkan berkas-berkas tetap ke penyedia panyimpanan atau CDN.

source: There's any number of ways you might do this, but if the provider has an API a :doc:`custom file storage backend </howto/custom-file-storage>` will make the process incredibly simple. If you've written or are using a 3rd party custom storage backend, you can tell :djadmin:`collectstatic` to use it by setting :setting:`STATICFILES_STORAGE` to the storage engine.
el: Υπάρχουν πολλοί τρόποι για το πετύχετε αυτό, αλλά αν ο πάροχος έχει κάποιο API, τότε ένα :doc:`παραμετροποιήσιμο σύστημα αποθήκευσης </howto/custom-file-storage>` θα κάνει την διαδικασία απίστευτα απλή. Αν έχετε γράψει ή χρησιμοποιείτε ένα σύστημα αποθήκευσης τρίτου (third-party custom storage backend), μπορείτε να πείτε στην εντολή :djadmin:`collectstatic` να χρησιμοποιήσει αυτό το σύστημα, ρυθμίζοντας ανάλογα την επιλογή :setting:`STATICFILES_STORAGE` στη μηχανή αποθήκευσης.
id: Terdapat sejumlah jalan anda mungkin lakukan ini, tetapi jika penyedia mempunyai sebuah API :doc:`custom file storage backend </howto/custom-file-storage>` akan membuat pengolahan luar biasa sederhana. Jika anda telah menulis atau menggunakan backend penyimpanan penyesuaian pihak ke3, anda dapat memberitahu :djadmin:`collectstatic` untuk digunakan oleh pengatur :setting:`STATICFILES_STORAGE` ke mesin penyimpanan.

source: For example, if you've written an S3 storage backend in ``myproject.storage.S3Storage`` you could use it with::
el: Για παράδειγμα, αν έχετε γράψει ένα σύστημα αποθήκευσης S3 στο αρχείο ``myproject.storage.S3Storage``, μπορείτε να το χρησιμοποιήσετε ως εξής::
id: Sebagai contoh, jika anda telah menulis sebuah backend penyimpanan S3 dalam ``myproject.storage.S3Storage`` anda dapat menggunakannya dengan::
