Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: :mod:`django.contrib.staticfiles` provides a convenience management command for gathering static files in a single directory so you can serve them easily.
el: Η εφαρμογή :mod:`django.contrib.staticfiles` παρέχει μια βολική διαχειριστική εντολή για να συγκεντρώσει (collect) όλα τα static files σε ένα μόνο φάκελο ούτως ώστε να τα εξυπηρετήσετε εύκολα.
id: :mod:`django.contrib.staticfiles` menyediakan kenyamanan perintah pengelolaan untuk mengumpulkan berkas-berkas tetap dalam direktori tunggal sehingga anda dapat melayani mereka dengan mudah.

source: Set the :setting:`STATIC_ROOT` setting to the directory from which you'd like to serve these files, for example::
el: Θέστε τη ρύθμιση :setting:`STATIC_ROOT` στον φάκελο από τον οποίο θα θέλετε να εξυπηρετήσετε αυτά τα αρχεία. Για παράδειγμα::
id: Setel pengaturan :setting:`STATIC_ROOT` ke direktori dari dimana anda ingin melayani berkas-berkas ini, sebagai contoh::

source: Run the :djadmin:`collectstatic` management command::
el: Τρέξτε την εντολή :djadmin:`collectstatic`::
id: Jalankan perintah pengelolaan :djadmin:`collectstatic`::

source: This will copy all files from your static folders into the :setting:`STATIC_ROOT` directory.
el: Η εντολή αυτή θα αντιγράψει όλα τα αρχεία από τους επιμέρους φακέλους με το όνομα ``static`` (αν υπάρχουν) κάθε εφαρμογής και όλα τα αρχεία στους φακέλους που περιέχονται στη ρύθμιση :setting:`STATICFILES_DIRS` στον έναν και μοναδικό φάκελο :setting:`STATIC_ROOT`.
id: Ini akan menyalin semua berkas dari pelipat tetap anda kedalam direktori :setting:`STATIC_ROOT`.

source: Use a web server of your choice to serve the files. :doc:`/howto/static-files/deployment` covers some common deployment strategies for static files.
el: Χρησιμοποιήστε έναν Web server της επιλογής σας για να εξυπηρετήσετε αυτά τα αρχεία. Το άρθρο :doc:`ανεβάζοντας τα static files </howto/static-files/deployment>` καλύπτει μερικές κοινές deployment στρατηγικές για τα static files.
id: Gunakan sebuah peladen jaringan dari pilihan anda untuk melayani berkas-berkas. :doc:`/howto/static-files/deployment` melingkupi beberapa strategi penyebaran umum untuk berkas-berkas tetap.

source: This document has covered the basics and some common usage patterns. For complete details on all the settings, commands, template tags, and other pieces included in :mod:`django.contrib.staticfiles`, see :doc:`the staticfiles reference </ref/contrib/staticfiles>`.
el: Αυτό το άρθρο κάλυψε τα βασικά και μερικές συνηθισμένες πρακτικές. Για πλήρεις λεπτομέρειες πάνω σε όλες τις ρυθμίσεις, εντολές, template tags και άλλα κομμάτια που περιέχονται στο :mod:`django.contrib.staticfiles`, δείτε στο άρθρο :doc:`αναφορά στα staticfiles </ref/contrib/staticfiles>`.
id: Dokumen ini melingkupi corak penggunaan dasar dan beberapa umum. Untuk melengkapi rincian pada semua pengaturan, perintah, etiket cetakan, dan potongan lainnya disertakan dalam :mod:`django.contrib.staticfiles`, lihat :doc:`the acuan berkas tetap </ref/contrib/staticfiles>`.

source: Upgrading Django to a newer version
el: Αναβαθμίζοντας το Django σε μια καινούργια έκδοση
id: Meningkatkan Django ke versi terbaru

source: While it can be a complex process at times, upgrading to the latest Django version has several benefits:
el: Παρόλο που μπορεί, μερικές φορές, να είναι περίπλοκη διαδικασία, η αναβάθμιση στην τελευταία έκδοση του Django έχει πολλά οφέλη:
id: Selama dia dapat menjadi pengolahan rumit terkadang, meningkatkan ke versi Django terakhir mempunyai beberapa keuntungan:

source: New features and improvements are added.
el: Προσθήκη καινούργιων λειτουργίων και βελτιστοποιήσεων.
id: Fitur baru dan perbaikan telah ditambahkan.

source: Bugs are fixed.
el: Επιδιόρθωση σφαλμάτων.
id: Kesalahan diperbaiki.

source: Older version of Django will eventually no longer receive security updates. (see :ref:`backwards-compatibility-policy`).
el: Οι παλαιότερες εκδόσεις του Django δεν θα λαμβάνουν, από κάποιο σημείο κι ύστερα, ενημερώσεις ασφαλείας (security updates). (δείτε την :ref:`πολιτική συμβατότητας παλαιότερων εκδόσεων <backwards-compatibility-policy>`).
id: Versi lama Django akhirnya akan tidak menerima pembaharuan keamanan. (lihat :ref:`backwards-compatibility-policy`).

source: Upgrading as each new Django release is available makes future upgrades less painful by keeping your code base up to date.
el: Η αναβάθμιση σε κάθε καινούργια διανομή του Django κάνει τις μελλοντικές αναβαθμίσεις λιγότερο περίπλοκες, διατηρώντας τον κώδικα σας ενημερωμένο.
id: Meningkatkan ketika setiap terbitan Django baru tersedia membuat peningkatan masa depan sedikit menyakitkan dengan menjaga dasar kode anda terbaru.

source: Here are some things to consider to help make your upgrade process as smooth as possible.
el: Παρακάτω επισημαίνουμε ορισμένα σημεία για να σας βοηθήσουμε να κάνετε την κάθε αναβάθμιση όσο γίνεται πιο ομαλά.
id: Ini adalah beberapa hal untuk dipertimbangkan untuk membantu pengolahan membuat peningkatan anda semulus mungkin.

source: Required Reading
el: Απαραίτητη ανάγνωση
id: Dibutuhkan Membaca

source: If it's your first time doing an upgrade, it is useful to read the :doc:`guide on the different release processes </internals/release-process>`.
el: Αν είναι η πρώτη σας φορά που κάνετε αναβάθμιση, είναι χρήσιμο να διαβάσετε τον :doc:`οδηγό της διαδικασίας για διαφορετικές εκδόσεις </internals/release-process>`.
id: Jika ini adalah pertama kali melakukan peningkatan, adalah sangat berguna untuk membaca :doc:`panduan dalam pengolahan terbitan berbeda </internals/release-process>`.

source: Afterwards, you should familiarize yourself with the changes that were made in the new Django version(s):
el: Έπειτα, θα πρέπει να εξοικειωθείτε με τις αλλαγές που έγιναν στην καινούργια Django έκδοση ή εκδόσεις:
id: Setelah itu, anda harus akrabkan diri anda dengan perubahan yang telah dibuat di versi Django baru:

source: Read the :doc:`release notes </releases/index>` for each 'final' release from the one after your current Django version, up to and including the version to which you plan to upgrade.
el: Διαβάστε το άρθρο :doc:`σημειώσεις διανομής </releases/index>` για κάθε 'final' διανομή από την αμέσως επόμενη της δικής σας έκδοσης μέχρι αυτή που θέλετε να αναβαθμίσετε.
id: Baca :doc:`release notes </releases/index>` untuk setiap terbitan 'final' dari satu setelah versi Django saat ini, sampai dan termasuk versi dimana anda berencana untuk ditingkatkan.

source: Look at the :doc:`deprecation timeline</internals/deprecation>` for the relevant versions.
el: Δείτε στο άρθρο :doc:`χρονοδιάγραμμα του deprecation </internals/deprecation>` για τις σχετικές εκδόσεις, ούτως ώστε να αποφύγετε να χρησιμοποιείτε deprecated λειτουργίες.
id: Lihat :doc:`deprecation timeline</internals/deprecation>` untuk versi bersangkutan.

source: Pay particular attention to backwards incompatible changes to get a clear idea of what will be needed for a successful upgrade.
el: Δώστε ιδιαίτερη προσοχή στις μη συμβατές, με παλαιότερες εκδόσεις, αλλαγές, για να πάρετε μια σαφή ιδέα του τι χρειάζεται για μια επιτυχημένη αναβάθμιση.
id: Bayar perhatian khusus untuk perubahan ketidaksesuaian kebelakang untuk mendapatkan ide jelas dari apa akan dibutuhkan untuk peningkatan yang berhasil.

source: Dependencies
id: Ketergantungan

source: In most cases it will be necessary to upgrade to the latest version of your Django-related dependencies as well. If the Django version was recently released or if some of your dependencies are not well-maintained, some of your dependencies may not yet support the new Django version. In these cases you may have to wait until new versions of your dependencies are released.
el: Στις περισσότερες περιπτώσεις θα είναι απαραίτητο να αναβαθμίσετε και τα dependecies (πακέτα-εφαρμογές τρίτων) τα οποία χρησιμοποιείτε με το Django. Αν μια έκδοση Django εκδόθηκε πρόσφατα ή κάποια από τα dependencies σας δεν έχουν την ανάλογη και συχνή αναβάθμιση, τότε ίσως να μην υποστηρίζουν ακόμα την καινούργια έκδοση του Django. Σε αυτές τις περιπτώσεις θα πρέπει να περιμένετε μέχρις ότου εκδοθούν οι νέες εκδόσεις των dependencies σας.
id: Dalam kebanyakan kasus-kasus dia akan butuh ditingkatkan sampai versi terakhir dari ketergantungan hubungan-Django anda juga. Jika versi Django saat ini diterbitkan atau jika beberapa dari ketergantungan tidak dirawat-baik, beberapa dari ketergantungan mungkin tidak mendukung versi Django baru. Dalam kasus ini anda mungkin harus menunggu sampai versi terbaru dari ketergantungan anda diterbitkan.

source: Installation
el: Εγκατάσταση
id: Pemasangan

source: Once you're ready, it is time to :doc:`install the new Django version </topics/install>`. If you are using virtualenv_ and it is a major upgrade, you might want to set up a new environment with all the dependencies first.
el: Όταν είστε έτοιμοι, :doc:`εγκαταστήστε τη νέα έκδοση του Django </topics/install>`. Αν χρησιμοποιείτε virtualenv_ και αυτή αποτελεί κάποια σημαντική αναβάθμιση, ίσως να θέλετε, πρώτα, να δημιουργήσετε ένα καινούργιο περιβάλλον με όλα τα dependencies.
id: Sekali anda siap, adalah waktunya untuk :doc:`install the new Django version </topics/install>`. Jika anda menggunakan virtualenv_ dan peningkatan utama, anda mungkin ingin menyetel lingkungan baru dengan ketergantungan terlebih dahulu.

source: Exactly which steps you will need to take depends on your installation process. The most convenient way is to use pip_ with the ``--upgrade`` or ``-U`` flag:
el: Τα ακριβή βήματα που πρέπει να ακολουθήσετε, εξαρτώνται από την διαδικασία της εγκατάστασης. Ο πιο βολικός τρόπος είναι η χρήση του pip_ με το flag ``--upgrade`` ή ``-U``:
id: Tepatnya langkah-langkah mana anda akan butuh untuk mengambil ketergantungan pada pengolahan pemasangan anda. Kebanyakan cara mudah adalah menggunakan pip_ dengan bendera ``--upgrade`` atau ``-U``:

source: pip_ also automatically uninstalls the previous version of Django.
el: Το pip_, επίσης, απεγκαθιστά, αυτόματα την προηγούμενη έκδοση του Django.
id: pip_ juga otomatis melepas versi Django sebelumnya.

source: If you use some other installation process, you might have to manually :ref:`uninstall the old Django version <removing-old-versions-of-django>` and should look at the complete installation instructions.
el: Αν χρησιμοποιείτε κάποια άλλη μέθοδο εγκατάστασης, θα πρέπει πρώτα να :ref:`απεγκαταστήσετε την προηγούμενη έκδοση του Django <removing-old-versions-of-django>` και μετά να εγκαταστήσετε την καινούργια σύμφωνα με τις οδηγίες εγκατάστασης της μεθόδου αυτής.
id: Jika anda menggunakan beberapa pengolahan pemasangan lain, anda mungkin harus secara manual :ref:`uninstall the old Django version <removing-old-versions-of-django>` dan harus mencari pada perintah pemasangan yang lengkap.

source: When the new environment is set up, :doc:`run the full test suite </topics/testing/overview>` for your application. In Python 2.7+, deprecation warnings are silenced by default. It is useful to turn the warnings on so they are shown in the test output (you can also use the flag if you test your app manually using ``manage.py runserver``):
id: Ketika lingkungan baru disetel, :doc:`run the full test suite </topics/testing/overview>` untuk aplikasi anda. Di Python 2.7+, peringatan ketergantungan didiamkan secara awal. Itu sangan berguna untuk menyalakan peringatan sehingga mereka yang ditampilkan dalam keluaran percobaan (anda dapat juga menggunakan bendera jika anda mencoba aplikasi anda secara manual menggunakan ``manage.py runserver``):

source: After you have run the tests, fix any failures. While you have the release notes fresh in your mind, it may also be a good time to take advantage of new features in Django by refactoring your code to eliminate any deprecation warnings.
el: Αφού έχετε τρέξει όλα τα τεστ, διορθώστε τυχόν περιπτώσεις που το τεστ δεν πέτυχε (failures). Όσο έχετε φρέσκιες τις σημειώσεις της διανομής του Django που αναβαθμίζετε, μια καλή ιδέα είναι να επωφεληθείτε των νέων χαρακτηριστικών της καινούργια έκδοσης και να αλλάξετε τον κώδικα σας, σε κάποια σημεία, για να εξαλείψετε τυχόν deprecation warnings.
id: Setelah anda menjalankan percobaan, perbaiki setiap kegagalan. Selagi anda telah menerbitkan catatan segar dalam pikiran anda, itu mungkin juga waktu yang tepat untuk mengambil keuntungan dari fitur baru dalam Django dengan merefaktor kode anda untuk mengurangi setiap peringatan pengusangan.

source: When you are sufficiently confident your app works with the new version of Django, you're ready to go ahead and :doc:`deploy </howto/deployment/index>` your upgraded Django project.
el: Όταν είστε απολύτως σίγουροι ότι η εφαρμογή σας δουλεύει με την νέα έκδοση του Django, τότε είστε έτοιμοι να προχωρήσετε στο :doc:`deployment </howto/deployment/index>` του αναβαθμισμένου, πλέον, Django project σας.
id: Ketika anda cukup percaya diri aplikasi anda bekerja dengan versi baru dari Django, anda siap melanjutkan dan :doc:`deploy </howto/deployment/index>` proyek Django anda yang ditingkatkan.

source: If you are using caching provided by Django, you should consider clearing your cache after upgrading. Otherwise you may run into problems, for example, if you are caching pickled objects as these objects are not guaranteed to be pickle-compatible across Django versions. A past instance of incompatibility was caching pickled :class:`~django.http.HttpResponse` objects, either directly or indirectly via the :func:`~django.views.decorators.cache.cache_page` decorator.
el: Αν χρησιμοποιείτε το caching που παρέχει το Django, ίσως θα ήταν καλύτερα να αδειάσετε την μνήμη cache μετά την αναβάθμιση. Σε διαφορετική περίπτωση, ίσως να έχετε προβλήματα, για παράδειγμα, αν κάνετε caching τυχόν pickled objects καθώς αυτά τα objects δεν εγγυώνται ότι είναι συμβατά με όλες τις εκδόσεις του Django. Μια παλαιότερη ασυμβατότητα ήταν το caching των object της κλάσης :class:`~django.http.HttpResponse`, είτε απ’ ευθείας είτε εμμέσως μέσω του decorator :func:`~django.views.decorators.cache.cache_page`.
id: Jika anda menggunakan penembolokan oleh Django, anda harus mempertimbangkan membersihkan tembolok setelah meningkatkan. Jika tidak anda mungkin berjalan kedalam masalah, sebagai contoh, jika anda sedang menembolok objek pickledimana obyek ini tidak dijamin untuk menjadi pickle cocok terhadap versi Django. Contoh lama dari ketidakcocokan adalah menembolok objek :class:`~django.http.HttpResponse` pickle, salah satu langsung atau tidak langsung melalui decorator :func:`~django.views.decorators.cache.cache_page`.

source: How to install Django on Windows
el: Πώς να εγκαταστήσετε το Django στα Windows
id: Bagaimana memasang Django pada WIndows

source: This document will guide you through installing Python 3.5 and Django on Windows. It also provides instructions for installing `virtualenv`_ and `virtualenvwrapper`_, which make it easier to work on Python projects. This is meant as a beginner's guide for users working on Django projects and does not reflect how Django should be installed when developing patches for Django itself.
el: Το παρών άρθρο θα σας καθοδηγήσει στην εγκατάσταση της Python 3.5 και του Django στα Windows. Παρέχει, επίσης, οδηγίες για την εγκατάσταση των πακέτων `virtualenv`_ και `virtualenvwrapper`_, τα οποία διευκολύνουν, κατά πολύ, τη ροή εργασίας με τα Python projects. Αυτό το άρθρο αφορά έναν οδηγό για αρχάριους χρήστες που δουλεύουν πάνω σε Django projects και δεν αντιπροσωπεύει το πώς πρέπει να εγκαθίσταται το Django όταν αναπτύσσετε patches για το ίδιο το Django.
id: Dokumen ini akan memandu anda melalui pemasangan Python 3.5 dan Django pada Windows. Dia juga menyediakan perintah-perintah untuk memasang `virtualenv`_ dan `virtualenvwrapper`_, yang membuatnya lebih mudah untuk bekerja pada proyek Python. Ini berarti sebagai panduan pemula untuk pengguna bekerja pada proyek Django dan tidak mencerminkan bagaimana Django harus dipasang ketika menyebarkan tambalan untuk Django itu sendiri.

source: The steps in this guide have been tested with Windows 7, 8, and 10. In other versions, the steps would be similar. You will need to be familiar with using the Windows command prompt.
el: Τα βήματα σε αυτό τον οδηγό έχουν ελεγχθεί στα Windows 7, 8 και 10. Σε άλλες εκδόσεις, τα βήματα θα είναι παρόμοια. Θα χρειαστεί να είστε εξοικειωμένοι με την γραμμή εντολών των Windows.
id: Langkah-langkah ini dalam panduan telah diujikan dengan Windows 7,8, dan 10. Dengan kata lain, langkah-langkah akan mirip. Anda akan butuh menjadi akrab dengan menggunakan command prompt Windows.

source: Install Python
el: Εγκατάσταση Python
id: Pasang Phyton

source: Django is a Python web framework, thus requiring Python to be installed on your machine. At the time of writing, Python 3.5 is the latest version.
el: Το Django είναι ένα Python web framework, που σημαίνει ότι απαιτεί εγκατεστημένη στον υπολογιστή σας την γλώσσα προγραμματισμού Python. Τη στιγμή που γράφεται το παρών άρθρο, η τελευταία έκδοση της Python είναι η 3.5.
id: Django adalah sebuah kerangka kerja jaringan Python, demikian membutuhkan dipasang pada mesin anda. Pada saat menulis, Python 3.5 adalah versi terakhir.

source: To install Python on your machine go to https://python.org/downloads/. The website should offer you a download button for the latest Python version. Download the executable installer and run it. Check the box next to ``Add Python 3.5 to PATH`` and then click ``Install Now``.
el: Για να εγκαταστήσετε την Python στον υπολογιστή σας, επισκεφτείτε την επίσημη ιστοσελίδα στη διεύθυνση https://python.org/downloads/. Το website θα σας προσφέρει ένα download κουμπί για την τελευταία έκδοση της Python. Κατεβάστε τον executable installer (το εκτελέσιμο αρχείο) και τρέξτε τον. Τσεκάρετε επίσης το κουτάκι ``Add Python to environment variables`` και μετά κλικάρετε στο κουμπί ``Install Now``.
id: Untuk memasang Pyhton pada mesin anda pergi ke https://python.org/downloads/. Jaringan situs harus menawarkan anda tombol unduhan untuk versi Python terakhir. Unduh pemasang dijalankan dan jalankan dia. Centang kotak dekat ``Add Python 3.5 to PATH`` dan klik ``Install Now``.

source: After installation, open the command prompt and check that the Python version matches the version you installed by executing::
el: Μετά την εγκατάσταση, ανοίξτε μια γραμμή εντολών και ελέγξτε ότι η έκδοση Python που έχετε εγκατεστημένη ταιριάζει με αυτή που μόλις κατεβάσατε::
id: Setelah pemasangan, buka command prompt dan periksa bahwa versi Python cocok dengan versi anda pasang dengan menjalankan::

source: About ``pip``
el: Σχετικά με το ``pip``
id: Tentang ``pip``

source: `pip`_ is a package manage for Python. It makes installing and uninstalling Python packages (such as Django!) very easy. For the rest of the installation, we'll use ``pip`` to install Python packages from the command line.
el: Το `pip`_ είναι ένας διαχειριστής πακέτων για την Python. Κάνει την εγκατάσταση και απεγκατάσταση των πακέτων της Python (όπως είναι και το Django!) παιχνιδάκι. Για το υπόλοιπο της εγκατάστασης, θα χρησιμοποιήσουμε το ``pip`` για να εγκαταστήσουμε διάφορα άλλα πακέτα της Python από τη γραμμή εντολών.
id: `pip`_ adalah sebuah pengelola paet untuk Python. Dia membuat memasang dan mencopot paket Python (seperti Django!) sangat mudah. Untuk sisa dari pemasangan, kami akan menggunakan ``pip`` untuk memasang paket Python dari baris perintah.

source: Install ``virtualenv`` and ``virtualenvwrapper``
el: Εγκατάσταση του ``virtualenv`` και του ``virtualenvwrapper``
id: Pasang ``virtualenv`` dan ``virtualenvwrapper``

source: `virtualenv`_ and `virtualenvwrapper`_ provide a dedicated environment for each Django project you create. While not mandatory, this is considered a best practice and will save you time in the future when you're ready to deploy your project. Simply type::
el: Τα πακέτα `virtualenv`_ και `virtualenvwrapper`_ παρέχουν ένα μεμονωμένο περιβάλλον για κάθε Django project που δημιουργείτε. Παρόλο που δεν είναι υποχρεωτικό, αυτό θεωρείται μια καλή πρακτική και θα σας γλυτώσει από πολύ χρόνο στο μέλλον, όταν είστε έτοιμοι να ανεβάσετε το project σας στον αέρα για το ευρύ κοινό (deployment). Για την εγκατάσταση τους, απλώς γράψτε::
id: `virtualenv`_ dan `virtualenvwrapper`_ menyediakan sebuah lingkungan khusus untuk setiap proyek Django anda buat. Selagi bukan kewajiban, ini dipertimbangkan sebagai praktik terbaik dan akan menghemat waktu anda di masa depan ketika anda sudah siap menyebarkan proyek anda. Cukup ketik::

source: Then create a virtual environment for your project::
el: Στη συνέχεια, δημιουργήστε ένα εικονικό περιβάλλον (virtual environment) για το project σας::
id: Kemudian buat lingkungan maya untuk proyek anda::

source: The virtual environment will be activated automatically and you'll see "(myproject)" next to the command prompt to designate that. If you start a new command prompt, you'll need to activate the environment again using::
el: Το virtual environment θα ενεργοποιηθεί αυτόματα και θα βλέπετε το "(myproject)" στην αρχή κάθε γραμμής στη γραμμή εντολών για να σας υπενθυμίζει ότι δουλεύετε σε αυτό το περιβάλλον (ήτοι το virtual environment είναι ενεργοποιημένο). Αν ανοίξετε μια καινούργια γραμμή εντολών, θα χρειαστεί να ενεργοποιήσετε, εκ νέου, το περιβάλλον χρησιμοποιώντας την εντολή::
id: Lingkungan maya akan diaktifkan otomatis dan anda akan melihat "(myproject)" dekat dengan command prompt untuk menandai itu. Jika anda mulai command prompt baru, anda akan butuh mengaktifkan lingkungan kembali menggunakan::

source: Install Django
el: Εγκατάσταση Django
id: Pasanga Django

source: Django can be installed easily using ``pip``.
id: Django dapat dipasang dengan mudah menggunakan ``pip``.

source: In the command prompt, execute the following command::
id: Dalam command prompt, jalankan perintah berikut::

source: This will download and install the latest Django release.
el: Η παραπάνω εντολή θα κατεβάσει και θα εγκαταστήσει την τελευταία έκδοση του Django. Αν θέλατε άλλη έκδοση και όχι την τελευταία, τότε θα γράφατε ``pip install django==x.x``, όπου x.x η έκδοση που θέλετε να εγκαταστήσετε.
id: Ini akan mengunduh dan memasang terbitan Django terakhir.

source: After the installation has completed, you can verify your Django installation by executing ``django-admin --version`` in the command prompt.
el: Αφού ολοκληρωθεί η εγκατάσταση, μπορείτε να επιβεβαιώσετε ότι εγκαταστάθηκε ορθά, εκτελώντας την εντολή ``django-admin --version`` μέσα από τη γραμμή εντολών.
id: Setelah pemasangan lengkap, anda dapat memeriksa pemasangan Django anda dengan menjalankan ``django-admin --version`` di command prompt.

source: See :ref:`database-installation` for information on database installation with Django.
el: Δείτε στο άρθρο See :ref:`εγκατάσταση βάσης δεδομένων στο Django <database-installation>` αν θέλετε να χρησιμοποιήσετε κάποια βάση δεδομένων για το project σας.
id: Lihat :ref:`database-installation` untuk informasi pada pemasangan basisdata dengan Django.

source: Common pitfalls
el: Συνηθισμένα σφάλματα εγκατάστασης
id: Kesalahan umum
