Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Once that's done, all you have to do is run :djadmin:`collectstatic` and your static files would be pushed through your storage package up to S3. If you later needed to switch to a different storage provider, it could be as simple as changing your :setting:`STATICFILES_STORAGE` setting.
el: Όταν γίνει αυτό, το μόνο που έχετε να κάνετε είναι να τρέξετε την εντολή :djadmin:`collectstatic` και όλα τα static files σας θα αποθηκευτούν, μέσω του συστήματος αποθήκευσης σας, στο S3. Αν αργότερα αποφασίσετε ότι θέλετε να αλλάξετε πάροχο αποθήκευσης αρχείων, δεν θα μπορούσε να είναι πιο απλό από το να αλλάξετε τη ρύθμιση :setting:`STATICFILES_STORAGE` αναλόγως.
id: Sekali semua dilakukan, semua anda harus lakukan adalah menjalankan :djadmin:`collectstatic` dan berkas-berkas tetap anda akan didorong melalui paket penyimpanan sampai ke S3. Jika anda kemudian membutuhkan mengganti ke penyedia penyimpanan berbeda, dia dapat semudah ketika merubah pengaturan :setting:`STATICFILES_STORAGE` anda.

source: For details on how you'd write one of these backends, see :doc:`/howto/custom-file-storage`. There are 3rd party apps available that provide storage backends for many common file storage APIs. A good starting point is the `overview at djangopackages.com <https://www.djangopackages.com/grids/g/storage-backends/>`_.
el: Για λεπτομέρειες του πως να γράψετε ένα από αυτά τα συστήματα, δείτε στο άρθρο :doc:`παραμετροποιήσιμο σύστημα αποθήκευσης αρχείων /howto/custom-file-storage`. Υπάρχουν, επίσης, και διάφορες διαθέσιμες εφαρμογές, οι οποίες παρέχουν συστήματα αποθήκευσης αρχειών για πολύ κοινά APIs αποθήκευσης αρχείων. Μια καλή αρχή να ξεκινήσετε να ψάξετε τέτοιου είδους πακέτα (και όχι μόνο) είναι το `djangopackages.com <https://www.djangopackages.com/grids/g/storage-backends/>`_.
id: Untuk perincian pada bagaimana anda menulis satu dari backend ini, lihat :doc:`/howto/custom-file-storage`. Ada aplikasi pihak ke3 tersedia yang menyediakan backend penyimpanan untuk banyak API penyimpanan penyimpanan berkas. Titik awal yang bagus adalah `overview at djangopackages.com <https://www.djangopackages.com/grids/g/storage-backends/>`_.

source: Learn more
el: Μάθετε περισσότερα
id: Pelajari lagi

source: For complete details on all the settings, commands, template tags, and other pieces included in :mod:`django.contrib.staticfiles`, see :doc:`the staticfiles reference </ref/contrib/staticfiles>`.
el: Για πλήρεις λεπτομέρειες πάνω σε όλες τις ρυθμίσεις, εντολές, template tags και άλλα κομμάτια που περιέχονται στο :mod:`django.contrib.staticfiles`, δείτε στο άρθρο :doc:`αναφορά στα staticfiles </ref/contrib/staticfiles>`.
id: Untuk rincian lengkap pada semua pengaturan, perintah, cetakan etiket, dan potongan-potongan lainnya dalam :mod:`django.contrib.staticfiles`, lihat :doc:`the staticfiles reference </ref/contrib/staticfiles>`.

source: Managing static files (e.g. images, JavaScript, CSS)
el: Διαχειρίζοντας τα static files (πχ εικόνες, JavaScript, CSS)
id: Mengelola berkas statis (sebagai contoh gambar, JavaScript, CSS)

source: Websites generally need to serve additional files such as images, JavaScript, or CSS. In Django, we refer to these files as "static files". Django provides :mod:`django.contrib.staticfiles` to help you manage them.
el: Οι ιστοσελίδες, γενικά, χρειάζονται να εξυπηρετούν και επιπρόσθετα αρχεία πέρα από την ίδια την HTML, όπως εικόνες, JavaScript, CSS, γραμματοσειρές κλπ. Στο Django, αναφερόμαστε σε αυτού του είδους τα αρχεία ως "στατικά αρχεία" (static files). Το Django παρέχει το module :mod:`django.contrib.staticfiles` για να σας βοηθήσει να τα διαχειρίζεστε.
id: Situs jaringan pada umumnya butuh melayani tambahan berkas-berkas seperti gambar, JavaScript, atau CSS. Di Django, kami mengacu pada berkas-berkas ini sebagai "berkas-berkas tetap". Django menyediakan :mod:`django.contrib.staticfiles` untuk membantu anda mengelola mereka.

source: This page describes how you can serve these static files.
el: Η σελίδα αυτή περιγράφει πως μπορείτε να εξυπηρετήσετε τέτοιου είδους αρχεία, static files.
id: Halaman ini menggambarkan bagaimana anda dapat melayani berkas statis ini.

source: Configuring static files
el: Ρυθμίζοντας τα static files
id: Mengkonfigurasi berkas-berkas tetap

source: Make sure that ``django.contrib.staticfiles`` is included in your :setting:`INSTALLED_APPS`.
el: Βεβαιωθείτε ότι η εφαρμογή ``django.contrib.staticfiles`` συμπεριλαμβάνεται στη ρύθμιση :setting:`INSTALLED_APPS`.
id: Pastikan bahwa ``django.contrib.staticfiles`` disertakan dalam :setting:`INSTALLED_APPS` anda.

source: In your settings file, define :setting:`STATIC_URL`, for example::
el: Στο γενικό αρχείο ρυθμίσεων σας, settings file, δώστε μια τιμή, string, στη μεταβλητή :`STATIC_URL`. Για παράδειγμα::
id: Di berkas pengaturan anda, tentukan :setting:`STATIC_URL`, sebagai contoh::

source: In your templates, either hardcode the url like ``/static/my_app/myexample.jpg`` or, preferably, use the :ttag:`static<staticfiles-static>` template tag to build the URL for the given relative path by using the configured :setting:`STATICFILES_STORAGE` storage (this makes it much easier when you want to switch to a content delivery network (CDN) for serving static files).
id: Dalam cetakan anda, bai itu url kode keras seperti ``/static/my_app/myexample.jpg`` atau, lebih disukai, menggunakan cetakan etiket :ttag:`static<staticfiles-static>` untuk membangun URL dari jalur relatif yang diberikan dengan menggunakan penyimpanan :setting:`STATICFILES_STORAGE` yang dikonfigurasi (ini membuatnya lebih mudah ketika anda ingin mengganti ke content delivery network (CDN) untuk melayani berkas-berkas tetap).

source: Store your static files in a folder called ``static`` in your app. For example ``my_app/static/my_app/myimage.jpg``.
id: Simpan berkas statis anda di pelipat disebut ``static`` di aplikasi anda. Sebagai contoh ``my_app/static/my_app/myimage.jpg``.

source: Serving the files
el: Εξυπηρετώντας τα αχεία
id: Melayani berkas-berkas

source: In addition to these configuration steps, you'll also need to actually serve the static files.
el: Πέρα από τις ανωτέρω ρυθμίσεις, θα χρειαστεί, επίσης, να εξυπηρετήσετε αυτά τα static files.
id: Dalam tambahan pada langkah-langkah konfigurasi ini, anda akan juga butuh untuk melayani berkas-berkas tetap.

source: During development, if you use :mod:`django.contrib.staticfiles`, this will be done automatically by :djadmin:`runserver` when :setting:`DEBUG` is set to ``True`` (see :func:`django.contrib.staticfiles.views.serve`).
el: Κατά τη διάρκεια του development, αν χρησιμοποιείτε την εφαρμογή :mod:`django.contrib.staticfiles`, η εξυπηρέτηση των static files θα γίνει αυτόματα από το :djadmin:`runserver` όταν, φυσικά, το :setting:`DEBUG` είναι ``True`` (δείτε τη συνάρτηση :func:`django.contrib.staticfiles.views.serve`).
id: Selama pengembangan, jika anda menggunakan :mod:`django.contrib.staticfiles`, ini akan dilakukan otomatis oleh :djadmin:`runserver` ketika :setting:`DEBUG` disetel ke ``True`` (lihat :func:`django.contrib.staticfiles.views.serve`).

source: This method is **grossly inefficient** and probably **insecure**, so it is **unsuitable for production**.
el: Αυτή η μέθοδος είναι **εντελώς αναποτελεσματική** και πιθανόν **μη ασφαλής**, κάτι που την καθιστά **ακατάλληλη για την παραγωγή**.
id: Cara ini adalah **terlalu tidak efesien** dan mungkin **tidak aman**, jadi dia **tidak cocok untuk produksi**.

source: See :doc:`/howto/static-files/deployment` for proper strategies to serve static files in production environments.
el: Δείτε στο άρθρο :doc:`ανεβάζοντας τα static files </howto/static-files/deployment>` για τις σωστές στρατηγικές εξυπηρέτησης των static files σε παραγωγικά περιβάλλοντα.
id: Lihat :doc:`/howto/static-files/deployment` untuk strategi yang sesuai untuk melayani berkas-berkas tetap dalam lingkungan produksi.

source: Your project will probably also have static assets that aren't tied to a particular app. In addition to using a ``static/`` directory inside your apps, you can define a list of directories (:setting:`STATICFILES_DIRS`) in your settings file where Django will also look for static files. For example::
el: Το project σας θα έχει, πιθανόν και κάποια static files τα οποία δεν θα συνδέονται με κάποια συγκεκριμένη εφαρμογή. Αν θέλετε να εξυπηρετήσετε στατικά αρχεία τα οποία θα είναι καθολικά για όλο το project σας, εκτός της δημιουργίας του φακέλου ``static/`` μέσα σε κάθε εφαρμογή σας, μπορείτε να ορίσετε μια λίστα από φακέλους (:setting:`STATICFILES_DIRS`) μέσα στο γενικό αρχείο ρυθμίσεων σας, settings file, όπου το Django θα κοιτάξει, επίσης, για επιπρόσθετα static files. Για παράδειγμα::
id: Proyek anda mungkin juga mempunyai aset tetap yang tidak diikat pada aplikasi khusus. Dalam tambahan untuk menggunakan direktori ``static/`` didalam aplikasi anda, anda dapat menentukan sebuah daftar direktori (:setting:`STATICFILES_DIRS`) di berkas pengaturan anda dimana Django akan juga mencari untuk berkas-berkas tetap. Sebagai contoh::

source: See the documentation for the :setting:`STATICFILES_FINDERS` setting for details on how ``staticfiles`` finds your files.
el: Δείτε το εγχειρίδιο για τη ρύθμιση :setting:`STATICFILES_FINDERS` για περισσότερες πληροφορίες σχετικά με το πως η εφαρμογή ``staticfiles`` βρίσκει τα αρχεία σας. Αν μπερδευτήκατε σχετικά με την διαχείριση των static files, ας το πούμε με άλλα λόγια: Ας υποθέσουμε ότι έχετε μέσα σε έναν φάκελο πχ static, στο root του project σας (στο ίδιο επίπεδο που βρίσκεται και το ``manage.py``) ένα CSS (πχ ``style.css``) και ένα JS αρχείο (πχ ``main.js``), τα οποία αφορούν ολόκληρο το project σας. Όταν τρέξετε την εντολή :djadmin:`collectstatic`, αυτά τα δύο αρχεία θα αντιγραφτούν από εκείνη την τοποθεσία (``static/``) στο φάκελο που έχετε ορίσει στη ρύθμιση :setting:`STATIC_ROOT` (πχ ``static_remote/`` που βρίσκεται πάλι στο root του project σας). Ίσως αυτό να σας φαίνεται παράξενο όταν γίνεται τοπικά στον υπολογιστή σας, επειδή έχετε τα ίδια αρχεία σε δύο διαφορετικά σημεία, αλλά μην ανησυχείτε, η εντολή :djadmin:`collectstatic` έχει ως σκοπό να μαζεύει-συγκεντρώνει όλα τα static files σε έναν φάκελο για να μπορείτε να τον εξυπηρετήσετε αργότερα στον server σας. Έχοντας δηλώσει το :setting:`STATIC_ROOT` θα πρέπει να βρούμε έναν τρόπο να μπορούμε να αναφερθούμε σε αυτά τα αρχεία μέσω των templates (πχ ``<link rel="stylesheet" href="???">``. Εδώ έρχονται να βοηθήσουν η ρύθμιση :setting:`STATIC_URL` και το template tag :ttag:`static`. Γράφοντας στο template ``<link rel="stylesheet" href="{% static 'style.css' %}">``, το Django γνωρίζει να βάλει στο attribute ``href`` την τιμή ``<STATIC_URL>style.css`` ανάλογα την ρύθμιση :setting:`STATIC_URL`. Αν πχ έχετε βάλει εκεί το ``/static/`` και το site σας βρίσκεται στη διεύθυνση ``http://www.mysite.com`` τότε η τιμή του ``href`` θα είναι ``http://www.mysite.com/static/style.css``.
id: Lihat dokumentasi untuk pengaturan :setting:`STATICFILES_FINDERS` untuk rincian pada bagaimana ``staticfiles`` menemukan berkas-berkas anda.

source: Static file namespacing
id: Namespacing berkas statis

source: Now we *might* be able to get away with putting our static files directly in ``my_app/static/`` (rather than creating another ``my_app`` subdirectory), but it would actually be a bad idea. Django will use the first static file it finds whose name matches, and if you had a static file with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those static files inside *another* directory named for the application itself.
el: Τώρα, *ίσως* θα μπορούσαμε να βάλουμε τα static files απ' ευθείας στο φάκελο ``my_app/static/`` (παρά να δημιουργήσουμε άλλον έναν υποφάκελο ``my_app``), αλλά δεν θα ήταν καλή ιδέα. Το Django θα επιλέξει το πρώτο static file που θα βρει το οποίο θα ταιριάξει στο όνομα που ψάχνει. Αν έχετε, λοιπόν, ένα static file με το ίδιο όνομα σε μια *άλλη* εφαρμογή, τότε το Django δεν θα μπορέσει να διαχωρίσει ποια από τα δύο να χρησιμοποιήσει. Χρειαζόμαστε ένα τρόπο να καθοδηγήσουμε το Django στο σωστό αρχείο. Ο ευκολότερος τρόπος να το κάνουμε είναι να εφαρμόσουμε την τεχνική του *namespacing* στα static files. Δηλαδή, να τοποθετούμε αυτά τα static files μέσα σε *άλλον έναν* φάκελο με το ίδιο όνομα με αυτό της εφαρμογής.
id: Sekarang kami *mungkin* dapat pergi dengan menaruh berkas-berkas tetap kami secara langsung dalam ``my_app/static/`` (daripada membuat subdirektori ``my_app`` lain), tetapi dia akan sebenarnya adalah ide bagus. Django akan menggunakan berkas tetapnya untuk menemukan nama yang cocok, dan jika anda mempunyai berkas tetap dengan nama sama dalam aplikasi *berbeda*, Django tidak akan dapat membedakan diantara mereka. Kami butuh dapat menunjuk Django pada satu yang benar, dan cara termudah untuk memastikan ini dengan *namesapcing* mereka. Yaitu, dengan menaruh berkas-berkas tetap mereka didalam direktori *lain* dinamai untuk aplikasi itu sendiri.

source: Serving static files during development.
id: Melayani berkas statis pada masa pengembangan

source: If you use :mod:`django.contrib.staticfiles` as explained above, :djadmin:`runserver` will do this automatically when :setting:`DEBUG` is set to ``True``. If you don't have ``django.contrib.staticfiles`` in :setting:`INSTALLED_APPS`, you can still manually serve static files using the :func:`django.contrib.staticfiles.views.serve` view.
el: Αν χρησιμοποιείτε την εφαρμογή :mod:`django.contrib.staticfiles` όπως περιγράφηκε παραπάνω, ο :djadmin:`runserver` θα εξυπηρετήσει τα static files αυτόματα αν το :setting:`DEBUG` είναι ``True``. Αν δεν έχετε την εφαρμογή ``django.contrib.staticfiles`` μέσα στη ρύθμιση :setting:`INSTALLED_APPS`, μπορείτε ακόμη να τα εξυπηρετήσετε, χειροκίνητα, χρησιμοποιώντας το view :func:`django.contrib.staticfiles.views.serve`.
id: Jika anda menggunakan :mod:`django.contrib.staticfiles` seperti yang dijelaskan diatas, :djadmin:`runserver` akan melakukan ini secara otomatis ketika :setting:`DEBUG` disetel ke ``True``. Jika anda tidak mempunyai ``django.contrib.staticfiles`` di :setting:`INSTALLED_APPS`, anda dapat masih secara manual melayani berkas-berkas tetap menggunakan tampilan :func:`django.contrib.staticfiles.views.serve`.

source: This is not suitable for production use! For some common deployment strategies, see :doc:`/howto/static-files/deployment`.
el: Αυτό, φυσικά, δεν είναι κατάλληλο για την παραγωγή (όταν δηλαδή το site σας είναι στον αέρα, διαθέσιμο για το ευρύ κοινό)! Για μερικές κοινές deployment στρατηγικές δείτε στο άρθρο :doc:`ανεβάζοντας τα static files </howto/static-files/deployment>`.
id: Ini tidak cocok untuk penggunaan produksi! Untuk beberapa strategi penyebaran umum, lihat :doc:`/howto/static-files/deployment`.

source: For example, if your :setting:`STATIC_URL` is defined as ``/static/``, you can do this by adding the following snippet to your urls.py::
el: Για παράδειγμα, αν το :setting:`STATIC_URL` έχει οριστεί ως ``/static/``, μπορείτε να κάνετε χρήση της :func:`django.contrib.staticfiles.views.serve`, μέσα στο αρχείο urls.py, ως εξής::
id: Sebagai contoh, jika :setting:`STATIC_URL` anda ditentukan sebagai ``/static/``, anda dapat melakukan ini dengan menambahkan potongan berikut ke urls.py anda::

source: This helper function works only in debug mode and only if the given prefix is local (e.g. ``/static/``) and not a URL (e.g. ``http://static.example.com/``).
el: Αυτή η βοηθητική συνάρτηση δουλεύει μόνο σε debug mode (ήτοι το :setting:`DEBUG` είναι ``True``) και μόνο αν το δοσμένο πρόθεμα είναι τοπικό (πχ ``/static/``) και όχι ένα URL (πχ ``http://static.example.com/``).
id: Fungsi pembantu ini hanya bekerja dalam suasana mencari kesalahan dan hanya jika awalan yang diberikan adalah lokal (sebagai contoh ``/static/``) dan bukan URL (sebagai contoh ``http://static.example.com/``).

source: Also this helper function only serves the actual :setting:`STATIC_ROOT` folder; it doesn't perform static files discovery like :mod:`django.contrib.staticfiles`.
el: Επίσης, αυτή η βοηθητική συνάρτηση εξυπηρετεί μόνο το φάκελο :setting:`STATIC_ROOT`. Δεν πραγματοποιεί την πραγματική αναζήτηση των static files, όπως κάνει η εφαρμογή :mod:`django.contrib.staticfiles`.
id: Juga fungsi pembantu ini hanya melayani folder :setting:`STATIC_ROOT` sebenarnya; dia tidak menampilkan berkas-berkas tetap seperti :mod:`django.contrib.staticfiles`.

source: Serving files uploaded by a user during development.
id: Melayani berkas yang diunggah oleh pengguna saat pengembangan

source: During development, you can serve user-uploaded media files from :setting:`MEDIA_ROOT` using the :func:`django.contrib.staticfiles.views.serve` view.
el: Στο Django, τα αρχεία που ανεβαίνουν στον server σας από κάποιον χρήστη (ή από τον admin μέσω του :mod:`django.contrib.admin`) ονομάζονται media files ή media assets και γι' αυτό το λόγο υπάρχει ένας διαχωρισμός μεταξύ των μεταβλητών στις ρυθμίσεις, πχ :setting:`MEDIA_ROOT`, :setting:`MEDIA_URL`, :setting:`STATIC_ROOT` και :setting:`STATIC_URL`. Κατά τη διάρκεια του development, μπορείτε να εξυπηρετήσετε τα media files που ανέβηκαν από κάποιον χρήστη μέσω της ρύθμισης :setting:`MEDIA_ROOT` χρησιμοποιώντας το view :func:`django.contrib.staticfiles.views.serve`.
id: Selama pengembangan, anda dapat melayani berkas-berkas media diupload-pengguna dari :setting:`MEDIA_ROOT` menggunakan tampilan :func:`django.contrib.staticfiles.views.serve`.

source: For example, if your :setting:`MEDIA_URL` is defined as ``/media/``, you can do this by adding the following snippet to your urls.py::
el: Για παράδειγμα, αν το :setting:`MEDIA_URL` έχει οριστεί ως ``/media/``, μπορείτε να κάνετε χρήση της :func:`django.contrib.staticfiles.views.serve`, μέσα στο αρχείο urls.py, ως εξής::
id: Sebagai contoh, jika :setting:`MEDIA_URL` anda ditentukan sebagai ``/media/``, anda dapat melakukan ini dengan menambahkan potongan berikut ke urls.py anda::

source: This helper function works only in debug mode and only if the given prefix is local (e.g. ``/media/``) and not a URL (e.g. ``http://media.example.com/``).
el: Αυτή η βοηθητική συνάρτηση δουλεύει μόνο σε debug mode (ήτοι το :setting:`DEBUG` είναι ``True``) και μόνο αν το δοσμένο πρόθεμα είναι τοπικό (πχ ``/media/``) και όχι ένα URL (πχ ``http://media.example.com/``). Σε περίπτωση που δεν είστε εξοικειωμένοι με τα media files διαβάστε αυτό: Ας υποθέσουμε ότι έχουμε ένα μοντέλο το οποίο έχει ένα πεδίο τύπου ``ImageField`` με το όνομα ``thumbnail``. Σε αυτό το πεδίο έχετε περάσει το όρισμα ``upload_to`` με την τιμή ``images``. Όλο αυτό σε κώδικα, θα μοιάζει κάπως έτσι: ``thumbnail = models.ImageField('thumbnail image', upload_to='images')``. Ας υποθέσουμε, επίσης, ότι αυτό το thumbnail μπορεί να το ανεβάσει στον server όποιος έχει πρόσβαση μέσω του Django admin site, :mod:`django.contrib.admin`. Τέλος, στο γενικό αρχείο ρυθμίσεων έχουμε τα εξής: η ρύθμιση :setting:`MEDIA_ROOT` είναι πχ ``media_remote/`` και η ρύθμιση :setting:`MEDIA_URL` είναι πχ ``/media/``. Αυτό, βέβαια, σημαίνει ότι έχετε δημιουργήσει τον φάκελο ``media_remote`` μέσα στο root του project σας. Κάθε φορά, λοιπόν, που κάποιος εξουσιοδοτημένος χρήστης επιλέγει μια εικόνα και πατάει το κουμπί ``Αποθήκευση``, η εικόνα αυτή αποθηκεύεται στο φάκελο ``<MEDIA_ROOT>/<upload_to>/<όνομα_αρχείου>``. Για το παράδειγμα μας, αν θέλουμε να αποθηκεύσουμε την εικόνα ``sky.jpg``, τότε αυτή θα αποθηκευτεί στην τοποθεσία ``media_remote/images/sky.jpg``. Για να εμφανίσουμε αυτή την εικόνα στα templates μας, θα χρησιμοποιήσουμε το ``src`` attribute του HTML ``<img>`` element ως εξής: ``<img src=”{{ img.url}}” alt=”sky image”>``. Αν το site σας βρίσκεται στη διεύθυνση ``http://www.mysite.com``, τότε η τιμή του ``src`` θα γίνει ``http://www.mysite.com/media/images/sky.jpg`` (ή αν δουλεύετε τοπικά στη διεύθυνση 127.0.0.1:8000, αυτό θα γίνει ``127.0.0.1:8000/media/images/sky.jpg``).
id: Fungsi pembantu ini bekerja hanya dalam suasana mencari kesalahan dan hanya jika awalan yang diberikan adalah lokal (sebagai contoh ``/media/``) dan bukan URL (sebagai contoh ``http://media.example.com/``).

source: When running tests that use actual HTTP requests instead of the built-in testing client (i.e. when using the built-in :class:`LiveServerTestCase <django.test.LiveServerTestCase>`) the static assets need to be served along the rest of the content so the test environment reproduces the real one as faithfully as possible, but ``LiveServerTestCase`` has only very basic static file-serving functionality: It doesn't know about the finders feature of the ``staticfiles`` application and assumes the static content has already been collected under :setting:`STATIC_ROOT`.
el: Όταν τρέχετε τα τεστ τα οποία χρησιμοποιούν πραγματικά HTTP requests αντί του προεγκατεστημένου testing client (πχ όταν χρησιμοποιείτε την κλάση :class:`LiveServerTestCase <django.test.LiveServerTestCase>`), τα static files θα χρειαστεί να εξυπηρετηθούν μαζί με το υπόλοιπο περιεχόμενο, προκειμένου το περιβάλλον του τεστ σας να αναπαράγει το πραγματικό περιβάλλον όσο πιο πιστά γίνεται. Αλλά η κλάση ``LiveServerTestCase`` παρέχει μια πολύ βασική λειτουργία εξυπηρέτησης των static files: Δεν γνωρίζει τίποτα σχετικά με τη λειτουργία των finders της εφαρμογής ``staticfiles`` και προϋποθέτει ότι τα static files έχουν ήδη συγκεντρωθεί μέσα στο φάκελο :setting:`STATIC_ROOT`.
id: Ketika menjalankan percobaan yang menggunakan permintaan HTTP sebenarnya daripada klien percobaan siap pakai (yaitu ketika menggunakan :class:`LiveServerTestCase <django.test.LiveServerTestCase>` siap pakai) aset tetap butuh dilayani bersama sisa dari isi sehingga lingkungan percobaan memproduksi kembali satu yang asli setepat mungkin, tetapi ``LiveServerTestCase`` mempunyai hanya sangat dasar berkas tetap-melayani fungsi: Dia tidak tahu bahwa penemu fitur dari aplikasi ``staticfiles`` dan menganggap isi statis telah dikumpulkan dibawah :setting:`STATIC_ROOT`.

source: Because of this, ``staticfiles`` ships its own :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`, a subclass of the built-in one that has the ability to transparently serve all the assets during execution of these tests in a way very similar to what we get at development time with ``DEBUG = True``, i.e. without having to collect them using :djadmin:`collectstatic` first.
el: Εξαιτίας αυτού, η εφαρμογή ``staticfiles`` έρχεται με μια δική της κλάση :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`, μια subclass της προεγκατεστημένης, η οποία έχει τη δυνατότητα να εξυπηρετεί με έναν παρόμοιο τρόπο με αυτόν που τρέχουμε κατά τη διάρκεια του development όταν το ``DEBUG = True``, διαφανώς, όλα τα assets κατά τη διάρκεια εκτέλεσης αυτών των τεστ, πχ χωρίς να χρειαστεί να τα συγκεντρώνουμε πρώτα, χρησιμοποιώντας την εντολή :djadmin:`collectstatic`.
id: Karena ini, ``staticfiles`` mengemas :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase` milik dia sendiri, sebuah subkelas dari satu siap pakai yang mempunyai kemampuan untuk transparan melayani semua aset selama pelaksanaan dari percobaan ini dengan cara sangat mirip pada apa kami dapat di waktu pengembangan dengan ``DEBUG = True``, yaitu tanpa mengumpulkan mereka menggunakan :djadmin:`collectstatic` pertama kali.

source: Deployment
id: Penyebaran
