Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: In older versions of Django, be careful when reusing Django's built-in filters as ``autoescape`` defaults to ``None``. You'll need to pass ``autoescape=True`` to get autoescaping.
el: Σε παλαιότερες εκδόσεις του Django, να είστε προσεκτικοί όταν χρησιμοποιείτε τα προεγκατεστημένα φίλτρα του Django επειδή η προεπιλεγμένη τιμή του keyword argument ``autoescape`` είναι ``None``. Θα χρειαστεί να το δηλώσετε ως ``autoescape=True`` για να έχετε autoescaping.
id: Dalam versi lama Django, berhati-hatilah ketika menggunakan penyaring pasang-tetap Django sebagai ``autoescape`` nilai awal ke ``None``. Anda akan butuh melewatkan ``autoescape=True`` untuk mendapatkan pelolosan otomatis.

source: For example, if you wanted to write a custom filter called ``urlize_and_linebreaks`` that combined the :tfilter:`urlize` and :tfilter:`linebreaksbr` filters, the filter would look like::
el: Για παράδειγμα, αν θέλετε να γράψετε ένα δικό σας φίλτρο με το όνομα ``urlize_and_linebreaks`` το οποίο συνδυάζει το φίλτρο :tfilter:`urlize` με :tfilter:`linebreaksbr`, τότε το φίλτρο σας θα έδειχνε κάπως έτσι::
id: Sebagai contoh, jika anda ingin menulis penyesuaian penyaring dipanggil ``urlize_and_linebreaks`` yang menggabungkan penyaring :tfilter:`urlize` dan :tfilter:`linebreaksbr`, penyaring akan kelihatan seperti::

source: Then:
el: Μετά το:
id: Kemudian:

source: would be equivalent to:
el: θα ήταν ισοδύναμο με αυτό:
id: akan setara dengan:

source: Filters and time zones
el: Φίλτρα και ζώνες ώρας
id: Saringan dan zona waktu

source: If you write a custom filter that operates on :class:`~datetime.datetime` objects, you'll usually register it with the ``expects_localtime`` flag set to ``True``::
el: Αν γράφετε δικά σας φίλτρα τα οποία δρουν σε objects του τύπου :class:`~datetime.datetime`, συνήθως θα το κάνετε register με το flag ``expects_localtime`` ως ``True``::
id: Jika anda menulis sebuah penyesuaian penyaring yang dijalankan pada obyek :class:`~datetime.datetime`, anda akan biasanya mendaftarkannya dengan bendera ``expects_localtime`` disetel ke ``True``::

source: When this flag is set, if the first argument to your filter is a time zone aware datetime, Django will convert it to the current time zone before passing it to your filter when appropriate, according to :ref:`rules for time zones conversions in templates <time-zones-in-templates>`.
el: Όταν αυτό το flag είναι ``True``, αν η πρώτη παράμετρος του φίλτρου σας είναι ένα datetime με επίγνωση της ζώνης ώρας (time zone aware datetime), το Django θα το μετατρέψει στην τρέχουσα ζώνη ώρας, κατά περίπτωση, πριν το περάσει στο φίλτρο σας, σύμφωνα με τους :ref:`κανόνες μετατροπής ζωνών ώρας στα templates <time-zones-in-templates>`.
id: Ketika bendera ini disetel, jika argumen pertama pada penyaring anda adalah zona waktu perhatikan datetime, Django akan merubahnya ke zona waktu saat ini sebelum melewatkannya ke penyaring anda ketika sesuai, menurut pada :ref:`aturan untuk perubahan zona waktu dalam cetakan <time-zones-in-templates>`.

source: Writing custom template tags
el: Γράφοντας δικάς σας template tags
id: Menulis etiket cetakan penyesuaian

source: Tags are more complex than filters, because tags can do anything. Django provides a number of shortcuts that make writing most types of tags easier. First we'll explore those shortcuts, then explain how to write a tag from scratch for those cases when the shortcuts aren't powerful enough.
el: Τα tags είναι περισσότερο πολύπλοκα από τα φίλτρα, επειδή τα tags μπορούν να κάνουν τα πάντα. Το Django παρέχει έναν αριθμό από συντομεύσεις που κάνει τη συγγραφή των περισσότερων τύπων tags ευκολότερη. Πρώτα θα εξερευνήσουμε αυτές τις συντομεύσεις και ύστερα θα εξηγήσουμε πως να γράψετε ένα tag από την αρχή για τις περιπτώσεις που κάποια συντόμευση δεν σας καλύπτει.
id: Etiket lebih rumit daripada penyaring, karena etiket dapat melakukan apapun. Django menyediakan sejumlah jalan pintas yang membuat penulisan kebanyakan jenis etiket lebih mudah. Pertama kami akan menjelajahi jalan pintas tersebut, kemudian menjelaskan bagaimana menulis sebauh etiket dari goresan untuk kasus=kasus tersebut ketika jalan pintas tidak cukup kuat.

source: Simple tags
el: Απλά tags
id: Etiket sederhana

source: Many template tags take a number of arguments -- strings or template variables -- and return a result after doing some processing based solely on the input arguments and some external information. For example, a ``current_time`` tag might accept a format string and return the time as a string formatted accordingly.
el: Πολλά template tags παίρνουν έναν αριθμό από παραμέτρους -- strings ή μεταβλητές template -- και επιστρέφουν ένα αποτέλεσμα αφού κάνουν κάποια επεξεργασία βασιζόμενα στις παραμέτρους και σε τυχόν εξωτερικές πληροφορίες. Για παράδειγμα, ένα tag με το όνομα ``current_time`` μπορεί να δεχτεί ένα string μορφοποίησης και να επιστρέψει την ώρα ως string, μορφοποιημένη σύμφωνα με αυτό που περάστηκε.
id: Banyak cetakan etiket mengambil sejumlah argumen -- deretan karakter atau cetakan variabel -- dan mengembalikan sebuah hasil setelah melakukan beberapa pengolahan berdasarkan hanya pada masukan argumen dan beberapa informasi luar. Sebagai contoh, sebuah etiket ``current_time`` mungkin menerima sebuah bentuk deretan karakter dan mengembalikan waktu sebagai bentuk deretan karakter.

source: To ease the creation of these types of tags, Django provides a helper function, ``simple_tag``. This function, which is a method of ``django.template.Library``, takes a function that accepts any number of arguments, wraps it in a ``render`` function and the other necessary bits mentioned above and registers it with the template system.
el: Για να διευκολύνουμε τη δημιουργία αυτού του τύπου των tags, το Django παρέχει μια βοηθητική συνάρτηση, τη ``simple_tag``. Αυτή η συνάρτηση, η οποία είναι μέθοδος της κλάσης ``django.template.Library``, δέχεται μια συνάρτηση η οποία δέχεται παραμέτρους ανεξαρτήτως αριθμού, την κάνει wrap σε μια render συνάρτηση και άλλων απαραίτητων στοιχείων που αναφέρθηκαν παραπάνω και την κάνει register με το σύστημα του template.
id: Untuk meringankan pembuatan dari jenis ini dari etiket, Django menyediakan fungsi pembantu, ``simple_tag``. Fungsi ini, yaitu sebuah cara dari ``django.template.Library``, mengambil sebuah fungsi yang menerima angka apapun dari argumen, membungkusnya dalam fungsi ``render`` dan bit-bit yang dibutuhkan lainnya disebutkan diatas dan mendaftarkannya dengan cetakan sistem.

source: Our ``current_time`` function could thus be written like this::
el: Η συνάρτηση μας ``current_time`` θα μπορούσε, επομένως, να γραφτεί κάπως έτσι::
id: Fungsi ``current_time`` kami dapat jadi ditulis seperti ini::

source: A few things to note about the ``simple_tag`` helper function:
el: Μερικά πράγματα που πρέπει να σημειώσετε για την βοηθητική συνάρτηση ``simple_tag``:
id: Beberapa hal untuk dicatat tentang fungsi pembantu ``simple_tag``:

source: Checking for the required number of arguments, etc., has already been done by the time our function is called, so we don't need to do that.
el: Ο έλεγχος του αριθμού των απαιτούμενων παραμέτρων κλπ, έχει ήδη γίνει τη στιγμή που η συνάρτηση μας καλείται, οπότε δεν θα χρειαστεί να γίνει κάτι τέτοιο.
id: Memeriksa angka dibutuhkan dari argumen, dll., telah selesai dilakukan oleh waktu fungsi kami dipanggil, jadi kami tidak butuh melakukan itu.

source: The quotes around the argument (if any) have already been stripped away, so we just receive a plain string.
el: Τα εισαγωγικά (``””`` ή ``''``) γύρω από την παράμετρο (αν υπάρχουν) έχουν ήδη αποκοπεί, οπότε έχουμε να κάνουμε με ένα απλό string μέσα στη συνάρτηση του template tag.
id: Kutipan disekeliling argumen (jika ada) telah dilucuti, jadi kami hanya menerima deretan karakter kosong.

source: If the argument was a template variable, our function is passed the current value of the variable, not the variable itself.
el: Αν η παράμετρος ήταν μια μεταβλητή template, τότε η συνάρτηση μας θα περνούσε την τιμή της μεταβλητής και όχι την ίδια τη μεταβλητή.
id: Jika argumen adalah cetakan variabel, fungsi kami dilewatkan nilai sast ini dari variabel, bukan variabel itu sendiri.

source: Unlike other tag utilities, ``simple_tag`` passes its output through :func:`~django.utils.html.conditional_escape` if the template context is in autoescape mode, to ensure correct HTML and protect you from XSS vulnerabilities.
el: Σε αντίθεση με λειτουργίες άλλων tags, το ``simple_tag`` περνάει την έξοδο του μέσα από τη συνάρτηση :func:`~django.utils.html.conditional_escape` αν το template context είναι σε λειτουργία autoescape, για να εξασφαλίσει σωστή HTML και για να σας προστατέψει από τρωτά σημεία του XSS.
id: Tidak seperti peralatan etiket lain, ``simple_tag`` melewatkan keluarannya melalui :func:`~django.utils.html.conditional_escape` jika konteks cetakan dalam suasana pelolosan otomatis, untuk memastikan HTML benar dan melindungi anda dari kerentanan XSS.

source: If additional escaping is not desired, you will need to use :func:`~django.utils.safestring.mark_safe` if you are absolutely sure that your code does not contain XSS vulnerabilities. For building small HTML snippets, use of :func:`~django.utils.html.format_html` instead of ``mark_safe()`` is strongly recommended.
el: Αν δεν επιθυμείτε κάποιο πρόσθετο escaping, θα χρειαστεί να χρησιμοποιήσετε τη συνάρτηση :func:`~django.utils.safestring.mark_safe` αν είστε απόλυτα σίγουροι ότι ο κώδικας σας δεν είναι ευάλωτος σε XSS επιθέσεις. Για το χτίσιμο μικρών HTML αποσπασμάτων, η χρήση της συνάρτησης :func:`~django.utils.html.format_html` προτείνεται έναντι της ``mark_safe()``.
id: Jika tambahan pelolosan tidak diharapkan, anda akan butuh menggunakan :func:`~django.utils.safestring.mark_safe` jika anda sepenuhnya yakin bahwa kode anda tidak mengandung kerentanan XSS. Untuk membangun potongan kecil HTML, gunakan :func:`~django.utils.html.format_html` daripada ``mark_safe()`` sangat kuat dianjurkan.

source: Auto-escaping for ``simple_tag`` as described in the previous two paragraphs was added.
el: Προστέθηκε η λειτουργία του auto-escaping για το ``simple_tag``, όπως περιγράφηκε στις προηγούμενες δύο παραγράφους.
id: Pelolosan otomatis untuk ``simple_tag`` seperti digambarkan dalam dua paragraf sebelumnya telah ditambahkan.

source: If your template tag needs to access the current context, you can use the ``takes_context`` argument when registering your tag::
el: Αν το template tag χρειάζεται να έχει πρόσβαση στο τρέχων template context, μπορείτε να χρησιμοποιήσετε την παράμετρο ``takes_context`` όταν κάνετε register το tag σας::
id: Jika etiket cetakan anda butuh untuk mengakses konteks saat ini, anda dapat menggunakan argumen ``takes_context`` ketika mendaftarkan etiket anda::

source: Note that the first argument *must* be called ``context``.
el: Σημειώστε ότι η πρώτη παράμετρος *πρέπει* να ονομαστεί ``context``.
id: Catat bahwa argumen pertama *harus* dipanggil ``context``.

source: For more information on how the ``takes_context`` option works, see the section on :ref:`inclusion tags<howto-custom-template-tags-inclusion-tags>`.
el: Για περισσότερες πληροφορίες σχετικά με τη λειτουργία της παραμέτρου ``takes_context``, δείτε στην ενότητα :ref:`inclusion tags<howto-custom-template-tags-inclusion-tags>`.
id: Untuk informasi lebih pada bagaimana pilihan ``takes_context`` bekerja, lihat bagian pada :ref:`inclusion tags<howto-custom-template-tags-inclusion-tags>`.

source: If you need to rename your tag, you can provide a custom name for it::
el: Αν χρειαστεί να μετονομάσετε το tag σας, μπορείτε να του δώσετε ένα δικό σας όνομα::
id: Jika anda butuh menamai kembali etiket anda, anda dapat menyediakan nama penyesuaian untuknya::

source: ``simple_tag`` functions may accept any number of positional or keyword arguments. For example::
el: Οι συναρτήσεις ``simple_tag`` μπορούν να δεχτούν απεριόριστο αριθμό από positional ή keyword arguments. Για παράδειγμα::
id: Fungsi ``simple_tag`` mungkin menerima angka apapun dari argumen terkait atau kata kunci. Sebagai contoh::

source: Then in the template any number of arguments, separated by spaces, may be passed to the template tag. Like in Python, the values for keyword arguments are set using the equal sign ("``=``") and must be provided after the positional arguments. For example:
el: Μετά, στο template, όλα τα arguments διαχωρισμένα με κενά (space character) μπορούν να περαστούν στο template tag. Όπως και στην Python, οι τιμές των keyword arguments ορίζονται με το σύμβολο της ισότητας ("``=``") και πρέπει να δηλωθούν μετά τα positional arguments. Για παράδειγμα:
id: Kemudian dalam cetakan angka apapun dari argumen, dipisahkan oleh spasi, mungkin dilewatkan ke cetakan etiket. Seperti dalam Python, nilai untuk argumen katakunci disetel menggunakan tanda sama dengan ("``=``") dan harus disediakan setelah penempatan argumen. Sebagai contoh:

source: It's possible to store the tag results in a template variable rather than directly outputting it. This is done by using the ``as`` argument followed by the variable name. Doing so enables you to output the content yourself where you see fit:
el: Είναι πιθανόν να αποθηκεύσετε το αποτέλεσμα ενός tag σε μια template μεταβλητή παρά να την εμφανίζετε απ' ευθείας στο template σας. Αυτό γίνεται χρησιμοποιώντας το argument ``as`` ακολουθούμενο από το όνομα της template μεταβλητής όπου και θα αποθηκευτεί. Με αυτό τον τρόπο μπορείτε να εκτυπώσετε την τιμή αυτή οπουδήποτε αλλού στο template σας ή και με κάποια επιπλέον επεξεργασία (είτε σε αλλο tag ή φίλτρο):
id: Itu dimungkinkan untuk menyimpan hasil etiket dalam sebuah cetakan variabel daripada secara langsung mengeluarkannya. Ini dilakukan dengan menggunakan argumen ``as`` diikuti oleh nama variabel. Melakukannya mengadakan anda untuk mengeluarkan isi diri anda dimana anda melihatnya cocok:

source: Inclusion tags
id: Penyertaaan etiket

source: Another common type of template tag is the type that displays some data by rendering *another* template. For example, Django's admin interface uses custom template tags to display the buttons along the bottom of the "add/change" form pages. Those buttons always look the same, but the link targets change depending on the object being edited -- so they're a perfect case for using a small template that is filled with details from the current object. (In the admin's case, this is the ``submit_row`` tag.)
el: Ένας άλλο κοινός τύπος ενός template tag είναι ο τύπος που εμφανίζει κάποια δεδομένα κάνοντας rendering *ένα άλλο* template. Για παράδειγμα, το admin interface του Django χρησιμοποιεί δικά του template tags για να εμφανίζει τα κουμπιά στο κάτω μέρος της σελίδας της φόρμας που προσθέτετε ή αλλάζετε κάποιο object. Αυτά τα κουμπιά δείχουν παντού το ίδιο, αλλά το target του link αλάζει ανάλογα το object που επεξεργάζεται εκείνη τη στιγμή -- αποτελούν λοιπόν μια τέλεια περίπτωση για τη χρήση μικρών template το οποίο είναι γεμάτο λεπτομέρειες από το τρέχων object. (Στην περίπτωση του admin, το tag ονομάζεται ``submit_row``.)
id: Jenis umum lainnya dari cetakan etiket adalah jenis yang menampilkan beberapa data dengan membangun cetakan *lain*. Sebagai contoh, antarmuka admin Django menggunakan penyesuaian etiket cetakan untuk menampilkan tombol dibawah dari halaman formulir "add/change". Tombol-tombol tersebut selalu terlihat sama, tetapi ssaran tautan berubah tergantung pada obyek yang sedang disunting -- sehingga mereka kasus sempurna untuk menggunakan cetakan kecil yang diisi dengan rincian dari obyek saat ini. (Dalam kasus admin, ini adalah etiket ``submit_row``.)

source: These sorts of tags are called "inclusion tags".
el: Αυτού του είδους τα tags ονομάζονται "inclusion tags".
id: Urutan etiket ini dipanggil "penyertaan etiket".

source: Writing inclusion tags is probably best demonstrated by example. Let's write a tag that outputs a list of choices for a given ``Poll`` object, such as was created in the :ref:`tutorials <creating-models>`. We'll use the tag like this:
el: Η συγγραφή των inclusion tags φαίνεται καλύτερα μέσα από ένα παράδειγμα. Ας γράψουμε ένα tag το οποίο εξάγει μια λίστα από επιλογές για ένα δοθέν ``Poll`` object, το οποίο δημιουργήθηκε μέσα από το :ref:`δεύτερο μέρος του οδηγού μας <creating-models>`. Θα χρησιμοποιήσουμε το tag ως εξής:
id: Menulis pencatuman etiket adalah mungkin pertunjukan terbaik dengan contoh. Mari kita menulis sebuah etiket yang mengeluarkan daftar pilihan untuk obyek ``Poll`` yang diberikan, seperti dibuat dalam :ref:`tutorial <creating-models>`. Kami akan menggunakan etiket seperti ini:

source: ...and the output will be something like this:
el: ...και η έξοδος του θα μοιάζει κάπως έτσι:
id: ...dan keluaran akan kelihatan seperti ini:

source: First, define the function that takes the argument and produces a dictionary of data for the result. The important point here is we only need to return a dictionary, not anything more complex. This will be used as a template context for the template fragment. Example::
el: Πρώτα, πρέπει να ορίσετε τη συνάρτηση η οποία παίρνει το argument και επιστρέφει ένα dictionary από δεδομένα. Το σημαντικό εδώ είναι ότι το μόνο που χρειάζεται να επιστρέψουμε είναι ένα dictionary, όχι κάτι περίπλοκο. Αυτό θα χρησιμοποιηθεί ως template context για το κομμάτι του template. Παράδειγμα::
id: Pertama, tentukan fungsi yang mengambil argumen dan menghasulkan kamus dari data untuk hasil. Titik terpenting disini adalah kami hanya butuh mengembalikan sebauh kamus, bukan apapun lebih rumit. Ini akan digunakan sebagai konteks cetakan untuk fragmen cetakan. Contoh::

source: Next, create the template used to render the tag's output. This template is a fixed feature of the tag: the tag writer specifies it, not the template designer. Following our example, the template is very simple:
el: Επόμενο βήμα είναι να δημιουργήσετε το template το οποίο θα κάνει render την έξοδο του tag. Αυτό το template είναι ένα μόνιμο χαρακτηριστικό του tag: το προσδιορίζει ο συντάκτης του tag και όχι ο σχεδιαστής του template. Εν ακολουθία του παραδείγματος μας, το template είναι πολύ απλό:
id: Selanjutnya, buat cetakan digunakan untuk membangun keluaran etiket. Cetakan ini adalah fitur tetap dari etiket: penulis etiket menentukannya, bukan perancang etiket. Mengikuti contoh kami, cetakan sangat mudah:

source: Now, create and register the inclusion tag by calling the ``inclusion_tag()`` method on a ``Library`` object. Following our example, if the above template is in a file called ``results.html`` in a directory that's searched by the template loader, we'd register the tag like this::
el: Τώρα, δημιουργήστε και κάντε register το inclusion tag καλώντας τη μέθοδο ``inclusion_tag()`` σε ένα object της κλάσης ``Library``. Ακολουθώντας το παράδειγμα μας, αν το παραπάνω template βρίσκεται σε ένα αρχείο με το όνομα ``results.html`` σε κάποιο φάκελο που είναι ανιχνεύσιμος από τον template loader, θα κάναμε register το tag κάπως έτσι::
id: Sekarang, buat dan daftar penyertaan etiket dengan memanggil cara ``inclusion_tag()`` pada sebuah obyek ``Library``. Mengikuti contoh kami, jika cetakan diatas dalam sebuah berkas dipanggil ``results.html`` dalam sebuah direktori yang dicari oleh pemuat cetakan, kami akan mendaftar etiket seperti ini::

source: Alternatively it is possible to register the inclusion tag using a :class:`django.template.Template` instance::
el: Εναλλακτικά μπορείτε να κάνετε register το inclusion tag χρησιμοποιώντας ένα instance της κλάσης :class:`django.template.
id: Kemungkinan lain dia memungkinkan mendaftarkan pemasukan etiket menggunakan instace :class:`django.template.Template`::

source: ...when first creating the function.
el: ...όταν πρωτο-δημιουργείτε τη συνάρτηση.
id: ...ketika pertama membuat fungsi.

source: Sometimes, your inclusion tags might require a large number of arguments, making it a pain for template authors to pass in all the arguments and remember their order. To solve this, Django provides a ``takes_context`` option for inclusion tags. If you specify ``takes_context`` in creating a template tag, the tag will have no required arguments, and the underlying Python function will have one argument -- the template context as of when the tag was called.
el: Μερικές φορές, τα inclusion tags μπορεί να χρειάζονται έναν μεγάλο αριθμό από παραμέτρους, κάνοντας δύσκολο για τους συντάκτες των templates να περάσουν όλες τις παραμέτρους και να θυμούνται τη σειρά τους. Για την αντιμετώπιση αυτού του προβλήματος, το Django προσφέρει την επιλογή ``takes_context`` τύπου boolean για inclusion tags. Αν τη θέσετε ``True `` όταν δημιουργείτε τη συνάρτηση, το tag δεν θα έχει απαιτούμενες παραμέτρους και η Python συνάρτηση του tag θα έχει μόνο μια παράμετρο -- το template context όπως είναι όταν κλήθηκε το tag.
id: Terkadang, penyertaan etiket anda mungkin membutuhkan sejumlah besar argumen, membuatnya sakit untuk cetakan penulis melewatkan semua argumen dan mengingat urutan mereka. Untuk mengatasi ini, Django menyediakan sebuah pilihan ``takes_context`` untuk penyertaan etiket. Jika anda menentukan ``takes_context`` dalam sebuah cetakan etiket, etiket akan tidak membutuhkan argumen, dan pokok fungsi Python akan mempunyai satu argumen -- konteks cetakan mulai ketika etiket dipanggil.

source: For example, say you're writing an inclusion tag that will always be used in a context that contains ``home_link`` and ``home_title`` variables that point back to the main page. Here's what the Python function would look like::
el: Για παράδειγμα, ας υποθέσουμε ότι γράφετε ένα inclusion tag το οποίο θα χρησιμοποιείται πάντα σε κάποιο context που περιέχει τις μεταβλητές ``home_link`` και ``home_title`` οι οποίες θα οδηγούν πίσω στην αρχική σελίδα. Η Python συνάρτηση του tag θα δείχνει κάπως έτσι::
id: Sebagai contoh, katakan anda sedang menulis sebuah penyertaan etiket yang akan selalu digunakan dalam sebuah konteks yang mengandung variabel ``home_link`` dan ``home_title`` yang menunjuk kembali ke halaman utama. Disini fungsi Python akan kelihatan seperti::

source: Note that the first parameter to the function *must* be called ``context``.
el: Σημειώστε ότι η πρώτη παράμετρος της συνάρτησης *πρέπει* να ονομάζεται ``context``.
id: Catat bahwa parameter pertama pada fungsi *harus* dipanggil ``context``.

source: In that ``register.inclusion_tag()`` line, we specified ``takes_context=True`` and the name of the template. Here's what the template ``link.html`` might look like:
el: Στη γραμμή ``register.inclusion_tag()``, προσδιορίσαμε το keyword argument ``takes_context=True`` και το όνομα του template. Το template ``link.html`` θα δείχνει κάπως έτσι:
id: Dalam baris ``register.inclusion_tag()`` itu, kami mencirikan ``takes_context=True`` dan nama dari cetakan. Ini adalah cetakan ``link.html`` mungkin kelihatan seperti:

source: Then, any time you want to use that custom tag, load its library and call it without any arguments, like so:
el: Έπειτα, κάθε φορά που θέλετε να χρησιμοποιήσετε αυτό το tag, φορτώστε τη βιβλιοθήκη (``{% load <όνομα_αρχείου> %}``) και καλέσετε τη χωρίς ορίσματα, ως εξής:
id: Lalu, kapanpun anda ingin menggunakan tag tersuai, muat pustakanya dan panggil tanpa argument, seperti:

source: Note that when you're using ``takes_context=True``, there's no need to pass arguments to the template tag. It automatically gets access to the context.
el: Σημειώστε ότι, όταν χρησιμοποιείτε το ``takes_context=True``, δεν χρειάζεται να περάσετε παραμέτρους μέσα στο template tag. Αυτόματα, έχει πρόσβαση στο template context.
id: Catat bahwa ketika anda menggunakan ``takes_context=True``, tidak perlu melewatkan argumen ke etiket cetakan. Dia otomatis mendapatkan akses ke konteks.
