Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Put a ``__str__()`` (``__unicode__()`` on Python 2) method on the class you're wrapping up as a field. There are a lot of places where the default behavior of the field code is to call :func:`~django.utils.encoding.force_text` on the value. (In our examples in this document, ``value`` would be a ``Hand`` instance, not a ``HandField``). So if your ``__str__()`` method (``__unicode__()`` on Python 2) automatically converts to the string form of your Python object, you can save yourself a lot of work.
el: Υλοποιήστε τη μέθοδο ``__str__()`` (την ``__unicode__()`` αν δουλεύετε με την Python 2) στην κλάση που δηλώνεται ως πεδίο. Υπάρχουν πολλά μέρη όπου η προεπιλεγμένη συμπεριφορά του κώδικα του πεδίου καλεί τη συνάρτηση :func:`~django.utils.encoding.force_text` χρησιμοποιώντας την τιμή (στα παραδείγματα μας σε αυτό το άρθρο, η τιμή, ``value``, θα είναι ένα instance της κλάσης ``Hand`` και όχι της ``HandField``). Οπότε αν η μέθοδος ``__str__()`` (``__unicode__()`` στην Python 2) μετατρέπει αυτόματα το Python object σε μια μορφή string, θα γλυτώσετε πολύ χρόνο.
id: Taruh sebuah cara ``__str__()`` (``__unicode__()`` pada Python 2) pada kelas anda sedang bungkus sebagai sebuah bidang. Ada banyak tempat dimana kebiasaan awal dari kode bidang adalah memanggil :func:`~django.utils.encoding.force_text` pada nilai. (Dalam contoh kami di dokumen ini, ``value`` akan menjadi instance ``Hand``, bukan sebuah ``HandField``). Jadi jika cara ``__str__()`` anda (``__unicode__()`` pada Python 2) otomatis merubah ke bentuk deretan karakter dari obyek Python anda, anda dapat menyimpan banyak pekerjaan.

source: Writing a ``FileField`` subclass
el: Γράφοντας μια subclass ενός πεδίου τύπου ``FileField``
id: Menulis subkelas ``FileField``

source: In addition to the above methods, fields that deal with files have a few other special requirements which must be taken into account. The majority of the mechanics provided by ``FileField``, such as controlling database storage and retrieval, can remain unchanged, leaving subclasses to deal with the challenge of supporting a particular type of file.
el: Επιπροσθέτως των παραπάνω μεθόδων, τα πεδια που ασχολούνται με αρχεία έχουν μερικές ακόμη απαιτήσεις, τις οποίες πρέπει να λάβετε υπόψιν σας. Η πλειονότητα των μηχανισμών που προσφέρει ένα πεδίο τύπου ``FileField``, όπως ο έλεγχος της μονάδας αποθήκευσης της βάσης δεδομένων (database storage) καθώς και της ανάκτησης, μπορεί να μείνει ανέπαφος, αφήνοντας τις subclasses να χειριστούν την πρόκληση της υποστήριξης ενός συγκεκριμένου τύπου αρχείου.
id: Dalam tambahan pada cara diatas, bidang-bidang yang berurusan dengan berkas-berkas mempunyai sedikit persyaratan khusus lainnya yang harus diambil kedalam akun. Kebanyakan dari mekanisme disediakan oleh ``FileField``, seperti mengendalikan penyimpanan basisdata dan pengambilan, dapat tetap tidak berubah, meninggalkan subkelas-subkelas untuk berurusan dengan tantangan dari mendukung jenis khusus dari berkas.

source: Django provides a ``File`` class, which is used as a proxy to the file's contents and operations. This can be subclassed to customize how the file is accessed, and what methods are available. It lives at ``django.db.models.fields.files``, and its default behavior is explained in the :doc:`file documentation </ref/files/file>`.
el: Το Django προσφέρει μια κλάση ``File``, που χρησιμοποιείται ως μεσάζων (proxy) στα περιεχόμενα και λειτουργίες του αρχείου. Αυτή η κλάση μπορεί να γίνει subclass προκειμένου να παραμετροποιηθεί η πρόσβαση στο αρχείο και το ποιες μέθοδοι θα είναι διαθέσιμες. Βρίσκεται στο ``django.db.models.fields.files`` και η προεπιλεγμένη συμπεριφορά του εξηγείται στο :doc:`εγχειρίδιο για αρχεία </ref/files/file>`.
id: Django menyediakan sebuah kelas ``File``, yang digunakan sebagai sebuah proxy pada isi berkas dan tindakan. Ini dapat disubkelaskan ke menyesuaikan bagaimana berkas diakses, dan cara apa yang tersedia. Dia tinggal di ``django.db.models.fields.files``, dan kebiasaan awalnya adalah dijelaskan dalam :doc:`file documentation </ref/files/file>`.

source: Once a subclass of ``File`` is created, the new ``FileField`` subclass must be told to use it. To do so, simply assign the new ``File`` subclass to the special ``attr_class`` attribute of the ``FileField`` subclass.
el: Όταν μια subclass της κλάσης ``File`` δημιουργηθεί, η νέα subclass ``FileField`` θα πρέπει να ξέρει πως να χρησιμοποιήσει τη subclass της ``File``. Για να γίνει αυτό, πρέπει να ορίσετε το ξεχωριστό attribute ``attr_class`` της ``FileField`` στην τιμή της νέας subclass της ``File``.
id: Sekali sebuah subkelas dari ``File`` dibuat, subkelas ``FileField`` harus diberitahu untuk menggunakannya. Untuk melakukannya, cukup tetapkan subkelas ``File`` baru ke atribut ``attr_class`` khusus dari subkelas ``FileField``.

source: A few suggestions
el: Μερικές προτάσεις
id: Sedikit saran

source: In addition to the above details, there are a few guidelines which can greatly improve the efficiency and readability of the field's code.
el: Πέρα από τις παραπάνω λεπτομέρειες, υπάρχουν μερικές κατευθυντήριες γραμμές οι οποίες μπορούν να βελτιώσουν την αποδοτικότητα και την αναγνωσιμότητα του κώδικα του πεδίου σας.
id: Sebagai tambahan pada rincian diatas, terdapat sedikit panduan yang dapat meningkatkan efisiensi dan kesiapan dari kode bidang.

source: The source for Django's own ``ImageField`` (in ``django/db/models/fields/files.py``) is a great example of how to subclass ``FileField`` to support a particular type of file, as it incorporates all of the techniques described above.
el: Ο πηγαίος κώδικας του πεδίου ``ImageField`` του Django (βρίσκεται στο αρχείο ``django/db/models/fields/files.py``) είναι ένα καλό παράδειγμα του πως να κάνετε subclass την κλάση ``FileField`` για να υποστηρίξετε έναν συγκεκριμένο τύπο αρχείου, καθώς υιοθετεί όλες τις τεχνικές που αναφέρθηκαν παραπάνω.
id: Sumber untuk ``ImageField`` sendiri Django (dalam ``django/db/models/fields/files.py``) adalah contoh hebat dari bagaimana untuk mensubkelaskan ``FileField`` untuk mendukung jenis khusus dari berkas, karena menggabungkan semua teknik digambarkan diatas.

source: Cache file attributes wherever possible. Since files may be stored in remote storage systems, retrieving them may cost extra time, or even money, that isn't always necessary. Once a file is retrieved to obtain some data about its content, cache as much of that data as possible to reduce the number of times the file must be retrieved on subsequent calls for that information.
el: Όσο μπορείτε να κάνετε cache τα attributes του αρχείου. Εφόσον τα αρχεία μπορεί να αποθηκεύονται σε απομακρυσμένα συστήματα αποθήκευσης, η ανάκτηση τους μπορεί να κοστίσει επιπλέον άσκοπο χρόνο ή ακόμη και χρήματα. Όταν ένα αρχείο ανακτάται ούτως ώστε να δείτε κάποιες πληροφορίες σχετικά με τα περιεχόμενα του, κάντε cache (αποθηκεύστε τα στη λανθάνουσα μνήμη) όσα περισσότερα δεδομένα μπορείτε για να μειώσετε τον αριθμό μελλοντικών προσπελάσεων του αρχείου για την απόκτηση των ίδιων πληροφοριών.
id: Menembolok atribut berkas dimanapaun memungkinkan. Sejak berkas-berkas mungkin disimpan dalam sistem penyimpanan jauh, mengambil mereka mungkin memakan waktu tambahan, atau bahkan uang, yang tidak selalu dibutuhkan. Sekali sebuah berkas diambil untuk mendapatkan beberapa data tentang isinya, tembolok sebanyak mungkin data tersebut untuk mengurangi jumlah kali berkas harus diambil pada pemanggilan berikut untuk informasi itu.

source: Custom template tags and filters
el: Γράφοντας δικά σας template tags και φίλτρα
id: Penyesuaian etiket cetakan dan saringan

source: Django's template language comes with a wide variety of :doc:`built-in tags and filters </ref/templates/builtins>` designed to address the presentation logic needs of your application. Nevertheless, you may find yourself needing functionality that is not covered by the core set of template primitives. You can extend the template engine by defining custom tags and filters using Python, and then make them available to your templates using the :ttag:`{% load %}<load>` tag.
el: Η γλώσσα template του Django έρχεται με μια μεγάλη ποικιλία από :doc:`προεγκατεστημένα tags και φίλτρα </ref/templates/builtins>` που έχουν σχεδιαστεί για να αντιμετωπίσουν τις ανάγκες της παρουσίασης της εφαρμογής σας. Παρόλ' αυτά, ίσως χρειαστείτε κάποια λειτουργία η οποία δεν υπάρχει στο βασικό πακέτο των template tags και φίλτρων. Μπορείτε να επεκτείνετε την template μηχανή του Django ορίζοντας δικά σας tags και φίλτρα χρησιμοποιώντας, τι άλλο, Python. Αφού τα δημιουργήσετε μπορείτε να τα χρησιμοποιήσετε στα templates σας αφού πρώτα τα φορτώσετε με το tag :ttag:`{% load %}<load>`.
id: Cetakan bahasa Django datang dengan beragam luas dari :doc:`built-in tags and filters </ref/templates/builtins>` dirancang untuk megnalamatkan kebutuhan pembawaan logis dari aplikasi anda. Namun, anda mungkin menemukan diri anda sendiri membutuhkan fungsi yang tidak dicakupi oleh inti kumpulan dari cetakan primitif. Anda dapat memperpanjang cetakan mesin dengan menentukan penyesuaian etiket dan penyaring menggunakan Python, dan membuat mereka tersedua pada cetakan anda menggunakan etiket :ttag:`{% load %}<load>`.

source: Code layout
el: Διάταξη κώδικα
id: Tata letak kode

source: The most common place to specify custom template tags and filters is inside a Django app. If they relate to an existing app, it makes sense to bundle them there; otherwise, they can be added to a new app. When a Django app is added to :setting:`INSTALLED_APPS`, any tags it defines in the conventional location described below are automatically made available to load within templates.
el: Το πιο κοινό μέρος για να προσδιορίσετε τα δικά σας template tags και φίλτρα είναι μέσα στη Django εφαρμογή σας. Αν σχετίζονται, δε, και με την ήδη υπάρχουσα εφαρμογή, τότε είναι πολύ λογικό να ζουν μέσα στο φάκελο της. Αν όχι, τότε μπορούν να προστεθούν σε κάποια καινούργια εφαρμογή. Αν τα δικά σας template tags και φίλτρα αφορούν γενικά το project ή κάποια άλλη λειτουργία, μπορείτε να φτιάξετε μια νέα εφαρμογή πχ my_utils και να τα αποθηκεύσετε εκεί. Όταν ένα Django app προστίθεται στη λίστα :setting:`INSTALLED_APPS`, οποιοδήποτε tag που είναι ορισμένο στη συμβατική τοποθεσία που περιγράφεται παρακάτω, αυτόματα γίνεται διαθέσιμο για να φορτωθεί μέσα στα templates.
id: Tempat paling umum untuk menentukan cetakan etiket dan penyaring adalah didalam aplikasi Django. Jika mereka terhubung pada aplikasi yang ada, dia masuk akal untuk menggabungkan mereka; kalau tidak, mereka dapat ditambahkan ke aplikasi baru. Ketika aplikasi Django ditambahkan ke :setting:`INSTALLED_APPS`, etiket apapun dia tentukan dalam tempat biasa dibawah otomatis dibuat tersedia untuk dimuat dengan cetakan.

source: The app should contain a ``templatetags`` directory, at the same level as ``models.py``, ``views.py``, etc. If this doesn't already exist, create it - don't forget the ``__init__.py`` file to ensure the directory is treated as a Python package.
el: Η εφαρμογή πρέπει να περιέχει ένα φάκελο ``templatetags``, στο ίδιο επίπεδο με τα αρχεία ``models.py``, ``views.py``, κλπ. Αν ο φάκελος δεν υπάρχει ήδη, δημιουργήστε τον – μη ξεχάσετε να προσθέσετε το αρχείο ``__init__.py`` για να εξασφαλίσετε ότι ο φάκελος αυτός θα αντιμετωπιστεί ως ένα Python package.
id: Aplikasi harus mengandung sebuah direktori ``templatetags``, pada tingkatan sama seperti ``models.py``, ``views.py``, dll. Jika ini tidak ada, buat dia - jangan lupakan berkas ``__init__.py`` untuk memastikan direktori diperlakukan sebagai paket Python.

source: Development server won't automatically restart
el: Ο development server δεν θα επανεκκινήσει αυτόματα
id: Peladen pengembangan tidak akan otomatis nyala kembali

source: After adding the ``templatetags`` module, you will need to restart your server before you can use the tags or filters in templates.
el: Αφού προσθέσετε το module ``templatetags``, θα χρειαστεί να επανεκκινήσετε χειροκίνητα τον server πριν χρησιμοποιήσετε τα tags ή τα φίλτρα στα templates.
id: Setelah menambahkan modul ``templatetags``, anda akan butuh memulai kembali peladen anda sebelum anda dapat menggunakan etiket atau penyaring dalam cetakan.

source: Your custom tags and filters will live in a module inside the ``templatetags`` directory. The name of the module file is the name you'll use to load the tags later, so be careful to pick a name that won't clash with custom tags and filters in another app.
el: Τα δικά σας tags και φίλτρα θα υπάρχουν σε ένα module (όποτε λέμε module εννοούμε ένα φάκελο μαζί με το κενό αρχείο ``__init__.py`` μέσα του) μέσα στο ``templatetags``. Το όνομα αυτού του module θα είναι αυτό που θα χρησιμοποιείτε αργότερα, για να φορτώνετε τα tags/φίλτρα, οπότε να είστε προσεκτικοί στην επιλογή του ονόματος ούτως ώστε να μην προκύψουν modules με το ίδιο όνομα σε άλλη εφαρμογή.
id: Penyesuaian etiket dan penyaring anda akan berada dalam sebuah modul didalam direktori ``templatetags``. Nama dari berkas modul adalah nama anda akan gunakan untuk memuat etiket kemudian, jadi berhati-hatilah untuk mengambil sebuah nama yang tidak akan bentrok dengan penyesuaian etiket dan penyaring di aplikasi lain.

source: For example, if your custom tags/filters are in a file called ``poll_extras.py``, your app layout might look like this::
el: Για παράδειγμα, αν τα δικά σας tags/φίλτρα βρίσκονται σε ένα αρχείο με το όνομα ``poll_extras.py``, η δομή των αρχείων της εφαρμογής σας θα δείχνει κάπως έτσι::
id: Sebagai contoh, jika penyesuaian etiket/penyaring anda berada dalam sebuah berkas yang dipanggil ``poll_extras.py``, tata letak eplikasi anda mungkin terlihat seperti ini::

source: And in your template you would use the following:
el: Και μέσα στο template σας θα μπορείτε να κάνετε διαθέσιμα τα tags/φίλτρα αυτού του αρχείου ως εξής:
id: Dan di cetakan anda, anda akan menggunakan berikut:

source: The app that contains the custom tags must be in :setting:`INSTALLED_APPS` in order for the :ttag:`{% load %}<load>` tag to work. This is a security feature: It allows you to host Python code for many template libraries on a single host machine without enabling access to all of them for every Django installation.
el: Η εφαρμογή που περιέχει τα δικά σας tags πρέπει να βρίσκεται μέσα στα :setting:`INSTALLED_APPS` προκειμένου το tag :ttag:`{% load %}<load>` να δουλέψει. Αυτό γίνεται για λόγους ασφαλείας: σας επιτρέπει να έχετε Python κώδικα από πολλές template βιβλιοθήκες σε μια μηχανή χωρίς να δοθεί πρόσβαση σε όλες αυτές για κάθε εγκατάσταση του Django.
id: Aplikasi yang mengandung penyesuaian etiket harus berada dalam :setting:`INSTALLED_APPS` agar etiket :ttag:`{% load %}<load>` bekerja. Ini adalah fitur keamanan: Dia mengizinkan anda untuk menempatkan kode Python untuk banyak cetakan pustaka pada sebuah mesin rumah tunggal tanpa mengadakan akses ke semua dari mereka untuk setiap pemasangan Django.

source: There's no limit on how many modules you put in the ``templatetags`` package. Just keep in mind that a :ttag:`{% load %}<load>` statement will load tags/filters for the given Python module name, not the name of the app.
el: Δεν υπάρχει όριο στον αριθμό των modules που θα βάλετε μέσα στο ``templatetags``. Θυμηθείτε όμως ότι το tag :ttag:`{% load %}<load>` θα φορτώσει τα tags/φίλτρα για το δοθέν όνομα του Python module που βρίσκεται μέσα στο ``templatetags``, όχι το όνομα της εφαρμογής.
id: Tidak ada batasan pada bagaimana banyak modul anda taruh dalam paket ``templatetags``. Hanya perlu diingat bahwa sebuah pernyataan :ttag:`{% load %}<load>` akan memuatetiket/penyaring untuk nama modul Python yang diberikan, bukan nama dari aplikasi.

source: To be a valid tag library, the module must contain a module-level variable named ``register`` that is a ``template.Library`` instance, in which all the tags and filters are registered. So, near the top of your module, put the following::
el: Για να είναι μια έγκυρη tag βιβλιοθήκη, το module πρέπει να περιέχει μια μεταβλητή, επιπέδου module, με το όνομα ``register``, ήτοι ένα instance της κλάσης ``template.Library``, με την οποία όλα τα tags και τα φίλτρα θα γίνουν register. Επομένως, στην αρχή του module ``poll_extras.py``, προσθέστε τα ακόλουθα::
id: Untuk menjadi pustaka sah, modul harus mengandung sebuah variabel tingkat-modul yang dinamai ``register`` yaitu sebuah instance ``template.Library``, dimana semua etiket dan penyaring didaftarkan. Jadi dekat diatas modul anda, taruh berikut:

source: Alternatively, template tag modules can be registered through the ``'libraries'`` argument to :class:`~django.template.backends.django.DjangoTemplates`. This is useful if you want to use a different label from the template tag module name when loading template tags. It also enables you to register tags without installing an application.
el: Εναλλακτικά, τα modules του template tag μπορούν να γίνουν register μέσω του argument ``'libraries'`` της κλάσης :class:`~django.template.backends.django.DjangoTemplates`. Αυτό είναι χρήσιμο αν θέλετε να χρησιμοποιήσετε ένα διαφορετικό label από το όνομα του module όταν φορτώνετε τα template tags. Επίσης σας επιτρέπει να κάνετε register τα tags χωρίς την εγκατάσταση κάποια εφαρμογής.
id: Kalau tidak, cetakan modul etiket dapat didaftarkan melalui argumen ``'libraries'`` ke :class:`~django.template.backends.django.DjangoTemplates`. Ini berguna jika anda ingin menggunakan label berbeda dari nama cetakan modul etiket ketika memuat cetakan etiket. Dia juga mengadakan anda untuk mendaftar etiket tanpa memasang sebuah aplikasi.

source: Behind the scenes
el: Πίσω από τις σκηνές
id: Dibalik layar

source: For a ton of examples, read the source code for Django's default filters and tags. They're in ``django/template/defaultfilters.py`` and ``django/template/defaulttags.py``, respectively.
el: Για πάρα πολλά παραδείγματα, διαβάστε τους πηγαίους κώδικες του Django σχετικά με τα προεγκατεστημένα φίλτρα και tags. Βρίσκονται στο ``django/template/defaultfilters.py`` και ``django/template/defaulttags.py``, αντίστοιχα.
id: Untuk banyak contoh, baca kode sumber untuk penatingan dan etiket awal Django. Mereka berada di ``django/template/defaultfilters.py`` dan ``django/template/defaulttags.py``, masing-masing.

source: For more information on the :ttag:`load` tag, read its documentation.
el: Για περισσότερες πληροφορίες σχετικά με το tag :ttag:`load`, διαβάστε το εγχειρίδιο του.
id: Untuk informasi lebih pada etiket :ttag:`load`, baca dokumentasinya.

source: Writing custom template filters
el: Γράφοντας δικά σας template φίλτρα
id: Menulis saringan cetakan penyesuaian

source: Custom filters are just Python functions that take one or two arguments:
el: Τα παραμετροποιήσιμα φίλτρα είναι απλώς Python συναρτήσεις οι οποίες δέχονται ένα ή δύο arguments:
id: Saringan penyesuaian hanyalah fungsi fungsi yang mengambil satu atau dua argumen:

source: The value of the variable (input) -- not necessarily a string.
el: Την τιμή της μεταβλητής (input) -- όχι απαραίτητα τύπου string.
id: Nilai dari variabel (masukan) -- tidak perlu deretan karakter.

source: The value of the argument -- this can have a default value, or be left out altogether.
el: Την τιμή του argument (αν υπάρχει) -- αυτή μπορεί να είναι μια προεπιλεγμένη τιμή ή να μην υπάρχει καθόλου.
id: Nilai dari argumen -- ini dapat mempunyai nilai awal, atau ditinggalkan sama sekali.

source: For example, in the filter ``{{ var|foo:"bar" }}``, the filter ``foo`` would be passed the variable ``var`` and the argument ``"bar"``.
el: Για παράδειγμα, μέσα στη σύνταξη του φίλτρου ``{{ var|foo:"bar" }}``, το φίλτρο ``foo`` θα λάβει μια μεταβλητή ``var`` (input) και ένα argument ``"bar"``.
id: Sebagai contoh, dalam saringan ``{{ var|foo:"bar" }}``, the filter ``foo`` akan dilewatkan variabel ``var`` dan argumen ``''bar''``.

source: Since the template language doesn't provide exception handling, any exception raised from a template filter will be exposed as a server error. Thus, filter functions should avoid raising exceptions if there is a reasonable fallback value to return. In case of input that represents a clear bug in a template, raising an exception may still be better than silent failure which hides the bug.
el: Εφόσον η γλώσσα του template δεν παρέχει exception handling, κάθε exception που θα γίνει raised από ένα template filter θα εμφανιστεί ως server error. Επομένως, οι συναρτήσεις των φίλτρων θα πρέπει να αποφεύγουν να κάνουν raise τυχόν exceptions αν υπάρχει κάποια λογική τιμή να επιστραφεί, ως fallback. Σε περίπτωση κάποιου input λόγω του οποίου φαίνεται ξεκάθαρα κάποιο bug στο template, το να κάνετε raise κάποιο exception είναι καλύτερο από το να το αφήσετε απαρατήρητο κάτι το οποίο θα κρύψει το bug.
id: Sejak cetakan bahasa tidak menyediakan penanganan pengecualian, setiap pengecualian yang muncul dari sebuah cetakan saringan akan tidak terlindungi sebagai sebuah kesalahan peladen. Dengan demikian, fungsi penyaring harus menghindari memunculkan pengecualian jika ada alasan nilai mundur untuk kembali. Dalam kasus dari masukan yang mewakili kesalahan jelas dalam sebuah cetakan, menampilkan pencegualian mungkin masih lebih baik daripada kegagalan diam yang menyembunyikan kesalahan.

source: Here's an example filter definition::
el: Παρακάτω φαίνεται ένα παράδειγμα ορισμού ενός φίλτρου::
id: Ini adalah sebuah contoh pengertian saringan ::

source: And here's an example of how that filter would be used:
el: Και εδώ φαίνεται ένα παράδειγμα του πως θα χρησιμοποιηθεί αυτό το φίλτρο στο template:
id: Dan ini adalah sebuah contoh bagaimana saringan itu akan digunakan:

source: Most filters don't take arguments. In this case, just leave the argument out of your function. Example::
el: Τα περισσότερα φίλτρα δεν παίρνουν arguments. Σε αυτή την περίπτωση, απλώς αφήστε το εκτός από την συνάρτηση σας. Παράδειγμα::
id: Kebanyakan saringan tidak mengambil argumen. Dalam kasus ini, tinggalkan argumen dari fungsi anda. Contoh::

source: Registering custom filters
el: Κάνοντας register τα δικά σας φίλτρα
id: Mendaftarkan saringan penyesuaian

source: Once you've written your filter definition, you need to register it with your ``Library`` instance, to make it available to Django's template language::
el: Όταν γράψετε τον ορισμό του φίλτρου σας, θα χρειαστεί να το κάνετε register με το instance της κλάσης ``Library``, για να το κάνετε διαθέσιμο στη γλώσσα template του Django::
id: Sekali anda telah menulis arti saringan anda, anda butuh mendaftarkannya dengan instance ``Library`` anda, untuk membuatnya tersedia pada bahasa cetakan Django::

source: The ``Library.filter()`` method takes two arguments:
el: Η μέθοδος ``Library.filter()`` παίρνει δύο ορίσματα:
id: Cara ``Library.filter()`` mengambil dua argumen:

source: The name of the filter -- a string.
el: Το όνομα του φίλτρου -- τύπου string.
id: Nama dari saringan -- sebuah deretan karakter.

source: The compilation function -- a Python function (not the name of the function as a string).
el: Τη συνάρτηση του φίλτρου -- μια Python συνάρτηση (όχι το όνομα της συνάρτησης ως string).
id: Fungsi himpunan -- Sebuah fungsi Python (bukan nama fungsi sebagai deretan karakter).

source: You can use ``register.filter()`` as a decorator instead::
el: Μπορείτε, αντ' αυτού, να χρησιμοποιήσετε τη μέθοδο ``register.filter()`` ως decorator::
id: Anda dapat menggunakan ``register.filter()`` sebagai penghias::

source: If you leave off the ``name`` argument, as in the second example above, Django will use the function's name as the filter name.
el: Αν δεν περάσετε το όρισμα ``name``, όπως στο δεύτερο παράδειγμα παραπάνω, το Django θα χρησιμοποιήσει το όνομα της συνάρτησης ως το όνομα του φίλτρου.
id: Jika anda tidak mengubah argumen ``name``, seperti di contoh kedua di atas, Django akan menggunakan nama fungsi sebagai nama filter.
