Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: If ``django-admin`` only displays the help text no matter what arguments it is given, there is probably a problem with the file association in Windows. Check if there is more than one environment variable set for running Python scripts in ``PATH``. This usually occurs when there is more than one Python version installed.
el: Αν η εντολή ``django-admin`` εμφανίζει μόνο το βοηθητικό μήνυμα ανεξαρτήτως των παραμέτρων που δίνονται, τότε πιθανόν υπάρχει πρόβλημα στα Windows με το file association. Ελέγξτε αν υπάρχει παραπάνω από μια environment variable στο ``PATH``, που να είναι ρυθμισμένη για να τρέχει Python scripts. Αυτό συνήθως συμβαίνει όταν είναι παραπάνω από μια εκδόσεις της Python εγκατεστημένες στο σύστημα σας.
id: Jika ``django-admin`` hanya menampilkan teks bantuan tidak perduli argumen apa yang diberikan, ada kemungkinan masalah dengan berkas terkait di Windows. Periksa jika ada lagi dari satu kumpulan lingkungan variabel untuk menjalankan tulisan Python dalam ``PATH``. Ini biasanya muncul ketika ada lebih dari satu versi Python terpasang.

source: If you are connecting to the internet behind a proxy, there might be problem in running the command ``pip install django``. Set the environment variables for proxy configuration in the command prompt as follows::
el: Αν συνδέεστε στο internet μέσω ενός proxy, ίσως να υπάρξει πρόβλημα κατά την εκτέλεση της εντολής ``pip install django``. Δείτε τις environment variables για ρύθμιση του proxy μέσω της γραμμής εντολών, όπως παρακάτω::
id: Jika anda sedang terhubung ke internet di belakang proxy, kemungkinan menjadi masalah dalam menjalankan perintah ``pip install django``. Setel lingkungan variabel untuk konfigurasi proxy dalam command prompt sebagai berikut::

source: Writing database migrations
el: Γράφοντας migrations για τη βάση δεδομένων
id: Menulis perpindahan basisdata

source: This document explains how to structure and write database migrations for different scenarios you might encounter. For introductory material on migrations, see :doc:`the topic guide </topics/migrations>`.
el: Αυτό το άρθρο εξηγεί πως να δομήσετε και να γράψετε migrations για τη βάση δεδομένων (database migrations), βασιζόμενοι σε διαφορετικά σενάρια που μπορεί να συναντήσετε. Για μια εισαγωγή στα migrations, δείτε στο άρθρο :doc:`migrations </topics/migrations>`.
id: Dokumen ini menjelaskan bagaimana menyusun dan menulis perpindahan basisdata untuk skenario berbeda anda mungkin hadapi. Untuk bahan perkenalan pada perpindahan, lihat :doc:`the topic guide </topics/migrations>`.

source: Data migrations and multiple databases
el: Data migrations και πολλαπλές βάσεις δεδομένων
id: Perpindahan data dan banyak basisdata

source: When using multiple databases, you may need to figure out whether or not to run a migration against a particular database. For example, you may want to **only** run a migration on a particular database.
el: Όταν χρησιμοποιείτε πολλές βάσεις δεδομένων, συχνά θα βρίσκεστε σε δίλλημα να τρέξετε ένα migration σε κάποια συγκεκριμένη βάση δεδομένων. Για παράδειγμα, ίσως να θέλετε να τρέξετε ένα migration **μόνο** για μια συγκεκριμένη βάση δεδομένων.
id: Ketika menggunakan banyak basisdata, anda mungkin butuh memahami apakat atau tidak menjalankan perpindahan terhadap basisdata tertentu. Sebagai contoh, anda ingin **hanya** menjalankan perpindahan pada basisdata tertentu.

source: In order to do that you can check the database connection's alias inside a ``RunPython`` operation by looking at the ``schema_editor.connection.alias`` attribute::
el: Για να το κάνετε αυτό, ελέγξτε το alias της σύνδεσης της βάσης δεδομένων μέσα σε μια ``RunPython`` λειτουργία, κοιτώντας το attribute του ``schema_editor.connection.alias``::
id: Untuk melakukan itu anda dapat memeriksa nama lain hubungan basisdata didalam operasi ``RunPython`` dengan mencari atribut ``schema_editor.connection.alias``::

source: You can also provide hints that will be passed to the :meth:`allow_migrate()` method of database routers as ``**hints``:
el: Μπορείτε, επίσης, να δώσετε κάποια hints (πληροφορίες) οι οποίες θα περαστούν στη μέθοδο :meth:`allow_migrate()` των database routers ως ``**hints``:
id: Anda dapat juga menyediakan bayangan yang akan dilewatkan ke cara :meth:`allow_migrate()` dari router basisdata sebagai ``**hints``:

source: Then, to leverage this in your migrations, do the following::
el: Έπειτα, για να το αξιοποιήσετε αυτό στα migrations σας, κάντε τα ακόλουθα::
id: Kemudian, untuk mempengaruhi ini dalam pemindahan anda, lakukan berikut::

source: If your ``RunPython`` or ``RunSQL`` operation only affects one model, it's good practice to pass ``model_name`` as a hint to make it as transparent as possible to the router. This is especially important for reusable and third-party apps.
el: Αν η ``RunPython`` ή η ``RunSQL`` λειτουργία σας, επιδρά μόνο σε ένα μοντέλο, μια καλή πρακτική είναι να περάσετε το ``model_name`` ως hint για να το κάνετε όσο γίνεται πιο διαφανές στον router. Αυτό είναι ιδιαίτερα σημαντικό για επαναχρησιμοποιήσιμες και third-party εφαρμογές.
id: Jika `operasi `RunPython`` atau ``RunSQL`` anda hanya berpengaruh pada satu model, adalah latihan bagus untuk melewatkan ``model_name`` sebagai sebuah bayangan untuk membuatnya se transparan mungkin ke router. Ini khususnya penting untuk aplikasi digunakan kembali dan pihak ketiga.

source: Migrations that add unique fields
el: Migrations τα οποία προσθέτουν unique πεδία
id: Perpindahan yang menambah bidang unik

source: Applying a "plain" migration that adds a unique non-nullable field to a table with existing rows will raise an error because the value used to populate existing rows is generated only once, thus breaking the unique constraint.
el: Εφαρμόζοντας ένα "απλό" migration το οποίο προσθέτει ένα μοναδικό μη-κενό πεδίο (unique non-nullable field) σε έναν πίνακα με ήδη υπάρχουσες γραμμές, θα κάνει raise κάποιο σφάλμα επειδή δεν είναι δυνατόν να αναπαραχθεί κάποια μοναδική τιμή για κάθε γραμμή της στήλης αυτής. Επίσης δεν γίνεται να ορίσουμε μια default τιμή καθώς δεν μπορεί κάθε γραμμή να έχει την ίδια τιμή για αυτή τη στήλη.
id: Memberlakukan perpindahan "plain" yang menambahkan bidang bukan null unik ke sebuah tabel dengan baris yang ada akan menampilkan sebuah kesalahan karena nilai digunakan untuk mengumpulkan baris-baris yang ada dibangkitkan hanya sekali, demikian merusak pembatas unik.

source: Therefore, the following steps should be taken. In this example, we'll add a non-nullable :class:`~django.db.models.UUIDField` with a default value. Modify the respective field according to your needs.
el: Για να λύσουμε αυτό το πρόβλημα, θα πρέπει να ακολουθήσουμε τα παρακάτω βήματα. Σε αυτό το παράδειγμα, θα προσθέσουμε ένα μη-κενό πεδίο του τύπου :class:`~django.db.models.UUIDField` με μια προεπιλεγμένη τιμή (default value). Τροποποιήστε το αντίστοιχο δικό σας πεδίο ανάλογα τις ανάγκες σας.
id: Karena itu, langkah-langkah berikut harus diambil. Dalam contoh ini, kami akan menambahkan :class:`~django.db.models.UUIDField` bukan null dengan nilai awal. Rubah bidang masing-masing menurut kebutuhan anda.

source: Add the field on your model with ``default=uuid.uuid4`` and ``unique=True`` arguments (choose an appropriate default for the type of the field you're adding).
el: Προσθέστε ένα πεδίο στο μοντέλο σας με τις παραμέτρους ``default=uuid.uuid4`` και ``unique=True`` (επιλέξτε μια κατάλληλη προεπιλεγμένη τιμή ανάλογα τον τύπο του πεδίου που πρόκειται να προσθέσετε).
id: Tambah bidang pada model anda dengan argumen ``default=uuid.uuid4`` dan ``unique=True`` (pilih awal yang sesuai untuk jenis dari bidang anda sedang tambahkan).

source: Run the :djadmin:`makemigrations` command. This should generate a migration with an ``AddField`` operation.
el: Τρέξτε την διαχειριστική εντολή :djadmin:`makemigrations`. Η εντολή αυτή θα δημιουργήσει ένα αρχείο migration με την λειτουργία του ``AddField`` μέσα του.
id: Jalankan perintah :djadmin:`makemigrations`. Ini harus membangkitkan perpindahan dengan tindakan ``AddField``.

source: Generate two empty migration files for the same app by running ``makemigrations myapp --empty`` twice. We've renamed the migration files to give them meaningful names in the examples below.
el: Δημιουργήστε δύο κενά migration αρχεία για την ίδια εφαρμογή, τρέχοντας δύο φορές την εντολή ``makemigrations myapp --empty``. Στο παράδειγμα μας, έχουμε μετονομάσει τα αρχεία των migrations για να τους δώσουμε πιο επεξηγηματικά ονόματα.
id: Bangkitkan dua berkas-berkas perpindahan kosong untuk aplikasi sama dengan menjalankan ``makemigrations myapp --empty`` dua kali. Kami telah menamai kembali berkas-berkas perpindahan untuk memberikan mereka nama berarti di contoh dibawah.

source: Copy the ``AddField`` operation from the auto-generated migration (the first of the three new files) to the last migration and change ``AddField`` to ``AlterField``. For example:
el: Αντιγράψτε τη λειτουργία του ``AddField`` από το migration αρχείο που δημιουργήθηκε με την εντολή :djadmin:`makemigrations` (το πρώτο από τα τρία migration αρχεία) στο τελευταίο (το δεύτερο από τα δύο κενά) και αλλάξτε το ``AddField`` σε ``AlterField``. Για παράδειγμα:
id: Salin operasi ``AddField`` dari perpindahan dibangkitkan otomatis (pertama dari tiga berkas-berkas baru) ke perpindahan terakhir dan rubah ``AddField`` ke ``AlterField``. Sebagi contoh:

source: Edit the first migration file. The generated migration class should look similar to this:
el: Επεξεργαστείτε το πρώτο αρχείο του migration, το οποίο θα μοιάζει κάπως έτσι:
id: Sunting berkas perpindahan pertama. Kelas perpindahan dibangkitkan harus kelihatan mirip seperti ini:

source: Change ``unique=True`` to ``null=True`` -- this will create the intermediary null field and defer creating the unique constraint until we've populated unique values on all the rows.
el: Αλλάξτε το ``unique=True`` σε ``null=True`` -- αυτό θα δημιουργήσει ένα μεσάζων κενό πεδίο που δεν περιέχει τον περιορισμό της μοναδικότητας (unique constraint) μέχρις ότου δημιουργήσουμε μοναδικές τιμές για κάθε γραμμή αυτής της στήλης. Με άλλα λόγια, αυτό που προσπαθούμε να κάνουμε είναι: Δημιουργία τριών migration αρχείων (το πρώτο δημιουργείται αυτόματα με την εντολή :djadmin:`makemigrations`) με διαφορετική λειτουργία το καθένα. Το πρώτο δημιουργεί το πεδίο αλλά αντί του ``unique=True`` χρησιμοποιεί το ``null=True``. Το δεύτερο (που θα φτιάξουμε στο αμέσως επόμενο βήμα) δημιουργεί μοναδικές τιμές για κάθε γραμμή αυτής της στήλης. Το τρίτο αλλάζει το ``null=True`` σε ``unique=True`` για να εφαρμόσει τον περιορισμό της μοναδικότητας της στήλης αυτής. Αφού, λοιπόν, δημιουργηθούν αυτά τα τρία migrations και τρέξουμε την εντολή :djadmin:`migrate`, τότε καθένα migration θα τρέξει με τη σειρά και πρώτα θα δημιουργηθεί η στήλη (με το απαραίτητο όνομα που δώσατε) η οποία θα επιτρέπει κενές τιμές (``null=True``), μετά σε κάθε γραμμή αυτής της στήλης θα μπουν μοναδικές τιμές και τέλος θα αλλάξει σε ``unique=True`` ούτως ώστε από δω και μπρος να μην μπορεί να υπάρξει η ίδια τιμή σε παραπάνω από δύο γραμμές για τη στήλη αυτή.
id: Rubah ``unique=True`` menjadi ``null=True`` -- ini akan membuat perantara bidang null dan menunda pembuatan pembatas unik sampai kami telah mengumpulkan nilai-nilai unik pada semua baris.

source: In the first empty migration file, add a :class:`~django.db.migrations.operations.RunPython` or :class:`~django.db.migrations.operations.RunSQL` operation to generate a unique value (UUID in the example) for each existing row. For example:
el: Στο πρώτο κενό migration αρχείο (το δεύτερο εκ των τριών), προσθέστε μια λειτουργία :class:`~django.db.migrations.operations.RunPython` ή :class:`~django.db.migrations.operations.RunSQL` για να δημιουργήσετε μια μοναδική τιμή (σε αυτό το παράδειγμα δημιουργούμε μια τιμή του τύπου UUID) για κάθε υπάρχουσα γραμμή. Για παράδειγμα:
id: Dalam berkas perpindahan kosong pertama, tambah tindakan :class:`~django.db.migrations.operations.RunPython` atau :class:`~django.db.migrations.operations.RunSQL` untuk membangkitkan nilai unik (UUID dalam contoh) untuk setiap baris yang ada. Sebagai contoh:

source: Now you can apply the migrations as usual with the :djadmin:`migrate` command.
el: Τώρα μπορείτε να εφαρμόσετε τα migration αρχεία, ως συνήθως, με την διαχειριστική εντολή :djadmin:`migrate`.
id: Sekarang anda dapat berlakukan perpindahan seperti biasa dengan perintah :djadmin:`migrate`

source: Note there is a race condition if you allow objects to be created while this migration is running. Objects created after the ``AddField`` and before ``RunPython`` will have their original ``uuid``’s overwritten.
el: Σημειώστε ότι θα υπάρξει race condition αν επιτρέψετε να δημιουργηθούν objects όσο το migration τρέχει. Η τιμή της ``uuid`` των objects που θα δημιουργηθούν μεταξύ της λειτουργίας του ``AddField`` και της ``RunPython`` θα γίνει overwritten.
id: Catat ada kondisi jarang jika anda mengizinkan obyek untuk dibuat selagi perpindahan ini berjalan. Obyek dibuat setelah ``AddField`` dan sebelum ``RunPython`` akan mempunyai ``uuid`` asli mereka ditulis kembali.

source: Controlling the order of migrations
el: Ελέγχοντας τη σειρά εκτέλεσης των migration αρχείων
id: Mengendalikan urutan dari pemindahan

source: Django determines the order in which migrations should be applied not by the filename of each migration, but by building a graph using two properties on the ``Migration`` class: ``dependencies`` and ``run_before``.
el: Το Django δεν καθορίζει τη σειρά εκτέλεσης των migration αρχείων από το όνομα τους αλλά δημιουργώντας ένα γράφημα χρησιμοποιώντας δύο properties της κλάσης ``Migration``: το ``dependencies`` και το ``run_before``.
id: Django menentukan urutan dalam perpindahan mana harus diberlakukan tidak berdasarkan nama berkas dari setiap perpindahan, tetapi dengan membangun sebauh grafik menggunakan dua alat pada kelas ``Migration``: ``dependencies`` dan ``run_before``.

source: If you've used the :djadmin:`makemigrations` command you've probably already seen ``dependencies`` in action because auto-created migrations have this defined as part of their creation process.
el: Αν έχετε χρησιμοποιήσει την διαχειριστική εντολή :djadmin:`makemigrations` θα έχετε δει, πιθανόν, το property ``dependencies`` που δημιουργείται αυτόματα μέσα σε κάθε migration αρχείο.
id: Jika anda telah menggunakan perintah :djadmin:`makemigrations` anda mungkin seudah melihat ``dependencies`` dalam tindakan karena perpindahan dibuat-otomatis mempunyai penentuan ini sebagai bagian dari pengolahan pembuatan mereka.

source: The ``dependencies`` property is declared like this::
el: Το property ``dependencies`` ορίζεται ως εξής::
id: Properti ``dependencies`` diumumkan seperti ini::

source: Usually this will be enough, but from time to time you may need to ensure that your migration runs *before* other migrations. This is useful, for example, to make third-party apps' migrations run *after* your :setting:`AUTH_USER_MODEL` replacement.
el: Συνήθως αυτό θα είναι αρκετό, αλλά μερικές φορές ίσως χρειαστεί να βεβαιωθείτε ότι το migration αρχείο σας τρέξει *πριν* τρέξουν άλλα migrations. Αυτό είναι χρήσιμο, για παράδειγμα, να κάνετε τα migration αρχεία τρίτων εφαρμογών να τρέξουν *μετά* την αντικατάσταση της δική σας ρύθμισης :setting:`AUTH_USER_MODEL`.
id: Biasanya ini akan cukup, tetapi dari waktu ke waktu anda mungkin butuh memastikan bahwa perpindahan anda berjalan *sebelum* perpindahan lain. Ini berguna, sebagai contoh, untuk membuat perpindahan aplikasi pihak ketiga berjalan *setelah* pergantian :setting:`AUTH_USER_MODEL` anda.

source: To achieve this, place all migrations that should depend on yours in the ``run_before`` attribute on your ``Migration`` class::
el: Για να το επιτύχετε αυτό, τοποθετήστε όλα τα migrations τα οποία εξαρτώνται από τα δικά σας, στο attribute ``run_before`` της κλάσης ``Migration``::
id: Untuk mencapai ini, tempatkan semua perpindahan yang harus tergantung pada diri anda dalam atribut ``run_before`` pada kelas ``Migration`` anda.

source: Prefer using ``dependencies`` over ``run_before`` when possible. You should only use ``run_before`` if it is undesirable or impractical to specify ``dependencies`` in the migration which you want to run after the one you are writing.
el: Προτιμήστε να χρησιμοποιείτε το ``dependencies`` αντί του ``run_before`` όπου αυτό είναι δυνατόν. Θα πρέπει να χρησιμοποιείτε το ``run_before`` μόνο όταν είναι μη επιθυμητό ή μη πρακτικό να προσδιορίσετε το ``dependencies`` σε ένα migration αρχείο το οποίο θέλετε να τρέξει μετά από αυτό που γράφετε.
id: Lebih suka menggunakan ``dependencies`` daripada ``run_before`` ketika memungkinkan. Anda harus hanya menggunakan ``run_before`` jika dia tidak diinginkan atau tidak praktis untuk menentukan ``dependencies`` dalam perpindahan yang anda ingin jalankan setelah satu anda sedang tulis.

source: First, you must add the :class:`django.contrib.auth.middleware.RemoteUserMiddleware` to the :setting:`MIDDLEWARE` setting **after** the :class:`django.contrib.auth.middleware.AuthenticationMiddleware`::
el: Πρώτα πρέπει να προσθέσετε τη middleware κλάση :class:`django.contrib.auth.middleware.RemoteUserMiddleware` στη ρύθμιση :setting:`MIDDLEWARE` **μετά** τη middleware κλάση :class:`django.contrib.auth.middleware.AuthenticationMiddleware`::

source: Users with :attr:`is_active=False <django.contrib.auth.models.User.is_active>` won't be allowed to authenticate. Use :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` if you want to allow them to.
el: Οι χρήστες με το attribute :attr:`is_active=False <django.contrib.auth.models.User.is_active>` δεν θα τους επιτραπεί να πιστοποιηθούν. Για να το παρακάμψετε αυτό χρησιμοποιήστε την κλάση :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend`.

source: In older versions, inactive users weren't rejected as described above.
el: Σε παλαιότερες εκδόσεις, οι απενεργοποιημένοι χρήστες δεν απορριπτόντουσαν όπως περιγράφηκε παραπάνω.

source: We then need to define the ``as_sql`` method. This takes a ``SQLCompiler`` object, called ``compiler``, and the active database connection. ``SQLCompiler`` objects are not documented, but the only thing we need to know about them is that they have a ``compile()`` method which returns a tuple containing an SQL string, and the parameters to be interpolated into that string. In most cases, you don't need to use it directly and can pass it on to ``process_lhs()`` and ``process_rhs()``.
el: Έπειτα χρειάζεται να ορίσουμε την μέθοδο ``as_sql``. Αυτή δέχεται ως όρισμα ένα ``SQLCompiler`` object, με το όνομα ``compiler`` και την ενεργή σύνδεση της βάσης δεδομένων με το όνομα ``connection``. Τα ``SQLCompiler`` objects δεν βρίσκονται κάπου γραμμένα στο εγχειρίδιο του Django αλλά το μόνο πράγμα που χρειάζεται να ξέρετε γι' αυτά είναι ότι έχουν μια μέθοδο ``compile()`` η οποία επιστρέφει ένα tuple που περιέχει ένα SQL string και κάποιες παραμέτρους οι οποίες “γεμίζουν” αυτό το SQL string. Στις περισσότερες περιπτώσεις δεν θα χρειαστεί να την χρησιμοποιήσετε και μπορείτε να συνεχίσετε με τις μεθόδους ``process_lhs()`` και ``process_rhs()``.

source: Finally we combine the parts into an SQL expression with ``<>``, and supply all the parameters for the query. We then return a tuple containing the generated SQL string and the parameters.
el: Στο τέλος ενώνουμε τα μέρη σε μια SQL εντολή με τη χρήση του ``<>`` και παρέχουμε όλες τις παραμέτρους για το query (ερώτημα). Αυτό που επιστρέφουμε είναι ένα tuple που περιέχει την παραγόμενη SQL εντολή και τις παραμέτρους, κενές ή όχι. Το tuple που θα επιστραφεί, αναφερόμενοι στην ανωτέρω ``as_sql``, είναι το ``('"author"."name" <> "%s"', ['Jack'])``.

source: The ``handle()`` method takes one or more ``poll_ids`` and sets ``poll.opened`` to ``False`` for each one. If the user referenced any nonexistent polls, a :exc:`CommandError` is raised. The ``poll.opened`` attribute does not exist in the :doc:`tutorial</intro/tutorial01>` and was added to ``polls.models.Question`` for this example.
el: Η μέθοδος ``handle()`` λαμβάνει ένα ή περισσότερα ``poll_ids`` (το ``<poll_id>`` μέσα στο ``python manage.py closepoll <poll_id>``, που αν θέλουμε να προσθέσουμε πολλά τα διαχωρίζουμε με κενό) και θέτει το attribute ``poll.opened`` σε ``False`` για κάθε ένα poll. Αν ο χρήστης έχει πληκτρολογήσει κάποιο ή κάποια polls που δεν υπάρχουν, το σφάλμα :exc:`CommandError` γίνεται raised. Το attribute ``poll.opened`` δεν υπάρχει στον :doc:`οδηγό </intro/tutorial01>` και προστέθηκε στο μοντέλο ``polls.models.Question`` για το συγκεκριμένο παράδειγμα. Δεν έχετε παρά να το προσθέσετε και εσείς, όμως μην ξεχάσετε να τρέξετε τις εντολές ``makemigrations`` και ``migrate`` για να προστεθεί η αντίστοιχη στήλη στη βάση δεδομένων σας.

source: A boolean; if ``True``, the command prints a warning if the set of migrations on disk don't match the migrations in the database. A warning doesn't prevent the command from executing. Default value is ``False``.
el: Τύπου boolean. Αν είναι ``True``, η εντολή θα εκτυπώσει ένα warning αν το σετ των migrations στο δίσκο δεν ταιριάζει με τα migrations στη βάση δεδομένων. Υπόψιν ότι, ένα warning δεν εμποδίζει την εντολή από το να εκτελεστεί. Προεπιλεγμένη τιμή είναι το ``False``.

source: Changing a custom field's base class
el: Αλλάζοντας την base class του δικού σας πεδίου

source: You can't change the base class of a custom field because Django won't detect the change and make a migration for it. For example, if you start with::
el: Δεν μπορείτε να αλλάξετε την base class ενός παραμετροποιήσιμου πεδίου επειδή το Django δεν ανιχνεύει την αλλαγή και δεν θα δημιουργήσει migration για αυτή την αλλαγή. Για παράδειγμα αν ξεκινήσετε με αυτό::

source: and then decide that you want to use ``TextField`` instead, you can't change the subclass like this::
el: και μετά αποφασίσετε ότι θέλετε να χρησιμοποιήσετε αντί αυτού ένα ``TextField``, δεν μπορείτε να αλλάξετε την subclass όπως::

source: Instead, you must create a new custom field class and update your models to reference it::
el: Αντιθέτως, πρέπει να δημιουργήσετε μια νέα κλάση πεδίου και να ενημερώσετε τα μοντέλα σας για να αναφερθούν σε αυτό::

source: As discussed in :ref:`removing fields <migrations-removing-model-fields>`, you must retain the original ``CustomCharField`` class as long as you have migrations that reference it.
el: Όπως συζητήθηκε στο :ref:`αφαιρώντας πεδία μοντέλων <migrations-removing-model-fields>`, θα πρέπει να διατηρήσετε την αρχική κλάση ``CustomCharField`` στον κώδικα σας όσο έχετε migrations τα οποία αναφέρονται σε αυτή.
