Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: To do this, just add a ``management/commands`` directory to the application. Django will register a ``manage.py`` command for each Python module in that directory whose name doesn't begin with an underscore. For example::
el: Για να το κάνουμε αυτό, απλά δημιουργήστε μια δομή φακέλων μέσα στην εφαρμογή ως εξής: ``management/commands``. Το Django θα κάνει register μια ``manage.py`` εντολή για κάθε Python module μέσα σε αυτό το φάκελο του οποίου το όνομα δεν ξεκινά με τον χαρακτήρα της κάτω παύλας. Για παράδειγμα::
id: Untuk melakukan ini, tambahkan direktori ``management/commands`` ke aplikasi. Django akan mendaftarkan sebuah perintah ``manage.py`` untuk setiap modul Python dalam direktori tersebut yang namanya tidak dimulai dengan garis bawah. Sebagai contoh::

source: On Python 2, be sure to include ``__init__.py`` files in both the ``management`` and ``management/commands`` directories as done above or your command will not be detected.
el: Αν χρησιμοποιείτε την Python 2, σιγουρευτείτε ότι το αρχείο ``__init__.py`` (κενό αρχείο) υπάρχει και στους δύο φακέλους (``management`` και ``management/commands``) όπως φαίνεται παραπάνω αλλιώς η εντολή σας δεν θα μπορέσει να εντοπιστεί.
id: Pada Python 2, pastika menyertakan berkas ``__init__.py`` dalam kedua direktori ``management`` dan ``management/commands`` seperti yang dilakukan diatas atau perintah anda tidak akan ditemukan.

source: In this example, the ``closepoll`` command will be made available to any project that includes the ``polls`` application in :setting:`INSTALLED_APPS`.
el: Σε αυτό το παράδειγμα, η εντολή ``closepoll`` θα είναι διαθέσιμη σε κάθε project που έχει εγκατεστημένη αυτή την εφαρμογή, ήτοι, η εφαρμογή ``polls`` βρίσκεται μέσα στη ρύθμιση :setting:`INSTALLED_APPS`.
id: Dalam contoh ini, perintah ``closepoll`` akan dibuat tersedia pada setiap proyek yang menyertakan aplikasi ``polls`` dalam :setting:`INSTALLED_APPS`.

source: The ``_private.py`` module will not be available as a management command.
el: Το module ``_private.py`` δεν θα είναι διαθέσιμο ως μια εντολή διαχείρισης (management command), αφού το όνομα του ξεκινά με την κάτω παύλα.
id: Modul ``_private.py`` tidak akan tersedia sebagai perintah pengelolaan.

source: The ``closepoll.py`` module has only one requirement -- it must define a class ``Command`` that extends :class:`BaseCommand` or one of its :ref:`subclasses<ref-basecommand-subclasses>`.
el: Το module ``closepoll.py`` έχει μόνο μια απαίτηση -- πρέπει να ορίσει μια κλάση ``Command`` η οποία κάνει extend την κλάση :class:`BaseCommand` ή μια από τις :ref:`subclasses<ref-basecommand-subclasses>` της.
id: Modul ``closepoll.py`` mempunyai hanya satu persyaratan -- itu harus ditentukan sebuah kelas ``Command`` yang memperpanjang :class:`BaseCommand` atau satu dari :ref:`subclasses<ref-basecommand-subclasses>` nya.

source: Standalone scripts
el: Αυτόνομα scripts
id: Tulisan berdiri sendiri

source: Custom management commands are especially useful for running standalone scripts or for scripts that are periodically executed from the UNIX crontab or from Windows scheduled tasks control panel.
el: Οι παραμετροποιήσιμες εντολές διαχείρισης είναι εξαιρετικά χρήσιμες για την εκτέλεση αυτόνομων scripts ή για scripts τα οποία εκτελούνται σε περιοδική βάση από το crontab του UNIX ή από τα scheduled tasks των Windows.
id: Penyesuaian pengelolaan perintah adalah khususnya berguna untuk menjalankan tulisan berdiri sendiri atau untuk tulisan yang secara berkala dijalankan dari panel kendali UNIX crontab atau Windows scheduled tasks.

source: To implement the command, edit ``polls/management/commands/closepoll.py`` to look like this::
el: Για να υλοποιήσετε την εντολή επεξεργαστείτε το αρχείο ``polls/management/commands/closepoll.py`` για να δείχνει κάπως έτσι::
id: Untuk menerapkan perintah, sunting ``polls/management/commands/closepoll.py`` untuk kelihatan seperti ini::

source: Before Django 1.8, management commands were based on the :py:mod:`optparse` module, and positional arguments were passed in ``*args`` while optional arguments were passed in ``**options``. Now that management commands use :py:mod:`argparse` for argument parsing, all arguments are passed in ``**options`` by default, unless you name your positional arguments to ``args`` (compatibility mode). You are encouraged to exclusively use ``**options`` for new commands.
id: Sebelum Django 1.8, pengelolaan perintah berdasarkan pada modul :py:mod:`optparse`, dan penempatan argumen dilewati dalam ``*args`` selama argumen pilihan dilewati dalam ``**options``. Sekarang pengelolaan perintah tersebut menggunakan :py:mod:`argparse` untuk menguraikan argumen, semua argumen dilewati dalam ``**options`` secara awal, meskipun nama anda penempatan argumen anda pada ``args`` (suasana kesesuaian). Anda dianjurkan secara eksklusif menggunakan ``**options`` untuk perintah baru.

source: When you are using management commands and wish to provide console output, you should write to ``self.stdout`` and ``self.stderr``, instead of printing to ``stdout`` and ``stderr`` directly. By using these proxies, it becomes much easier to test your custom command. Note also that you don't need to end messages with a newline character, it will be added automatically, unless you specify the ``ending`` parameter::
el: Όταν χρησιμοποιείτε εντολές διαχείρισης και θέλετε να εμφανίσετε κάτι στην κονσόλα, θα πρέπει να το στέλνετε στο ``self.stdout`` και στο ``self.stderr``, αντί να το εκτυπώνετε απ’ ευθείας στο ``stdout`` και ``stderr``. Χρησιμοποιώντας αυτά, το τεστ της εντολής σας γίνεται παιχνιδάκι. Σημειώστε, επίσης, ότι δεν χρειάζεται να προσθέτετε το χαρακτήρα της νέας γραμμής (line feed) στο τέλος κάθε ``self.stdout`` ή ``self.stderr`` του μηνύματος σας. Θα προστεθεί αυτόματα από το Django εκτός και αν θέλετε διαφορετικά χρησιμοποιώντας την παράμετρο ``ending``::
id: Ketika anda menggunakan pengelolaan perintah dan berharap untuk menyediakan keluaran tempat tuts, anda harus menulis ke ``self.stdout`` dan ``self.stderr``, daripada mencetak ke ``stdout`` and ``stderr`` secara langsung. Dengan menggunakan proxi ini, dia menjadi lebih mudah untuk mencoba penyesuaian perintah anda. Catat juga bahwa anda tidak butuh mengakhiri pesan dengan karakter baris baru, dia akan ditambahkan otomatis, meskipun anda menentukan parameter ``ending``::

source: The new custom command can be called using ``python manage.py closepoll <poll_id>``.
el: Την καινούργια σας εντολή μπορείτε να την καλείτε ως ``python manage.py closepoll <poll_id>``. Αν θέλετε να δείτε όλες τις διαθέσιμες εντολές, όλων των ενεργοποιημένων apps του project σας, πληκτρολογήστε ``python manage.py`` και εκεί θα δείτε και τη δική σας κάτω από την εφαρμογή ``polls``.
id: Perintah penyesuaian baru dapat dipanggil menggunakan ``python manage.py closepoll <poll_id>``.

source: The ``handle()`` method takes one or more ``poll_ids`` and sets ``poll.opened`` to ``False`` for each one. If the user referenced any nonexistent polls, a :exc:`CommandError` is raised. The ``poll.opened`` attribute does not exist in the :doc:`tutorial</intro/tutorial01>` and was added to ``polls.models.Poll`` for this example.
id: Cara ``handle()`` mengambil satu atau lebih ``poll_ids`` dan menyetel ``poll.opened`` menjadi ``False`` untuk stiap satu. Jika pengguna diberikan petunjuk jejak pendapat yang tidak ada, sebuah :exc:`CommandError` dimunculkan. Atribut ``poll.opened`` tidak ada dalam :doc:`tutorial</intro/tutorial01>` dan telah ditambahkan ke ``polls.models.Poll`` untuk contoh ini.

source: Accepting optional arguments
el: Προαιρετικά arguments
id: Menerima argumen pilihan

source: The same ``closepoll`` could be easily modified to delete a given poll instead of closing it by accepting additional command line options. These custom options can be added in the :meth:`~BaseCommand.add_arguments` method like this::
el: Αλλάζοντας εύκολα την εντολή ``closepoll`` ώστε να δέχεται επιπρόσθετες επιλογές όταν την καλείτε, θα μπορούσε να διαγράφει ένα poll αντί να το θέτει ως κλειστό (``poll.opened = False``). Αυτές οι επιλογές μπορούν να προστεθούν στη μέθοδο :meth:`~BaseCommand.add_arguments` ως εξής::
id: ``closepoll`` yang sama dapat dengan mudah dirubah untuk menghapus jejak pendapat yang diberikan daripada menutupnya dengan menerima tambahan pilihan baris perintah. Penyesuaian pilihan ini dapat ditambahkan dalam cara :meth:`~BaseCommand.add_arguments` seperti ini::

source: Previously, only the standard :py:mod:`optparse` library was supported and you would have to extend the command ``option_list`` variable with ``optparse.make_option()``.
id: Sebelumnya, hanya pustaka :py:mod:`optparse` standar yang didukung dan anda harus memperpanjang perintah variabel ``option_list`` dengan ``optparse.make_option()``.

source: The option (``delete`` in our example) is available in the options dict parameter of the handle method. See the :py:mod:`argparse` Python documentation for more about ``add_argument`` usage.
el: Η επιλογή (η ``delete`` στο παράδειγμα μας) είναι διαθέσιμη μέσα στη μέθοδο handle μέσα από το options dictionary με το key delete. Δείτε περισσότερα στο εγχειρίδιο της Python σχετικά με τη χρήση της :py:mod:`argparse` και τη μέθοδο ``add_argument`` .
id: Pilihan (``delete`` dalam contoh kami) tersedia dalam pilihan parameter perintah dari cara penanganan. Lihat dokumentasi Python :py:mod:`argparse` untuk lebih tentang penggunaan ``add_argument``.

source: In addition to being able to add custom command line options, all :doc:`management commands</ref/django-admin>` can accept some default options such as :option:`--verbosity` and :option:`--traceback`.
el: Πέρα από τη δυνατότητα της πρόσθεσης δικών σας επιλογών στην εντολή, όλες οι :doc:`εντολές διαχείρισης </ref/django-admin>` μπορούν να δεχτούν μερικές δικές τους, προεγκατεστημένες, επιλογές όπως η :option:`--verbosity` και η :option:`--traceback`.
id: Dalam tambahan untuk dapat menambahkan penyesuaian pilihan baris perintah, semua :doc:`pengelolaan perintah</ref/django-admin>` dapat menerima beberapa pilihan awal seperti :option:`--verbosity` dan :option:`--traceback`.

source: Management commands and locales
el: Εντολές διαχείρισης και locales
id: Pengelolaan perintah dan lokal

source: By default, the :meth:`BaseCommand.execute` method deactivates translations because some commands shipped with Django perform several tasks (for example, user-facing content rendering and database population) that require a project-neutral string language.
el: Από προεπιλογή, η μέθοδος :meth:`BaseCommand.execute` απενεργοποιεί τις μεταφράσεις (που τυχόν έχουν γίνει) επειδή κάποιες εντολές διαχείρισης του Django εκτελούν διάφορες εργασίες (πχ population της database, rendering των δεδομένων που βλέπει ο χρήστης) οι οποίες απαιτούν μια γλώσσα που να είναι καθολική και να μην εξαρτάται από το εκάστοτε project του προγραμματιστή.
id: Secara awal, cara :meth:`BaseCommand.execute` menonaktifkan terjemahan karena beberapa perintah dikemas dengan Django melakukan beberapa tugas (sebagai contoh, membangun isi pengguna muka dan mengumpulkan basisdata) yang membutuhkan bahasa deretan karakter proyek-netral.

source: In previous versions, Django forced the "en-us" locale instead of deactivating translations.
id: Dalam versi sebelumnya, Django memaksa lokal "en-us" daripada meniadakan terjemahan.

source: If, for some reason, your custom management command needs to use a fixed locale, you should manually activate and deactivate it in your :meth:`~BaseCommand.handle` method using the functions provided by the I18N support code::
el: Αν, για κάποιο λόγο, η δική σας εντολή διαχείρισης χρειάζεται να χρησιμοποιήσει ένα μόνιμο locale, θα χρειαστεί να το ενεργοποιήσετε/απενεργοποιήσετε χειροκίνητα μέσα στη μέθοδο :meth:`~BaseCommand.handle` χρησιμοποιώντας τις μεθόδους που παρέχονται από το module I18N::
id: Jika, untuk beberapa alasan, penyesuaian pengelolaan perintah anda butuh menggunakan lokal yang tetap, anda harus secara manual mengaktif dan menonaktifkannya dalam cara :meth:`~BaseCommand.handle` anda menggunakan fungsi disediakan oleh dukungan kode I18N::

source: Another need might be that your command simply should use the locale set in settings and Django should be kept from deactivating it. You can achieve it by using the :data:`BaseCommand.leave_locale_alone` option.
el: Μια άλλη προσέγγιση ίσως, είναι να χρησιμοποιήσετε το locale που έχετε θέσει στα settings του project σας και το Django να μην το απενεργοποιήσει. Το επιτυγχάνετε αυτό χρησιμοποιώντας την επιλογή :data:`BaseCommand.leave_locale_alone`.
id: Kebutuhan lainnya mungkin bahwa perintah anda dengan mudah harus menggunakan kumpulan lokal dalam pengaturan dan Django harus dijaga dari penonaktifannya. Anda dapat mencapainya dengan menggunakan pilihan :data:`BaseCommand.leave_locale_alone`.

source: When working on the scenarios described above though, take into account that system management commands typically have to be very careful about running in non-uniform locales, so you might need to:
el: Όταν δουλεύετε σε σενάρια παρόμοια με τα παραπάνω, λάβετε υπόψη σας ότι οι εντολές διαχείρισης του συστήματος πρέπει να είναι πολύ προσεκτικές όταν τρέχουν σε μη ομοιόμορφα locales, που σημαίνει ότι θα χρειαστεί να:
id: Ketika bekerja pada skenario yang digambarkan diatas, perhatikan akun yang sistem pengelolaan perintah khususnya harus sangat waspada tentang berjalan dalam lokal yang tidak seragam, jadi anda mungkin butuh untuk:

source: Make sure the :setting:`USE_I18N` setting is always ``True`` when running the command (this is a good example of the potential problems stemming from a dynamic runtime environment that Django commands avoid offhand by deactivating translations).
el: Σιγουρευτείτε ότι η ρύθμιση :setting:`USE_I18N` είναι πάντα ``True`` όταν τρέχετε την εντολή (αυτό είναι ένα καλό παράδειγμα των πιθανών προβλημάτων που απορρέουν από ένα δυναμικό runtime περιβάλλον, όπου οι Django εντολές διαχείρισης προσπαθούν να αποφύγουν απενεργοποιώντας τις μεταφράσεις).
id: Pastikan pengaturan :setting:`USE_I18N` selalu ``True`` ketika menjalankan perintah (ini adalah contoh bagus dari potensial masalah berasal dari sebuah lingkungan waktu berjalan dinamis dimana perintah Django menghindari begitu saja dengan menonaktifkan terjemahan).

source: Review the code of your command and the code it calls for behavioral differences when locales are changed and evaluate its impact on predictable behavior of your command.
el: Ελέγξτε τον κώδικα της εντολής σας καθώς και τυχόν κώδικα που καλεί η εντολή σας για να δείτε τυχόν διαφορές συμπεριφοράς όταν τα locales αλλάζουν και να αξιοποιήσετε την επιρροή του κώδικα πάνω στην προβλέψιμη συμπεριφορά της εντολής σας.
id: Tinjau kode dari perintah anda dan kode dipanggil untuk perbedaan perilaku ketika lokal dirubah dan dinilai dampaknya pada perkiraan kebiasaan dari perintah anda.

source: Testing
el: Τεστ
id: Pengujian

source: Information on how to test custom management commands can be found in the :ref:`testing docs <topics-testing-management-commands>`.
el: Πληροφορίες στο πως να τεστάρετε τις δικές σας εντολές διαχείρισης, μπορείτε να βρείτε στα :ref:`εργαλεία για τεστ <topics-testing-management-commands>`.
id: Informasi pada bagaimana untuk mencoba penyesuaian pengelolaan perintah dapat ditemukan dalam :ref:`dokumen percobaan <topics-testing-management-commands>`.

source: Command objects
el: Objects εντολών
id: Obyek perintah

source: The base class from which all management commands ultimately derive.
el: Η κύρια κλάση από την οποία πηγάζουν όλες οι εντολές διαχείρισης.
id: Kelas dasar dari mana semua pengelolaan perintah akhirnya berasal.

source: Use this class if you want access to all of the mechanisms which parse the command-line arguments and work out what code to call in response; if you don't need to change any of that behavior, consider using one of its :ref:`subclasses<ref-basecommand-subclasses>`.
el: Χρησιμοποιήστε αυτή την κλάση αν θέλετε να έχετε πρόσβαση σε όλους τους μηχανισμούς οι οποίοι μεταφράζουν τις επιλογές στη γραμμή εντολών (όπως την ``--delete`` που χρησιμοποιήσαμε νωρίτερα) και αποφασίζουν, ανάλογα την επιλογή, ποιον κώδικα να καλέσουν περαιτέρω. Αν δεν θέλετε να αλλάξετε κάποια από αυτές τις συμπεριφορές, ίσως σας φανεί χρήσιμη μια από τις :ref:`subclasses <ref-basecommand-subclasses>` της ``BaseCommand``.
id: Gunakan kelas ini jika anda ingin mengakses semua mekanisme yang mengurai argumen baris perintah dan bekerja kode apa untuk dipanggil dalam tanggapan; jika anda tidak butuh merubah kebiasaan apapun, pertimbangkan menggunakan satu dari :ref:`subclasses<ref-basecommand-subclasses>` nya.

source: Subclassing the :class:`BaseCommand` class requires that you implement the :meth:`~BaseCommand.handle` method.
el: Πραγματοποιώντας subclassing στην κλάση :class:`BaseCommand` απαιτεί να υλοποιήσετε τη μέθοδο :meth:`~BaseCommand.handle`.
id: Mensubkelaskan kelas :class:`BaseCommand` membutuhkan bahwa anda menerapkan cara :meth:`~BaseCommand.handle`.

source: Attributes
id: Atribut

source: All attributes can be set in your derived class and can be used in :class:`BaseCommand`’s :ref:`subclasses<ref-basecommand-subclasses>`.
el: Όλα τα attributes μπορούν να οριστούν στη δική σας κλάση και να χρησιμοποιηθούν στις :ref:`subclasses <ref-basecommand-subclasses>` της :class:`BaseCommand`.
id: Semua atribut dapat di setel dalam kelas turunan anda dan dapat digunakan dalam :ref:`subclasses<ref-basecommand-subclasses>` :class:`BaseCommand`.

source: A string listing the arguments accepted by the command, suitable for use in help messages; e.g., a command which takes a list of application names might set this to '<app_label app_label ...>'.
id: Daftar deretan karakter argumen yang diterima oleh perintah, cocok untuk digunakan dalam pesan bantuan; sebagai contoh, sebuah perintah yang mengambil daftar nama aplikasi mungkin disetel ini menjadi '<app_label app_label ...>'.

source: This should be done now in the :meth:`~BaseCommand.add_arguments()` method, by calling the ``parser.add_argument()`` method. See the ``closepoll`` example above.
id: Ini seharusnya selesai sekarang dalam cara :meth:`~BaseCommand.add_arguments()`, dengan memanggil cara ``parser.add_argument()``. Lihat coontoh ``closepoll`` diatas.

source: A boolean indicating whether the command needs to be able to import Django settings; if ``True``, ``execute()`` will verify that this is possible before proceeding. Default value is ``True``.
el: Τύπου boolean που υποδεικνύει αν η εντολή μπορεί να κάνει import τα Django settings. Αν είναι ``True``, τότε η μέθοδος ``execute()`` θα επιβεβαιώσει ότι αυτό είναι δυνατόν πριν προχωρήσει. Προεπιλεγμένη τιμή είναι το ``True``.
id: Sebuah boolean menunjukkan apakah perintah butuh dapat mengimpor pengaturan Django; jika ``True``, ``execute()`` akan memeriksa bahwa ini dimungkinkan sebelum dilanjutkan. Nilai awal adalah ``True``.

source: A short description of the command, which will be printed in the help message when the user runs the command ``python manage.py help <command>``.
el: Μια μικρή περιγραφή της εντολής η οποία θα εκτυπωθεί στην κονσόλα όταν ο χρήστης τρέξει την εντολή ``python manage.py help <command>``.
id: Deskripsi singkat dari perintah, dimana akan ditampilkan di pesan bantuan ketika pengguna eksekusi perintah ``python manage.py help <command>``.

source: If your command defines mandatory positional arguments, you can customize the message error returned in the case of missing arguments. The default is output by :py:mod:`argparse` ("too few arguments").
el: Αν η εντολή σας ορίζει κάποια υποχρεωτικά positional arguments, μπορείτε να παραμετροποιήσετε το μήνυμα σφάλματος που επιστρέφεται, σε περίπτωση που αυτά τα arguments λείπουν. Προεπιλεγμένη τιμή είναι η έξοδος της :py:mod:`argparse` ("too few arguments").
id: Jika perintah anda menentukan argumen penempatan wajib, anda dapat menyesuaiakan pesan kesalahan yang dikembalikan dalam kasus argumen yang hilang. Awalnya adalah keluaran oleh :py:mod:`argparse` ("terlalu sedikit argumen").

source: This is the list of ``optparse`` options which will be fed into the command's ``OptionParser`` for parsing arguments.
id: Ini adalah daftar dari pilihan ``optparse`` yang akan diberi makan kedalam perintah ``OptionParser`` untuk mengurai argumen.

source: You should now override the :meth:`~BaseCommand.add_arguments` method to add custom arguments accepted by your command. See :ref:`the example above <custom-commands-options>`.
id: Anda harus sekarang mengesampingkan cara :meth:`~BaseCommand.add_arguments` untuk menambahkan penyesuaian argumen yang diterima oleh perintah anda. Lihat :ref:`contoh diatas <custom-commands-options>`.

source: A boolean indicating whether the command outputs SQL statements; if ``True``, the output will automatically be wrapped with ``BEGIN;`` and ``COMMIT;``. Default value is ``False``.
el: Τύπου boolean που υποδεικνύει αν η εντολή θα εκτυπώσει (στην κονσόλα) εντολές SQL. Αν είναι ``True``, τότε η έξοδος θα συμπεριληφθεί μέσα σε ένα ``BEGIN;`` και ``COMMIT;``. Προεπιλεγμένη τιμή είναι το ``False``.
id: Sebuah boolean menunjukkan apakah perintah keluaran pernyataan SQL; jika ``True``, keluaran akan otomatis dibungkus dengan ``BEGIN;`` dan ``COMMIT;``. Nilai awal adalah ``False``.

source: A boolean; if ``True``, the entire Django project will be checked for potential problems prior to executing the command. Default value is ``True``.
el: Τύπου boolean. Αν είναι ``True``, τότε ολόκληρο το Django project σας θα ελεγχθεί για τυχόν σφάλματα πριν εκτελεστεί η εντολή. Προεπιλεγμένη τιμή είναι το ``True``.
id: Sebuah boolean; jika ``True``, seluruh proyek Django akan diperiksa untuk masalah potensial sebelum menjalankan perintah. Nilai awal adalah ``True``.

source: A boolean indicating whether the locale set in settings should be preserved during the execution of the command instead of being forcibly set to 'en-us'.
el: Τύπου boolean που υποδεικνύει αν το locale που έχει οριστεί στα settings του project σας θα πρέπει να ληφθεί υπόψιν κατά τη διάρκεια εκτέλεσης της εντολής, αντί να χρησιμοποιηθεί η τιμή 'en-us'.
id: Sebuah boolean menunjukkan apakah kumpulan lokal dalam pengaturan harus dipertahankan selama menjalankan dari program daripada dipaksa disetel menjadi 'en-us'.

source: Default value is ``False``.
el: Προεπιλεγμένη τιμή είναι το ``False``.
id: Nilai awal adalah ``False``.
