Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Using a ``virtualenv``
el: Χρησιμοποιώντας ένα ``virtualenv``
id: Menggunakan ``virtualenv``

source: If you install your project's Python dependencies inside a `virtualenv`_, you'll need to add the path to this virtualenv's ``site-packages`` directory to your Python path as well. To do this, add an additional path to your ``WSGIPythonPath`` directive, with multiple paths separated by a colon (``:``) if using a UNIX-like system, or a semicolon (``;``) if using Windows. If any part of a directory path contains a space character, the complete argument string to ``WSGIPythonPath`` must be quoted:
el: Αν εγκαταστήσετε τα Python dependencies του project σας μέσα σε ένα `virtualenv`_, θα χρειαστεί, επίσης, να προσθέσετε το path του φακέλου ``site-packages`` του virtualenv στο Python path σας. Για να το κάνετε αυτό, προσθέστε ένα επιπλέον path στο ``WSGIPythonPath`` directive. Αν το σύστημα μας βασίζεται στο UNIX τότε διαχωρίστε τα paths με άνω-κάτω τελεία (``:``), ενώ αν βασίζεται σε Windows τα διαχωρίζετε με ερωτηματικό (``;``). Αν κάποιο κομμάτι του path περιέχει κενό, τότε θα πρέπει όλο το path να συμπεριληφθεί σε μονά ή διπλά εισαγωγικά (``’’`` ή ``””``):
id: Jika anda memasang ketergantungan Python proyek didalam sebuah `virtualenv`_, anda akan butuh menambahkan jalur pada paket direktori ``site-packages``ini ke jalur Python anda juga. Untuk melakukan ini, tambah sebuah jalur tambahan dengan sebuah titik dua (``:``) jika menggunakan sistem seperti UNIX, atau sebuah titik koma (``;``) jika menggunakan Windows. Jika bagian apapun dari jalur direktori mengandung karakter ruang, deretan karakter argumen lengkap pada ``WSGIPythonPath`` harus dikutip:

source: Make sure you give the correct path to your virtualenv, and replace ``python3.X`` with the correct Python version (e.g. ``python3.4``).
el: Σιγουρευτείτε ότι δώσατε το σωστό path για το virtualenv σας καθώς και αντικαταστήσατε το ``python3.X`` με τη σωστή έκδοση Python που χρησιμοποιείτε (πχ ``python3.4``).
id: Pastikan anda memberikan jalur benar ke virtualenv anda, dan ganti ``python3.X`` dengan versi Python yang benar (sebagai contoh ``python3.4``).

source: Using ``mod_wsgi`` daemon mode
el: Χρησιμοποιώντας το ``mod_wsgi`` daemon mode
id: Menggunakan ``mod_wsgi`` mode daemon

source: "Daemon mode" is the recommended mode for running mod_wsgi (on non-Windows platforms). To create the required daemon process group and delegate the Django instance to run in it, you will need to add appropriate ``WSGIDaemonProcess`` and ``WSGIProcessGroup`` directives. A further change required to the above configuration if you use daemon mode is that you can't use ``WSGIPythonPath``; instead you should use the ``python-path`` option to ``WSGIDaemonProcess``, for example:
el: Η λειτουργία daemon ("daemon mode") είναι η προτεινόμενη λειτουργία για να τρέχετε το mod_wsgi (σε πλατφόρμες εκτός Windows). Για να δημιουργήσετε το απαραίτητο daemon process group και να εξουσιοδοτήσετε το Django instance να το τρέξει, θα πρέπει να προσθέσετε τα κατάλληλα directives ``WSGIDaemonProcess`` και ``WSGIProcessGroup``. Αν χρησιμοποιείτε την παραπάνω ρύθμιση με το daemon mode δεν θα μπορείτε να χρησιμοποιήσετε το ``WSGIPythonPath``. Αντ’ αυτού θα πρέπει να χρησιμοποιήσετε την επιλογή ``python-path`` μέσα στο ``WSGIDaemonProcess``. Για παράδειγμα:
id: "Daemon mode" adalah suasana yang dianjurkan untuk menjalankan mod_wsgi (pada serambi bukan-Windows). Untuk membuat kelompok pengolahan daemon yang dibutuhkan dan menugaskan instance Django untuk menjalankan di dalamnya, anda akan butuh menambahkan arahan ``WSGIDaemonProcess`` dan ``WSGIProcessGroup`` sesuai. Perubahan lebih lanjut pada konfigurasi diatas jika anda menggunakan suasana daemon adalah anda tidak dapat menggunakan ``WSGIPythonPath``; daripada anda harus menggunakan pilihan ``python-path`` ke ``WSGIDaemonProcess``, sebagai contoh:

source: If you want to serve your project in a subdirectory (``https://example.com/mysite`` in this example), you can add ``WSGIScriptAlias`` to the configuration above:
el: Αν θέλετε να εξυπηρετήσετε το project σας σε κάποιον υποφάκελο (πχ στη διεύθυνση ``https://example.com/mysite``), μπορείτε να προσθέσετε το ``WSGIScriptAlias`` στην παραπάνω παραμετροποίηση:
id: Jika anda ingin melayani proyek anda dalam subdirektori (``https://example.com/mysite`` dalam contoh ini), anda dapat menambahkan ``WSGIScriptAlias`` pada konfigurasi diatas:

source: See the official mod_wsgi documentation for `details on setting up daemon mode`_.
el: Δείτε το επίσημο εγχειρίδιο του mod_wsgi για περισσότερες λεπτομέρειες στην παραμετροποίηση του `daemon mode <https://modwsgi.readthedocs.io/en/develop/user-guides/quick-configuration-guide.html#delegation-to-daemon-process>`_.
id: Lihat dokumentasi mod_wsgi resmi untuk `details on setting up daemon mode`_.

source: Serving files
el: Εξυπηρετώντας αρχεία
id: Melayani berkas

source: Django doesn't serve files itself; it leaves that job to whichever Web server you choose.
el: Το Django δεν εξυπηρετεί το ίδιο, αρχεία. Αυτό το αφήνει στον Web server τον οποίο θα διαλέξετε εσείς.
id: Django tidak melayani berkas-berkas dia sendiri; dia meninggalkan pekerjaan tersebut ke peladen Jaringan manapun anda pilih.

source: We recommend using a separate Web server -- i.e., one that's not also running Django -- for serving media. Here are some good choices:
el: Προτείνουμε να διαλέξετε έναν διαφορετικό Web server -- πχ κάποιον ο οποίος δεν τρέχει ήδη Django -- για να εξυπηρετήσετε τα media files. Παρακάτω φαίνονται μερικές καλές επιλογές:
id: Kami rekomendasi menggunakan Web server terpisah -- misalnya, yang juga menggunakan Django -- untuk melayani media. Berikut adalah beberapa alternatif baik:

source: A stripped-down version of Apache_
el: `Μια stripped-down έκδοση του Apache <https://httpd.apache.org/>`_
id: Versi ringkas dari Apache_

source: If, however, you have no option but to serve media files on the same Apache ``VirtualHost`` as Django, you can set up Apache to serve some URLs as static media, and others using the mod_wsgi interface to Django.
el: Αν, παρόλ’ αυτά, δεν έχετε άλλη επιλογή παρά να εξυπηρετήσετε τα media files στον ίδιο Apache ``VirtualHost`` που τρέχει και το Django, μπορείτε να ρυθμίσετε τον Apache να εξυπηρετήσει μερικά URLs ως static media και άλλα χρησιμοποιώντας το mod_wsgi interface στο Django.
id: Jika, bagaimanapun, anda tidak mempunyai pilihan tetapi utnuk melayani berkas-berkas media pada Apache ``VirtualHost`` sama sebagai Django, anda dapat menyetel Apache untuk melayani beberapa URL sebagai media statis, dan lainnya menggunakan antarmuka mod_wsgi ke Django.

source: This example sets up Django at the site root, but serves ``robots.txt``, ``favicon.ico``, and anything in the ``/static/`` and ``/media/`` URL space as a static file. All other URLs will be served using mod_wsgi:
el: Αυτό το παράδειγμα ρυθμίζει το Django στο site root, αλλά εξυπηρετεί τα αρχεία ``robots.txt``, ``favicon.ico`` και οτιδήποτε μέσα στα URLs ``/static/`` και ``/media/`` ως ένα static file (πχ JavaScript, CSS, fonts αρχείο κλπ). Όλα τα άλλα URLs θα εξυπηρετηθούν χρησιμοποιώντας το mod_wsgi:
id: Contoh ini menyetel Django pada akar situs, tetapi melayani ``robots.txt``, ``favicon.ico``, dan apapun dalam ruang URL ``/static/`` dan ``/media/`` sebagai berkas statis. Semua URL lain akan dilayani menggunakan mod_wsgi:

source: If you are using a version of Apache older than 2.4, replace ``Require all granted`` with ``Allow from all`` and also add the line ``Order deny,allow`` above it.
el: Αν χρησιμοποιείτε κάποια παλαιότερη έκδοση του Apache από 2.4, αντικαταστήστε το ``Require all granted`` με το ``Allow from all`` και, επίσης, προσθέστε τη γραμμή ``Order deny,allow`` από πάνω.
id: Jika anda sedang menggunakan versi Apache lebih lama dari 2.4, ganti ``Require all granted`` dengan ``Allow from all`` dan juga tambah baris ``Order deny,allow`` diatasnya.

source: Serving the admin files
el: Εξυπηρετώντας τα αρχεία του admin
id: Melayani berkas admin

source: When :mod:`django.contrib.staticfiles` is in :setting:`INSTALLED_APPS`, the Django development server automatically serves the static files of the admin app (and any other installed apps). This is however not the case when you use any other server arrangement. You're responsible for setting up Apache, or whichever Web server you're using, to serve the admin files.
el: Όταν η εφαρμογή :mod:`django.contrib.staticfiles` είναι μέσα στα :setting:`INSTALLED_APPS`, ο Django development server αυτόματα εξυπηρετεί τα static files της εφαρμογής admin (και κάθε άλλης εγκατεστημένης εφαρμογής). Αυτό, ωστόσο, δεν ισχύει ότι χρησιμοποιείτε κάποια άλλη διάταξη server. Είστε υπεύθυνοι για να ρυθμίσετε τον Apache ή οποιονδήποτε άλλο Web server χρησιμοποιείτε, για να εξυπηρετήσετε τα αρχεία για το site του admin.
id: Ketika :mod:`django.contrib.staticfiles` berada dalam :setting:`INSTALLED_APPS`, peladen pengembangan Django otomatis melayani berkas-berkas tetap dari aplikasi admin (dan aplikasi terpasang lainnya). Ini bagaimanapun bukan kasus ketika anda menggunakan pengaturan peladen lainnya. Anda bertanggungjawab untuk mengatur Apache, atau peladen Jaringan manapun anda sedang gunakan, untuk melayani berkas-berkas admin.

source: The admin files live in (:file:`django/contrib/admin/static/admin`) of the Django distribution.
el: Τα αρχεία του admin βρίσκονται στην τοποθεσία :file:`django/contrib/admin/static/admin` της Django διανομής.
id: Berkas admin tinggal di (:file:`django/contrib/admin/static/admin`) dari penyaluran Django.

source: We **strongly** recommend using :mod:`django.contrib.staticfiles` to handle the admin files (along with a Web server as outlined in the previous section; this means using the :djadmin:`collectstatic` management command to collect the static files in :setting:`STATIC_ROOT`, and then configuring your Web server to serve :setting:`STATIC_ROOT` at :setting:`STATIC_URL`), but here are three other approaches:
el: Συνιστούμε **θερμά** να χρησιμοποιείτε την εφαρμογή :mod:`django.contrib.staticfiles` για να διαχειριστείτε τα αρχεία του admin (μαζί με κάποιον Web server όπως περιγράφηκε στην προηγούμενη ενότητα. Αυτό σημαίνει ότι χρησιμοποιείτε την διαχειριστική εντολή :djadmin:`collectstatic` για να συγκεντρώσετε τα static files στο φάκελο in :setting:`STATIC_ROOT` και κατόπιν να ρυθμίσετε τον Web server σας να εξυπηρετεί το φάκελο :setting:`STATIC_ROOT` στη διεύθυνση :setting:`STATIC_URL`), αλλά αν δεν το κάνετε, παρακάτω φαίνονται τρεις διαφορετικές προσεγγίσεις του θέματος:
id: Kami **sangat kuat** menganjurkan menggunakan :mod:`django.contrib.staticfiles` untuk menangani berkas-berkas admin (bersama dengan peladen Jaringan sebagai gambaran peta di bagian sebelumnya; ini berarti menggunakan perintah pengelolaan :djadmin:`collectstatic` untuk mengumpulkan berkas-berkas tetap dalam :setting:`STATIC_ROOT`, dan ketika mengkonfigurasi peladen Jaringan anda untuk melayani :setting:`STATIC_ROOT` pada :setting:`STATIC_URL`), tetapi disini adalah tiga pendekatan lain:

source: Create a symbolic link to the admin static files from within your document root (this may require ``+FollowSymLinks`` in your Apache configuration).
el: Δημιουργήστε ένα symbolic link στα static files του admin από το document root σας (αυτό ίσως απαιτήσει να χρησιμοποιήσετε το ``+FollowSymLinks`` στη ρύθμιση του Apache).
id: Buat sebuah tautan simbolis ke berkas statis admin dari dalam akar dokumen anda (ini mungkin membutuhkan ``+FollowSymLinks`` dalam konfigurasi Apache anda).

source: Use an ``Alias`` directive, as demonstrated above, to alias the appropriate URL (probably :setting:`STATIC_URL` + ``admin/``) to the actual location of the admin files.
el: Χρησιμοποιήστε ένα directive ``Alias``, όπως περιγράφηκε παραπάνω, για να κάνετε alias το κατάλληλο URL (πιθανόν το :setting:`STATIC_URL` + ``admin/``) με την ακριβή τοποθεσία των αρχείων του admin.
id: Gunakan sebuah petunjuk ``Alias``, seperti yang ditampilkan diatas, untuk alias URL yang sesuai (mungkin :setting:`STATIC_URL` + ``admin/``) ke tempat sebenarnya dari berkas-berkas admin.

source: Copy the admin static files so that they live within your Apache document root.
el: Αντιγράψτε τα static files του admin ούτως ώστε να υπάρχουν μέσα στο document root του Apache σας.
id: Salin berkas tetap admin sehingga mereka berada dalam akar dokumen Apache anda.

source: Django provides a handler to allow Apache to authenticate users directly against Django's authentication backends. See the :doc:`mod_wsgi authentication documentation </howto/deployment/wsgi/apache-auth>`.
el: Το Django παρέχει έναν handler που επιτρέπει στον Apache να πιστοποιεί τους χρήστες απ’ ευθείας μέσω το σύστημα πιστοποίησης του Django. Δείτε περισσότερα στο εγχειρίδιο της :doc:`πιστοποίησης του mod_wsgi </howto/deployment/wsgi/apache-auth>`.
id: Django menyediakan sebuah penanganan untuk mengizinkan Apache untuk membuktikan keaslian pengguna secara langsung terhadap backend pembuktian keaslian Django. Lihat :doc:`mod_wsgi authentication documentation </howto/deployment/wsgi/apache-auth>`.

source: How to use Django with uWSGI
el: Πως να χρησιμοποιήσετε το Django με το uWSGI
id: Bagaimana menggunakan Django dengan uWSGI

source: uWSGI_ is a fast, self-healing and developer/sysadmin-friendly application container server coded in pure C.
el: Το uWSGI_ είναι ένας γρήγορος, αυτό-θεραπευόμενος και φιλικός προς τον developer και τον διαχειριστή application container server ο οποίος είναι γραμμένος αμιγώς σε C.
id: uWSGI_ adalah cepat, menyembuhkan-sendiri dan wadah peladen aplikasi developer/sysadmin-friendly dikodekan dalam C murni.

source: The uWSGI docs offer a `tutorial`_ covering Django, nginx, and uWSGI (one possible deployment setup of many). The docs below are focused on how to integrate Django with uWSGI.
el: Τα εγχειρίδια του uWSGI παρέχουν ένα `tutorial`_ που καλύπτουν το Django, τον nginx και το uWSGI (ένας από τους πολλούς συνδυασμούς για να κάνετε deployment). Τα άρθρα, παρακάτω, εστιάζουν στο πως να ενσωματώσετε το Django με το uWSGI.
id: Dokumen uWSGI menawarkan sebuah `tutorial`_ mencangkup Django, nginx, dan uWSGI (satu kemungkinan penyebaran pengaturan dari banyak). Dokumen dibawah fokus pada bagaimana menggabungkan Django dengan uWSGI.

source: Prerequisite: uWSGI
el: Προαπαιτούμενο: uWSGI
id: Prasyarat: uWSGI

source: The uWSGI wiki describes several `installation procedures`_. Using pip, the Python package manager, you can install any uWSGI version with a single command. For example:
el: Το uWSGI wiki περιγράφει πολλά `installation procedures`_. Μπορείτε να εγκαταστήσετε οποιαδήποτε uWSGI έκδοση επιθυμείτε χρησιμοποιώντας τον διαχειριστή πακέτων της Python, pip. Για παράδειγμα:
id: Wiki uWSGI menggambarkan beberapa `installation procedures`_. Menggunakan pip, pengelola paket Python, anda dapat memasang versi uWSGI apapun dengan perintah tunggal. Sebagai contoh:

source: Some distributions, including Debian and Ubuntu, ship an outdated version of uWSGI that does not conform to the WSGI specification. Versions prior to 1.2.6 do not call ``close`` on the response object after handling a request. In those cases the :data:`~django.core.signals.request_finished` signal isn't sent. This can result in idle connections to database and memcache servers.
el: Μερικές διανομές, συμπεριλαμβανομένων της Debian και του Ubuntu, έρχονται με ξεπερασμένες εκδόσεις του uWSGI οι οποίες δεν συμμορφώνονται με την προδιαγραφή του WSGI. Εκδόσεις πριν την 1.2.6 δεν καλούν τη μέθοδο ``close`` στο response object μετά το πέρας χειρισμού ενός request. Σε αυτές τις περιπτώσεις το σήμα :data:`~django.core.signals.request_finished` δεν στέλνεται. Αυτό μπορεί να έχει ως αποτέλεσμα αδρανείς συνδέσεις στη βάση δεδομένων και στους memcache servers.
id: Beberapa penyaluran, termasuk Debian dan Ubuntu, mengemas versi lama dari uSWGI yang tidak memenuhi spesifikasi WSGI. Versi sebelumnya sampai 1.2.6 jangan memanggil ``close`` pada obyek tanggapan setelah menangani sebuah permintaan. Dalam kasus-kasus tersebut sinyal :data:`~django.core.signals.request_finished` tidak dikirim. Ini dapat menghasilkan hubungan diam ke basisdata dan peladen memcache.

source: uWSGI model
el: Το μοντέλο του uWSGI
id: Model uWSGI

source: uWSGI operates on a client-server model. Your Web server (e.g., nginx, Apache) communicates with a django-uwsgi "worker" process to serve dynamic content. See uWSGI's `background documentation`_ for more detail.
el: Το uWSGI λειτουργεί πάνω σε ένα μοντέλο client-server. Ο Web server σας (πχ nginx, Apache) επικοινωνεί με ένα django-uwsgi "worker" process για να εξυπηρετήσει δυναμικό περιεχόμενο. Δείτε στο `background documentation`_ του uWSGI για περισσότερες λεπτομέρειες.
id: uWSGI berjalan pada model klien-peladen. Peladen Jaringan anda (sebagai contoh nginx, Apache) berkomunikasi dengan pengolahan "worker" uwsgi-django untuk melayani isi dinamis. Lihat `background documentation`_ uWSGI untuk lebih rinci.

source: Configuring and starting the uWSGI server for Django
el: Παραμετροποιώντας και ξεκινώντας τον uWSGI server για το Django
id: Mengkonfigurasi dan memulai peladen uWSGI untuk Django

source: uWSGI supports multiple ways to configure the process. See uWSGI's `configuration documentation`_ and `examples`_.
el: Το uWSGI υποστηρίζει πολλούς τρόπους για να παραμετροποιήσετε το process. Δείτε στο `configuration documentation`_ και στο `examples`_ του uWSGI.
id: uWSGI mendukung banyak cara untuk mengkonfigurasikan pengolahan. Lihat `configuration documentation`_ uWSGI dan `examples`_.

source: Here's an example command to start a uWSGI server::
el: Παρακάτω φαίνεται ένα παράδειγμα της εντολής ``uwsgi`` για να ξεκινήσετε έναν uWSGI server::
id: Ini adalah sebuah contoh perintah untuk memulai peladen uWSGI::

source: This assumes you have a top-level project package named ``mysite``, and within it a module :file:`mysite/wsgi.py` that contains a WSGI ``application`` object. This is the layout you'll have if you ran ``django-admin startproject mysite`` (using your own project name in place of ``mysite``) with a recent version of Django. If this file doesn't exist, you'll need to create it. See the :doc:`/howto/deployment/wsgi/index` documentation for the default contents you should put in this file and what else you can add to it.
el: Τα παραπανω προϋποθέτουν ότι έχετε ένα project με το όνομα ``mysite`` και μέσα σε αυτό ένα module :file:`mysite/wsgi.py` το οποίο περιέχει ένα WSGI ``application`` object. Αυτή θα είναι η διάταξη που θα έχετε αν τρέξετε την εντολή ``django-admin startproject mysite`` (χρησιμοποιώντας το δικό σας όνομα project στη θέση του ``mysite``, φυσικά) με μια νεώτερη έκδοση του Django. Αν το αρχείο :file:`mysite/wsgi.py` δεν υπάρχει, θα χρειαστεί να το δημιουργήσετε. Δείτε στο άρθρο :doc:`Πως να ανεβάσετε το site σας χρησιμοποιώντας το WSGI </howto/deployment/wsgi/index>` για τα προεπιλεγμένα περιεχόμενα που θα πρέπει να βάλετε σε αυτό το αρχείο καθώς και άλλα που μπορείτε να προσθέσετε.
id: Ini menganggap anda mempunyai paket proyek tingkat-tinggi bernama ``mysite``, dan dalamnya sebuah modul :file:`mysite/wsgi.py` yang mengandung obyek ``application`` WSGI. Ini adalah tata letak anda akan punyai jika anda menjalankan ``django-admin startproject mysite`` (menggunakan nama proyek anda sendiri di tempat ``mysite``) dengan versi baru dari Django. Jika berkas ini tidak ada, anda akan butuh membuatnya. Lihat dokumentasi :doc:`/howto/deployment/wsgi/index` untuk isi awal anda harus taruh dalam berkas ini dan apa lagi anda dapat tambahkan ke dia.

source: The Django-specific options here are:
el: Οι επιλογές που αφορούν το Django είναι:
id: Pilihan khusus-Django disini adalah:

source: ``chdir``: The path to the directory that needs to be on Python's import path -- i.e., the directory containing the ``mysite`` package.
el: ``chdir``: Το path στο φάκελο που χρειάζεται να είναι στο import path της Python -- πχ ο φάκελος που περιέχει το project ``mysite``.
id: ``chdir``: Jalur ke direktori yang dibutuhkan berada di jalur impor Python -- yaitu direktori mengandung paket ``mysite``.

source: ``module``: The WSGI module to use -- probably the ``mysite.wsgi`` module that :djadmin:`startproject` creates.
el: `module``: Το module WSGI που θα χρησιμοποιηθεί -- πιθανόν το αρχείο ``mysite.wsgi`` που δημιουργεί η εντολή :djadmin:`startproject`.
id: ``module``: modul WSGI dogunakan -- mungkin modul ``mysite.wsgi`` yang :djadmin:`startproject` buat.

source: ``env``: Should probably contain at least ``DJANGO_SETTINGS_MODULE``.
el: ``env``: Θα πρέπει να περιέχει τουλάχιστον τη μεταβλητή ``DJANGO_SETTINGS_MODULE``.
id: ``env``: mungkin harus mengandung setidaknya ``DJANGO_SETTINGS_MODULE``.

source: ``home``: Optional path to your project virtualenv.
el: ``home``: Προαιρετικό path για το to virtualenv του project σας.
id: ``home``: path pilihan untuk virtualenv dari proyek anda.

source: Example ini configuration file::
el: Παράδειγμα του configuration αρχείου ini::
id: Contoh di berkas konfigurasi::

source: Example ini configuration file usage::
el: Παράδειγμα χρήσης του configuration αρχείου ini::
id: Contoh penggunaan berkas konfigurasi ini::

source: If you get a ``UnicodeEncodeError`` when uploading files with file names that contain non-ASCII characters, make sure uWSGI is configured to accept non-ASCII file names by adding this to your ``uwsgi.ini``::
el: Αν λαμβάνετε το σφάλμα ``UnicodeEncodeError`` όταν ανεβάζετε αρχεία που τα ονόματα τους περιέχουν χαρακτήρες που δεν ανήκουν στον ASCII κώδικα (όπως είναι οι ελληνικοί χαρακτήρες), σιγουρευτείτε ότι ο uWSGI είναι ρυθμισμένος να δέχεται ονόματα αρχείων με χαρακτήρες που δεν είναι ASCII, προσθέτωντας το παρακάτω στο αρχείο ``uwsgi.ini``::
id: Jika anda mendapatkan sebuah ``UnicodeEncodeError`` ketika mengunggah berkas-berkas dengan nama-nama berkas yang mengandung karakter bukan ASCII, pastikan uWSGI dikonfigurasikan untuk menerima nama-nama berkas bukan ASCII dengan menambahkan ini ke ``uwsgi.ini``::

source: See the uWSGI docs on `managing the uWSGI process`_ for information on starting, stopping and reloading the uWSGI workers.
el: Ανατρέξτε στα εγχειρίδια του uWSGI σχετικά με `managing the uWSGI process`_ για πληροφορίες σχετικά με την εκκίνηση, παύση και επαναφόρτωση των uWSGI workers.
id: Lihat dokumentasi uWSGI pada `managing the uWSGI process`_ untuk informasi pada permulaan, pemberhentian dan memuat kembali pekerja-pekerja uWSGI.

source: When you're running a public site you should always turn off the :setting:`DEBUG` setting. That will make your server run much faster, and will also prevent malicious users from seeing details of your application that can be revealed by the error pages.
el: Όταν έχετε στον αέρα την ιστοσελίδα σας θα πρέπει να έχετε πάντα απενεργοποιημένη την επιλογή :setting:`DEBUG`, ήτοι να είναι ``False``. Αυτό θα κάνει τον server σας πιο γρήγορο και θα αποτρέψει τους κακόβουλους χρήστες να δουν λεπτομέρειες σχετικά με την εφαρμογή σας οι οποίες εμφανίζονται όταν προκύπτουν σφάλματα στη σελίδα.
id: Ketika anda sedang menjalankan situs umum anda harus selalu mematikan pengaturan :setting:`DEBUG`. Itu akan membuat peladen anda berjalan lebih cepat, dan juga akan mencegah pengguna hahat dari melihat rincian dari aplikasi anda yang dapat diungkap dengan kesalahan halaman.
