Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: The actual implementation of :ttag:`{% comment %}<comment>` is slightly different in that it allows broken template tags to appear between ``{% comment %}`` and ``{% endcomment %}``. It does so by calling ``parser.skip_past('endcomment')`` instead of ``parser.parse(('endcomment',))`` followed by ``parser.delete_first_token()``, thus avoiding the generation of a node list.
el: Η υλοποίηση του tag :ttag:`{% comment %} <comment>` διαφέρει ελαφρώς στο ότι επιτρέπει την εμφάνιση broken template tags μεταξύ του ``{% comment %}`` και του ``{% endcomment %}``. Το κάνει αυτό καλώντας τη μέθοδο ``parser.skip_past('endcomment')`` αντί της ``parser.parse(('endcomment',))`` ακολουθούμενη από τη μέθοδο ``parser.delete_first_token()``, με αποτέλεσμα την αποφυγή της δημιουργίας μιας λίστας από nodes.
id: Penerapan sebenarnya dari :ttag:`{% comment %}<comment>` adalah sedikit berbeda dalam memungkinkan merusak cetakan etiket untuk muncul diantara ``{% comment %}`` dan ``{% endcomment %}``. Dia melakukannya dengan memanggil ``parser.skip_past('endcomment')`` daripada ``parser.parse(('endcomment',))`` diikuti oleh ``parser.delete_first_token()``, jadi menghindari generasi dari sebuah daftar node.

source: ``parser.parse()`` takes a tuple of names of block tags ''to parse until''. It returns an instance of ``django.template.NodeList``, which is a list of all ``Node`` objects that the parser encountered ''before'' it encountered any of the tags named in the tuple.
el: Η μέθοδος ``parser.parse()`` παίρνει ένα tuple από ονόματα block tags ''να γίνει parse μέχρι''. Επιστρέφει ένα instance του ``django.template.NodeList``, το οποίο είναι μια λίστα από ``Node`` objects τα οποία βρήκε ο parser ''πριν'' βρει κάποιο από τα tags που είναι μέσα στο tuple.
id: ``parser.parse()`` mengambil sebuah tuple dari nama dari blok etiket "untuk diurai sampai". Dia mengembalikan sebuah instance dari ``django.template.NodeList``, yaitu sebuah daftar dari semua obyek ``Node`` yang pengurai jumpai "sebelum" dia menjumpai etiket dinamai apapun dalam tuple.

source: In ``"nodelist = parser.parse(('endcomment',))"`` in the above example, ``nodelist`` is a list of all nodes between the ``{% comment %}`` and ``{% endcomment %}``, not counting ``{% comment %}`` and ``{% endcomment %}`` themselves.
el: Στο ``"nodelist = parser.parse(('endcomment',))"`` στο παραπάνω παράδειγμα, η ``nodelist`` είναι μια λίστα από όλα τα nodes μεταξύ του ``{% comment %}`` και του ``{% endcomment %}``, χωρίς τα ίδια τα ``{% comment %}`` και ``{% endcomment %}``.
id: Dalam ``"nodelist = parser.parse(('endcomment',))"`` di contoh atas, ``nodelist`` adalah sebuah daftar dari semua node diantara ``{% comment %}`` dan ``{% endcomment %}``, bukan menghitung ``{% comment %}`` dan ``{% endcomment %}`` mereka sendiri.

source: After ``parser.parse()`` is called, the parser hasn't yet "consumed" the ``{% endcomment %}`` tag, so the code needs to explicitly call ``parser.delete_first_token()``.
el: Αφού καλεστεί η ``parser.parse()``, ο parser δεν έχει "καταναλώσει" ακόμα το ``{% endcomment %}`` tag, οπότε ο κώδικας χρειάζεται να καλέσει ρητώς τη μέθοδο ``parser.delete_first_token()``.
id: Setelah ``parser.parse()`` dipanggil, pengurai belum "mengkonsumsi" etiket ``{% endcomment %}``, jadi kode butuh secara eksplisit memanggil ``parser.delete_first_token()``.

source: ``CommentNode.render()`` simply returns an empty string. Anything between ``{% comment %}`` and ``{% endcomment %}`` is ignored.
el: Η μέθοδος ``CommentNode.render()`` απλώς επιστρέφει ένα κενό string. Οτιδήποτε μεταξύ του ``{% comment %}`` και ``{% endcomment %}`` αγνοείται.
id: ``CommentNode.render()`` mengembalikan sebuah deretan karakter kosong. Apapun diantara ``{% comment %}`` dan ``{% endcomment %}`` diabaikan.

source: Parsing until another block tag, and saving contents
el: Κάνοντας parsing μέχρι να βρεθεί κάποιο άλλο block tag και αποθήκευση περιεχομένων
id: Mengurai sampai blok etiket lainnya, dan menyimpan isi

source: In the previous example, ``do_comment()`` discarded everything between ``{% comment %}`` and ``{% endcomment %}``. Instead of doing that, it's possible to do something with the code between block tags.
el: Στο προηγούμενο παράδειγμα, η συνάρτηση ``do_comment()`` απέρριπτε τα πάντα μεταξύ του blck tag ``{% comment %}`` και ``{% endcomment %}``, επειδή θεωρούνταν σχόλια και αυτά δεν γινόντουσαν render στην τελική σελίδα που θα έβλεπε ο χρήστης. Αντί να γίνεται αυτό, μπορείτε να κάνετε κάτι με τον κώδικα μεταξύ των block tags.
id: Di contoh sebelumnya, ``do_comment()`` menyingkirkan apapun diantara ``{% comment %}`` and ``{% endcomment %}``. Daripada melakukan itu, dimungkinkan untuk melakukan sesuatu dengan kode diantara blok etiket.

source: For example, here's a custom template tag, ``{% upper %}``, that capitalizes everything between itself and ``{% endupper %}``.
el: Για παράδειγμα, εδώ φαίνεται ένα παραμετροποιήσιμο template tag, με το όνομα ``{% upper %}``, το οποίο μετατρέπει σε κεφαλαία γράμματα όλους τους χαρακτήρες μεταξύ του ίδιου και του ``{% endupper %}``.
id: Sebagai contoh, ini adalah penyesuaian cetakan etiket, ``{% upper %}``, yang menghuruf besarkan semuanya diantara dia sendiri dan ``{% endupper %}``.

source: Usage:
el: Χρήση
id: Penggunaan:

source: As in the previous example, we'll use ``parser.parse()``. But this time, we pass the resulting ``nodelist`` to the ``Node``::
el: Όπως στο προηγούμενο παράδειγμα, θα χρησιμοποιήσουμε τη μέθοδο ``parser.parse()``. Αλλά αυτή τη φορά, θα περάσουμε τη ``nodelist`` στο ``Node``, εν αντιθέσει με την προηγούμενη φορά που επιστρέφαμε το ``CommentNode()`` χωρίς κάποιο ``nodelist`` μέσα::
id: Seperti di contoh sebelumnya, kami akan menggunakan ``parser.parse()``. Tetapi kali ini, kami melewatkan hasil ``nodelist`` ke ``Node``::

source: The only new concept here is the ``self.nodelist.render(context)`` in ``UpperNode.render()``.
el: Η μοναδική καινούργια έννοια εδώ είναι το ``self.nodelist.render(context)`` μέσα στη μέθοδο ``UpperNode.render()``.
id: Satu-satunya konsep disini adalah ``self.nodelist.render(context)`` dalam ``UpperNode.render()``.

source: For more examples of complex rendering, see the source code of :ttag:`{% for %}<for>` in ``django/template/defaulttags.py`` and :ttag:`{% if %}<if>` in ``django/template/smartif.py``.
el: Για περισσότερα παραδείγματα περίπλοκων renderings, δείτε τον πηγαίο κώδικα του tag :ttag:`{% for %} <for>` στο αρχείο ``django/template/defaulttags.py`` και το tag :ttag:`{% if %} <if>` στο αρχείο ``django/template/smartif.py``.
id: Untuk lebih contoh dari pembangunan rumit, lihat kode sumber dari :ttag:`{% for %}<for>` dalam ``django/template/defaulttags.py`` dan :ttag:`{% if %}<if>` di ``django/template/smartif.py``.

source: Deployment checklist
el: Λίστα ελέγχου για το Deployment
id: Daftar centang penyebaran

source: The Internet is a hostile environment. Before deploying your Django project, you should take some time to review your settings, with security, performance, and operations in mind.
el: Το Internet είναι ένα εχθρικό περιβάλλον. Πριν ανεβάσετε το Django project σας για το ευρύ κοινό, θα πρέπει να αφιερώσετε λίγο χρόνο να ξανακοιτάξετε τις ρυθμίσεις σας σχετικά με την ασφάλεια, την απόδοση και την λειτουργικότητα.
id: Internet adalah lingkungan yang bermusuhan. Sebelum menyebarkan proyek Django anda, anda harus mengambil beberapa waktu untuk meninjau pengaturan anda, dengan penampilan keamanan, dan tindakan dalam pikiran.

source: Django includes many :doc:`security features </topics/security>`. Some are built-in and always enabled. Others are optional because they aren't always appropriate, or because they're inconvenient for development. For example, forcing HTTPS may not be suitable for all websites, and it's impractical for local development.
el: Το Django περιέχει πολλά :doc:`χαρακτηριστικά ασφαλείας </topics/security>`. Κάποια είναι προεγκατεστημένα και πάντα ενεργοποιημένα. Κάποια άλλα είναι προαιρετικά επειδή δεν είναι πάντα κατάλληλα ή είναι μη βολικά για το development. Για παράδειγμα, ο εξαναγκασμός για χρήση HTTPS ίσως όχι μόνο να μην είναι κατάλληλο για όλα τα websites αλλά, επίσης, και μη πρακτικό όταν κάνετε development τοπικά στον υπολογιστή σας.
id: Django menyertakan banyak :doc:`fitur keamanan </topics/security>`. Beberapa dibangun dan selalu tersedia. Lainnya pilihan karena mereka tidak selalu sesuai, atau karena mereka susah untuk dikembangkan. Sebagai contoh, memaksa HTTPS mungkin tidak cocok untuk semua situs jaringan, dan dia tidak berguna untuk pengembangan lokal.

source: Performance optimizations are another category of trade-offs with convenience. For instance, caching is useful in production, less so for local development. Error reporting needs are also widely different.
el: Ένα άλλο trade-off είναι μεταξύ των βελτιστοποιήσεων της απόδοσης (performance optimizations) και της ευκολίας. Για παράδειγμα, το caching είναι χρήσιμο στην παραγωγή, αλλά όχι τόσο για τοπικό development (στον υπολογιστή σας). Οι ανάγκες για αναφορά σφαλμάτων είναι, επίσης, διαφορετικές μεταξύ τοπικού (local) και παραγωγικού (production) περιβάλλοντος.
id: Optimalisasi penampilan adalah kategori lain dari penjualan dengan mudahnya. Sebagai contoh, menembolok sangat berguna dalam produksi, sedikit juga untuk pengembangan lokal. Kebutuhan pelaporan kesalahan sangat berbeda.

source: The following checklist includes settings that:
el: Η ακόλουθη λίστα ελέγχου περιλαμβάνει ρυθμίσεις που:
id: Daftar centang berikut menyertakan pengaturan yang:

source: must be set properly for Django to provide the expected level of security;
el: πρέπει να ρυθμιστούν κατάλληλα για το Django για την παροχή του αναμενόμενου επιπέδου ασφαλείας,
id: harus di setel dengan benar untuk Django untuk menyediakan tingkatan diharapkan dari keamanan;

source: are expected to be different in each environment;
el: αναμένονται να είναι διαφορετικές για κάθε περιβάλλον,
id: diharapkan menjadi berbeda dalam setiap lingkungan;

source: enable optional security features;
el: ενεργοποιούν προαιρετικά χαρακτηριστικά ασφαλείας,
id: adakan pilihan fitur keamanan;

source: enable performance optimizations;
el: ενεργοποιούν βελτιστοποιήσεις της απόδοσης και
id: adakan optimalisasi penampilan;

source: provide error reporting.
el: παρέχουν αναφορές σφαλμάτων.
id: menyediakan pelaporan kesalahan.

source: Many of these settings are sensitive and should be treated as confidential. If you're releasing the source code for your project, a common practice is to publish suitable settings for development, and to use a private settings module for production.
el: Πολλές από αυτές τις ρυθμίσεις είναι ευαίσθητες και θα πρέπει να αντιμετωπιστούν ως απόρρητες. Αν πρόκειται να διανείμετε τον πηγαίο κώδικα του project σας, μια κοινή πρακτική είναι να δημοσιοποιήσετε τις κατάλληλες ρυθμίσεις για το αναπτυξιακό περιβάλλον και να χρησιμοποιήσετε ένα προσωπικό module ρυθμίσεων για την παραγωγή. Αντί, λοιπόν, να έχετε ένα μόνο αρχείο ``settings.py`` μπορείτε να έχετε ένα Python package με το όνομα settings και μέσα διάφορα settings αρχεία, καθένα διαφορετικό για κάθε περιβάλλον.
id: Banyak dari setelan ini adalah sesitif dan harus diperlakukan rahasia. Jika anda sedang menerbitkan sumber kode untuk proyek anda, praktik umum adalah menerbitkan pengaturan yang cocok untuk pengembangan, dan menggunakan modul setelan pribadi untuk produksi.

source: Run ``manage.py check --deploy``
el: Τρέξτε την εντολή ``manage.py check --deploy``
id: Jalankan ``manage.py check --deploy``

source: Some of the checks described below can be automated using the :option:`check --deploy` option. Be sure to run it against your production settings file as described in the option's documentation.
el: Μερικοί από τους ελέγχους που περιγράφονται παρακάτω μπορούν να αυτοματοποιηθούν χρησιμοποιώντας την επιλογή :option:`check --deploy`. Σιγουρευτείτε ότι τρέχετε αυτή την εντολή σύμφωνα με το αρχείο ρυθμίσεων που αφορά στο παραγωγικό σας περιβάλλον, όπως περιγράφεται στο εγχειρίδιο της επιλογής αυτής.
id: Beberapa pemeriksaan digambarkan dibawah dapat diotomatisasi menggunakan pilihan :option:`check --deploy`. Pastikan menjalankannya terhadap berkas pengaturan produksi anda seperti yang digambarkan dalam dokumentasi pilihan.

source: Critical settings
el: Σημαντικές ρυθμίσεις
id: Pengaturan kritis

source: **The secret key must be a large random value and it must be kept secret.**
el: **Το μυστικό κλειδί (secret key) πρέπει να είναι μια μεγάλου μήκους τυχαία τιμή και πρέπει να κρατηθεί μυστική.**
id: **Kunci rahasia harus nilai acak besar dan dia harus tetap rahasia.**

source: Make sure that the key used in production isn't used anywhere else and avoid committing it to source control. This reduces the number of vectors from which an attacker may acquire the key.
el: Σιγουρευτείτε ότι το κλειδί που χρησιμοποιείτε σε παραγωγικό περιβάλλον δεν χρησιμοποιείται πουθενά αλλού και αποφύγετε να το κάνετε commit σε κάποιο source control (πχ git, mercurial κλπ). Αυτό ελαχιστοποιεί τις πιθανότητες όπου κάποιος κακόβουλος τρίτος θα μπορούσε να αποκτήσει πρόσβαση στο κλειδί σας.
id: Pastikan bahwa kunci digunakan dalam produksi tidak digunakan dimanapun dan hindari menyerahkannya ke sumber kendali. Ini mengurangi sejumlah vektor dari yang sebuah penyerang mungkin mendapatkan kunci.

source: Instead of hardcoding the secret key in your settings module, consider loading it from an environment variable::
el: Αντί να υπάρχει γραμμένο, ως έχει, το κλειδί στο module των ρυθμίσεων σας, σκεφτείτε να το φορτώνετε από μια environment variable::
id: Daripada kode keras kuncu rahasia dalam modul pengaturan anda, pertimbangkan memuatnya dari sebuah variabel lingkungan::

source: or from a file::
el: ή από ένα αρχείο::
id: atau dari sebuah berkas::

source: **You must never enable debug in production.**
el: **Δεν πρέπει ποτέ να έχετε ενεργοποιημένο το debug στην παραγωγή.
id: **Anda dilarang mengaktifkan debug di lingkungan produksi.**

source: You're certainly developing your project with :setting:`DEBUG = True <DEBUG>`, since this enables handy features like full tracebacks in your browser.
el: Εννοείται πως αναπτύσσετε το project σας με το :setting:`DEBUG = True <DEBUG>`, αφού αυτό παρέχει μερικά χρήσιμα χαρακτηριστικά όπως full tracebacks μέσα στον browser σας.
id: Anda pasti mengembangkan proyek anda dengan :setting:`DEBUG = True <DEBUG>`, sejak ini mengadakan fitur mudah seperti pelacakan kembali penuh dalam perambah anda.

source: For a production environment, though, this is a really bad idea, because it leaks lots of information about your project: excerpts of your source code, local variables, settings, libraries used, etc.
el: Ωστόσο, για ένα παραγωγικό περιβάλλον, αυτό είναι μια εντελώς κακή ιδέα, επειδή διαρρέει πολλές πληροφορίες για το project σας: αποσπάσματα από τον πηγαίο κώδικα σας, τοπικές μεταβλητές, ρυθμίσεις, βιβλιοθήκες που χρησιμοποιείτε κλπ.
id: Untuk sebuah lingkungan produksi, meskipun, ini adalah ide jelek, karena dia membocorkan banyak informasi tentang proyek anda; kutipan dari kode sumber anda, variabel lokal, pengaturan, pustaka-pustaka digunakan, dll.

source: Environment-specific settings
el: Ρυθμίσεις ανάλογα το περιβάλλον
id: Pengaturan lingkungan-khusus

source: When :setting:`DEBUG = False <DEBUG>`, Django doesn't work at all without a suitable value for :setting:`ALLOWED_HOSTS`.
el: Όταν το :setting:`DEBUG = False <DEBUG>`, το Django δεν μπορεί να δουλέψει χωρίς μια κατάλληλη τιμή για την ρύθμιση :setting:`ALLOWED_HOSTS`.
id: Ketika :setting:`DEBUG = False <DEBUG>`, Django tidak bekerja sama sekali tanpa nilai cocok untuk :setting:`ALLOWED_HOSTS`.

source: This setting is required to protect your site against some CSRF attacks. If you use a wildcard, you must perform your own validation of the ``Host`` HTTP header, or otherwise ensure that you aren't vulnerable to this category of attacks.
el: Αυτή η ρύθμιση είναι απαραίτητη για να προστατέψει το site σας από τυχόν CSRF επιθέσεις. Αν χρησιμοποιήσετε ένα wildcard (πχ ``*``), θα πρέπει να φτιάξετε το δικό σας validation για τον HTTP header με το όνομα ``Host`` ή αλλιώς σιγουρευτείτε ότι δεν είστε ευάλωτοι από τέτοιου είδους επιθέσεις.
id: Pengaturan ini dibutuhkan untuk melindungi situs anda terhadap beberapa serangan CSRF. Jika anda menggunakan wildcard, anda harus melakukan pengecekan anda sendiri dari kepala ``Host`` HTTP, atau jika tidak pastikan bahwa anda tidak rentan ke kategori serangan ini.

source: You should also configure the Web server that sits in front of Django to validate the host. It should respond with a static error page or ignore requests for incorrect hosts instead of forwarding the request to Django. This way you'll avoid spurious errors in your Django logs (or emails if you have error reporting configured that way). For example, on nginx you might setup a default server to return "444 No Response" on an unrecognized host:
el: Θα πρέπει επίσης να ρυθμίσετε τον Web server, που βρίσκεται μπροστά από το Django, για να κάνει validate τον host. Θα πρέπει να ανταποκριθεί (respond) με μια στατική σελίδα σφάλματος ή να αγνοήσει τα requests για λανθασμένους hosts αντί να τα προωθεί στο Django. Με αυτό τον τρόπο θα αποφύγετε ψεύτικα σφάλματα μέσα στα Django logs σας (ή στα emails αν έχετε ρυθμίσει κατ’ αυτό τον τρόπο την αναφορά σφαλμάτων). Για παράδειγμα, θα μπορούσατε να ρυθμίσετε τον Web server nginx να επιστρέφει ένα σφάλμα "444 No Response" σε κάθε μη αναγνωρίσιμο host:
id: Anda harus juga mengkonfigurasi peladen Jaringan yang duduk didepan Django untuk mengecek rumah. Dia harus menjadwan dengan halaman kesalahan statis atai mengabaikan permintaan untuk rumah tidak benar dari pada meneruskan permintaan ke Django. Jalan ini anda akan menghindari kesalahan palsu dalam catatan Django anda (atau surel jika anda mempunyai pelaporan kesalahan dokonfigurasi seperti itu). Sebagai contoh, pada nginx anda mungkin menyetel sebuah peladen awal untuk mengembalikan "444 No Response" pada sebuah rumah tidak dikategorikan:

source: If you're using a cache, connection parameters may be different in development and in production.
el: Αν χρησιμοποιείτε μια cache, οι ρυθμίσεις της σύνδεσης ενδέχεται να είναι διαφορετικές μεταξύ του development και του production περιβάλλοντος.
id: Jika anda sedang menggunakan tembolok, parameter tetap mungkin berbeda dalam pengembangan dan dalam produksi.

source: Cache servers often have weak authentication. Make sure they only accept connections from your application servers.
el: Οι cache servers δεν έχουν συνήθως δυνατό σύστημα πιστοποίησης (authentication). Σιγουρευτείτε ότι δέχονται συνδέσεις μόνο από τους application servers σας.
id: Server cache seringnya memiliki autentifikasi yang lemah. Pastikan hanya menerima koneksi dari server aplikasi anda saja.

source: If you're using Memcached, consider using :ref:`cached sessions <cached-sessions-backend>` to improve performance.
el: Αν χρησιμοποιείτε την Memcached, σκεφτείτε μήπως χρησιμοποιήσετε τα :ref:`cached sessions <cached-sessions-backend>` για να βελτιώσετε την απόδοση της εφαρμογής σας.
id: Jika anda sedang menggunakan Memcached, pertimbangkan menggunakan :ref:`cached sessions <cached-sessions-backend>` untuk meningkatkan penampilan.

source: Database connection parameters are probably different in development and in production.
el: Οι παράμετροι σύνδεσης με την βάση δεδομένων είναι πιθανώς διαφορετικές μεταξύ development και production.
id: Parameter hubungan basisdata kemungkinan berbeda di pengembangan dan di produksi.

source: Database passwords are very sensitive. You should protect them exactly like :setting:`SECRET_KEY`.
el: Οι κωδικοί της βάσης δεδομένων είναι πολύ ευαίσθητοι. Άλλωστε πρόκειται για κωδικούς που αν γνωστοποιηθούν, τα πραγματικά δεδομένα σας θα είναι εκτεθειμένα. Θα πρέπει να τους προστατέψετε ακριβώς όπως το :setting:`SECRET_KEY`.
id: Sandi basisdata sangat rahasia. Anda harus melindungi mereka persis seperti :setting:`SECRET_KEY`.

source: For maximum security, make sure database servers only accept connections from your application servers.
el: Για μέγιστη ασφάλεια, σιγουρευτείτε ότι οι database servers δέχονται μόνο συνδέσεις από τους δικούς σας application servers.
id: Untuk keamanan maksimal, pastikan peladen basisdata hanya menerima hubungan dari peladen aplikasi anda.

source: If you haven't set up backups for your database, do it right now!
el: Αν δεν έχετε κάνει κάποιο backup για τη βάση δεδομένων σας, κάντε το τώρα! Σκεφτείτε επίσης να κάνετε συχνά backup (πχ τα ξημερώματα κάθε μέρα) μέσω ενός cron job.
id: Jika anda belum menyetel sokongan basisdata anda, lakukan sekarang!

source: :setting:`EMAIL_BACKEND` and related settings
el: :setting:`EMAIL_BACKEND` και σχετικές ρυθμίσεις
id: :setting:`EMAIL_BACKEND` dan pengaturan terkait

source: If your site sends emails, these values need to be set correctly.
el: Αν το site σας στέλνει emails, αυτές οι τιμές πρέπει να οριστούν καταλλήλως.
id: Jika situs anda mengirim email, nilai ini butuh disetel dengan benar.

source: By default, Django sends email from webmaster@localhost and root@localhost. However, some mail providers reject email from these addresses. To use different sender addresses, modify the :setting:`DEFAULT_FROM_EMAIL` and :setting:`SERVER_EMAIL` settings.
el: Από προεπιλογή, το Django στέλνει email από τις διευθύνσεις webmaster@localhost και root@localhost. Ωστόσο, μερικοί πάροχοι email απορρίπτουν τα email από αυτές τις διευθύνσεις. Για να χρησιμοποιήσετε διαφορετικές διευθύνσεις αποστολέα, αλλάξτε τις ρυθμίσεις :setting:`DEFAULT_FROM_EMAIL` και :setting:`SERVER_EMAIL`.
id: Secara awal, DJango mengirim email dari webmaster@localhost dan root@localhost. BAgaimanapun, beberapa penyedia surat menolak email dari alamat ini. Untuk menggunakan alamat pengirim berbeda, rubah pengaturan :setting:`DEFAULT_FROM_EMAIL` dan :setting:`SERVER_EMAIL`

source: :setting:`STATIC_ROOT` and :setting:`STATIC_URL`
el: :setting:`STATIC_ROOT` και :setting:`STATIC_URL`
id: :setting:`STATIC_ROOT` dan :setting:`STATIC_URL`

source: Static files are automatically served by the development server. In production, you must define a :setting:`STATIC_ROOT` directory where :djadmin:`collectstatic` will copy them.
el: Τα static files (στατικά αρχεία – css, fonts, js, εικόνες κλπ) εξυπηρετούνται αυτόματα από τον development server. Στην παραγωγή, όμως, θα πρέπει να ορίσετε έναν φάκελο :setting:`STATIC_ROOT` όπου η εντολή :djadmin:`collectstatic` θα τα αντιγράψει.
id: Berkas statis otomatis dilayani oleh peladen pengembangan. Di produksi, anda harus menentukan direktori :setting:`STATIC_ROOT` dimana :djadmin:`collectstatic` akan menyalin mereka.

source: See :doc:`/howto/static-files/index` for more information.
el: Δείτε το άρθρο See :doc:`Διαχειρίζοντας τα static files (εικόνες, JavaScript, CSS) </howto/static-files/index>` για περισσότερες πληροφορίες.
id: Lihat :doc:`/howto/static-files/index` untuk informasi lebih.

source: :setting:`MEDIA_ROOT` and :setting:`MEDIA_URL`
el: :setting:`MEDIA_ROOT` και :setting:`MEDIA_URL`
id: :setting:`MEDIA_ROOT` dan :setting:`MEDIA_URL`

source: Media files are uploaded by your users. They're untrusted! Make sure your web server never attempt to interpret them. For instance, if a user uploads a ``.php`` file , the web server shouldn't execute it.
id: Berkas media diunggah oleh pengguna anda. Mereka tidak dapat dipercaya! Pastikan peladen jaringan anda tidak pernah mencoba untuk menafsirkannya. Sebagai contoh, jika pengguna mengunggah berkas ``.php``, peladen jaringan jangan menjalankannya.

source: Now is a good time to check your backup strategy for these files.
el: Τώρα είναι μια καλή στιγμή να ελέγξετε την στρατηγική σας σχετικά με αυτού του είδους τα αρχεία.
id: Sekarang waktu tepat untuk memeriksa strategi sokongan anda untuk berkas ini.
