Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Should return the actual name of name of the file saved (usually the ``name`` passed in, but if the storage needs to change the file name return the new name instead).
el: Θα πρέπει να επιστρέφει το όνομα του αρχείου που αποθηκεύεται (συνήθως αυτό θα είναι το ``name`` που περνάει ως όρισμα. Αλλά αν το σύστημα αποθήκευσης χρειαστεί να αλλάξει το όνομα του αρχείου πριν την αποθήκευση του, θα πρέπει να επιστρέψετε το νέο όνομα).
id: Harus mengembalikan nama sebenarnya dari nama dari berkas tersimpan (biasanya ``name`` disahkan, tetapi jika penyimpanan butuh merubah nama berkas mengembalikan nama baru sebagai gantinya).

source: Returns a filename suitable for use with the underlying storage system. The ``name`` argument passed to this method is either the original filename sent to the server or, if ``upload_to`` is a callable, the filename returned by that method after any path information is removed. Override this to customize how non-standard characters are converted to safe filenames.
el: Επιστρέφει το όνομα του αρχείου το οποίο θεωρείται έγκυρο για να αποθηκευτεί στη συνέχεια από το σύστημα αποθήκευσης. Το όρισμα ``name`` είναι είτε το αρχικό όνομα του αρχείου που στάλθηκε στον server είτε, αν το ``upload_to`` είναι κάποιο callable, το όνομα που επεστράφη από αυτή τη μέθοδο αφού έχει αφαιρεθεί κάθε πληροφορία σχετικά με το path του αρχείου. Μπορείτε να παρακάμψετε αυτή τη μέθοδο για να ελέγξετε το πως οι μη-τυποποιημένοι χαρακτήρες μπορούν να μετατραπούν σε έγκυρα-ασφαλή ονόματα αρχείων.
id: Mengembalikan sebuah nama berkas yang cocok untuk digunakan dengan sistem penyimpanan pokok. Argumen ``name`` dilewati ke cara ini antara berkas nama asli dikirim ke peladen atau, jika ``upload_to`` adalah dapat dipanggil, nama berkas dikembalikan oleh cara tersebut setelah informasi jalur dipindahkan. Kesampingkan ini untuk menyesuaiakan bagaimana karakter bukan-standar dirubah ke nama berkas aman.

source: In older versions, this method was not called when ``upload_to`` was a callable.
el: Σε παλαιότερες εκδόσεις, αυτή η μέθοδος δεν καλούταν αν το ``upload_to`` ήταν callable.
id: Di versi lebih lama, cara ini tidak dipanggil ketika ``upload_to`` dapat dipanggil.

source: The code provided on ``Storage`` retains only alpha-numeric characters, periods and underscores from the original filename, removing everything else.
el: Ο κώδικας του ``Storage`` διατηρεί μόνο τους αλφαριθμητικούς χαρακτήρες, τις τελείες και τις κάτω παύλες από τα αρχικά ονόματα των αρχείων (αυτά που επιλέγονται προς αποθήκευση), αφαιρώντας οποιονδήποτε άλλον χαρακτήρα.
id: Kode disediakan di ``Storage`` hanya mempertahankan karakter alpanumerik, titik dan garis bawah dari nama berkas asli, memindahkan semua yang lainnya.

source: Returns a filename that is available in the storage mechanism, possibly taking the provided filename into account. The ``name`` argument passed to this method will have already cleaned to a filename valid for the storage system, according to the ``get_valid_name()`` method described above.
el: Επιστρέφει ένα όνομα αρχείου το οποίο είναι διαθέσιμο στο μηχανισμό αποθήκευσης και πιθανόν να λαμβάνει υπόψιν του το, περασμένο ως όρισμα, όνομα του αρχείου. Το όρισμα ``name`` θα έχει ήδη μετατραπεί σε κάποιο έγκυρο όνομα αρχείου για αποθήκευση σύμφωνα με την μέθοδο ``get_valid_name()`` που περιγράφηκε πιο πάνω.
id: Mengembalikan nama berkas yang tersedia di mekanisme penyimpanan, barangkali mengambil nama berkas tersedia ke dalam akun. argumen ``name`` dilewati ke cara ini akan sudah dibersihkan ke nama berkas sah untuk sistem penyimpanan, menurut cara ``get_valid_name()`` digambarkan diatas.

source: The length of the filename will not exceed ``max_length``, if provided. If a free unique filename cannot be found, a :exc:`SuspiciousFileOperation <django.core.exceptions.SuspiciousOperation>` exception is raised.
el: Το μήκος του ονόματος του αρχείου δεν μπορεί να υπερβαίνει το ``max_length``, αν αυτό δίνεται. Αν ένα μοναδικό όνομα αρχείου δεν μπορεί να βρεθεί, τότε γίνεται raise το exception :exc:`SuspiciousFileOperation <django.core.exceptions.SuspiciousOperation>`.
id: Panjang dari nama berkas tidak melebihi ``max_length``, jika disediakan. Jika nama berkas unik bebas tidak dapat ditemukan, sebuah pengecualian :exc:`SuspiciousFileOperation <django.core.exceptions.SuspiciousOperation>` muncul.

source: If a file with ``name`` already exists, an underscore plus a random 7 character alphanumeric string is appended to the filename before the extension.
el: Αν κάποιο αρχείο με το όνομα ``name`` υπάρχει ήδη, τότε θα προστεθούν μετά το όνομα, ο χαρακτήρας της κάτω παύλας μαζί με 7 τυχαίους αλφαριθμητικούς χαρακτήρες πριν την κατάληξη του αρχείου.
id: Jika sebuah berkas dengan ``name`` sudah ada, garis bawah ditambah 7 karakter acak alpanumerik string akan ditambahkan ke nama berkas sebelum tambahan.

source: The ``max_length`` argument was added.
id: Argumen ``max_length`` telah ditambahkan.

source: Custom Lookups
el: Παραμετροποιήσιμα Lookups
id: Penyesuaian Pencarian

source: Django offers a wide variety of :ref:`built-in lookups <field-lookups>` for filtering (for example, ``exact`` and ``icontains``). This documentation explains how to write custom lookups and how to alter the working of existing lookups. For the API references of lookups, see the :doc:`/ref/models/lookups`.
el: Το Django προσφέρει μια μεγάλη ποικιλία από :ref:`προεγκατεστημένα lookups <field-lookups>` για το φιλτράρισμα (π.χ ``exact`` και ``icontains``) των δεδομένων σας από την βάση δεδομένων. Το παρών εγχειρίδιο εξηγεί πως να γράψετε δικά σας lookups και πως να αλλάξετε τη συμπεριφορά των ήδη υπαρχουσών lookups. Για την σχετική αναφορά στο API των lookups, δείτε στο άρθρο :doc:`/ref/models/lookups`.
id: Django menawarkan beragam luas dari :ref:`built-in lookups <field-lookups>` untuk penyaringan (sebagai contoh, ``exact`` dan ``icontains``). Dokumentasi ini menjelaskan bagaimana menulis penyesuaian pencarian dan bagaimana mengubah pekerjaan dari pencarian yang ada. Untuk acuan API dari pencarian, lihat :doc:`/ref/models/lookups`.

source: A simple lookup example
el: Ένα απλό lookup παράδειγμα
id: Sebuah contoh pencarian sederhana

source: Let's start with a simple custom lookup. We will write a custom lookup ``ne`` which works opposite to ``exact``. ``Author.objects.filter(name__ne='Jack')`` will translate to the SQL::
el: Ας ξεκινήσουμε με ένα απλό παραμετροποιήσιμο lookup. Θα γράψουμε ένα δικό μας lookup και θα του δώσουμε το όνομα ``ne`` (από τις λέξεις not equal), το οποίο θα έχει την ανάποδη συμπεριφορά του ``exact``. Για παράδειγμα, αν γράψουμε ``Author.objects.filter(name__ne='Jack')``, τότε αυτό θα μεταφραστεί στην SQL ως::
id: Mari kita mulai dengan sebuah penyesuaian pencarian sederhana. Kami akan menulis penyesuaian pencarian ``ne`` yang bekerja berlawawan ke ``exact``. ``Author.objects.filter(name__ne='Jack')`` akan dirubah ke SQL::

source: This SQL is backend independent, so we don't need to worry about different databases.
el: Η παραπάνω εντολή SQL είναι ανεξάρτητη από τη βάση δεδομένων που χρησιμοποιείτε, οπότε δεν θα χρειαστεί να ανησυχούμε γι' αυτό. Όλες οι βάσεις καταλαβαίνουν αυτή τη σύνταξη.
id: Backend SQL berdisi sendiri, sehingga kita tidak perlu khawatir tentang basisdata berbeda.

source: There are two steps to making this work. Firstly we need to implement the lookup, then we need to tell Django about it. The implementation is quite straightforward::
el: Υπάρχουν δύο βήματα που πρέπει να κάνουμε για να δουλέψει το ανωτέρω. Πρώτα, πρέπει να υλοποιήσουμε το lookup και μετά πρέπει να το αναφέρουμε στο Django. Η υλοποίηση είναι λίγο πολύ ευθέως κατανοητή::
id: Terdapat dua langkah untuk membuat ini bekerja. Pertama kami butuh menerapkan pencarian, kemudian kami butuh mengatakan Django tentang ini. Penerapannya sangat mudah::

source: To register the ``NotEqual`` lookup we will just need to call ``register_lookup`` on the field class we want the lookup to be available. In this case, the lookup makes sense on all ``Field`` subclasses, so we register it with ``Field`` directly::
el: Σε αυτό το σημείο απλώς έχουμε ορίσει μια κλάση. Τίποτε περισσότερο. Επόμενο βήμα είναι κάνουμε register το νέο μας ``NotEqual`` lookup με κάποιο πεδίο από τα Django μοντέλα ή με όλα. Θα χρειαστεί να καλέσουμε την ``register_lookup`` πάνω στο πεδίο που θέλουμε αυτό το lookup να είναι διαθέσιμο. Αυτό γίνεται, γιατί σε μερικές περιπτώσεις δεν θέλουμε να έχουμε διαθέσιμο (να φιλτράρουμε, αν θέλετε) το lookup μας σε όλα τα πεδία (πχ IntegerField, DateField κλπ). Αν φτιάξουμε ένα άλλο lookup που να ελέγχει, πχ το πρώτο γράμμα ενός string δεν θα ήταν λογικό να το συνδέσουμε με ένα DateTimeField. Στην προκειμένη περίπτωση, το lookup μπορεί να εφαρμοστεί σε όλων των ειδών τα ``Field`` subclasses, οπότε θα το κάνουμε register με το ``Field`` απ' ευθείας::
id: Untuk mendaftar pencarian ``NotEqual`` kami akan butuh memanggil ``register_lookup`` pada kelas bidang kami ingin pencarian menjadi tersedia. Dalam kasus ini, pencarian dapat dimengerti pada semua subkelas ``Field``, jadi kami mendaftarkannya dengan ``Field`` secara langsung:

source: Lookup registration can also be done using a decorator pattern::
el: Το registration του lookup μπορεί να γίνει και με τη χρήση ενός decorator ως εξής::
id: Pendaftaran pencarian dapat juga dikerjakan menggunakan corak decorator::

source: The ability to use the decorator pattern was added.
id: Kemampuan untuk menggunakan coran decorator telah ditambahkan.

source: We can now use ``foo__ne`` for any field ``foo``. You will need to ensure that this registration happens before you try to create any querysets using it. You could place the implementation in a ``models.py`` file, or register the lookup in the ``ready()`` method of an ``AppConfig``.
el: Τώρα μπορούμε να χρησιμοποιήσουμε το ``foo__ne`` για κάθε τύπο πεδίου του ``foo``. Θα χρειαστεί να βεβαιωθείτε ότι το registration του lookup, γίνεται πριν προσπαθήσετε να δημιουργήσετε querysets χρησιμοποιώντας το. Θα μπορούσατε να τοποθετήσετε τον παραπάνω κώδικα μέσα στο αρχείο ``models.py`` ή να κάνετε register το lookup μέσα στη μέθοδο ``ready()`` στο αντίστοιχο ``AppConfig`` της εφαρμογής σας.
id: Kami sekarang dapat menggunakan ``foo__ne`` untuk setiap bidang ``foo``. Anda akan butuh memastikan bahwa pendaftaran ini terjadi sebelum anda mencoba membuat kumpulan permintaan menggunakannya. Anda dapat menempatkan penerapan dalam sebuah berkas ``models.py``, atau mendaftarkan pencarian dalam cara ``ready()`` dari sebuah ``AppConfig``.

source: Taking a closer look at the implementation, the first required attribute is ``lookup_name``. This allows the ORM to understand how to interpret ``name__ne`` and use ``NotEqual`` to generate the SQL. By convention, these names are always lowercase strings containing only letters, but the only hard requirement is that it must not contain the string ``__``.
el: Ρίχνοντας μια πιο προσεκτική ματιά στην υλοποίηση αυτού του lookup, το πρώτο απαραίτητο attribute που χρειάζεται είναι το ``lookup_name``. Αυτό επιτρέπει στο Django ORM να καταλάβει πως να μεταφράσει το ``name__ne`` και να χρησιμοποιήσει την κλάση ``NotEqual`` για να παράξει την SQL. Συμβατικά, αυτά τα ονόματα είναι πάντα πεζοί χαρακτήρες (μόνο γράμματα) και η μοναδική αυστηρή απαίτηση είναι να μην περιέχουν δύο συνεχόμενες κάτω παύλες, ``__``.
id: Melihat lebih dekat pada penerapan, atribut dibutuhkan pertama adalah ``lookup_name``. Ini mengizinkan ORM untuk memahami bagaimana mengartikan ``name__ne`` dan menggunakan ``NotEqual`` utnuk membangkitkan SQL. Berdasarkan pemufakatan, nama-nama ini selalu deretan karakter huruf kecil mengandung hanya huruf, tetapi persyaratan mutlak adalah bahwa itu harus mengandung deretan karakter ``__``.

source: We then need to define the ``as_sql`` method. This takes a ``SQLCompiler`` object, called ``compiler``, and the active database connection. ``SQLCompiler`` objects are not documented, but the only thing we need to know about them is that they have a ``compile()`` method which returns a tuple containing a SQL string, and the parameters to be interpolated into that string. In most cases, you don't need to use it directly and can pass it on to ``process_lhs()`` and ``process_rhs()``.
id: Kami kemudian butuh menentukan cara ``as_sql``. Ini mengambil obyek ``SQLCompiler``, dipanggil ``compiler``, dan hubungan basisdata aktif. Obyek ``SQLCompiler`` tidak didokumentasikan, tetapi hal yang kita butuhkan untuk mengetahui tentang mereka adalah mereka mempunyai sebuah cara ``compile()`` yang mengembalikan tuple mengandung deretan karakter SQL, dan parameter untuk disisipkan kedalam deretan karakter. Dalam kebanyakan kasus, anda tidak butuh menggunakannya secara langsung dan lewatinya ke ``process_lhs()`` and ``process_rhs()``.

source: A ``Lookup`` works against two values, ``lhs`` and ``rhs``, standing for left-hand side and right-hand side. The left-hand side is usually a field reference, but it can be anything implementing the :ref:`query expression API <query-expression>`. The right-hand is the value given by the user. In the example ``Author.objects.filter(name__ne='Jack')``, the left-hand side is a reference to the ``name`` field of the ``Author`` model, and ``'Jack'`` is the right-hand side.
el: Ένα ``Lookup`` συνεργάζεται με δύο τιμές, την ``lhs`` και την ``rhs``, οι οποίες είναι σύντμηση των λέξεων left-hand side (αριστερό μέρος) και right-hand side (δεξί μέρος). Το αριστερό μέρος αναφέρεται συνήθως σε κάποιο πεδίο αλλά μπορεί να είναι οτιδήποτε αρκεί να έχει υλοποιήσει το :ref:`API για εκφράσεις ερωτημάτων <query-expression>`. Το δεξί μέρος είναι η τιμή η οποία δίνεται από τον χρήστη. Στο παράδειγμα ``Author.objects.filter(name__ne='Jack')``, το αριστερό μέρος αναφέρεται στο πεδίο ``name`` του μοντέλου ``Author`` και το string ``'Jack'`` αποτελεί το δεξί μέρος.
id: Sebuah ``Lookup`` bekerja terhadap dua nilai, ``lhs`` dan ``rhs``, kepanjangan dari left-hand side dan right-hand side. Left-hand side biasanya acuan bidang, tetapi dia dapat menjadi apapun menerapkan :ref:`query expression API <query-expression>`. Right-hand adalah nilai diberikan oleh pengguna. Dalam contoh ``Author.objects.filter(name__ne='Jack')``, the left-hand side adalah sebauh acuan pada bidang ``name`` dari model ``Author``, dan ``'Jack'`` adalah the right-hand side.

source: We call ``process_lhs`` and ``process_rhs`` to convert them into the values we need for SQL using the ``compiler`` object described before. These methods return tuples containing some SQL and the parameters to be interpolated into that SQL, just as we need to return from our ``as_sql`` method. In the above example, ``process_lhs`` returns ``('"author"."name"', [])`` and ``process_rhs`` returns ``('"%s"', ['Jack'])``. In this example there were no parameters for the left hand side, but this would depend on the object we have, so we still need to include them in the parameters we return.
el: Καλούμε την ``process_lhs`` και την ``process_rhs`` για να μετατρέψουμε το ``Author.objects.filter(name__ne='Jack')`` στις τιμές που χρειαζόμαστε για την SQL χρησιμοποιώντας το ``compiler`` object που περιγράψαμε παραπάνω. Αυτές οι μέθοδοι επιστρέφουν tuples που περιέχουν λίγη SQL και κάποιες παραμέτρους που θα “γεμίσουν” αυτή την SQL. Ότι ακριβώς χρειαζόμαστε για να επιστρέψει η μέθοδος ``as_sql``. Στο παραπάνω παράδειγμα, η ``process_lhs`` επιστρέφει ``('"author"."name"', [])`` και η ``process_rhs`` επιστρέφει ``('"%s"', ['Jack'])``. Όπως θα είδατε, δεν υπάρχουν παράμετροι για το αριστερό μέρος, αλλά αυτό εξαρτάται από την περίπτωση. Όπως και να έχει πάντως, θα πρέπει πάντα να περιλαμβάνονται στο τελικό tuple προς επιστροφή (η μεταβλητή ``params`` στην ``as_sql``).
id: Kami memanggil ``process_lhs`` dan ``process_rhs`` untuk merubah mereka kedalam nilai-nilai kami butuh untuk SQL menggunakan obyek ``compiler`` digambarkan sebelumnya. Cara ini mengembalikan tuple mengandung beberapa SQL dan parameter untuk ditambahkan kedaam SQL itu, seperti yang kita perlu untuk mengembalikan cara ``as_sql`` kami. Dalam contoh diatas, ``process_lhs`` mengembalikan ``('"author"."name"', [])`` dan ``process_rhs`` mengembalikan ``('"%s"', ['Jack'])``. Dalam contoh ini tidak ada parameter untuk left hand side, tetapi ini akan tergantung pada obyek kita punya, jadi jami masih butuh menyertakan merekan dalam parameter kami kembalikan.

source: Finally we combine the parts into a SQL expression with ``<>``, and supply all the parameters for the query. We then return a tuple containing the generated SQL string and the parameters.
id: Akhirnya kami memadukan bagian kedalam sebuah pernyataan SQL dengan ``<>``, dan memasok semua parameter untuk permintaan. Kami lalu mengembalikan sebuah tuple mengandung deretan karakter SQL dan parameter yang dibangkitkan.

source: A simple transformer example
el: Ένα απλό παράδειγμα transformer
id: Contoh perubahan sederhana

source: The custom lookup above is great, but in some cases you may want to be able to chain lookups together. For example, let's suppose we are building an application where we want to make use of the ``abs()`` operator. We have an ``Experiment`` model which records a start value, end value, and the change (start - end). We would like to find all experiments where the change was equal to a certain amount (``Experiment.objects.filter(change__abs=27)``), or where it did not exceed a certain amount (``Experiment.objects.filter(change__abs__lt=27)``).
el: Το παραπάνω lookup που φτιάξαμε είναι ωραίο, αλλά σε αρκετές περιπτώσεις θα θέλετε να έχετε τη δυνατότητα να ενώνετε τα lookups μεταξύ τους. Για παράδειγμα, ας υποθέσουμε ότι χτίζουμε μια εφαρμογή όπου θέλουμε να κάνουμε χρήση της μεθόδου ``abs()``, που επιστρέφει το απόλυτο ενός αριθμού. Έχουμε ένα μοντέλο με το όνομα ``Experiment`` το οποίο καταγράφει μια τιμή έναρξης (start), μια τέλους (end) και την αλλαγή (αρχή – τέλος). Θα θέλαμε να βρούμε όλα τα πειράματα (experiments) όπου η αλλαγή ήταν ίση με μια συγκεκριμένη τιμή (``Experiment.objects.filter(change__abs=27)``) ή η αλλαγή ήταν μικρότερη ή ίση μιας συγκεκριμένης τιμής (``Experiment.objects.filter(change__abs__lt=27)``). Εδώ βλέπετε τη σύνδεση μεταξύ των lookups που αναφέραμε πριν (``abs__lt``).
id: Penyesuaian pencarian diatas adalah hebat, tetapi dalam beberapa kasus anda mungkin ingin dapat merangkai pencarian bersama-sama. Sebagai contoh, mari kita misalnya kami sedang membangun sebuah aplikasi dimana kami ingin membuat penggunaan dari operator ``abs()``. Kami mempunyai sebuah model ``Experiment`` yang merekam sebuah nilai awal, nilai akhir, dan perubahan (awal - akhir). Kami akan suka menemukan semua percobaan dimana perubahan setara pada bilangan tertentu (``Experiment.objects.filter(change__abs=27)``), atau dimana itu tidak melebihi bilangan tertentu (``Experiment.objects.filter(change__abs__lt=27)``).

source: This example is somewhat contrived, but it nicely demonstrates the range of functionality which is possible in a database backend independent manner, and without duplicating functionality already in Django.
el: Αυτό το παράδειγμα είναι λίγο πολύ σκηνοθετημένο αλλά επιδεικνύει όμορφα τις λειτουργίες που είναι δυνατόν να υλοποιηθούν χωρίς την εξάρτηση πάνω σε μια συγκεκριμένη βάση δεδομένων και χωρίς να ξαναγράφουμε κώδικα που υπάρχει ήδη στο Django.
id: Contoh ini agak dibikin, tetapi dia menunjukkan jangkauan fungsionalitas yang memungkinkan dalam cara backend basisdata berdisi sendiri, tanpa menggandakan fungsionalitas yang sudah ada di Django.

source: We will start by writing a ``AbsoluteValue`` transformer. This will use the SQL function ``ABS()`` to transform the value before comparison::
el: Θα ξεκινήσουμε γράφοντας έναν ``AbsoluteValue`` transformer (στην ουσία είναι μια δικιά μας κλάση που κληρονομεί από την κλάση ``Transform``). Η κλάση αυτή θα χρησιμοποιήσει την SQL συνάρτηση ``ABS()`` για να μετατρέψει την τιμή πριν την συγκρίνει::
id: Kami akan mulai dengan menulis sebuah pengubah ``AbsoluteValue``. Ini akan menggunakan fungsi SQL ``ABS()`` untuk merubah nilai sebelum dibandingkan::

source: Next, let's register it for ``IntegerField``::
el: Επόμενο βήμα είναι κάνουμε register την κλάση μας με το πεδίο ``IntegerField``::
id: Selanjutnya, mari kita daftarkan sebagai ``IntegerField``::

source: We can now run the queries we had before. ``Experiment.objects.filter(change__abs=27)`` will generate the following SQL::
el: Μπορούμε τώρα να τρέξουμε τα queries στα οποία αναφερθήκαμε παραπάνω. Το ``Experiment.objects.filter(change__abs=27)`` θα παράξει την ακόλουθη SQL εντολή::
id: Kami dapat sekarang menjalankan permintaan kami punyai sebelumnya. ``Experiment.objects.filter(change__abs=27)`` akan membangkitkan SQL berikut::

source: By using ``Transform`` instead of ``Lookup`` it means we are able to chain further lookups afterwards. So ``Experiment.objects.filter(change__abs__lt=27)`` will generate the following SQL::
el: Χρησιμοποιώντας την ``Transform`` αντί της ``Lookup`` μας επιτρέπει να συνδέουμε περαιτέρω lookups στην αλυσίδα. Επομένως το ``Experiment.objects.filter(change__abs__lt=27)`` θα παράξει την ακόλουθη SQL εντολή::
id: Dengan menggunakan ``Transform`` dari pada ``Lookup`` itu berarti kami dapat merangkai pencarian lebih lanjut setelahnya. Jadi ``Experiment.objects.filter(change__abs__lt=27)`` akan membangkitkan SQL berikut::

source: Note that in case there is no other lookup specified, Django interprets ``change__abs=27`` as ``change__abs__exact=27``.
el: Σημειώστε ότι στην περίπτωση που δεν υπάρχει άλλο lookup στο τέλος, το Django μεταφράζει το ``change__abs=27`` ως ``change__abs__exact=27``.
id: Catat bahwa dalam kasus terdapat tidak ada pencarian lain yang ditentukan, Django menterjemahkan ``change__abs=27`` sebagai ``change__abs__exact=27``.
