Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: The :meth:`~Field.db_type` and :meth:`~Field.rel_db_type` methods are called by Django when the framework constructs the ``CREATE TABLE`` statements for your application -- that is, when you first create your tables. The methods are also called when constructing a ``WHERE`` clause that includes the model field -- that is, when you retrieve data using QuerySet methods like ``get()``, ``filter()``, and ``exclude()`` and have the model field as an argument. They are not called at any other time, so it can afford to execute slightly complex code, such as the ``connection.settings_dict`` check in the above example.
el: Οι μέθοδοι :meth:`~Field.db_type` και :meth:`~Field.rel_db_type` καλούνται από το Django όταν το framework φτιάχνει τα ``CREATE TABLE`` statements για την εφαρμογή σας -- δηλαδή, στο αρχικό στάδιο δημιουργίας των πινάκων σας. Οι μέθοδοι, καλούνται, επίσης, όταν δημιουργείται μια ``WHERE`` εντολή η οποία περιλαμβάνει το πεδίο του μοντέλου -- δηλαδή, όταν αντλείτε δεδομένα χρησιμοποιώντας μεθόδους QuerySet όπως η ``get()``, ``filter()`` και ``exclude()`` και έχετε περασμένο το πεδίο του μοντέλου ως argument. Οι μέθοδοι αυτές δεν καλούνται κάποια άλλη στιγμή, οπότε αξίζει να εκτελέσουν έναν ελαφρά περίπλοκο κώδικα, όπως το να ελέγξουν το ``connection.settings_dict`` όπως στο παραπάνω παράδειγμα.

source: The :meth:`~Field.rel_db_type` method is called by fields such as ``ForeignKey`` and ``OneToOneField`` that point to another field to determine their database column data types. For example, if you have an ``UnsignedAutoField``, you also need the foreign keys that point to that field to use the same data type::
el: Η μέθοδος :meth:`~Field.rel_db_type` καλείται από πεδία τύπου ``ForeignKey`` και ``OneToOneField`` τα οποία δείχνουν σε ένα άλλο πεδίο για να καθορίσουν τον τύπο δεδομένων της στήλης. Για παράδειγμα, αν έχετε ένα πεδίο τύπου ``UnsignedAutoField``, χρειάζεστε επίσης τα foreign keys τα οποία δείχνουν σε αυτό το πεδίο για να χρησιμοποιηθεί ο ίδιος τύπος δεδομένων::

source: The :meth:`~Field.rel_db_type` method was added.
el: Προστέθηκε η μέθοδος :meth:`~Field.rel_db_type`.

source: Media files are uploaded by your users. They're untrusted! Make sure your web server never attempts to interpret them. For instance, if a user uploads a ``.php`` file, the web server shouldn't execute it.
el: Τα media files τα ανεβάζουν οι χρήστες σας. Χρήστης θεωρείται και ο Django admin που έχει πρόσβαση στο Django admin και μέσα από κει ανεβάζει σε κάποιον server φωτογραφίες, αρχεία κλπ. Αυτού του είδους τα αρχεία είναι μη έμπιστα! Σιγουρευτείτε ότι ο Web server σας δεν θα πρέπει ποτέ να προσπαθήσει να τα εκτελέσει-τρέξει. Για παράδειγμα, αν ένας χρήστης ανεβάσει ένα αρχείο ``.php``, ο Web server δεν θα πρέπει να το εκτελέσει.

source: WSGI servers obtain the path to the ``application`` callable from their configuration. Django's built-in server, namely the :djadmin:`runserver` command, reads it from the :setting:`WSGI_APPLICATION` setting. By default, it's set to ``<project_name>.wsgi.application``, which points to the ``application`` callable in :file:`<project_name>/wsgi.py`.
el: Οι WSGI servers αποκτούν το path στο ``application`` callable από την παραμετροποίηση τους. Ο προεγκατεστημένος server του Django, που τρέχετε με την εντολή :djadmin:`runserver`, διαβάζει το path από τη ρύθμιση :setting:`WSGI_APPLICATION`. Από προεπιλογή, είναι σεταρισμένη στην τιμή ``<project_name>.wsgi.application``, η οποία δείχνει στο ``application`` callable που βρίσκεται μέσα στο αρχείο :file:`<project_name>/wsgi.py`.

source: Once you've got mod_wsgi installed and activated, edit your Apache server's `httpd.conf`_ file and add the following. If you are using a version of Apache older than 2.4, replace ``Require all granted`` with ``Allow from all`` and also add the line ``Order deny,allow`` above it.
el: Αφού εγκαταστήσετε και ενεργοποιήσετε το mod_wsgi, επεξεργαστείτε το αρχείο `httpd.conf`_ του Apache Web server και προσθέστε τα ακόλουθα. Αν χρησιμοποιείτε κάποια έκδοση του Apache παλαιότερη της 2.4, αντικαταστήστε το ``Require all granted`` με το ``Allow from all`` και επίσης προσθέστε τη γραμμή ``Order deny,allow`` από πάνω.

source: Your :setting:`MIDDLEWARE` setting includes :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.
el: Η ρύθμιση :setting:`MIDDLEWARE` περιέχει την :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.

source: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` must appear before other middleware that intercepts 404 errors, such as :class:`~django.middleware.locale.LocaleMiddleware` or :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Put it towards the top of your :setting:`MIDDLEWARE` setting.
el: Η middleware κλάση :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` πρέπει να εμφανίζεται πριν από άλλες middleware οι οποίες ασχολούνται με σφάλματα 404, όπως η κλάση :class:`~django.middleware.locale.LocaleMiddleware` ή :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Βάλτε τη κοντά στην κορυφή της ρύθμισης :setting:`MIDDLEWARE`.

source: However, sometimes certain types of information may be too sensitive and thus may not be appropriate to be kept track of, for example a user's password or credit card number. So in addition to filtering out settings that appear to be sensitive as described in the :setting:`DEBUG` documentation, Django offers a set of function decorators to help you control which information should be filtered out of error reports in a production environment (that is, where :setting:`DEBUG` is set to ``False``): :func:`sensitive_variables` and :func:`sensitive_post_parameters`.
el: Ωστόσο, μερικές φορές, μερικοί τύποι πληροφοριών μπορεί να είναι πολύ ευαίσθητοι και επομένως δεν πρέπει να καταγράφονται, για παράδειγμα το password ενός χρήστη ή ο αριθμός της πιστωτικής του κάρτας. Οπότε, εκτός από το φιλτράρισμα των ρυθμίσεων οι οποίες είναι ευαίσθητες, όπως περιγράφεται στο εγχειρίδιο του :setting:`DEBUG`, το Django προσφέρει ένα σετ από decorator συναρτήσεις για να σας βοηθήσει να ελέγξετε ποιες πληροφορίες θα πρέπει να μένουν εκτός σε αναφορές σφαλμάτων σε ένα παραγωγικό περιβάλλον (ήτοι η ρύθμιση :setting:`DEBUG` είναι ``False``): η συνάρτηση :func:`sensitive_variables` και η :func:`sensitive_post_parameters`.

source: Another common tactic is to serve static files from a cloud storage provider like Amazon's S3 and/or a CDN (content delivery network). This lets you ignore the problems of serving static files and can often make for faster-loading Web pages (especially when using a CDN).
el: Μια άλλη συνηθισμένη τακτική είναι να εξυπηρετείτε τα static files από έναν πάροχο αποθήκευσης αρχείων στο cloud, όπως είναι η υπηρεσία S3 της Amazon και/ή σε κάποιο CDN (content delivery network). Αυτό, φυσικά, σας απαλλάσσει από το πρόβλημα της εξυπηρέτησης των static files και συχνά συμβάλλει στη γρηγορότερη φόρτωση των ιστοσελίδων (ειδικότερα αν χρησιμοποιείτε CDN).

source: In your templates, either hardcode the url like ``/static/my_app/example.jpg`` or, preferably, use the :ttag:`static` template tag to build the URL for the given relative path by using the configured :setting:`STATICFILES_STORAGE` storage (this makes it much easier when you want to switch to a content delivery network (CDN) for serving static files).
el: Στα templates σας, είτε εισάγετε με το χέρι το url για μια εικόνα, πχ κάπως έτσι ``/static/my_app/myexample.jpg`` ή, προτιμότερο, χρησιμοποιήστε το template tag :ttag:`static` για να χτίσετε το URL ενός δοσμένου relative path χρησιμοποιώντας την, ήδη παραμετροποιημένη ρύθμιση :setting:`STATICFILES_STORAGE` (η χρήση του :ttag:`static` κάνει ακόμα πιο εύκολη, μελλοντικά, την μετάβαση σε ένα content delivery network (CDN) για την εξυπηρέτηση των static files).

source: Store your static files in a folder called ``static`` in your app. For example ``my_app/static/my_app/example.jpg``.
el: Αποθηκεύστε τα static files σας σε έναν φάκελο που ονομάζεται ``static`` μέσα στην εκάστοτε εφαρμογή σας. Για παράδειγμα ``my_app/static/my_app/myimage.jpg``.

source: Serving static files during development
el: Εξυπηρετώντας τα static files κατά τη διάρκεια του development

source: Serving files uploaded by a user during development
el: Εξυπηρετώντας αρχεία τα οποία ανέβηκαν από έναν χρήστη κατά τη διάρκεια του development

source: Resolving deprecation warnings
el: Επιλύοντας τα deprecation warnings

source: Before upgrading, it's a good idea to resolve any deprecation warnings raised by your project while using your current version of Django. Fixing these warnings before upgrading ensures that you're informed about areas of the code that need altering.
el: Πριν την αναβάθμιση, μια καλή ιδέα είναι να επιλύσετε τυχόν deprecation warnings τα οποία γίνονται raised από το project σας, με την τρέχουσα έκδοση του Django. Επιδιορθώνοντας αυτά τα warnings, πριν την αναβάθμιση, εγγυάται ότι είστε ενημερωμένοι για τις περιοχές του κώδικα που θέλουν αλλαγή.

source: In Python, deprecation warnings are silenced by default. You must turn them on using the ``-Wall`` Python command line option or the :envvar:`PYTHONWARNINGS` environment variable. For example, to show warnings while running tests:
el: Στην Python, τα deprecation warnings, από προεπιλογή, δεν εμφανίζονται. Θα πρέπει να τα ενεργοποιήσετε χρησιμοποιώντας την παράμετρο ``-Wall`` της εντολής ``python`` ή την environment variable :envvar:`PYTHONWARNINGS`. Για παράδειγμα, για να εμφανίσετε τα warnings όταν τρέχετε τα τεστ σας, χρησιμοποιήστε την εντολή ``python`` ως εξής:

source: If you're not using the Django test runner, you may need to also ensure that any console output is not captured which would hide deprecation warnings. For example, if you use `py.test`:
el: Αν δεν χρησιμοποιείτε τον Django test runner, θα χρειαστεί, επίσης, να σιγουρευτείτε ότι κάθε έξοδος της κονσόλας δεν γίνεται captured, κάτι το οποίο θα έκρυβε τα deprecation warnings. Για παράδειγμα, αν χρησιμοποιείτε το `py.test`:

source: Resolve any deprecation warnings with your current version of Django before continuing the upgrade process.
el: Επιλύστε κάθε deprecation warning με την τρέχουσα έκδοση του Django που χρησιμοποιείτε και μετά προχωρήστε στην διαδικασία της αναβάθμισης.

source: Third party applications might use deprecated APIs in order to support multiple versions of Django, so deprecation warnings in packages you've installed don't necessarily indicate a problem. If a package doesn't support the latest version of Django, consider raising an issue or sending a pull request for it.
el: Οι εφαρμογές τρίτων ίσως χρησιμοποιούν deprecated APIs προκειμένου να υποστηρίξουν πολλές εκδόσεις του Django, οπότε τα deprecation warnings στα πακέτα που έχετε εγκαταστήσει, ίσως να μην αποτελούν πρόβλημα. Αν ένα πακέτο-εφαρμογή δεν υποστηρίζει την τελευταία έκδοση του Django, σκεφτείτε μήπως κάνετε raise κάποιο issue ή να στείλετε ένα pull request για αυτό.

source: When the new environment is set up, :doc:`run the full test suite </topics/testing/overview>` for your application. Again, it's useful to turn on deprecation warnings on so they're shown in the test output (you can also use the flag if you test your app manually using ``manage.py runserver``):
el: Όταν το νέο περιβάλλον είναι έτοιμο, :doc:`τρέξτε ολόκληρη την σουίτα ελέγχων του Django </topics/testing/overview>` για την εφαρμογή σας. Για ακόμη μια φορά, είναι χρήσιμο να ενεργοποιήσετε τα deprecation warnings ούτως ώστε να εμφανίζονται στην κονσόλα που τρέχει τα τεστ (μπορείτε επίσης να χρησιμοποιήσετε το flag για να τεστάρετε την εφαρμογή σας χειροκίνητα, χρησιμοποιώντας το ``manage.py runserver``):

source: To install pip on your machine, go to https://pip.pypa.io/en/latest/installing/, and follow the ``Installing with get-pip.py`` instructions.
el: Για την εγκατάσταση του pip στον υπολογιστή σας, επισκεφτείτε τη σελίδα https://pip.pypa.io/en/latest/installing/ και ακολουθήστε τις οδηγίες στην ενότητα ``Installing with get-pip.py``.

source: Django can be installed easily using ``pip`` within your virtual environment.
el: Το Django μπορεί να εγκατασταθεί εύκολα με το ``pip`` μέσα στο virtual environment που μόλις φτιάξατε.

source: In the command prompt, ensure your virtual environment is active, and execute the following command::
el: Από την γραμμή εντολών, βεβαιωθείτε ότι το virtual environment σας είναι ενεργοποιημένο και εκτελέστε την ακόλουθη εντολή::

source: On databases that support DDL transactions (SQLite and PostgreSQL), migrations will run inside a transaction by default. For use cases such as performing data migrations on large tables, you may want to prevent a migration from running in a transaction by setting the ``atomic`` attribute to ``False``::
el: Στις βάσεις δεδομένων που υποστηρίζουν DDL transactions (όπως η SQLite και η PostgreSQL), τα migrations θα τρέξουν μέσα σε ένα transaction από προεπιλογή. Για τις περιπτώσεις όπου θα πραγματοποιηθούν data migrations σε μεγάλους πίνακες, ίσως να θέλετε να αποτρέψετε το migration να τρέξει μέσα σε ένα transaction θέτοντας το attribute ``atomic`` σε ``False``::

source: Within such a migration, all operations are run without a transaction. It's possible to execute parts of the migration inside a transaction using :func:`~django.db.transaction.atomic()` or by passing ``atomic=True`` to ``RunPython``.
el: Μέσα σε ένα τέτοιο migration, όλες οι λειτουργίες θα τρέξουν εκτός κάποιου transaction. Μπορείτε, επίσης, να τρέξετε μερικά επιμέρους κομμάτια ενός migration μέσα σε ένα transaction χρησιμοποιώντας τη μέθοδο :func:`~django.db.transaction.atomic()` ή περνώντας την παράμετρο ``atomic=True`` στη λειτουργία του ``RunPython``.

source: Here's an example of a non-atomic data migration that updates a large table in smaller batches::
el: Παρακάτω φαίνεται ένα παράδειγμα ενός non-atomic data migration, το οποίο ενημερώνει έναν μεγάλο πίνακα ανά μικρότερα κομμάτια::

source: The ``atomic`` attribute doesn't have an effect on databases that don't support DDL transactions (e.g. MySQL, Oracle).
el: Το attribute ``atomic`` δεν επηρεάζει τις βάσεις δεδομένων οι οποίες δεν υποστηρίζουν τα DDL transactions (πχ MySQL, Oracle).

source: Migrating data between third-party apps
el: Κάνοντας migration των data μεταξύ third-party εφαρμογών

source: You can use a data migration to move data from one third-party application to another.
el: Μπορείτε να χρησιμοποιήσετε το data migration για να μετακινήσετε δεδομένα (data) από μια εφαρμογή τρίτου σε μια άλλη.

source: If you plan to remove the old app later, you'll need to set the ``dependencies`` property based on whether or not the old app is installed. Otherwise, you'll have missing dependencies once you uninstall the old app. Similarly, you'll need to catch :exc:`LookupError` in the ``apps.get_model()`` call that retrieves models from the old app. This approach allows you to deploy your project anywhere without first installing and then uninstalling the old app.
el: Αν σκοπεύετε να αφαιρέσετε αργότερα την παλιά εφαρμογή σας, θα χρειαστεί να ορίσετε το property ``dependencies`` βασιζόμενοι στο αν η παλιά σας εφαρμογή είναι εγκατεστημένη ή όχι. Σε διαφορετική περίπτωση, θα έχετε απόντα dependencies μόλις απεγκαταστήσετε την παλιά εφαρμογή. Ομοίως, θα χρειαστεί να κάνετε catch το exception :exc:`LookupError` μέσα στην κλήση της μεθόδου ``apps.get_model()``η οποία ανακτά τα μοντέλα από την παλιά εφαρμογή. Αυτή η μέθοδος σας επιτρέπει να ανεβάσετε το project σας σε κάποιον server (deployment) χωρίς να χρειάζεται, πρώτα, να εγκαταστήσετε και μετά να απεγκαταστήσετε την παλιά σας εφαρμογή.

source: Here's a sample migration:
el: Παρακάτω φαίνεται ένα δείγμα ενός migration αρχείου:

source: Also consider what you want to happen when the migration is unapplied. You could either do nothing (as in the example above) or remove some or all of the data from the new application. Adjust the second argument of the :mod:`~django.db.migrations.operations.RunPython` operation accordingly.
el: Επίσης, σκεφτείτε τι θα θέλατε να γίνει όταν το migration δεν εφαρμοστεί. Θα μπορούσατε να μην κάνετε τίποτα (όπως στο παραπάνω παράδειγμα) ή να αφαιρέσετε κάποια ή όλα τα data από την καινούργια εφαρμογή. Προσαρμόστε το δεύτερο argument της λειτουργίας του :mod:`~django.db.migrations.operations.RunPython` καταλλήλως.

source: Changing an unmanaged model to managed
el: Αλλαγή ενός unmanaged μοντέλου σε managed

source: If you want to change an unmanaged model (:attr:`managed=False <django.db.models.Options.managed>`) to managed, you must remove ``managed=False`` and generate a migration before making other schema-related changes to the model, since schema changes that appear in the migration that contains the operation to change ``Meta.managed`` may not be applied.
el: Αν θέλετε να αλλάξετε ένα unmanaged μοντέλο (:attr:`managed=False <django.db.models.Options.managed>`) σε managed, θα πρέπει να αφαιρέσετε το ``managed=False`` και να δημιουργήσετε ένα migration προτού κάνετε άλλες αλλαγές στο μοντέλο σχετικά με το schema, αφού οι αλλαγές στο schema οι οποίες εμφανίζονται στο migration που περιέχει την αλλαγή του ``Meta.managed`` ίσως να μην εφαρμοστούν. Με άλλα λόγια, δημιουργήστε και τρέξτε ένα migration μετά την αφαίρεση του ``managed=False`` και κατόπιν μπορείτε ελεύθερα να κάνετε τις schema αλλαγές στο (managed) μοντέλο σας.
