Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: When looking for which lookups are allowable after the ``Transform`` has been applied, Django uses the ``output_field`` attribute. We didn't need to specify this here as it didn't change, but supposing we were applying ``AbsoluteValue`` to some field which represents a more complex type (for example a point relative to an origin, or a complex number) then we may have wanted to specify that the transform returns a ``FloatField`` type for further lookups. This can be done by adding an ``output_field`` attribute to the transform::
el: Για να βρει το Django τον τύπο των lookups που επιτρέπονται μετά το δικό μας (``AbsoluteValue``), κοιτάζει το attribute ``output_field`` το οποίο δεν χρειάστηκε να το ορίσουμε στο συγκεκριμένο παράδειγμα γιατί έτυχε ο αριθμός που συγκρίνουμε, στο δεξί μέρος, να είναι ακέραιος (27). Αν μπερδευτήκατε, ας το ξεκαθαρίσουμε: Η ``Transform`` προσφέρει τη μετατροπή ενός πεδίου (πχ του ``change``) σε κάποια άλλη τιμή (πχ από -27 που μπορεί να ήταν, σε 27) προτού συγκριθεί με το δεξί μέρος και γίνει το lookup στη βάση δεδομένων. Ο τύπος της νέας αυτής τιμής (πχ 27 αντί -27) δηλώνεται στο ``output_field`` του δικού μας ``AbsoluteValue ``. Δεν το δηλώσαμε γιατί και οι δύο τιμές είναι τύπου int. Αν υποθέσουμε όμως ότι έχουμε πιο περίπλοκα πεδία (πχ καρτεσιανές συντεταγμένες ή μιγαδικούς αριθμούς) τότε ίσως θα θέλαμε να προσδιορίσουμε τον τύπο της νέας τιμής ως ``FloatField`` για περαιτέρω lookups. Αυτό μπορεί να γίνει θέτοντας το attribute `` output_field`` ως property της δικής μας κλάσης, ως εξής::
id: Ketika mencari pencarian mana yang diizinkan setelah ``Transform`` diberlakukan, Django menggunakan atribut ``output_field``. Kami tidak butuh menentukan ini disini jika itu tidak berubah, tetapi seharusnya kami memberlakukan ``AbsoluteValue`` pada beberapa bidang yang mewakili jenis lebih rumit (sebagai contoh sebuah titik relatif ke yang asli, atau angka rumit) kemudian kami mungkin ingin menentukan bahwa perubahan mengembalikan jenis ``FloatField`` untuk pencarian lebih lanjut. Ini dapat dikerjakan dengan menambahkan sebuah atribut ``output_field`` untuk perubahan::

source: This ensures that further lookups like ``abs__lte`` behave as they would for a ``FloatField``.
el: Με αυτό τον τρόπο είμαστε σίγουροι ότι το δικό μας transformation θα επιστρέψει μια τιμή τύπου float και τα επόμενα lookups (αν υπάρχουν, πχ το lte στο ``abs__lte``) θα “δουν” την τιμή αυτή ως float και όχι ως int όπως ήταν στην αρχή. Ένα άλλο πολύ κοινό παράδειγμα της ``Transform`` είναι η μετατροπή ενός ``DateField`` στην τιμή του έτους μόνο. Για παράδειγμα, θα θέλατε να δείτε ποια πειράματα έγιναν το έτος 2016. Θα θέλατε να το γράψετε ως εξής: ``Experiment.objects.filter(date__year=2016)``. Το ``date`` είναι το πεδίο του μοντέλου μας, τύπου ``DateField`` και το ``year`` το lookup (που υπάρχει ήδη μέσα στο Django). Το ``year`` lookup “ξηλώνει” μόνο το έτος από την ημερομηνία και το συγκρίνει με το 2016. Έτσι, μετατρέπεται η ημερομηνία (``DateField``) σε έτος (``IntegerField``) και συγκρίνεται με το δεξί μέρος.
id: Ini memastikan bahwa pencarian lebih lanjut seperti ``abs__lte`` berperilaku seperti mereka lakukan untuk ``FloatField``.

source: Writing an efficient ``abs__lt`` lookup
el: Γράφοντας ένα πιο αποτελεσματικό ``abs__lt`` lookup
id: Menulis sebuah pencarian ``abs__lt`` efisien

source: When using the above written ``abs`` lookup, the SQL produced will not use indexes efficiently in some cases. In particular, when we use ``change__abs__lt=27``, this is equivalent to ``change__gt=-27`` AND ``change__lt=27``. (For the ``lte`` case we could use the SQL ``BETWEEN``).
el: Όταν χρησιμοποιούμε το παραπάνω ``abs`` lookup, η παραγόμενη SQL, σε μερικές περιπτώσεις, δεν χρησιμοποιεί αποτελεσματικά τα ευρετήρια (indexes) της βάσης δεδομένων. Πιο συγκεκριμένα, όταν χρησιμοποιούμε το ``change__abs__lt=27``, αυτό είναι ισοδύναμο με το ``change__gt=-27`` AND ``change__lt=27``. (Στη περίπτωση του ``lte`` θα μπορούσαμε να χρησιμοποιήσουμε την εντολή SQL ``BETWEEN``).
id: Ketika menggunakan penulisan diatas pencarian ``abs``, keluaran SQL tidak menggunakan indeks secara efisien dalam beberapa kasus. Khususnya, ketika kami menggunakan ``change__abs__lt=27``, ini setara pada ``change__gt=-27`` AND ``change__lt=27``. (Untuk kasus ``lte`` kami akan menggunakan SQL ``BETWEEN``).

source: So we would like ``Experiment.objects.filter(change__abs__lt=27)`` to generate the following SQL::
el: Θα θέλαμε, επομένως, η παραγόμενη SQL από το ``Experiment.objects.filter(change__abs__lt=27)`` να δείχνει κάπως έτσι::
id: Jadi kami akan ``Experiment.objects.filter(change__abs__lt=27)`` untuk membangkitkan SQL berikut::

source: The implementation is::
el: Η υλοποίηση αυτού φαίνεται παρακάτω::
id: Peneprapannya adalah::

source: There are a couple of notable things going on. First, ``AbsoluteValueLessThan`` isn't calling ``process_lhs()``. Instead it skips the transformation of the ``lhs`` done by ``AbsoluteValue`` and uses the original ``lhs``. That is, we want to get ``"experiments"."change"`` not ``ABS("experiments"."change")``. Referring directly to ``self.lhs.lhs`` is safe as ``AbsoluteValueLessThan`` can be accessed only from the ``AbsoluteValue`` lookup, that is the ``lhs`` is always an instance of ``AbsoluteValue``.
el: Υπάρχουν μερικά αξιοσημείωτα πράγματα εδώ. Πρώτα απ’ όλα το ``AbsoluteValueLessThan`` δεν καλεί τη μέθοδο ``process_lhs()``. Αντιθέτως, υπερπηδά τη μετατροπή του ``lhs`` που γίνεται από την ``AbsoluteValue`` και χρησιμοποιεί την αρχική τιμή του `lhs`` (το ``self.lhs`` είναι η τιμή μετά την μετατροπή ενώ το ``self.lhs.lhs`` είναι η αρχική τιμή του ``change``). Αυτό γίνεται γιατί θέλουμε να έχουμε το ``"experiments"."change"`` και όχι το ``ABS("experiments"."change")``. Είναι ασφαλής η αναφορά μας απ’ ευθείας στο ``self.lhs.lhs`` γιατί η ``Lookup`` κλάση ``AbsoluteValueLessThan`` μπορεί να προσπελασθεί μόνο από την ``Transform`` κλάση ``AbsoluteValue`` (λόγω του register στην τελευταία γραμμή), δηλαδή το ``lhs`` θα είναι πάντα ένα instance της Transform κλάσης ``AbsoluteValue``.
id: Terdapat sepasang hal penting sedang terjadi. Pertama, ``AbsoluteValueLessThan`` tidak memanggil ``process_lhs()``. Malahan dia melewati perubahan dari ``lhs`` dikerjakan oleh ``AbsoluteValue`` dan menggunakan ``lhs`` asli. Yaitu, kami ingin mendapatkan ``"experiments"."change"`` bukan ``ABS("experiments"."change")``. Mengacu secara langsung pada ``self.lhs.lhs`` adalah aman ``AbsoluteValueLessThan`` dapat diakses hanya dari pencarian ``AbsoluteValue``, yaitu ``lhs`` selalu sebuah instance dari ``AbsoluteValue``.

source: Notice also that as both sides are used multiple times in the query the params need to contain ``lhs_params`` and ``rhs_params`` multiple times.
el: Επισημαίνεται επίσης το γεγονός ότι όχι μόνο και τα δύο μέρη (αριστερό και δεξί) χρησιμοποιούνται πολλές φορές μέσα στο SQL query αλλά και οι παράμετροι επίσης (``lhs_params`` και ``rhs_params``).
id: Perhaikan juga bahwa kedua sisi menggunakan banyak waktu dalam permintaan parameter butuh untuk dikandung ``lhs_params`` dan ``rhs_params`` banyak waktu.

source: The final query does the inversion (``27`` to ``-27``) directly in the database. The reason for doing this is that if the ``self.rhs`` is something else than a plain integer value (for example an ``F()`` reference) we can't do the transformations in Python.
el: Ο λόγος που γίνεται αυτό είναι γιατί, σε περίπτωση που το ``self.rhs`` είναι κάτι διαφορετικό από έναν ακέραιο (πχ μια αναφορά σε ένα ``F()``) δε θα μπορούμε να κάνουμε τις μετατροπές στην Python.
id: Permintaan akhir melakukan pembalikan (``27`` ke ``-27``) secara langsung di basisdata. Alasan untuk melakukan ini adalah bahwa jika ``self.rhs`` sesuatu lain daripada nilai integer polos (sebagai contoh sebuah acuan ``F()``) kami tidak dapat melakukan perubahan dalam Python.

source: In fact, most lookups with ``__abs`` could be implemented as range queries like this, and on most database backends it is likely to be more sensible to do so as you can make use of the indexes. However with PostgreSQL you may want to add an index on ``abs(change)`` which would allow these queries to be very efficient.
el: Στην πραγματικότητα, τα περισσότερα lookups που εμπεριέχουν το ``__abs`` θα μπορούσαν να υλοποιηθούν με την παραπάνω μέθοδο και στις περισσότερες βάσεις δεδομένων θα μπορέσετε να εκμεταλλευτείτε τη δυνατότητα των ευρετηρίων (indexes) τους. Ωστόσο, στην PostgreSQL ίσως θα θέλατε να προσθέσετε ένα ευρετήριο για το ``abs(change)`` το οποίο θα επιτρέψει σε αυτά τα queries να είναι πολύ αποτελεσματικά.
id: Faktanya, kebanyakan pencarian dengan ``__abs`` dapat diterapkan sebagai jangkauan permintaan seperti ini, dan pada kebanyakan backend basisdata sepertinya lebih bijaksana untuk dilakukan sehingga anda dapat membuat penggunaan indeks. Bagaimanapun dengan PostgreSQL anda mungkin ingin menambahkan indeks pada ``abs(change)`` yang akan mengizinkan permintaan ini menjadi lebih efisien.

source: A bilateral transformer example
el: Ένα παράδειγμα ενός διμερούς transformer
id: Sebuah contoh perubahan timbal balik

source: The ``AbsoluteValue`` example we discussed previously is a transformation which applies to the left-hand side of the lookup. There may be some cases where you want the transformation to be applied to both the left-hand side and the right-hand side. For instance, if you want to filter a queryset based on the equality of the left and right-hand side insensitively to some SQL function.
el: Το παράδειγμα της ``Transformer`` κλάσης ``AbsoluteValue`` που περιγράψαμε παραπάνω είναι μια μετατροπή η οποία εφαρμόζεται στο αριστερό μέρος του lookup (στο πεδίο ``change``). Ίσως να υπάρξουν, μερικές περιπτώσεις όπου θα θέλατε η μετατροπή να εφαρμοστεί και στο αριστερό και στο δεξί μέρος. Για παράδειγμα, αν θέλετε να φιλτράρετε ένα queryset βασιζόμενο στην ισότητα των δύο μερών (αριστερό και δεξί) με την χρήση κάποιας SQL συνάρτησης.
id: Contoh ``AbsoluteValue`` kami obrolkan sebelumnya adalah sebuah perubahan yang berlaku pada left-hand side dari pencarian. Mungkin disana beberapa kasus dimana anda ingin perubahan diberlakukan pada kedua left-hand side and the right-hand side. Sebagai contoh, jika anda ingin menyaring kumpulan permintaan berdasarkan pada persamaan left and right-hand side kebal pada beberapa fungsi SQL.

source: Let's examine the simple example of case-insensitive transformation here. This transformation isn't very useful in practice as Django already comes with a bunch of built-in case-insensitive lookups, but it will be a nice demonstration of bilateral transformations in a database-agnostic way.
el: Ας εξετάσουμε την απλή περίπτωση μιας μετατροπής που δεν κάνει διάκριση μεταξύ πεζών και κεφαλαίων γραμμάτων. Αυτή η μετατροπή δεν είναι πολύ χρήσιμη στην πράξη καθώς το Django έχει προεγκατεστημένα αρκετά lookups που δεν κάνουν διακρίσεις μεταξύ πεζών-κεφαλαίων. Παρόλ’ αυτά αποτελεί ένα χρήσιμο παράδειγμα για την επίδειξη των διμερών μετατροπών (bilateral transformations) ανεξαρτήτως της βάση δεδομένων που χρησιμοποιείται.
id: Mari kita ujikan contoh sederhana dari perubahan kasus tidak peka disini. Perubahan ini tidak sangat berguna dalam praktiknya ketika Django sudah datang dengan seikat pencarian siap pakai tidak peka, tetapi dia akan menjadi pertunjukan bagus dari perubahan timbal balik dalam sebuah cara basisdata-agnostik.

source: We define an ``UpperCase`` transformer which uses the SQL function ``UPPER()`` to transform the values before comparison. We define :attr:`bilateral = True <django.db.models.Transform.bilateral>` to indicate that this transformation should apply to both ``lhs`` and ``rhs``::
el: Ορίζουμε έναν transformer ``UpperCase`` ο οποίος χρησιμοποιεί την SQL συνάρτηση ``UPPER()`` για να μετατρέψει τις τιμές πριν την σύγκριση. Θέτουμε το attribute :attr:`bilateral = True <django.db.models.Transform.bilateral>` για να υποδείξουμε ότι η μετατροπή θα πρέπει να γίνει όχι μόνο στο αριστερό μέρος, ``lhs``, αλλά και στο δεξί, ``rhs``::
id: Kami menentukan sebuab perubahan `UpperCase`` yang menggunakan fungsi SQL ``UPPER()`` untuk merubah nilai sebelum dibandingkan. Kami menentukan :attr:`bilateral = True <django.db.models.Transform.bilateral>` untuk mengindikasikan bahwa perubahan ini harus berlaku pada kedua ``lhs`` and ``rhs``::

source: Next, let's register it::
el: Έπειτα το κάνουμε register με τους ανάλογους τύπους πεδίων::
id: Selanjutnya, mari kita mendaftarkannya::

source: Now, the queryset ``Author.objects.filter(name__upper="doe")`` will generate a case insensitive query like this::
el: Τώρα το queryset ``Author.objects.filter(name__upper="doe")`` θα παράξει ένα query το οποίο δεν θα κάνει διάκριση μεταξύ πεζών-κεφαλαίων γραμμάτων::
id: Sekarang, kumpulan permintaan ``Author.objects.filter(name__upper="doe")`` akan membangkitkan sebuah permintaan kasus tidak peka seperti ini::

source: Writing alternative implementations for existing lookups
el: Γράφοντας εναλλακτικές υλοποιήσεις για ήδη υπάρχοντα lookups
id: Menulis penerapan cara lain untuk pencarian yang ada

source: Sometimes different database vendors require different SQL for the same operation. For this example we will rewrite a custom implementation for MySQL for the NotEqual operator. Instead of ``<>`` we will be using ``!=`` operator. (Note that in reality almost all databases support both, including all the official databases supported by Django).
el: Κάποιες φορές, μερικές βάσεις δεδομένων απαιτούν έναν διαφορετικό τρόπο γραφής της SQL για την ίδια λειτουργία. Για παράδειγμα, κάποιες βάσεις για να προσδιορίσουν τη λογική "όχι ίσο με", αντί του συμβόλου ``<>`` απαιτούν το ``!=``. (Στην πραγματικότητα σχεδόν όλες οι βάσεις δεδομένων υποστηρίζουν και τα δύο αυτά σύμβολα, συμπεριλαμβανομένων και όλων των επίσημων βάσεων δεδομένων που υποστηρίζει το Django). Σε αυτό το παράδειγμα θα ξαναγράψουμε μια δικιά μας υλοποίηση, για την MySQL, της λειτουργίας NotEqual.
id: Terkadang penjaja basisdata berbeda membutuhkan SQL berbeda untuk pekerjaan yang sama. Untuk contoh ini kami akan menulis kembali sebuah penyesuaian penerapan untuk MySQL untuk penghubung NotEqual. Dari pada ``<>`` kami akan menggunakan penghubung ``!=``. (Catat bahwa dalam kenyataan hampir semua basisdata mendukung keduanya, termasuk semua basisdata resmi didukung oleh Django).

source: We can change the behavior on a specific backend by creating a subclass of ``NotEqual`` with a ``as_mysql`` method::
el: Μπορούμε να αλλάξουμε τη συμπεριφορά για ένα συγκεκριμένο database backend δημιουργώντας μια subclass της ``NotEqual`` η οποία δεν υλοποιεί τη μέθοδο ``as_sql `` αλλά την ``as_mysql``::
id: Kami dapat merubah kebiasaan pada backend spesifik dengan membuat subkelas dari ``NotEqual`` dengan sebuah cara ``as_mysql``::

source: We can then register it with ``Field``. It takes the place of the original ``NotEqual`` class as it has the same ``lookup_name``.
el: Μπορούμε, έπειτα, να κάνουμε register την κλάση αυτή με το ``Field``. Η κλάση ``MySQLNotEqual`` αντικαθιστά την κλάση ``NotEqual``, μόνο για τις MySQL βάσεις δεδομένων, αφού μοιράζονται το ίδιο ``lookup_name``.
id: Kami dapat mendaftarkannya dengan ``Field``. Dia memakan tempat dari kelas ``NotEqual`` asli seperti dia mempunyai ``lookup_name`` sama.

source: When compiling a query, Django first looks for ``as_%s % connection.vendor`` methods, and then falls back to ``as_sql``. The vendor names for the in-built backends are ``sqlite``, ``postgresql``, ``oracle`` and ``mysql``.
el: Κατά τη διάρκεια μετάφρασης του query, το Django ψάχνει για τις μεθόδους``as_%s % connection.vendor`` και αν δεν βρει κάποια τότε χρησιμοποιεί την ``as_sql``. Τα ονόματα των vendor για τις προεγκατεστημένες στο Django database backends είναι τα ``sqlite``, ``postgresql``, ``oracle`` και ``mysql``.
id: Ketika menyusun sebuah permintaan, Django pertama mencari cara ``as_%s % connection.vendor``, dan kemudian kembali ke ``as_sql``. Nama penjaja untuk membangun backend adalah ``sqlite``, ``postgresql``, ``oracle`` dan ``mysql``.

source: How Django determines the lookups and transforms which are used
el: Πως προσδιορίζει το Django τα lookups και τα transforms που χρησιμοποιούνται
id: Bagaimana Django menentuka pencarian dan merubah yang sedang digunakan

source: In some cases you may wish to dynamically change which ``Transform`` or ``Lookup`` is returned based on the name passed in, rather than fixing it. As an example, you could have a field which stores coordinates or an arbitrary dimension, and wish to allow a syntax like ``.filter(coords__x7=4)`` to return the objects where the 7th coordinate has value 4. In order to do this, you would override ``get_lookup`` with something like::
el: Σε μερικές περιπτώσεις θα θέλατε να αλλάξετε, δυναμικά, το ``Transform`` ή το ``Lookup`` που επιστρέφεται ανάλογα το όνομα που δίνεται στο query παρά να μπείτε στη διαδικασία να φτιάξετε ένα για το καθένα. Θα μπορούσατε, για παράδειγμα, να έχετε ένα πεδίο το οποίο αποθηκεύει συντεταγμένες ή κάποια αυθαίρετη διάσταση και θέλετε να μπορείτε να γράφετε το ``.filter(coords__x7=4)`` και να σας επιστρέφει τα objects όπου η 7η συντεταγμένη έχει την τιμή 4. Για να το κάνετε αυτό, θα πρέπει να παρακάμψετε (override) την ``get_lookup`` με κάτι σαν αυτό::
id: Dalam beberapa kasus anda mungkin berharap untuk secara dinamis merubah ``Transform`` atau ``Lookup`` dikembalikan berdasarkan pada nama dilewatkan, daripada memperbaikinya. Sebagai sebuah contoh, anda dapat mempunyai sebuah bidang yang menyimpan kordinat atau dimensi berubah-ubah dan berharap untuk mengizinkan sebuah sintaksis seperti ``.filter(coords__x7=4)`` untuk mengembalikan obyek dimana kordinat 7 mempunyai nilai 4. Untuk melakukan ini, anda akan mengesampingkan ``get_lookup`` dengan sesuatu seperti::

source: You would then define ``get_coordinate_lookup`` appropriately to return a ``Lookup`` subclass which handles the relevant value of ``dimension``.
el: Μετά θα ορίσετε τη μέθοδο ``get_coordinate_lookup``, καταλλήλως, για να επιστρέφει μια subclass της ``Lookup`` η οποία θα χειριστεί την σχετική τιμή της μεταβλητής ``dimension``.
id: Anda kemudian akan menentukan ``get_coordinate_lookup`` dengan benar untuk mengembalikan sebuah subkelas ``Lookup`` yang menangani nilai yang terkait dari ``dimension``.

source: There is a similarly named method called ``get_transform()``. ``get_lookup()`` should always return a ``Lookup`` subclass, and ``get_transform()`` a ``Transform`` subclass. It is important to remember that ``Transform`` objects can be further filtered on, and ``Lookup`` objects cannot.
el: Ομοίως, υπάρχει μια μέθοδος για την ``Transform`` με το όνομα ``get_transform()``. Η μέθοδος ``get_lookup()`` θα πρέπει πάντα να επιστρέφει μια subclass της ``Lookup`` ενώ η ``get_transform()`` μια subclass της ``Transform``. Είναι σημαντικό να θυμάστε ότι τα objects της κλάσης ``Transform`` μπορούν να φιλτραριστούν περαιτέρω ενώ τα objects της κλάσης ``Lookup`` όχι.
id: Ada cara yang dinamai mirip dipanggil ``get_transform()``. ``get_lookup()`` harus selalu mengembalikan sebuah subkelas ``Lookup``, dan ``Lookup`` sebuah subkelas ``Transform``. Itu sangat penting diingat bahwa obyek ``Transform`` dapat lebih jauh disaring, dan obyek ``Lookup`` tidak dapat.

source: When filtering, if there is only one lookup name remaining to be resolved, we will look for a ``Lookup``. If there are multiple names, it will look for a ``Transform``. In the situation where there is only one name and a ``Lookup`` is not found, we look for a ``Transform`` and then the ``exact`` lookup on that ``Transform``. All call sequences always end with a ``Lookup``. To clarify:
el: Όταν φιλτράρετε και έχει απομείνει μόνο ένα lookup όνομα, το Django ψάξει για κάποιο ``Lookup``. Αν υπάρχουν πολλά τότε θα ψάξει για κάποιο ``Transform``. Στην περίπτωση που υπάρχει μόνο ένα όνομα και δεν βρεθεί κάποιο ``Lookup``, τότε το Django θα ψάξει για ένα ``Transform`` και μετά το ``exact`` lookup πάνω σε αυτό το ``Transform``. Στο τέλος, το Django, πάντα θα ψάχνει για ένα ``Lookup``. Για να ξεκαθαρίσουμε λίγο το τοπίο:
id: Ketika menyaring, jika hanya ada satu nama pencarian tersisa untuk diselesaikan, kami akan mencari sebuah ``Lookup``. Jika ada banyak nama, dia akan mencari sebuah ``Transform``. Dalam keadaan dimana hanya ada satu nama dan sebuah ``Lookup`` tidak ditemukan, kami mencari sebuah ``Transform`` dan kemudian pencarian ``exact`` pada ``Transform`` tersebut. Semua panggilan selalu berurutan diakhiri dengan sebuah ``Lookup``. Untuk menjelaskan:

source: ``.filter(myfield__mylookup)`` will call ``myfield.get_lookup('mylookup')``.
el: Το ``.filter(myfield__mylookup)`` θα καλέσει την μέθοδο ``myfield.get_lookup('mylookup')``.
id: ``.filter(myfield__mylookup)`` akan memanggil ``myfield.get_lookup('mylookup')``.

source: ``.filter(myfield__mytransform__mylookup)`` will call ``myfield.get_transform('mytransform')``, and then ``mytransform.get_lookup('mylookup')``.
el: Το ``.filter(myfield__mytransform__mylookup)`` θα καλέσει τη μέθοδο ``myfield.get_transform('mytransform')`` και μετά την ``mytransform.get_lookup('mylookup')``.
id: ``.filter(myfield__mytransform__mylookup)`` akan memanggil ``myfield.get_transform('mytransform')``, dan lalu ``mytransform.get_lookup('mylookup')``.

source: ``.filter(myfield__mytransform)`` will first call ``myfield.get_lookup('mytransform')``, which will fail, so it will fall back to calling ``myfield.get_transform('mytransform')`` and then ``mytransform.get_lookup('exact')``.
el: Το ``.filter(myfield__mytransform)`` θα καλέσει πρώτα τη μέθοδο ``myfield.get_lookup('mytransform')``, η οποία θα αποτύχει. Έπειτα θα καλέσει την μέθοδο ``myfield.get_transform('mytransform')`` και τέλος την ``mytransform.get_lookup('exact')``.
id: ``.filter(myfield__mytransform)`` akan memanggil pertama ``myfield.get_lookup('mytransform')``, yang akan gagal, sehingga dia akan gagal kembali memanggil ``myfield.get_transform('mytransform')`` dan kemudian ``mytransform.get_lookup('exact')``.

source: Writing custom ``django-admin`` commands
el: Γράφοντας δικές σας ``django-admin`` εντολές
id: Menulis perintah ``django-admin`` penyesuaian

source: Applications can register their own actions with ``manage.py``. For example, you might want to add a ``manage.py`` action for a Django app that you're distributing. In this document, we will be building a custom ``closepoll`` command for the ``polls`` application from the :doc:`tutorial</intro/tutorial01>`.
el: Οι εφαρμογές μπορούν να κάνουν register τις δικές τους ενέργειες με το ``manage.py``. Για παράδειγμα, ίσως να θέλετε να προσθέσετε μια ``manage.py`` ενέργεια για ένα Django app το οποίο προωθείτε για διανομή. Σε αυτό το άρθρο θα χτίσουμε μια δικιά μας εντολή, με το όνομα ``closepoll``, για την εφαρμογή ``polls`` που φτιάξαμε στον :doc:`οδηγό </intro/tutorial01>`.
id: Aplikasi dapat mendaftarkan tindakan mereka sendiri dengan ``manage.py``. Sebagai contoh, anda mungkin ingin menambahkan sebuah tindakan ``manage.py`` untuk sebuah aplikasi Django yang anda sedang sebarkan. Dalam dokumen ini, kami akan membangun sebuah penyesuaian perintah ``closepoll`` untuk aplikasi ``polls`` dari :doc:`tutorial</intro/tutorial01>`.
