Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Finally, ``register.filter()`` also accepts three keyword arguments, ``is_safe``, ``needs_autoescape``, and ``expects_localtime``. These arguments are described in :ref:`filters and auto-escaping <filters-auto-escaping>` and :ref:`filters and time zones <filters-timezones>` below.
el: Εν τέλει, η μέθοδος ``register.filter()`` δέχεται τρία keyword arguments, το ``is_safe``, το ``needs_autoescape`` και το ``expects_localtime``. Αυτά τα arguments περιγράφονται στα :ref:`φίλτρα και auto-escaping <filters-auto-escaping>` και στα :ref:`φίλτρα και ζώνες ώρας <filters-timezones>` παρακάτω.
id: Akhirnya, ``register.filter()`` juga menerima tiga argumen katakunci, ``is_safe``, ``needs_autoescape``, dan ``expects_localtime``. Argumen ini digambarkan dalam :ref:`penyaring dan pelolosan otomatis <filters-auto-escaping>` dan :ref:`penyaring dan zona waktu <filters-timezones>` dibawah.

source: Template filters that expect strings
el: Template φίλτρα που περιμένουν strings
id: Cetakan penyaring yang mengharapkan deretan karakter

source: If you're writing a template filter that only expects a string as the first argument, you should use the decorator ``stringfilter``. This will convert an object to its string value before being passed to your function::
el: Αν γράφετε ένα template φίλτρο το οποίο περιμένει ένα argument τύπου string ως πρώτο argument, θα πρέπει να χρησιμοποιήσετε τον decorator ``stringfilter``. Αυτό θα μετατρέψει το object στην string τιμή του πριν περαστεί στη συνάρτηση σας::
id: Jika anda sedang menulis sebuah cetakan penyaring yang hanya menerima sebuah deretan karakter sebagai argumen pertama, anda harus menggunakan decorator ``stringfilter``. Ini akan merubah sebuah obyek ke nilai deretan karakternya sebelum dilewatkan ke fungsi anda::

source: This way, you'll be able to pass, say, an integer to this filter, and it won't cause an ``AttributeError`` (because integers don't have ``lower()`` methods).
el: Με αυτό τον τρόπο, θα μπορείτε να περνάτε, ας πούμε, έναν integer σε αυτό το φίλτρο και αυτό δεν θα προκαλέσει κάποιο ``AttributeError`` (επειδή οι integers δεν έχουν την μέθοδο ``lower()``).
id: Jalan ini, anda akan dapat melewatkan, katakan, sebuah integer ke penyaring ini, dan dia tidak menyebabkan sebuah ``AttributeError`` (karena integer tidak mempunyai cara ``lower()``).

source: Filters and auto-escaping
el: Φίλτρα και auto-escaping
id: Penyaring dan pelolosan otomatis

source: When writing a custom filter, give some thought to how the filter will interact with Django's auto-escaping behavior. Note that three types of strings can be passed around inside the template code:
el: Όταν γράφετε ένα δικό σας φίλτρο, σκεφτείτε λιγάκι το πως θα αλληλεπιδρά με την auto-escaping συμπεριφορά του Django. Όταν λέμε auto-escaping εννοούμε τη δυνατότητα αυτόματης αποφυγής εμφάνισης συγκεκριμένων χαρακτήρων-λέξεων οι οποίοι αν εμφανιζόντουσαν θα προκαλούσαν, ενδεχομένως, πρόβλημα στο rendering της σελίδας. Σημειώστε ότι υπάρχουν τρεις τύποι strings οι οποίοι μπορούν να περαστούν μέσα σε κώδικα template:
id: Ketika menulis sebuah penyesuaian penyaring, berikan beberapa pemikiran tentang bagaimana penyaring akan berinteraksi dengan kebiasaan pelolosan otomatis Django. Catat bahwa tiga jenis deretan karakter dapat dilewatkan disekeliling dalam cetakan kode:

source: **Raw strings** are the native Python ``str`` or ``unicode`` types. On output, they're escaped if auto-escaping is in effect and presented unchanged, otherwise.
el: **Σκέτα strings**: είναι τα παραδοσιακά Python strings, τύπου ``str`` ή ``unicode``. Στην έξοδο, αυτά τα string γίνονται escaped αν το auto-escaping είναι ενεργοποιημένο, ειδάλλως παρουσιάζονται όπως είναι.
id: **Raw strings** adalah jenis ``str`` atau ``unicode`` Python asli. Pada keluaran, mereka lolos jika pelolosan otomatis ini berlaku dan disajikan tidak berubah, jika tidak.

source: **Safe strings** are strings that have been marked safe from further escaping at output time. Any necessary escaping has already been done. They're commonly used for output that contains raw HTML that is intended to be interpreted as-is on the client side.
el: **Ασφαλή strings**: είναι τα strings τα οποία έχουν μαρκαριστεί ως ασφαλή από περαιτέρω escaping κατά την παρουσίαση τους. Όλα τα απαραίτητα escapings έχουν γίνει μέχρι εδώ. Χρησιμοποιούνται συνήθως για έξοδο η οποία περιέχει σκέτη HTML και προορίζεται να μεταφραστεί ως έχει από τη μεριά του client.
id: **Safe strings** adalah deretan karakter yang telah ditandai aman dari pelolosan lanjut pada waktu keluar. Apa saja yang diperlukan pelolosan telah dilakukan. Mereka umumnya digunakan untuk keluaran yang mengandung HTML mentah yang akan di ditafsirkan apa adanya pada sisi klien.

source: Internally, these strings are of type ``SafeBytes`` or ``SafeText``. They share a common base class of ``SafeData``, so you can test for them using code like::
el: Εσωτερικώς, αυτά τα strings είναι τύπου ``SafeBytes`` ή ``SafeText``. Μοιράζονται μια κοινή κλάση της ``SafeData``, με αποτέλεσμα να μπορείτε να κάνετε τεστ σε αυτά με κώδικα όπως::
id: Secara internal, deretan karakter ini adalah dari jenis ``SafeBytes`` atau ``SafeText``. Mereka berbagi kelas dasar umum dari ``SafeData``, sehingga anda dapat mencoba untuk mereka menggunakan kode seperti::

source: **Strings marked as "needing escaping"** are *always* escaped on output, regardless of whether they are in an :ttag:`autoescape` block or not. These strings are only escaped once, however, even if auto-escaping applies.
id: **Deretan karakter ditandai sebagai "needing escaping"** adalah *selalu* diloloskan pada keluaran, tanpa memperhatikan apakah mereka berada dalam sebuah blok :ttag:`autoescape` atau tidak. Deretan karakter ini hanya diloloskan sekali, bagaimanapun, bahkan jika pelolosan otomatis berlaku.

source: Internally, these strings are of type ``EscapeBytes`` or ``EscapeText``. Generally you don't have to worry about these; they exist for the implementation of the :tfilter:`escape` filter.
id: Secara internal, deretan karakter ini adaah dari jenis ``EscapeBytes`` or ``EscapeText``. Umumnya anda tidak perlu khawatir tentang ini; mereka ada untuk penerapan dari :tfilter:`escape` filter.

source: Template filter code falls into one of two situations:
el: Ο κώδικας ενός template φίλτρου εμπίπτει σε μια από τις δύο ακόλουθες καταστάσεις:
id: Kode cetakan penyaring gagal kedalam satu dari dua keadaan:

source: Your filter does not introduce any HTML-unsafe characters (``<``, ``>``, ``'``, ``"`` or ``&``) into the result that were not already present. In this case, you can let Django take care of all the auto-escaping handling for you. All you need to do is set the ``is_safe`` flag to ``True`` when you register your filter function, like so::
el: Το φίλτρο σας δεν εισάγει τυχόν μη ασφαλείς HTML χαρακτήρες (``<``, ``>``, ``'``, ``"`` ή ``&``) στο αποτέλεσμα, οι οποίοι δεν ήταν προηγουμένως παρόντες. Σε αυτή την περίπτωση, μπορείτε να αφήσετε το Django να τακτοποιήσει το auto-escaping για εσάς. Το μόνο που έχετε να κάνετε είναι να θέσετε το flag ``is_safe`` σε ``True`` όταν κάνετε register τη συνάρτηση του φίλτρου σας, ως εξής::
id: Penyaring anda tidak memperkenalkan salah satu karakter tidak aman (``<``, ``>``, ``'``, ``"`` atau ``&``) kedalam hasil yang tidak hadir. Dalam kasus ini, anda dapat membiarkan Django mengambil semua penanganan pelolosan otomatis untuk anda. Semua anda butuh untuk dilakukan adalah menyetel bendera ``is_safe`` ke ``True`` ketika anda mendaftar fungsi penyaringan, seperti begitu:

source: This flag tells Django that if a "safe" string is passed into your filter, the result will still be "safe" and if a non-safe string is passed in, Django will automatically escape it, if necessary.
el: Αυτό το flag λέει στο Django ότι αν ένα "ασφαλές" string περαστεί στο φίλτρο σας, το αποτέλεσμα θα εξακολουθήσει να είναι "ασφαλές" ακόμη και αν ένα μη-ασφαλές string περαστεί, το Django, αυτόματα θα το κάνει escape, εάν χρειαστεί.
id: Bendera ini memberitahu Django bahwa jika sebuah deretan karakter "safe" dilewatkan kedalam penyaring anda, hasil akan masih menjadi "safe" dan jika sebuah deretan karakter tidak aman dilewatkan, Django akan otomatis meloloskannya, jika diperlukan.

source: You can think of this as meaning "this filter is safe -- it doesn't introduce any possibility of unsafe HTML."
el: Μπορείτε να το σκεφτείτε αλλιώς: "αυτό το φίλτρο είναι ασφαλές -- δεν υπάρχει πιθανότητα τυχόν μη ασφαλούς HTML".
id: Anda dapat berpikir dari ini sebagai berarti "penyaring ini aman -- dia tidak memperkenalkan kemungkinan apapun dari HTML tidak aman."

source: The reason ``is_safe`` is necessary is because there are plenty of normal string operations that will turn a ``SafeData`` object back into a normal ``str`` or ``unicode`` object and, rather than try to catch them all, which would be very difficult, Django repairs the damage after the filter has completed.
el: Ο λόγος που το flag ``is_safe`` είναι απαραίτητο είναι επειδή υπάρχουν πολλών ειδών λειτουργίες για τα strings οι οποίες θα μετατρέψουν ένα object τύπου ``SafeData`` πίσω σε ένα κανονικό object τύπου ``str`` ή ``unicode`` (παρά να προσπαθήσουν να πιάσουν όλα τα strings κάτι το οποίο είναι δύσκολο) και το Django θα επιδιορθώσει τυχόν ζημιά αφού το φίλτρο έχει ολοκληρώσει τις εργασίες του.
id: Alasan ``is_safe`` adalah diperlukan bahwa karena ada banyak tindakan deretan karakter biasa yang akan mengembalikan obyek ``SafeData`` kembali ke dalam obyek ``str`` atau ``unicode`` normal, daripada mencoba menangkap semuanya, yang akan sangat sulit, Django memperbaiki kerusakan setelah penyaring telah lengkap.

source: For example, suppose you have a filter that adds the string ``xx`` to the end of any input. Since this introduces no dangerous HTML characters to the result (aside from any that were already present), you should mark your filter with ``is_safe``::
el: Για παράδειγμα, ας υποθέσουμε ότι έχετε ένα φίλτρο το οποίο προσθέτει το string ``xx`` στο τέλος κάθε input. Επειδή αυτό δεν εισάγει επικινδύνους HTML χαρακτήρες στο αποτέλεσμα (εκτός αυτού που είναι ήδη παρόν), θα πρέπει να μαρκάρετε το φίλτρο σας με το ``is_safe``::
id: Sebagi contoh, andaikan anda mempunyai sebuah penyaring yang menambahkan deretan karakter ``xx`` ke akhir dari masukan. Sejak ini diperkenalkan karakter HTML tidak berbahaya ke hasil (selain dari apapun itu sudah hadir), anda harus menandai penyaring anda dengan ``is_safe``::

source: When this filter is used in a template where auto-escaping is enabled, Django will escape the output whenever the input is not already marked as "safe".
el: Όταν αυτό το φίλτρο χρησιμοποιείται σε ένα template όπου το auto-escaping είναι ενεργοποιημένο, το Django θα κάνει escape την έξοδο οποτεδήποτε το input δεν είναι μαρκαρισμένο ως "ασφαλές".
id: Ketika penyaring ini digunakan dalam sebuah cetakan dimana pelolosan otomatis diadakan, Django akan meloloskan keluaran ketika masukan belum ditandai sebagai "safe".

source: By default, ``is_safe`` is ``False``, and you can omit it from any filters where it isn't required.
el: Από προεπιλογή, το flag ``is_safe`` είναι ``False`` και μπορείτε να το παραλείψετε από τα φίλτρα όπου δεν χρειάζεται.
id: Secara awal, ``is_safe`` adalah ``False``, dan anda dapat menghilangkannya dari saringan dimana dia tidak dibutuhkan.

source: Be careful when deciding if your filter really does leave safe strings as safe. If you're *removing* characters, you might inadvertently leave unbalanced HTML tags or entities in the result. For example, removing a ``>`` from the input might turn ``<a>`` into ``<a``, which would need to be escaped on output to avoid causing problems. Similarly, removing a semicolon (``;``) can turn ``&amp;`` into ``&amp``, which is no longer a valid entity and thus needs further escaping. Most cases won't be nearly this tricky, but keep an eye out for any problems like that when reviewing your code.
el: Να είστε προσεκτικοί όταν αποφασίζετε αν το φίλτρο σας αφήνει όντως τα safe strings ως safe. Εάν *αφαιρείτε* χαρακτήρες, μπορεί ακούσια να αφήσετε μη-ισορροπημένα HTML tags (χωρίς το start ή το end tag) ή οντότητες στο αποτέλεσμα. Για παράδειγμα, όταν αφαιρείτε ένα ``>`` από το input μπορεί να μετατρέψει ένα ``<a>`` σε ``<a``, το οποίο θα χρειαστεί να γίνει escaped στην έξοδο για την αποφυγή τυχόν προβλημάτων. Ομοίως, η αφαίρεση του ``;`` μπορεί να μετατρέψει το ``&amp;`` σε ``&amp``, η οποία δεν είναι πλέον μια έγκυρη οντότητα και επομένως χρειάζεται περαιτέρω escaping. Οι περισσότερες περιπτώσεις δεν θα είναι τόσο πολύπλοκες αλλά προσέχετε για τέτοιου είδους προβλήματα όταν επανεξετάζετε τον κώδικα σας.
id: Hati-hati ketika memutuskan jika penyaring anda sangat membiarkan deretan karakter aman sebagai safe. Jika anda sedang *memidnahkan* karakter, anda mungkin secara tidak sengaja membiarkan etiket HTML tidak seimbang atau kesatuan dalam hasil. Sebagai contoh, memindahkan sebuah ``>`` dari masukan mungkin mengubah ``<a>`` menjadi ``<a``, yang akan butuh diloloskan pada keluaran untuk menghindari masalah. Demikian pula, memindahkan titik koma (``;``) dapat merubah ``&amp;`` into ``&amp``, yang tidak lagi kesatuan sah dan demikian butuh pelolosan. Kebanyakan kasus tidak dekat dengan trik ini, tetapi jaga mata anda untuk masalah apapun seperti itu ketika meninjau kode anda.

source: Marking a filter ``is_safe`` will coerce the filter's return value to a string. If your filter should return a boolean or other non-string value, marking it ``is_safe`` will probably have unintended consequences (such as converting a boolean False to the string 'False').
el: Μαρκάροντας ένα φίλτρο ως ``is_safe`` θα αναγκάσει την επιστρεφόμενη τιμή του φίλτρου να γίνει ένα string. Αν το φίλτρο σας θα πρέπει να επιστρέψει μια τιμή τύπου boolean ή κάποια άλλη πέρα από string, μαρκάροντας το ως ``is_safe`` θα έχει πιθανόν ακούσιες συνέπειες (όπως τη μετατροπή της τιμής False τύπου boolean στο string 'False').
id: Menandai sebuah penyaring ``is_safe`` akan memaksa nilai kembalian penyaring menjadi deretan karakter. Jika penyaring anda harus mengembalikan sebuah boolean atau nilai bukan deretan karakter, tandai dia ``is_safe`` akan mungkin mempunyai konsekuensi yang tidak diinginkan (seperti merubah boolean False menjadi deretan karakter 'False').

source: Alternatively, your filter code can manually take care of any necessary escaping. This is necessary when you're introducing new HTML markup into the result. You want to mark the output as safe from further escaping so that your HTML markup isn't escaped further, so you'll need to handle the input yourself.
el: Εναλλακτικά, ο κώδικας του φίλτρου σας μπορεί να χειριστεί χειροκίνητα, τυχόν αναγκαίο escaping. Αυτό είναι απαραίτητο όταν εισάγετε καινούργιο HTML κώδικα στο αποτέλεσμα σας. Θα θέλετε να μαρκάρετε την έξοδο ως ασφαλή από περαιτέρω escaping ούτως ώστε ο HTML κώδικας να μην γίνει περαιτέρω escape, οπότε θα χρειαστεί εσείς να χειριστείτε το input.
id: Kalau tidak, kode penyaring anda dapat secara manual merawat pelolosan apapun yang dibutuhkan. Ini adalah penting ketika anda sedang memperkenalkan markah HTML baru kedalam hasil. Anda ingin menandai keluaran sebagai aman dari pelolosan lebih lanjut sehingga markah HTML anda tidak diloloskan lebih lanjut, jadi anda akan butuh menangani masukan diri anda sendiri.

source: To mark the output as a safe string, use :func:`django.utils.safestring.mark_safe`.
el: Για να μαρκάρετε την έξοδο ως ασφαλή string, χρησιμοποιήστε τη συνάρτηση :func:`django.utils.safestring.mark_safe`.
id: Untuk menandai keluaran sebagai deretan karakter aman, gunakan :func:`django.utils.safestring.mark_safe`.

source: Be careful, though. You need to do more than just mark the output as safe. You need to ensure it really *is* safe, and what you do depends on whether auto-escaping is in effect. The idea is to write filters that can operate in templates where auto-escaping is either on or off in order to make things easier for your template authors.
el: Προσέχετε όμως. Θα χρειαστεί να κάνετε παραπάνω πράγματα από το να μαρκάρετε μόνο την έξοδο ως ασφαλή. Θα χρειαστεί να εξασφαλίσετε ότι είναι *όντως* ασφαλή και ότι κάνετε εξαρτάται από το αν το auto-escaping είναι ενεργοποιημένο ή όχι. Η ιδέα είναι να γράφετε φίλτρα τα οποία μπορούν να δρουν σε templates όπου το auto-escaping είναι είτε ενεργοποιημένο ή όχι, προκειμένου να κάνετε ευκολότερη τη δουλειά για τους συντάκτες των templates.
id: Berhati-hatilah, meskipun. Anda butuh melakukan lagi daripada hanya menandai keluaran sebagai aman. Anda butuh memastikan dia sangat *adalah* aman, dan apa yang anda lakukan tergantung pada apakah pelolosan otomatis berpengaruh. Idenya adalah menulis penyaring yang dapat berjalan dalam cetakan dimana pelolosan otomatis salah satunya nyala atau mati agar membuat hal-hal semakin mudah untuk cetakan penulis anda.

source: In order for your filter to know the current auto-escaping state, set the ``needs_autoescape`` flag to ``True`` when you register your filter function. (If you don't specify this flag, it defaults to ``False``). This flag tells Django that your filter function wants to be passed an extra keyword argument, called ``autoescape``, that is ``True`` if auto-escaping is in effect and ``False`` otherwise. It is recommended to set the default of the ``autoescape`` parameter to ``True``, so that if you call the function from Python code it will have escaping enabled by default.
el: Για να ξέρει το φίλτρο σας την κατάσταση του auto-escaping, θέστε το flag ``needs_autoescape`` σε ``True`` όταν κάνετε register το φίλτρο σας. (Αν δεν θέσετε αυτό το flag, η προεπιλεγμένη του τιμή είναι ``False``). Αυτό το flag λέει στο Django ότι η συνάρτηση του φίλτρου σας δέχεται ένα επιπλέον keyword argument, με το όνομα ``autoescape``, δηλαδή ``True`` αν το auto-escaping είναι ενεργοποιημένο και ``False`` αν όχι. Προτείνεται να θέσετε την προεπιπλεγμένη τιμή της παραμέτρου ``autoescape`` σε ``True``, ούτως ώστε αν καλέσετε τη συνάρτηση του φίλτρου σας από τον Python κώδικα σας, το φίλτρο σας θα έχει το escaping ενεργοποιημένο από προεπιλογή.
id: Agar penyaring anda mengetahui keadaan pelolosan otomatis saat ini, setel bendera ``needs_autoescape`` ke ``True`` ketika anda mendaftar fungsi penyaring anda. (Jika anda tidak menentukan bendera ini, dia awalnya adalah ``False``). Bendera ini mengatakan Django bahwa fungsi penyaring anda ingin dilewatkan sebuah argumen katakunci tambahan, dipanggil ``autoescape``, yaitu ``True`` jika pelolosan otomatis dalam efek dan ``False`` sebaliknya. Sangat dianjurkan untuk menyetel parameter ``autoescape`` ke ``True``, sehingga jika anda memanggil fungsi dari kode Python dia akan mempunyai pelolosan diadakan secara awal.

source: For example, let's write a filter that emphasizes the first character of a string::
el: Για παράδειγμα, ας γράψουμε ένα φίλτρο το οποίο δίνει έμφαση στον πρώτο χαρακτήρα ενός string::
id: Sebagai contoh, mari kita menulis penyaring yang menekankan karakter pertama dari sebuah deretan karakter::

source: The ``needs_autoescape`` flag and the ``autoescape`` keyword argument mean that our function will know whether automatic escaping is in effect when the filter is called. We use ``autoescape`` to decide whether the input data needs to be passed through ``django.utils.html.conditional_escape`` or not. (In the latter case, we just use the identity function as the "escape" function.) The ``conditional_escape()`` function is like ``escape()`` except it only escapes input that is **not** a ``SafeData`` instance. If a ``SafeData`` instance is passed to ``conditional_escape()``, the data is returned unchanged.
el: Tο flag ``needs_autoescape`` και το keyword argument ``autoescape`` σημαίνουν ότι η συνάρτηση μας θα ξέρει αν το automatic escaping είναι ενεργοποιημένο ή όχι όταν το φίλτρο μας τρέξει. Χρησιμοποιούμε το ``autoescape`` για να αποφασίσουμε αν τα input data (το string που πέρασε στο φίλτρο μέσα από την HTML) θα χρειαστεί να περάσουν μέσα από την μέθοδο ``django.utils.html.conditional_escape`` ή όχι. (Στην τελευταία περίπτωση χρησιμοποιούμε μια lambda συνάρτηση ως την "escape" συνάρτηση.) Η συνάρτηση ``conditional_escape()`` είναι σαν την ``escape()`` αλλά κάνει escape το input το οποίο **δεν είναι** instance της κλάσης ``SafeData``. Αν ένα instance μιας κλάσης ``SafeData`` περαστεί στη συνάρτηση ``conditional_escape()``, τα δεδομένα θα επιστραφούν ανέπαφα.
id: Bendera ``needs_autoescape`` dan argumen katakunci ``autoescape`` berarti bahwa fungsi kami akan mengetahui apakah pelolosan otomatis berada dalam efek ketika penyaring dipanggil. Kami menggunakan ``autoescape`` untuk memutuskan apakah data masukan butuh dilewatkan melalui ``django.utils.html.conditional_escape`` atau tidak. (Dalam kasus terakhir, kami hanya menggunakan fungsi identitas sebagai fungsi "escape".) Fungsi ``conditional_escape()`` seperti ``escape()`` kecuali dia hanya meloloskan masukan yang **bukan** instance ``SafeData``. Jika sebuah instance ``SafeData`` dilewatkan ke ``conditional_escape()``, data dikembalikan tidak berubah.

source: Finally, in the above example, we remember to mark the result as safe so that our HTML is inserted directly into the template without further escaping.
el: Στο παραπάνω παράδειγμα, θυμόμαστε να μαρκάρουμε το αποτέλεσμα ως ασφαλή ούτως ώστε η HTML που θα εισαχθεί απ' ευθείας μέσα στο template να μην υποστεί περαιτέρω escaping.
id: Akhirnya, dalam contoh diatas, kami ingat untuk menandai hasil sebagai aman sehingga HTML kami dimasukkan langsung kedalam cetakan tanpa pelolosan lanjut.

source: There's no need to worry about the ``is_safe`` flag in this case (although including it wouldn't hurt anything). Whenever you manually handle the auto-escaping issues and return a safe string, the ``is_safe`` flag won't change anything either way.
el: Δεν υπάρχει λόγος να ανησυχούμε για το flag ``is_safe`` σε αυτή την περίπτωση (παρόλου που το περιλαμβάνουμε δεν βλάπτει κανέναν). Οποτεδήποτε χειρίζεστε χειροκίνητα τα θέματα του auto-escaping και επιστρέφετε ένα ασφαλή string, το flag ``is_safe`` δεν θα αλλάξει τίποτα με τον ένα ή τον άλλο τρόπο.
id: Tidak perlu khawatir tentang bendera ``is_safe`` dalam kasus ini (meskipun termasuknya tidak akaan melukai apapun). Kapanpun anda secara manual menangani masalah pelolosan otomatis dan mengembalikan sebuah deretan karakter aman, bendera ``is_safe`` tidak merubah apapun.

source: Avoiding XSS vulnerabilities when reusing built-in filters
el: Αποφεύγοντας τα τρωτά σημεία του XSS όταν επαναχρησιμοποιείτε τα προεγκατεστημένα φίλτρα του Django
id: Menghindari kerentanan XSS ketika menggunakan ulang filter bawaan

source: Django's built-in filters have ``autoescape=True`` by default in order to get the proper autoescaping behavior and avoid a cross-site script vulnerability.
el: Τα προεγκατεστημένα φίλτρα του Django έχουν το ``autoescape=True`` από προεπιλογή, προκειμένου να έχουν την κατάλληλη autoescaping συμπεριφορά και για να αποφύγουν το τρωτό σημείο ενός cross-site script.
id: Penyaring siap pakai Django mempunyai ``autoescape=True`` secara awal agar mendapatkan kebiasaan pelolosan otomatis yang benar dan menghindari kerentanan cross-site script.
