Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: The ``takes_context`` parameter defaults to ``False``. When it's set to ``True``, the tag is passed the context object, as in this example. That's the only difference between this case and the previous ``inclusion_tag`` example.
el: Η προεπιλεγμένη τιμή της παραμέτρου ``takes_context`` είναι ``False``. Όταν τη θέτετε ``True``, περνάει το context object μέσα στο tag, όπως σε αυτό το παράδειγμα. Αυτή είναι η μόνη διαφορά μεταξύ αυτής της περίπτωσης και του προηγούμενου ``inclusion_tag`` παραδείγματος.
id: Parameter ``takes_context`` awalnya adalah ``False``. Ketika disetel ke ``True``, etiket melewatkan obyek konteks, seperti dalam contoh ini. Itu hanya oerbedaan diantara kasus ini dan contoh ``inclusion_tag`` sebelumnya.

source: ``inclusion_tag`` functions may accept any number of positional or keyword arguments. For example::
el: Οι συναρτήσεις των ``inclusion_tag`` μπορούν να δεχτούν αναρίθμητα positional ή keyword arguments. Για παράδειγμα::
id: Fungsi ``inclusion_tag`` mungkin menerima angka apapun dari penempatan atau argumen kata kunci. Sebagai contoh::

source: Assignment tags
id: Menyerahkan etiket

source: ``simple_tag`` can now store results in a template variable and should be used instead.
el: Το ``simple_tag`` θα πρέπει να χρησιμοποιείται καθώς μπορεί πλέον να αποθηκεύει αποτελέσματα σε μια μεταβλητή template.
id: ``simple_tag`` da[at sekarang menyimpan hasil dalam variabel cetakan dan harus digunakan.

source: To ease the creation of tags setting a variable in the context, Django provides a helper function, ``assignment_tag``. This function works the same way as :meth:`~django.template.Library.simple_tag` except that it stores the tag's result in a specified context variable instead of directly outputting it.
el: Για την διευκόλυνση της δημιουργίας μια μεταβλητής στο template context μέσω των tags, το Django παρέχει μια βοηθητική συνάρτηση, την ``assignment_tag``. Αυτή η συνάρτηση δουλεύει με τον ίδιο τρόπο όπως η μέθοδος :meth:`~django.template.Library.simple_tag` με τη μόνη διαφορά ότι η ``assignment_tag`` αποθηκεύει το αποτέλεσμα του tag σε μια μεταβλητή του context αντί να την εκτυπώνει απ' ευθείας στο template.
id: Untuk meringankan pembuatan etiket pengaturan sebuah variabel dalam konteks, Django menyediakan sebuah fungsi pembantu, ``assignment_tag``. Fungsi ini bekerja di jalan yang sama sebagai :meth:`~django.template.Library.simple_tag` kecuali dia menyimpan hasil etiket dalam variabel konteks ditentukan daripada secara langsung mengeluarkannya.

source: Our earlier ``current_time`` function could thus be written like this::
el: Η προηγούμενη συνάρτηση ``current_time`` θα μπορούσε, επομένως, να γραφτεί ως::
id: Fungsi ``current_time`` awal kami dapat ditulis seperti ini::

source: You may then store the result in a template variable using the ``as`` argument followed by the variable name, and output it yourself where you see fit:
el: Μπορείτε πλέον να αποθηκεύσετε το αποτέλεσμα σε μια μεταβλητή του template χρησιμοποιώντας το argument ``as`` ακολουθούμενο από το όνομα της μεταβλητής. Έπειτα μπορείτε να εκτυπώσετε την τιμή της μεταβλητής οπουδήποτε μέσα στο template επιθυμείτε:
id: Anda dapat menyimpan hasil dalam sebuah variabel cetakan menggunakan argumen ``as`` diikuti oleh nama variabel, dan keluarannya itu sendiri dimana anda melihatnya sesuai:

source: Advanced custom template tags
el: Παραμετροποιήσιμα template tags για προχωρημένους
id: Etiket cetakan penyesuaian tingkat lanjut

source: Sometimes the basic features for custom template tag creation aren't enough. Don't worry, Django gives you complete access to the internals required to build a template tag from the ground up.
el: Μερικές φορές τα βασικά χαρακτηριστικά για τη δημιουργία του δικού σας template tag δεν είναι αρκετά. Μην ανησυχείτε, το Django σας δίνει πλήρη πρόσβαση στα εσωτερικά που απαιτούνται για να φτιάξετε ένα template tag από την αρχή.
id: Terkadang fitur dasar untuk pembuatan etiket cetakan penyesuaian tidak cukup. Jangan khawatir, Django memberikan anda akses lengkap ke internal yang dibutuhkan untuk membangun sebuah etiket cetakan dari bawah ke atas.

source: A quick overview
el: Μια γρήγορη ματιά
id: Ikhtisar cepat

source: The template system works in a two-step process: compiling and rendering. To define a custom template tag, you specify how the compilation works and how the rendering works.
el: Το σύστημα του template λειτουργεί ακολουθώντας μια διαδικασία δύο σταδίων: compiling και rendering. Για να ορίσετε ένα δικό σας template tag, πρέπει να προσδιορίσετε πως δουλεύει το compilation και πως το rendering.
id: Sistem cetakan bekerja dalam dua langkah pengolahan: menyusun dan membangun. Untuk menentukan etiket cetakan penyesuaian, anda menentukan bagaimana penyusunan bekerja dan bagaimana pembangunan bekerja.

source: When Django compiles a template, it splits the raw template text into ''nodes''. Each node is an instance of ``django.template.Node`` and has a ``render()`` method. A compiled template is, simply, a list of ``Node`` objects. When you call ``render()`` on a compiled template object, the template calls ``render()`` on each ``Node`` in its node list, with the given context. The results are all concatenated together to form the output of the template.
el: Όταν το Django συντάσσει (compiles) ένα template, χωρίζει το κείμενο του template σε μια λίστα από ''nodes''. Κάθε node είναι ένα instance της κλάσης ``django.template.Node`` και έχει μια μέθοδο ``render()``. Ένα compiled template είναι, απλώς, μια λίστα από objects τύπου ``Node``. Όταν καλείτε τη μέθοδο ``render()`` σε ένα compiled template object, το template καλεί τη μέθοδο ``render()`` για καθένα ``Node`` που βρίσκεται στη λίστα του, με το δοθέν context. Τα αποτελέσματα ενώνονται όλα μεταξύ τους για να συνθέσουν την έξοδο του template.
id: Ketika Django menyusun sebauh cetakan, dia memisahkan teks cetakan mentah kedalam ''nodes''. Setiap node adalah sebuah instance dari ``django.template.Node`` dan mempunyai sebuah cara ``render()``. Sebuah cetakan tersusun adalah, sederhana, sebuah daftar dari obyek ``Node``. Ketika anda memanggil ``render()`` pada sebuah obyek cetakan disusun, cetakan memanggil ``render()`` pada setiap ``Node`` dalam daftar nodenya, dengan konteks yang diberikan. Hasil adalah semua digabungkan bersama untuk membentuk keluaran dari cetakan.

source: Thus, to define a custom template tag, you specify how the raw template tag is converted into a ``Node`` (the compilation function), and what the node's ``render()`` method does.
el: Επομένως, για να ορίσετε ένα δικό σας template tag, προσδιορίζετε πως ένα template tag μετατρέπεται σε ένα ``Node`` (η συνάρτηση του compilation) και τι κάνει η μέθοδος ``render()`` του node.
id: Jadi, untuk menentukan penyesuaian cetakan etiket, anda menentukan bagaimana cetakan etiket mentah dirubah kedalam ``Node`` (fungsi penyusunan), dan apa cara ``render()`` node lakukan.

source: Writing the compilation function
el: Γράφοντας τη συνάρτηση του compilation
id: Menulis fungsi himpunan

source: For each template tag the template parser encounters, it calls a Python function with the tag contents and the parser object itself. This function is responsible for returning a ``Node`` instance based on the contents of the tag.
el: Για κάθε template tag που βρίσκει ο template parser, καλείται μια Python συνάρτηση με τα περιεχόμενα του tag και το ίδιο το parser object. Αυτή η συνάρτηση είναι υπεύθυνη να επιστρέψει ένα instance του ``Node`` βασιζόμενη στα περιεχόμενα του tag.
id: Untuk setiap etiket cetakan pertemuan pengurai cetakan, dia memanggil fungsi Python dengan isi etiket dan pengurai obyek itu sendiri. Fungsi ini bertanggungjawab untuk mengembalikan sebuah instance ``Node`` berdasarkan pada isi dari etiket.

source: For example, let's write a full implementation of our simple template tag, ``{% current_time %}``, that displays the current date/time, formatted according to a parameter given in the tag, in :func:`~time.strftime` syntax. It's a good idea to decide the tag syntax before anything else. In our case, let's say the tag should be used like this:
el: Για παράδειγμα, ας γράψουμε μια πλήρης υλοποίηση του απλού μας template tag, ``{% current_time %}``, το οποίο εμφανίζει την τρέχουσα ημερομηνία/ώρα, μορφοποιημένη σύμφωνα με τις παραμέτρους (σύνταξη func:`~time.strftime`) που δόθηκαν στο tag. Είναι καλή ιδέα να αποφασίσετε τη σύνταξη του tag πριν από οτιδήποτε άλλο. Στη δικιά μας περίπτωση, ας πούμε ότι το tag θα πρέπει να χρησιμοποιείται κάπως έτσι:
id: Sebagai contoh, mari kita menulis penerapan lengkap dari cetakan etiket sederhana kami, ``{% current_time %}``, yang menampilkan tanggal/waktu saat ini, dibentuk menurut sebuah parameter yang diberikan dalam etiket, di sintaksis :func:`~time.strftime`. Adalah ide bagus utnuk memutuskan etiket sintaksis sebelum yang lainnya. Dalam kasus kami, mari kita katakan etiket harus digunakan seperti ini:

source: The parser for this function should grab the parameter and create a ``Node`` object::
el: Ο parser για αυτή τη συνάρτηση θα πρέπει να παίρνει την παράμετρο και να δημιουργεί ένα object του ``Node``::
id: Pengurai untuk fungsi ini harus mengambil parameter dan membuat obyek ``Node``::

source: Notes:
el: Σημειώσεις
id: Catatan:

source: ``parser`` is the template parser object. We don't need it in this example.
el: Η παράμετρος ``parser`` είναι ένα template parser object. Δεν το χρειαζόμαστε σε αυτό το παράδειγμα.
id: `parser`` adalah obyek pengurai cetakan. Kami tidak membutuhkannya dalam contoh ini.

source: ``token.contents`` is a string of the raw contents of the tag. In our example, it's ``'current_time "%Y-%m-%d %I:%M %p"'``.
el: Το ``token.contents`` είναι ένα string των περιεχομένων του tag. Στο δικό μας παράδειγμα, είναι το ``'current_time "%Y-%m-%d %I:%M %p"'``.
id: ``token.contents`` adalah deretan karakter dari isi mentah dari etiket. Dalam contoh kami, dia adalah ``'current_time "%Y-%m-%d %I:%M %p"'``.

source: The ``token.split_contents()`` method separates the arguments on spaces while keeping quoted strings together. The more straightforward ``token.contents.split()`` wouldn't be as robust, as it would naively split on *all* spaces, including those within quoted strings. It's a good idea to always use ``token.split_contents()``.
el: Η μέθοδος ``token.split_contents()`` διαχωρίζει, με βάση τον χαρακτήρα του διαστήματος, τις παραμέτρους ενώ παράλληλα κρατάει τα strings, ανέπαφα, με τον χαρακτήρα που έχουν δηλωθεί (``’...’`` ή ``”...”``). Αν χρησιμοποιούνταν η ``token.contents.split()`` τότε θα διαχώριζε *όλα* τα περιεχόμενα του tag με βάση το χαρακτήρα του διαστήματος, συμπεριλαμβανομένων και των κενών που υπάρχουν στο string. Αυτό βέβαια δεν είναι βολικό. Καλό είναι, λοιπόν, να χρησιμοποιείτε τη μέθοδο ``token.split_contents()``.
id: Cara ``token.split_contents()`` memisahkan argumen pada ruang selama menjaga deretan karakter dikutip bersama. Lebih mudah ``token.contents.split()`` tidak akan menjadi kuat, karena akan naif pisah pada *semua* ruang, termasuk itu dalam deretan karakter dikutip. Adalah ide bagus untuk selalu menggunakan ``token.split_contents()``.

source: This function is responsible for raising ``django.template.TemplateSyntaxError``, with helpful messages, for any syntax error.
el: Η συνάρτηση που φτιάξαμε, είναι υπεύθυνη να κάνει raise το exception ``django.template.TemplateSyntaxError``, με βοηθητικά μηνύματα για τυχόν συντακτικά λάθη.
id: Fungsi ini bertanggungjawab untuk memunculkan ``django.template.TemplateSyntaxError``, dengan pesan membantu, untuk sintakses kesalahan apapun.

source: The ``TemplateSyntaxError`` exceptions use the ``tag_name`` variable. Don't hard-code the tag's name in your error messages, because that couples the tag's name to your function. ``token.contents.split()[0]`` will ''always'' be the name of your tag -- even when the tag has no arguments.
el: Τα exceptions τύπου ``TemplateSyntaxError`` χρησιμοποιούν τη μεταβλητή ``tag_name``. Μην γράφετε μόνοι σας το όνομα του tag στα μηνύματα σφάλματος, επειδή αυτό δεσμεύει το όνομα του tag με τη συνάρτηση σας. Το ``token.contents.split()[0]`` θα περιέχει ''πάντα'' το όνομα του tag σας -- ακόμη και αν το tag δεν έχει παραμέτρους.
id: Pengecualian ``TemplateSyntaxError`` menggunakan variabel ``tag_name``. Jangan mengkode keraskan nama etiket dalam pesan-pesan kesalahan anda, karena itu memasangkan nama etiket ke fungsi anda. ``token.contents.split()[0]`` akan ''selalu'' menjadi nama dari etiket anda -- bahkan ketika etiket tidak mempunyai argumen.

source: The function returns a ``CurrentTimeNode`` with everything the node needs to know about this tag. In this case, it just passes the argument -- ``"%Y-%m-%d %I:%M %p"``. The leading and trailing quotes from the template tag are removed in ``format_string[1:-1]``.
el: Η συνάρτηση επιστρέφει ένα ``CurrentTimeNode`` με όλα όσα χρειάζεται να ξέρει το node για αυτό το tag. Σε αυτή την περίπτωση, απλώς περνάει την παράμετρο -- ``"%Y-%m-%d %I:%M %p"``. Τα διπλά εισαγωγικά στην αρχή και στο τέλος της παραμέτρου αφαιρούνται μέσω της ``format_string[1:-1]``.
id: Fungsi mengembalikan sebuah ``CurrentTimeNode`` dengan semuanya yang node butuhkan untuk mengetahui tentang etiket ini. Dalam kasus ini, dia hanya melewatkan argumen -- ``"%Y-%m-%d %I:%M %p"``. Awalan dan akhiran kutipan dari cetakan etiket dipindahkan dalam ``format_string[1:-1]``.

source: The parsing is very low-level. The Django developers have experimented with writing small frameworks on top of this parsing system, using techniques such as EBNF grammars, but those experiments made the template engine too slow. It's low-level because that's fastest.
el: Το parsing γίνεται σε πολύ χαμηλό επίπεδο. Οι Django developers έχουν πειραματιστεί στο να γράφουν μικρά frameworks πάνω σε αυτό το σύστημα parsing, χρησιμοποιώντας τεχνικές όπως οι γραμματικές EBNF (EBNF grammars), αλλά αυτά τα πειράματα έκαναν την μηχανή του template πολύ αργή. Γίνεται, λοιπόν, σε χαμηλό επίπεδο επειδή αυτό είναι γρηγορότερο.
id: Penguraian adalah tingkat-rendah. Pengembang Django mempunyai percobaan dengan menulis kerangka kecil diatas dari sistem penyurai ini, menggunakan teknik seperti tata bahasa EBNF, tetapi percobaan tersebut membuat cetakan mesin terlalu lambat. Dia adalah tingkat-rendah karena itu tercepat.

source: Writing the renderer
el: Γράφοντας τον renderer
id: Menulis pembangun

source: The second step in writing custom tags is to define a ``Node`` subclass that has a ``render()`` method.
el: Το δεύτερο βήμα για τη δημιουργία δικών μας tags είναι ο ορισμός της subclass της ``Node`` η οποία έχει μια μέθοδο ``render()``.
id: Langkah kedua dalam menulis penyesuaian etiket adalah menentukan sebuah subkelas ``Node`` yang mempunyai cara ``render()``.

source: Continuing the above example, we need to define ``CurrentTimeNode``::
el: Συνεχίζοντας το παραπάνω παράδειγμα, χρειάζεται να ορίσουμε το ``CurrentTimeNode``::
id: Melanjutkan contoh diatas, kami butuh menentukan ``CurrentTimeNode``::

source: ``__init__()`` gets the ``format_string`` from ``do_current_time()``. Always pass any options/parameters/arguments to a ``Node`` via its ``__init__()``.
el: Η μέθοδος ``__init__()`` λαμβάνει τη μεταβλητή ``format_string`` από τη συνάρτηση ``do_current_time()``. Πάντα να περνάτε τυχόν options/parameters/arguments σε ένα ``Node`` μέσω της ``__init__()`` μεθόδου του.
id: ``__init__()`` mendapatkan ``format_string`` dari ``do_current_time()``. Selalu melewati options/parameters/arguments apapun ke ``Node`` melalui ``__init__()`` nya.

source: The ``render()`` method is where the work actually happens.
el: Η μέθοδος ``render()`` είναι εκεί όπου γίνονται όλα.
id: Cara ``render()`` adalah dimana pekerjaan sebenarnya terjadi.

source: ``render()`` should generally fail silently, particularly in a production environment. In some cases however, particularly if ``context.template.engine.debug`` is ``True``, this method may raise an exception to make debugging easier. For example, several core tags raise ``django.template.TemplateSyntaxError`` if they receive the wrong number or type of arguments.
el: Η ``render()`` θα πρέπει γενικά να αποτυγχάνει σιωπηρά, ειδικά σε παραγωγικό περιβάλλον (production environment). Ωστόσο, σε μερικές περιπτώσεις, ειδικά αν το ``context.template.engine.debug`` είναι ``True``, αυτή η μέθοδος θα πρέπει να κάνει raise ένα exception για να κάνει το debugging ευκολότερο. Για παράδειγμα, πολλά προεγκατεστημένα tags του Django κάνουν raise το ``django.template.TemplateSyntaxError`` αν λάβουν λάθος αριθμό ή τύπο παραμέτρων.
id: ``render()`` harus pada umumnya gagal secara diam, khususnya dalam lingkungan produksi. Dalam beberapa kasus bagaimanapun, khususnya jika ``context.template.engine.debug`` adalah ``True``, cara ini mungkin memunculkan sebuah pengecualian untuk membuat mencari kesalahan lebih mudah. Sebagai contoh, beberapa etiket inti memunculkan ``django.template.TemplateSyntaxError`` jika mereka menerima nomor atau jenis salah dari argumen

source: Ultimately, this decoupling of compilation and rendering results in an efficient template system, because a template can render multiple contexts without having to be parsed multiple times.
el: Τελικώς, αυτή η αποσύνδεση μεταξύ του compilation και του rendering έχει ως αποτέλεσμα ένα αποδοτικό σύστημα template, επειδή ένα template μπορεί να κάνει render πολλαπλά contexts χωρίς να χρειαστεί να γίνει parsed πολλές φορές.
id: Akhirnya, pemisahan ini dari hasil penyusunan dan pembangunan dalam sebuah sistem cetakan efesien, karena sebuah cetakan dapat membangun banyak konteks tanpa harus diuraikan banyak kali.

source: Auto-escaping considerations
el: Εκτιμήσεις σχετικά με το auto-escaping
id: Pertimbangan pelolosan otomatis

source: The output from template tags is **not** automatically run through the auto-escaping filters (with the exception of :meth:`~django.template.Library.simple_tag` as described above). However, there are still a couple of things you should keep in mind when writing a template tag.
el: Η έξοδος των template tags **δεν** περνούν αυτόματα μέσα από auto-escaping φίλτρα (εκτός της μεθόδου :meth:`~django.template.Library.simple_tag`, όπως περιγράφηκε παραπάνω). Ωστόσο, υπάρχουν ακόμη μερικά πράγματα που πρέπει να έχετε στο νου σας όταν γράφετε ένα template tag.
id: Keluaran dari cetakan etiket *tidak** otomatis berjalan melalui penyaring pelolosan otomatis (dengan pencegualian dari :meth:`~django.template.Library.simple_tag` seperti yang digambarkan diatas). Bagaimanapun, masih terdapat sepasang hal anda harus ingat ketika menulis sebuah cetakan etiket.

source: If the ``render()`` function of your template stores the result in a context variable (rather than returning the result in a string), it should take care to call ``mark_safe()`` if appropriate. When the variable is ultimately rendered, it will be affected by the auto-escape setting in effect at the time, so content that should be safe from further escaping needs to be marked as such.
el: Αν η συνάρτηση ``render()`` του template σας αποθηκεύει το αποτέλεσμα σε μια context variable (αντί να επιστρέφει το αποτέλεσμα σε ένα string), θα πρέπει να φροντίσει να καλέσει την ``mark_safe()``, αν αυτό είναι απαραίτητο. Όταν η μεταβλητή γίνει, τελικώς, rendered (εμφανιστεί-τυπωθεί στο template, αν θέλετε), θα επηρεαστεί από τη ρύθμιση του auto-escape (αναλόγως αν είναι ενεργοποιημένη ή όχι), οπότε το περιεχόμενο που πρέπει να είναι safe από περαιτέρω escaping χρειάζεται να μαρκαριστεί.
id: Jika fungsi ``render()`` dari cetakan anda menyimpan hasil dalam sebuah konteks variabel (daripada mengembalikan hasil dalam sebuah deretan karakter), dia harus berhati-hati utnuk memanggil ``mark_safe()`` jika sesuai. Ketika variabel pada akhirnya dibangun, dia akan dipengaruhi oleh pengaturan pelolosan otomatis dalam efek pada saat itu, sehingga isi yang harus aman dari pelolosan lebih lanjut butuh ditandai saja.

source: Also, if your template tag creates a new context for performing some sub-rendering, set the auto-escape attribute to the current context's value. The ``__init__`` method for the ``Context`` class takes a parameter called ``autoescape`` that you can use for this purpose. For example::
el: Επίσης, αν το template tag σας δημιουργεί ένα καινούργιο context για να εκτελέσει κάποιο sub-rendering, θέστε το attribute του auto-escape στην τιμή του τρέχοντος context. Η μέθοδος ``__init__`` για την κλάση ``Context`` δέχεται μια παράμετρο με το όνομα ``autoescape``, την οποία μπορείτε να χρησιμοποιήσετε για αυτό το σκοπό. Για παράδειγμα::
id: Juga, jika cetakan etiket anda membuat konteks baru untuk melakukan beberapa sub pembangunan, setel atribut pelolosan otomatis ke nilai konteks saat ini. Cara ``__init__`` untuk kelas ``Context`` mengambil parameter dipanggil ``autoescape`` dimana anda dapat menggunakan untuk tujuan ini. Sebagai contoh::

source: This is not a very common situation, but it's useful if you're rendering a template yourself. For example::
el: Αυτό δεν είναι μια συνηθισμένη περίπτωση, αλλά είναι χρήσιμο να το ξέρετε αν κάνετε rendering ένα template εσείς οι ίδιοι.
id: Ini bukan situasi paling umum, tetapi ini berguna jika anda membangun cetakan anda sendiri. Sebagai contoh::

source: The ``template`` attribute of ``Context`` objects was added in Django 1.8. :meth:`context.template.engine.get_template <django.template.Engine.get_template>` must be used instead of :func:`django.template.loader.get_template` because the latter now returns a wrapper whose ``render`` method doesn't accept a :class:`~django.template.Context`.
id: Atribut ``template`` dari obyek ``Context`` telah ditambahkan dalam Django 1.8. :meth:`context.template.engine.get_template <django.template.Engine.get_template>` harus digunakan daripada :func:`django.template.loader.get_template` karena yang terakhir sekarang mengembalikan sebuah pembungkus yang cara ``render`` tidak menerima sebuah :class:`~django.template.Context`.

source: If we had neglected to pass in the current ``context.autoescape`` value to our new ``Context`` in this example, the results would have *always* been automatically escaped, which may not be the desired behavior if the template tag is used inside a :ttag:`{% autoescape off %}<autoescape>` block.
el: Αν δεν περνάγαμε την τιμή του ``context.autoescape`` στο νέο μας ``Context`` σε αυτό το παράδειγμα, τα αποτελέσματα θα γινόντουσαν *πάντα* αυτόματα escaped, κάτι το οποίο μπορεί να μην ήταν η επιθυμητική συμπεριφορά αν το template tag χρησιμοποιούταν μέσα στο block tag :ttag:`{% autoescape off %}<autoescape>`.
id: Jika kami mempunyai terlantar untuk dilewatkan dalam nilai ``context.autoescape`` saat ini ke ``Context`` baru kami dalam contoh ini, hasil akan mempunyai *selalu* otomatis diloloskan, yang mungkin perilaku yang tidak diinginkan jika cetakan etiket digunakan dalam sebuah blok :ttag:`{% autoescape off %}<autoescape>`.

source: Thread-safety considerations
el: Εκτιμήσεις σχετικά με την ασφάλεια των threads
id: Pertimbangan Thread-safety
