Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: All :func:`sensitive_variables` and :func:`sensitive_post_parameters` do is, respectively, annotate the decorated function with the names of sensitive variables and annotate the ``HttpRequest`` object with the names of sensitive POST parameters, so that this sensitive information can later be filtered out of reports when an error occurs. The actual filtering is done by Django's default error reporter filter: :class:`django.views.debug.SafeExceptionReporterFilter`. This filter uses the decorators' annotations to replace the corresponding values with stars (`**********`) when the error reports are produced. If you wish to override or customize this default behavior for your entire site, you need to define your own filter class and tell Django to use it via the :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` setting::
el: Το μόνο που κάνουν οι συναρτήσεις :func:`sensitive_variables` και :func:`sensitive_post_parameters`, αντίστοιχα, είναι να επισημαίνουν την διακοσμημένη συνάρτηση με τα ονόματα των ευαίσθητων δεδομένων και να επισημαίνουν το ``HttpRequest`` object με τα ονόματα των ευαίσθητων POST παραμέτρων, ούτως ώστε αυτές οι ευαίσθητες πληροφορίες να μπορούν αργότερα να μείνουν εκτός των αναφορών σφαλμάτων, όταν προκύψει κάποιο σφάλμα. Το πραγματικό φιλτράρισμα γίνεται από ένα προεπιλεγμένο φίλτρο αναφορά σφαλμάτων του Django: την κλάση :class:`django.views.debug.SafeExceptionReporterFilter`. Αυτό το φίλτρο χρησιμοποιεί τις επισημάνσεις των decorator για να αντικαταστήσει τις αντίστοιχες τιμές με αστερίσκους (`**********`) όταν παράγονται οι αναφορές σφάλματος. Αν θέλετε να παρακάμψετε ή να παραμετροποιήσετε αυτή την προεπιλεγμένη συμπεριφορά για όλο το site σας, θα πρέπει να ορίσετε τη δική σας κλάση φίλτρου και να πείτε στο Django να χρησιμοποιήσει αυτή μέσω της ρύθμισης :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER`::
id: Semua :func:`sensitive_variables` dan :func:`sensitive_post_parameters` lakukan adalah, masing-masing, keterangan dungsi dihiasi dengan nama-nama dari variabel sensitif dan keterangan obyek ``HttpRequest`` dengan nama-nama dari sensitif parameter POST, sehingga informasi sensitif ini dapat kemudian disaring keluar dari laporan ketika kesalahan muncul. Penyaring sebenarnya dilakukan oleh penyaring laporan kesalahan awal Django: :class:`django.views.debug.SafeExceptionReporterFilter`. Penyaring ini menggunakan keterangan dihiasi untuk mengganti nilai-nilai terhubung dengan bintang (`**********`) ketika laporan kesalahan di buat. Jika anda berharap mengesampingkan atau menyesuaikan perilaku awal ini untuk keseluruhan situs anda, anda butuh menentukan kelas penyaring sendiri dan beritahu Django untuk menggunakannya melalui pengaturan :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER`:

source: You may also control in a more granular way which filter to use within any given view by setting the ``HttpRequest``’s ``exception_reporter_filter`` attribute::
el: Μπορείτε επίσης να ελέγξετε, σε πιο λεπτομερές επίπεδο, ποιο φίλτρο να χρησιμοποιηθεί μέσα σε κάθε view θέτοντας το attribute ``exception_reporter_filter`` του ``HttpRequest``::
id: Anda dapat juga mengendalikan cara lebih kecil penyaring mana untuk digunakan dalam tampilan yang diberikan oleh pengaturan atribut ``exception_reporter_filter`` ``HttpRequest``::

source: Your custom filter class needs to inherit from :class:`django.views.debug.SafeExceptionReporterFilter` and may override the following methods:
el: Η δική σας κλάση φίλτρου χρειάζεται να κληρονομήσει από την κλάση :class:`django.views.debug.SafeExceptionReporterFilter` και μπορεί να παρακάμψει (override) τις ακόλουθες μεθόδους:
id: Kelas penyaring penyesuaian anda butuh diwariskan dari :class:`django.views.debug.SafeExceptionReporterFilter` dan mungkin mengesampingkan cara berikut:

source: Returns ``True`` to activate the filtering operated in the other methods. By default the filter is active if :setting:`DEBUG` is ``False``.
el: Επιστρέφει ``True`` για να ενεργοποιήσει το φιλτράρισμα που γίνεται σε άλλες μεθόδους. Από προεπιλογή το φίλτρο είναι ενεργό αν η ρύθμιση :setting:`DEBUG` είναι ``False``.
id: Mengembalikan ``True`` untuk mengaktifkan penyaring dijalankan dalam cara lain. Secara awal penyaring aktif jika :setting:`DEBUG` adalah ``False``.

source: Returns the filtered dictionary of POST parameters. By default it replaces the values of sensitive parameters with stars (`**********`).
el: Επιστρέφει το φιλτραρισμένο dictionary των POST παραμέτρων. Από προεπιλογή αντικαθιστά τις τιμές των ευαίσθητων δεδομένων με αστερίσκους (`**********`).
id: Mengembalikan kamis penyaring dari parameter POST. Secara awal dia mengganti nilai-nilai dari parameter sensitif dengan bintang (`**********`).

source: Returns the filtered dictionary of local variables for the given traceback frame. By default it replaces the values of sensitive variables with stars (`**********`).
el: Επιστρέφει το φιλτραρισμένο dictionary των τοπικών μεταβλητών για το τρέχων traceback frame. Από προεπιλογή αντικαθιστά τις τιμές των ευαίσθητων δεδομένων με αστερίσκους (`**********`).
id: Mengembalikan kamus disaring dari variabel lokal untuk kerangka pelacakan kembali yang diberikan. Secara awal dia mengganti nilai-nilai dari variabel sensitif dengan bintang (`**********`).

source: You can also set up custom error reporting by writing a custom piece of :ref:`exception middleware <exception-middleware>`. If you do write custom error handling, it's a good idea to emulate Django's built-in error handling and only report/log errors if :setting:`DEBUG` is ``False``.
el: Μπορείτε επίσης να ρυθμίσετε τις δικές σας αναφορές σφαλμάτων γράφοντας ένα δικό σας κομμάτι μιας :ref:`exception middleware <exception-middleware>`. Αν όντως γράψετε έναν δικό σας διαχειριστή σφαλμάτων, μια καλή ιδέα είναι να μιμηθείτε τον προεγκατεστημένο διαχειριστή σφαλμάτων του Django και να αναφέρετε ή να κάνετε log τυχόν σφάλματα μόνο αν η ρύθμιση :setting:`DEBUG` είναι ``False``.
id: Anda dapat juga mengatur penyesuaian pelaporan kesalahan dengan menulis sebuah potongan penyesuaian dari :ref:`exception middleware <exception-middleware>`. Jika anda melakukan menulis penyesuaian penanganan kesalahan, adalah ide bagus untuk meniru penanganan kesalahan siap pakai Django dan hanya laporan/catatan kesalahan jika setting:`DEBUG` adalah ``False``.

source: "How-to" guides
el: Οδηγοί "Πως-να"
id: Panduan "Bagaimana"

source: Here you'll find short answers to "How do I....?" types of questions. These how-to guides don't cover topics in depth -- you'll find that material in the :doc:`/topics/index` and the :doc:`/ref/index`. However, these guides will help you quickly accomplish common tasks.
el: Εδώ θα βρείτε σύντομες απαντήσεις σε ερωτήματα του τύπου "Πως να...;". Αυτοί οι οδηγοί δεν καλύπτουν τα θέματα εις βάθος -- αν θέλετε να εμβαθύνετε κοιτάξτε στο άρθρο :doc:`χρησιμοποιώντας το Django </topics/index>` και στην :doc:`αναφορά σχετικά με το API </ref/index>`. Ωστόσο, αυτοί οι οδηγοί θα σας βοηθήσουν να λύσετε συνήθη προβλήματα μέσα σε γρήγορο χρονικό διάστημα.
id: Disini anda akan menemukan jawaban pendek pada jenis pertanyaan "Bagaimana Saya....?". Panduanbagaimana-untuk ini tidak mencakupi topik lebih dalam -- anda akan menemukan bahan tersebut di :doc:`/topics/index` dan the :doc:`/ref/index`. Bagaimanapun, panduan ini akan membantu anda dengan cepat menyelesaikan tugas-tugas umum.

source: The `Django community aggregator`_, where we aggregate content from the global Django community. Many writers in the aggregator write this sort of how-to material.
el: Στην `κοινότητα του Django <https://www.djangoproject.com/community/>`_, όπου μαζεύουμε υλικό από όλη την Django κοινότητα. Πολλοί συγγραφείς από εκεί, έχουν γράψει αυτού του είδους τους οδηγούς.
id: `Django community aggregator`_, dimana kami mengumpulkan isi dari komunitas Django keseluruhan. Banyak penulis di perkumpulan menulis bahan bagaimana-untuk semacam ini.

source: Providing initial data for models
el: Παρέχοντας αρχικά δεδομένα στα μοντέλα
id: Menyediakan data awal untuk model

source: It's sometimes useful to pre-populate your database with hard-coded data when you're first setting up an app. You can provide initial data via fixtures.
el: Μερικές φορές είναι χρήσιμο να κάνετε pre-populate τη βάση δεδομένων σας με hard-coded δεδομένα όταν σετάρετε για πρώτη φορά μια εφαρμογή. Με άλλα λόγια, θέλετε να δοκιμάστε την εφαρμογή σας με κάποια ψεύτικα δεδομένα (fake data) τα οποία στο παραγωγικό περιβάλλον, φυσικά, δεν θα υπάρχουν. Μπορείτε να παρέχετε αρχικά δεδομένα μέσω των fixtures.
id: Terkadang berguna untuk pra-pengumpulan basisdata anda dengan data dikode keraskan ketika anda pertama kali mengatur aplikasi. Anda dapat menyedikan data awal melalui perlengkapan tetap.

source: Providing initial data with fixtures
el: Παρέχοντας αρχικά δεδομένα με τα fixtures
id: Menyediakan data awal dengan perlengkapan tetap

source: A fixture is a collection of data that Django knows how to import into a database. The most straightforward way of creating a fixture if you've already got some data is to use the :djadmin:`manage.py dumpdata <dumpdata>` command. Or, you can write fixtures by hand; fixtures can be written as JSON, XML or YAML (with PyYAML_ installed) documents. The :doc:`serialization documentation </topics/serialization>` has more details about each of these supported :ref:`serialization formats <serialization-formats>`.
el: Ένα fixture είναι μια συλλογή από δεδομένα την οποία το Django ξέρει πως να την κάνει import σε μια βάση δεδομένων. Ο πιο ευθύς τρόπος να δημιουργήσετε ένα fixture, αν έχετε ήδη κάποια data, είναι να χρησιμοποιήσετε την διαχειριστική εντολή :djadmin:`manage.py dumpdata <dumpdata>`. Ή, μπορείτε να γράψετε τα fixtures με το χέρι. Τα fixtures μπορούν να γραφτούν σε μορφή JSON, XML ή YAML (με το PyYAML_ εγκατεστημένο, φυσικά) αρχείων. Το :doc:`εγχειρίδιο για serialization </topics/serialization>` περιέχει περισσότερες λεπτομέρειες σχετικά με αυτού του είδους των υποστηριζόμενων :ref:`μορφών serialization <serialization-formats>`.
id: Perlengkapan tetap adalah sebuah kumpulan dari data yang Django ketahui bagaimana diimpor kedalam sebuah basisdata. Kebanyakan jalan mudah dari pembuatan perlengkapan tetap jika anda telah mendapatkan beberapa data adalah untuk menggunakan perintah :djadmin:`manage.py dumpdata <dumpdata>`. Atau, anda dapat menulis perlengkapan tetap dengan tangan; perlengkapan tetap dapat ditulis sebagai dokumen JSON, XML atau YAML (dengan PyYAML_ terpasang). :doc:`serialization documentation </topics/serialization>` mempunyai lebih rincian tentang setiap dari ini :ref:`serialization formats <serialization-formats>` yang didukung.

source: As an example, though, here's what a fixture for a simple ``Person`` model might look like in JSON:
el: Για παράδειγμα, παρακάτω φαίνεται ένα fixture για ένα μοντέλο με το όνομα ``Person``σε JSON μορφή:
id: Sebagai sebuah contoh, meskipun, ini adalah apa sebuah perlengkapan tetap untuk mode ``Person`` sederhana mungkin kelihatan seperti di JSON:

source: And here's that same fixture as YAML:
el: Και εδώ φαίνεται το ίδιο fixture σε μορφή YAML:
id: Dan ini adalah yang perlengkapan tetap sama seperti YAML:

source: You'll store this data in a ``fixtures`` directory inside your app.
el: Θα αποθηκεύσετε αυτά τα δεδομένα σε ένα φάκελο ``fixtures`` μέσα στην εφαρμογή σας.
id: Anda akan menyimpan data ini dalam sebuah direktori ``fixtures`` didalam aplikasi anda.

source: Loading data is easy: just call :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``, where ``<fixturename>`` is the name of the fixture file you've created. Each time you run :djadmin:`loaddata`, the data will be read from the fixture and re-loaded into the database. Note this means that if you change one of the rows created by a fixture and then run :djadmin:`loaddata` again, you'll wipe out any changes you've made.
el: Η φόρτωση των δεδομένων είναι εύκολη: απλώς καλέστε την διαχειριστική εντολή :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``, όπου ``<fixturename>`` είναι το όνομα του fixture αρχείου που δημιουργήσατε. Κάθε φορά που τρέχετε την εντολή :djadmin:`loaddata`, τα δεδομένα θα διαβαστούν από το fixture και θα επαναφορτωθούν στη βάση δεδομένων. Αυτό σημαίνει ότι αν αλλάξατε κάτι στη βάση δεδομένων και μετά ξανατρέξετε την εντολή :djadmin:`loaddata`, θα χάσετε τις αλλαγές αυτές αφού θα φορτωθούν εκ νέου τα fixtures.
id: Memuat data sangat mudah: cukup panggil :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``, dimana ``<fixturename>`` adalah nama dari berkas perlengkapan tetap anda telah buat. Setiap kali anda menjalankan :djadmin:`loaddata`, data akan dibaca dari perlengkapan tetap dan dimuat kembali kedalam basisdata. Catat ini berarti bahwa jika anda merubah satu dari baris-baris dibuat oleh sebuah perlengkapan tetap dan kemudian menjalankan :djadmin:`loaddata` kembali, anda akan menyapu bersih setiap perubahan anda telah buat.

source: Where Django finds fixture files
el: Που βρίσκει το Django τα fixture αρχεία
id: Dimana Django menemukan berkas-berkas perlengkapan tetap

source: By default, Django looks in the ``fixtures`` directory inside each app for fixtures. You can set the :setting:`FIXTURE_DIRS` setting to a list of additional directories where Django should look.
el: Από προεπιλογή, το Django κοιτάει στο φάκελο ``fixtures`` μέσα σε κάθε app για fixtures. Μπορείτε να ρυθμίσετε τη λίστα :setting:`FIXTURE_DIRS` από επιπρόσθετους φακέλους όπου το Django θα ψάξει.
id: Secara awal, Django mencari dalam direktori ``fixtures`` didalam setiap aplokasi untuk perlengkapan tetap. Anda dapat mengatur pengaturan :setting:`FIXTURE_DIRS`ke sebuah daftar dari direktoti tambahan dimana Django seharusnya melihat.

source: When running :djadmin:`manage.py loaddata <loaddata>`, you can also specify a path to a fixture file, which overrides searching the usual directories.
el: Όταν τρέχετε την εντολή :djadmin:`manage.py loaddata <loaddata>`, μπορείτε, επίσης, να προσδιορίσετε ένα path σε ένα fixture αρχείο, το οποίο παρακάμπτει (overrides) την εύρεση στους συνηθισμένους φακέλους.
id: Ketika menjalankan :djadmin:`manage.py loaddata <loaddata>`, anda dapat juga menentukan sebuah jalur untuk berkas pelengkapan tetap, yang mengesampingkan pencarian direktori-direktori biasanya.

source: Fixtures are also used by the :ref:`testing framework <topics-testing-fixtures>` to help set up a consistent test environment.
el: Τα fixtures χρησιμοποιούνται, επίσης, από το :ref:`testing framework <topics-testing-fixtures>` για να βοηθήσουν να στηθεί ένα σταθερό περιβάλλον για τεστ.
id: Perlengkapan tetap juga digunakan oleh :ref:`testing framework <topics-testing-fixtures>` untuk membantu mengatur kelesarasan lingkungan percobaan.

source: Running Django on Jython
el: Τρέχοντας το Django στη Jython
id: Menjalankan Django pada Jyton

source: Jython_ is an implementation of Python that runs on the Java platform (JVM). This document will get you up and running with Django on top of Jython.
el: Η Jython_ είναι μια υλοποίηση της Python η οποία τρέχει πάνω στην πλατφόρμα της Java (Java platform – JVM). Το παρών άρθρο θα σας βοηθήσει να ολοκληρώσετε και να τρέξετε το Django πάνω στη Jython.
id: Jython_ adalah sebuah penerapan dari Python yang berjalan pada Java platform (JVM). Dokumen ini akan membuat anda terbangun dan berjalan dengan Django diatas Jython.

source: Installing Jython
el: Εγκαθιστώντας την Jython
id: Memasang Jython

source: Django works with Jython versions 2.7b2 and higher. See the Jython_ website for download and installation instructions.
el: Το Django δουλεύει με τις εκδόσεις της Jython 2.7b2 και μεγαλύτερες. Δείτε την επίσημη ιστοσελίδα της Jython_ για συμβουλές download και εγκατάστασης.
id: Django bekerja dengan Jython versi 2.7b2 dan lebih tinggi. Lihat situs jaringan Jython_ untuk petunjuk mengunduh dan memasang.

source: Creating a servlet container
el: Δημιουργώντας ένα servlet container
id: Membuat kontainer servlet

source: If you just want to experiment with Django, skip ahead to the next section; Django includes a lightweight Web server you can use for testing, so you won't need to set up anything else until you're ready to deploy Django in production.
el: Αν θέλετε, απλώς, να πειραματιστείτε με το Django, προχωρήσετε στην επόμενη ενότητα. Το Django περιλαμβάνει έναν ελαφρύ Web server που μπορείτε να χρησιμοποιήσετε για τεστ, οπότε δεν χρειάζεται να κάνετε κάτι άλλο μέχρις ότου είστε έτοιμοι να ανεβάσετε το Django site σας για το ευρύ κοινό.
id: Jika anda hanya ingin mencoba dengan Django, lewati kedepan ke bagian selanjutnya; Django menyertakan peladen Jaringan ringan anda dapat gunakan untuk percobaan, jadi anda tidak butuh mengatur apapun lagi sampai anda telah siap untuk menyebarkan Django di produksi.

source: If you want to use Django on a production site, use a Java servlet container, such as `Apache Tomcat`_. Full JavaEE applications servers such as `GlassFish`_ or `JBoss`_ are also OK, if you need the extra features they include.
el: Αν θέλετε να χρησιμοποιήσετε το Django site σας στην παραγωγή, χρησιμοποιήστε ένα Java servlet container, όπως το `Apache Tomcat`_. Άλλοι πλήρεις JavaEE applications servers όπως οι `GlassFish`_ ή `JBoss`_ είναι, επίσης, εντάξει, αν θέλετε τις επιπλέον λειτουργίες που προσφέρουν.
id: Jika anda ingin menggunakan Django pada sebuah situs produksi, gunakan wadah Java servlet, seperti `Apache Tomcat`_. Peladen aplikasi JavaEE penuh seperti `GlassFish`_ atau `JBoss`_ juga OKE, jika anda butuh fitur-fitur tambahan mereka sertakan.

source: Installing Django
el: Εγκαθιστώντας το Django
id: Memasang Django

source: The next step is to install Django itself. This is exactly the same as installing Django on standard Python, so see :ref:`removing-old-versions-of-django` and :ref:`install-django-code` for instructions.
el: Το επόμενο βήμα είναι να εγκαταστήσετε το ίδιο το Django. Αυτή η διαδικασία είναι ακριβώς η ίδια με την εγκατάσταση του Django στην Python. Οπότε, δείτε στην :ref:`απεγκατάσταση παλαιών εκδόσεων του Django <removing-old-versions-of-django>` και στην :ref:`εγκατάσταση του Django <install-django-code>` για οδηγίες.
id: Langkah selanjutnya adalah memasang Django itu sendiri. Ini tepatnya sama ketika memasang Django pada Python standar, jadi lihat :ref:`removing-old-versions-of-django` dan :ref:`install-django-code` untuk petunjuk.

source: Installing Jython platform support libraries
el: Εγκαθιστώντας τις βιβλιοθήκες υποστήριξης της πλατφόρμας Jython
id: Memasang pustaka-pustaka pendukung serambi Jython

source: The `django-jython`_ project contains database backends and management commands for Django/Jython development. Note that the builtin Django backends won't work on top of Jython.
el: Το project `django-jython`_ περιέχει database backends και διαχειριστικές εντολές για το development του Django/Jython. Σημειώστε ότι τα προεγκατεστημένα Django backends δεν θα δουλέψουν πάνω στη Jython.
id: Proyek `django-jython`_ mengandung backend basisdata dan perintah pengelolaan untuk pengembangan Django/Jython. Catah bahwa backend Django siap pakai tidak akan bekerja di atas Jython.

source: To install it, follow the `installation instructions`_ detailed on the project website. Also, read the `database backends`_ documentation there.
el: Για να εγκαταστήσετε το πακέτο ``django-jython``, ακολουθήστε τις `οδηγίες εγκατάστασης <https://pythonhosted.org/django-jython/quickstart.html#install>`_ που φαίνονται στην επίσημη ιστοσελίδα του project. Επίσης, διαβάστε εκεί και το εγχειρίδιο `database backends`_.
id: Untuk memasangnya, ikuti rincian `installation instructions`_ pada proyek situs jaringan. Juga, baca dokumentasi database backends`_ disana.

source: Differences with Django on Jython
el: Διαφορές του Django πάνω στη Jython
id: Perbedaan dengan Django pada Jython

source: At this point, Django on Jython should behave nearly identically to Django running on standard Python. However, are a few differences to keep in mind:
el: Σε αυτό το σημείο, το Django πάνω στη Jython θα συμπεριφέρεται σχεδόν το ίδιο με το Django πάνω στην Python. Ωστόσο, παρακάτω φαίνονται μερικές διαφορές για να τις έχετε στο νου σας:
id: Pada titik ini, Django pada Jython harus berperilaku hampir mirip pada Django dijalankan pada Python standar. Bagaimanapun, sedikit perbedaan untuk dijaga dalam pikiran:

source: Remember to use the ``jython`` command instead of ``python``. The documentation uses ``python`` for consistency, but if you're using Jython you'll want to mentally replace ``python`` with ``jython`` every time it occurs.
el: Θυμηθείτε να χρησιμοποιείτε την εντολή ``jython`` αντί της ``python``. Το εγχειρίδιο του Django χρησιμοποιεί την εντολή ``python`` για λόγους συνοχής, αλλά όταν χρησιμοποιείτε την Jython θα πρέπει να αντικαταστήσετε την εντολή ``python`` με την ``jython`` κάθε φορά που θέλετε να τρέξετε κάτι. Για παράδειγμα, αντί να τρέξετε την εντολή ``python manage.py runserver`` θα τρέξετε την ``jython manage.py runserver``.
id: Ingat untuk menggunakan perintah ``jython`` daripada ``python``. Dokumentasi menggunakan ``python`` untuk konsisten, tetapi jika anda sedang menggunakan Jython anda akan ingin secara mental mengganti ``python`` dengan ``jython`` setiap kali dia muncul.

source: Similarly, you'll need to use the ``JYTHONPATH`` environment variable instead of ``PYTHONPATH``.
el: Ομοίως, θα χρειαστεί να χρησιμοποιήσετε την environment variable ``JYTHONPATH`` αντί της ``PYTHONPATH``.
id: Samah halnya, anda akan butuh menggunakan variabel lingkungan ``JYTHONPATH`` daripada ``PYTHONPATH``.

source: Any part of Django that requires `Pillow`_ will not work.
el: Κάθε κομμάτι του Django που απαιτεί τη βιβλιοθήκη `Pillow`_ δεν θα δουλέψει.
id: Bagian apapun dari Django yang membutuhkan `Pillow`_ tidak akan bekerja.

source: Integrating Django with a legacy database
el: Ενσωματώνοντας το Django με μια legacy database
id: Memadukan Django dengan basisdata warisan

source: While Django is best suited for developing new applications, it's quite possible to integrate it into legacy databases. Django includes a couple of utilities to automate as much of this process as possible.
el: Ενώ το Django είναι κατάλληλο για να αναπτύσσετε καινούργιες εφαρμογές, είναι δυνατόν να το ενσωματώσετε με legacy databases. Το Django περιλαμβάνει μερικές λειτουργίες για να αυτοματοποιήσει όσο γίνεται αυτή τη διαδικασία. Με άλλα λόγια, σκοπός αυτής της διαδικασίας είναι: έχετε μια υπάρχουσα βάση δεδομένων για την οποία δεν υπάρχουν Django μοντέλα. Θέλετε, λοιπόν, αντί να ξαναχτίσετε τη βάση αυτή γράφοντας τα μοντέλα σας που θα αντικατοπτρίζουν τη βάση να κάνετε την αντίστροφη διαδικασία, ήτοι να χρησιμοποιήσετε την υπάρχουσα βάση για να φτιάξετε τα μοντέλα σας.
id: Selagi Django adalah terbaik cocok untuk pengembangan aplikasi baru, dia sangat dimungkinkan untuk menggabungkan nya kedalam warisan basisdata. Django menyertakan sepasang peralatan untuk mengotomatisasi sebanyak mungkin proses ini.

source: This document assumes you know the Django basics, as covered in the :doc:`tutorial </intro/tutorial01>`.
el: Αυτό το άρθρο προϋποθέτει ότι γνωρίζετε τα βασικά του Django, όπως έχουν καλυφθεί στον :doc:`οδηγό μας </intro/tutorial01>`.
id: Dokumen ini menganggap anda mengetahui dasar-dasar Django, seperti yang tercakup dalam :doc:`tutorial </intro/tutorial01>`.

source: Once you've got Django set up, you'll follow this general process to integrate with an existing database.
el: Αφού έχετε εγκαταστήσει και σετάρει το Django, θα ακολουθήσετε την παρακάτω γενική διαδικασία για να ενσωματώσετε το Django με μια ήδη υπάρχουσα βάση δεδομένων.
id: Sekali anda telah menyetel Django, anda akan mengikuti pengolahan umum untuk digabungkan dengan basisdata yang ada.
