Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Authentication using ``REMOTE_USER``
el: Πιστοποίηση με χρήση του ``REMOTE_USER``
id: Otentikasi menggunakan ``REMOTE_USER``

source: This document describes how to make use of external authentication sources (where the Web server sets the ``REMOTE_USER`` environment variable) in your Django applications. This type of authentication solution is typically seen on intranet sites, with single sign-on solutions such as IIS and Integrated Windows Authentication or Apache and `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_, etc.
el: Αυτό το άρθρο περιγράφει πως μπορείτε να χρησιμοποιήσετε εξωτερικές πηγές πιστοποίησης (όπου ο Web server έχει ορίσει ως environment variable το ``REMOTE_USER``) μέσα στις Django εφαρμογές σας. Αυτού του είδους οι πιστοποιήσεις εμφανίζονται, συνήθως, μέσα σε intranet σελίδες, όπου η είσοδος του χρήστη στο σύστημα γίνεται μέσω IIS και του Integrated Windows Authentication ή μέσω Apache και `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_, κλπ.
id: Dokumen ini menjelaskan bagaimana memanfaatkan sumber otentikasi eksternal (di mana server Web menetapkan variabel environment ``REMOTE_USER``) dalam aplikasi Django Anda. Jenis solusi otentikasi biasanya terlihat di situs intranet, dengan solusi single sign-on seperti IIS dan Integrated Windows Authentication atau Apache dan `mod_authnz_ldap`_, `CAS`_, `Cosign`_,` WebAuth`_, `mod_auth_sspi `_, dll

source: When the Web server takes care of authentication it typically sets the ``REMOTE_USER`` environment variable for use in the underlying application. In Django, ``REMOTE_USER`` is made available in the :attr:`request.META <django.http.HttpRequest.META>` attribute. Django can be configured to make use of the ``REMOTE_USER`` value using the ``RemoteUserMiddleware`` or ``PersistentRemoteUserMiddleware``, and :class:`~django.contrib.auth.backends.RemoteUserBackend` classes found in :mod:`django.contrib.auth`.
el: Όταν ο Web server αναλαμβάνει την πιστοποίηση, στην ουσία θέτει τη μεταβλητή ``REMOTE_USER`` ως environment variable για να χρησιμοποιηθεί από την εκάστοτε εφαρμογή. Στο Django, η μεταβλητή ``REMOTE_USER`` είναι διαθέσιμη μέσα από το attribute :attr:`request.META <django.http.HttpRequest.META>` του request object. Το Django μπορεί να παραμετροποιηθεί για να κάνει χρήση της μεταβλητής ``REMOTE_USER`` χρησιμοποιώντας τη ``RemoteUserMiddleware`` ή τη ``PersistentRemoteUserMiddleware`` και την κλάση :class:`~django.contrib.auth.backends.RemoteUserBackend` που βρίσκεται μέσα στο module :mod:`django.contrib.auth`.
id: Ketika peladen Jaringan mengurus pembuktian keaslian dia khususnya menyetel variabel lingkungan ``REMOTE_USER`` untuk digunakan dalam aplikasi pokok. Dalam Django, ``REMOTE_USER`` adalah dibuat tersedia dalam atribut :attr:`request.META <django.http.HttpRequest.META>`. Django dapat dikonfigurasikan untuk memanfaatkan nilai ``REMOTE_USER`` menggunakan ``RemoteUserMiddleware`` atau``PersistentRemoteUserMiddleware``, dan kelas :class:`~django.contrib.auth.backends.RemoteUserBackend` ditemukan dalam :mod:`django.contrib.auth`.

source: Configuration
el: Παραμετροποίηση
id: Pengaturan

source: First, you must add the :class:`django.contrib.auth.middleware.RemoteUserMiddleware` to the :setting:`MIDDLEWARE_CLASSES` setting **after** the :class:`django.contrib.auth.middleware.AuthenticationMiddleware`::
id: Pertama, Anda harus menambahkan kelas :class:`django.contrib.auth.middleware.RemoteUserMiddleware` ke pengaturan :setting:`MIDDLEWARE_CLASSES` **setelah** :class:`django.contrib.auth.middleware.AuthenticationMiddleware`::

source: Next, you must replace the :class:`~django.contrib.auth.backends.ModelBackend` with :class:`~django.contrib.auth.backends.RemoteUserBackend` in the :setting:`AUTHENTICATION_BACKENDS` setting::
el: Κατόπιν, πρέπει να αντικαταστήσετε την κλάση :class:`~django.contrib.auth.backends.ModelBackend` με την :class:`~django.contrib.auth.backends.RemoteUserBackend` μέσα στη ρύθμιση :setting:`AUTHENTICATION_BACKENDS`::
id: Selanjutnya, anda harus mengganti :class:`~django.contrib.auth.backends.ModelBackend` dengan :class:`~django.contrib.auth.backends.RemoteUserBackend` di pengaturan :setting:`AUTHENTICATION_BACKENDS` ::

source: With this setup, ``RemoteUserMiddleware`` will detect the username in ``request.META['REMOTE_USER']`` and will authenticate and auto-login that user using the :class:`~django.contrib.auth.backends.RemoteUserBackend`.
el: Με αυτές τις ρυθμίσεις, η ``RemoteUserMiddleware`` θα ανιχνεύσει το username μέσα στο ``request.META['REMOTE_USER']`` και όχι μόνο θα πιστοποιήσει αλλά και θα εισάγει αυτόν τον χρήστη αυτόματα στο σύστημα, χρησιμοποιώντας την κλάση :class:`~django.contrib.auth.backends.RemoteUserBackend`.
id: Dengan pengaturan ini, ``RemoteUserMiddleware`` akan mengenali nama pengguna di ``request.META['REMOTE_USER']`` dan akan mengecek keasliannya dan masuk-otomatis bagi pengguna menggunakan :class:`~django.contrib.auth.backends.RemoteUserBackend`.

source: Be aware that this particular setup disables authentication with the default ``ModelBackend``. This means that if the ``REMOTE_USER`` value is not set then the user is unable to log in, even using Django's admin interface. Adding ``'django.contrib.auth.backends.ModelBackend'`` to the ``AUTHENTICATION_BACKENDS`` list will use ``ModelBackend`` as a fallback if ``REMOTE_USER`` is absent, which will solve these issues.
el: Ιδιαίτερη προσοχή πρέπει να δοθεί στο γεγονός ότι η ανωτέρω συγκεκριμένη ρύθμιση απενεργοποιεί την πιστοποίηση του, προεπιλεγμένου, ``ModelBackend``. Αυτό σημαίνει ότι αν η τιμή της μεταβλητής ``REMOTE_USER`` δεν έχει οριστεί, τότε ο χρήστης δεν θα μπορεί να κάνει log in στο σύστημα, ακόμη και αν χρησιμοποιεί το interface του Django admin. Για την επίλυση αυτού, απλώς προσθέστε το ``'django.contrib.auth.backends.ModelBackend'`` στη λίστα ``AUTHENTICATION_BACKENDS``. Με αυτό τον τρόπο το Django θα χρησιμοποιήσει το ``ModelBackend`` ως fallback αν το ``REMOTE_USER`` δεν έχει οριστεί.
id: Waspada bahwa setelan khusus ini meniadakan pembuktian keaslian dengan awal ``ModelBackend``. Ini berarti bahwa jika nilai ``REMOTE_USER`` tidak disetel kemudian pengguna tidak dapat masuk, bahkan menggunakan antarmuka admin Django. Menambahkan ``'django.contrib.auth.backends.ModelBackend'`` pada daftar ``AUTHENTICATION_BACKENDS`` akan menggunakan ``ModelBackend`` sebagai alternatif jika ``REMOTE_USER`` tidak hadir, yang akan menyelesaikan masalah ini.

source: Django's user management, such as the views in ``contrib.admin`` and the :djadmin:`createsuperuser` management command, doesn't integrate with remote users. These interfaces work with users stored in the database regardless of ``AUTHENTICATION_BACKENDS``.
el: Η διαχείριση των χρηστών του Django, όπως τα views μέσα στο ``contrib.admin`` και η εντολή :djadmin:`createsuperuser`, δεν δουλεύουν με τους απομακρυσμένους χρήστες (remote users). Αυτά τα interfaces δουλεύουν με τους χρήστες οι οποίοι είναι αποθηκευμένοι στην βάση δεδομένων ανεξαρτήτως της ρύθμισης ``AUTHENTICATION_BACKENDS``.
id: Pengelola pengguna Django, seperti tampilan dalam perintah pengelola ``contrib.admin`` dan the :djadmin:`createsuperuser`, tidak dipadukan dengan pengguna kendali jauh. Antarmuka ini bekerja dengan pengguna disimpan dalam basisdata tanpa memperhatikan ``AUTHENTICATION_BACKENDS``.

source: Since the ``RemoteUserBackend`` inherits from ``ModelBackend``, you will still have all of the same permissions checking that is implemented in ``ModelBackend``.
el: Επειδή η κλάση ``RemoteUserBackend`` κληρονομεί από την ``ModelBackend``, θα έχετε στην διάθεση σας όλο το API, που είναι υλοποιημένο στο ``ModelBackend`` και αφορά τον έλεγχο δικαιωμάτων των χρηστών.
id: Sejak ``RemoteUserBackend`` warisan dari ``ModelBackend``, anda akan masih mempunyai semua pemeriksaan perizinan sama yang diterapkan dalam ``ModelBackend``.

source: If your authentication mechanism uses a custom HTTP header and not ``REMOTE_USER``, you can subclass ``RemoteUserMiddleware`` and set the ``header`` attribute to the desired ``request.META`` key. For example::
el: Οι χρήστες με το attribute :attr:`is_active=False <django.contrib.auth.models.User.is_active>` δεν θα τους επιτραπεί να πιστοποιηθούν. Για να το παρακάμψετε αυτό χρησιμοποιήστε την κλάση :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend`.
id: Jika mekanisme pembuktian keaslian anda menggunakan kepala HTTP penyesuaian dan bukan ``REMOTE_USER``, anda dapat men subkelas kan ``RemoteUserMiddleware`` dan menyetel atribut ``header`` ke kunci ``request.META`` yang diinginkan. Sebagai contoh::

source: Be very careful if using a ``RemoteUserMiddleware`` subclass with a custom HTTP header. You must be sure that your front-end web server always sets or strips that header based on the appropriate authentication checks, never permitting an end-user to submit a fake (or "spoofed") header value. Since the HTTP headers ``X-Auth-User`` and ``X-Auth_User`` (for example) both normalize to the ``HTTP_X_AUTH_USER`` key in ``request.META``, you must also check that your web server doesn't allow a spoofed header using underscores in place of dashes.
el: Να είστε εξαιρετικά προσεκτικοί όταν χρησιμοποιείτε κάποια subclass της ``RemoteUserMiddleware`` η οποία ορίζει δικό της HTTP header. Πρέπει να είστε σίγουροι ότι ο front-end web server ορίζει ή αφαιρεί πάντα αυτόν τον header βασιζόμενος στους κατάλληλους ελέγχους πιστοποίησης. Ποτέ να μην επιτρέπετε στον τελικό χρήστη να μπορεί να καταθέτει ψεύτικες (ή "πλαστογραφημένες") τιμές του header. Εφόσον οι HTTP headers, π.χ ``X-Auth-User`` και ``X-Auth_User`` ομαλοποιούνται και οι δύο στο κλειδί ``HTTP_X_AUTH_USER`` του ``request.META``, θα πρέπει, επίσης, να ελέγξετε ότι ο web server σας δεν επιτρέπει πλαστογραφημένους headers οι οποίοι χρησιμοποιούν κάτω παύλες (“_”) αντί σκέτων παυλών (“-”).
id: Sangat berhati-hatilah jika menggunakan subkelas ``RemoteUserMiddleware`` dengan kepala HTTP penyesuaian. Anda harus pastikan bahwa peladen jaringan paling depan anda selalu disetel atau memotong kepala itu berdasarkan pada pemeriksaan pembuktian keaslian yang sesuai, jangan pernah mengizinkan pengguna-akhir mengajukan nilai kepala tiruan (atau "palse"). Sejak kepala HTTP ``X-Auth-User`` dan ``X-Auth_User`` (sebagai contoh) keduanya menormalkan ke kunci ``HTTP_X_AUTH_USER`` dalam ``request.META``, anda harus juga memeriksa bahwa peladen jaringan anda tidak mengizinkan kepala palsu menggunakan garis bawah di tempat atau strip.

source: This warning doesn't apply to ``RemoteUserMiddleware`` in its default configuration with ``header = 'REMOTE_USER'``, since a key that doesn't start with ``HTTP_`` in ``request.META`` can only be set by your WSGI server, not directly from an HTTP request header.
el: Η παραπάνω προειδοποίηση δεν αφορά μόνο την κλάση ``RemoteUserMiddleware`` με τις προεπιλεγμένες της ρυθμίσεις (``header = 'REMOTE_USER'``), αφού ένα κλειδί που το όνομα του δεν ξεκινά με το ``HTTP_`` μέσα στο ``request.META``, μπορεί να οριστεί μόνο από τον WSGI server σας και όχι απ’ ευθείας από ένα HTTP request header.
id: Peringatan ini tidak berlaku pada ``RemoteUserMiddleware`` dalam konfigurasi awalnya dengan ``header = 'REMOTE_USER'``, sejak sebuah kunci tidak dimulai dengan ``HTTP_`` dalam ``request.META`` dapat hanya disetel dengan peladen WSGI anda, bukan secara langsung dari kepala meminta HTTP.

source: If you need more control, you can create your own authentication backend that inherits from :class:`~django.contrib.auth.backends.RemoteUserBackend` and override one or more of its attributes and methods.
el: Αν χρειάζεστε περισσότερο έλεγχο, μπορείτε να δημιουργήσετε το δικό σας backend πιστοποίησης ο οποίος θα κληρονομεί από την κλάση :class:`~django.contrib.auth.backends.RemoteUserBackend` και θα παρακάμπτει (override) ένα ή περισσότερα από τα attributes και τις μεθόδους της.
id: Jika anda butuh lebih kendali, anda dapat membuat backend pembuktian keaslian sendiri yang mewarisi dari :class:`~django.contrib.auth.backends.RemoteUserBackend` dan mengesampingkan satu atau lebih atribut dan caranya.

source: Using ``REMOTE_USER`` on login pages only
el: Χρήση του ``REMOTE_USER`` μόνο στις σελίδες login
id: Menggunakan ``REMOTE_USER`` hanya pada halaman masuk

source: The ``RemoteUserMiddleware`` authentication middleware assumes that the HTTP request header ``REMOTE_USER`` is present with all authenticated requests. That might be expected and practical when Basic HTTP Auth with ``htpasswd`` or other simple mechanisms are used, but with Negotiate (GSSAPI/Kerberos) or other resource intensive authentication methods, the authentication in the front-end HTTP server is usually only set up for one or a few login URLs, and after successful authentication, the application is supposed to maintain the authenticated session itself.
el: Η middleware πιστοποίησης ``RemoteUserMiddleware`` προϋποθέτει ότι ο HTTP request header ``REMOTE_USER`` υφίσταται με όλα τα πιστοποιημένα requests. Αυτό μπορεί να είναι πρακτικό και να λειτουργεί περίφημα όταν χρησιμοποιούνται απλοί μηχανισμοί HTTP πιστοποίησης όπως o ``htpasswd``, αλλά με άλλες μεθόδους ευαίσθητων πηγών όπως η Negotiate (GSSAPI/Kerberos), η πιστοποίηση στον front-end HTTP server συνήθως ρυθμίζεται για ένα ή για μερικά login URLs και κατόπιν επιτυχούς πιστοποίησης, η εφαρμογή υποτίθεται ότι διατηρεί το πιστοποιημένο session κατά τη διάρκεια της επικοινωνίας.
id: Pembuktian keaslian middleware ``RemoteUserMiddleware`` menganggap bahwa kepala permintaan HTTP ``REMOTE_USER`` mewakili dengan semua permintaan dibuktikan keaslian. Itu mungkin diharapkan dan secara praktiknya ketika Pembuktian Keaslian HTTP Dasar dengan ``htpasswd`` atau mekanisme sederhana lainnya digunakan, tetapi dengan Negotiate (GSSAPI/Kerberos) atau cara pembuktian keaslian intensif sumber daya lainnya, pembuktian keaslian dalam peladen HTTP depan biasanya hanya disetel untuk satu atau sedikit URL masuk, dan setelah berhasil dibuktikan keasliannya, aplikasi seharusnya menjaga sesi dibuktikan keasliannya sendiri.

source: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` provides support for this use case. It will maintain the authenticated session until explicit logout by the user. The class can be used as a drop-in replacement of :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` in the documentation above.
el: Η middleware κλάση :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` παρέχει υποστήριξη για αυτήν ακριβώς την περίπτωση. Θα διατηρήσει το πιστοποιημένο session μέχρις ότου ο χρήστης κάνει logout ο ίδιος. Η κλάση μπορεί να χρησιμοποιηθεί ως αντικατάσταση της :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` όπως αναφέρθηκε παραπάνω.
id: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` menyediakan dukungan untuk penggunaan kasus ini. Dia akan menjaga sesi dibuktikan keasliannya sampai keluar oleh pengguna. Kelas dapat digunakan sebagai pengganti dari :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` dalam dokumentasi diatas.

source: Writing a custom storage system
el: Γράφοντας ένα δικό σας σύστημα αποθήκευσης (storage system)
id: Menulis sistem penyimpanan disesuaikan

source: If you need to provide custom file storage -- a common example is storing files on some remote system -- you can do so by defining a custom storage class. You'll need to follow these steps:
el: Αν θέλετε να έχετε το δικό σας σύστημα αποθήκευσης αρχείων -- ένα συνηθισμένο παράδειγμα είναι η αποθήκευση αρχείων σε ένα απομακρυσμένο σύστημα -- μπορείτε να το κάνετε ορίζοντας μια δικιά σας κλάση αποθήκευσης (storage class). Θα χρειαστεί να ακολουθήσετε τα παρακάτω βήματα:
id: Jika anda butuh untuk menyediakan penyimpanan berkas disesuaikan -- contoh umum adalah menyimpan berkas di beberapa sistem terpencil -- anda dapat melakukannya dengan menentukan kelas penyimpanan disesuaikan. Anda akan butuh mengikuti langkah-langkah ini:

source: Your custom storage system must be a subclass of ``django.core.files.storage.Storage``::
el: Το δικό σας σύστημα αποθήκευσης θα πρέπει να είναι μια subclass της κλάσης ``django.core.files.storage.Storage``::
id: Sistem penyimpanan disesuaikan anda harus subkelas dari ``django.core.files.storage.Storage``::

source: Django must be able to instantiate your storage system without any arguments. This means that any settings should be taken from ``django.conf.settings``::
el: Το Django πρέπει να είναι σε θέση να αρχικοποιεί το δικό σας σύστημα αποθήκευσης χωρίς arguments. Αυτό σημαίνει ότι τυχόν ρυθμίσεις του δικού σας συστήματος θα πρέπει να λαμβάνονται από το γενικό αρχείο ρυθμίσεων ``django.conf.settings``::
id: Django harus dapat memberikan contoh sistem penyimanan disesuaikan anda tanpa argumen apapun. Ini berarti bahwa setiap pengaturan harus diambil dari ``django.conf.settings``::

source: Your storage class must implement the :meth:`_open()` and :meth:`_save()` methods, along with any other methods appropriate to your storage class. See below for more on these methods.
el: Η κλάση αποθήκευση σας πρέπει να υλοποιεί τις μεθόδους :meth:`_open()` και :meth:`_save()`, μαζί με οποιεσδήποτε άλλες, απαραίτητες για τις ανάγκες σας. Για περισσότερα σχετικά με αυτές τις μεθόδους, δείτε παρακάτω.
id: Kelas penyimpanan anda harus menerapkan cara :meth:`_open()` dan :meth:`_save()` , bersama dengan cara lainnya sesuai pada kelas penyimpanan anda. Lihat dibawah untuk lebih pada cara ini.

source: In addition, if your class provides local file storage, it must override the ``path()`` method.
el: Επιπροσθέτως, αν η κλάση σας παρέχει τη δυνατότητα τοπικής αποθήκευσης των αρχείων, θα πρέπει να παρακάμπτει (override) τη μέθοδο ``path()``.
id: Sebagai tambahan, jika kelas anda menyediakan penyimpanan berkas lokal, itu harus mengesampingkan cara ``path()``.

source: Your storage class must be :ref:`deconstructible <custom-deconstruct-method>` so it can be serialized when it's used on a field in a migration. As long as your field has arguments that are themselves :ref:`serializable <migration-serializing>`, you can use the ``django.utils.deconstruct.deconstructible`` class decorator for this (that's what Django uses on FileSystemStorage).
el: Η κλάση αποθήκευσης σας θα πρέπει να είναι :ref:`deconstructible <custom-deconstruct-method>` προκειμένου να γίνει serialized όταν χρησιμοποιείται πάνω σε ένα πεδίο μέσα σε κάποιο migration. Αν το πεδίο σας έχει arguments τα οποία είναι και αυτά :ref:`serializable <migration-serializing>`, μπορείτε να χρησιμοποιήσετε τον decorator ``django.utils.deconstruct.deconstructible`` (αυτό χρησιμοποιεί και το Django στο σύστημα αποθήκευσης FileSystemStorage).
id: Kelas penyimpanan anda harus :ref:`deconstructible <custom-deconstruct-method>` sehingga dia dapat di serialkan ketika digunakan pada bidang dalam sebuah perpindahan. Selama bidang anda mempunyai argumen yang mereka sendiri :ref:`serializable <migration-serializing>`, anda dapat menggunakan kelas decorator untuk ini (itu mengapa Django digunakan pada FileSystemStorage).

source: By default, the following methods raise `NotImplementedError` and will typically have to be overridden:
el: Από προεπιλογή, οι ακόλουθες μέθοδοι κάνουν raise το σφάλμα `NotImplementedError` που σημαίνει ότι πρέπει να γίνουν overridden:
id: Secara awal, cara ini menimbulkan `NotImplementedError` dan akan secara khusus harus dikesampingkan:

source: Note however that not all these methods are required and may be deliberately omitted. As it happens, it is possible to leave each method unimplemented and still have a working Storage.
el: Υπόψιν ότι δεν είναι απαραίτητο, όλες αυτές οι μέθοδοι, να υλοποιηθούν και μερικές μπορούν σκοπίμως να παραλειφθούν. Παραβλέποντας, λοιπόν, μερικές από αυτές το σύστημα αποθήκευσης σας θα μπορεί να λειτουργεί.
id: Catat bagaimanapun bahwa tidak semua cara ini dibutuhkan dan mungkin sengaja dihilangkan. Ketika itu terjadi, itu memungkinkan meninggalkan setiap cara tidak diterapkan dan masih dapat Penyimpanan bekerja.

source: By way of example, if listing the contents of certain storage backends turns out to be expensive, you might decide not to implement `Storage.listdir`.
el: Αν, για παράδειγμα η εμφάνιση των αρχείων υπό τη μορφή λίστας φαίνεται ακριβή, για το σύστημα, διαδικασία, μπορείτε να μην υλοποιήσετε τη μέθοδο `Storage.listdir`.
id: Sebagai contoh, jika daftar isi dari backend penyimpanan tertentu berubah menjadi mahal, anda mungkin memutuskan tidak menerapkan `Storage.listdir`.

source: Another example would be a backend that only handles writing to files. In this case, you would not need to implement any of the above methods.
el: Άλλο παράδειγμα είναι ένα άλλο σύστημα αποθήκευσης που μοναδικός του ρόλος είναι η εγγραφή σε αρχεία. Σε αυτή την περίπτωση δεν χρειάζεται να υλοποιήσετε καμία από τις παραπάνω μεθόδους.
id: Cara lain akan menjadi backend yang ahnya menangani penulisan ke berkas. Dalam kasus ini, anda tidak akan butuh menerapkan apapun cara diatas.

source: Ultimately, which of these methods are implemented is up to you. Leaving some methods unimplemented will result in a partial (possibly broken) interface.
el: Με άλλα λόγια, το ποιες μέθοδοι θα υλοποιηθούν εξαρτάται από σας και τις ανάγκες σας. Από την άλλη, αν μερικές δεν υλοποιηθούν θα καταλήξετε με ένα λειψό (πιθανόν χαλασμένο) interface.
id: Akhirnya, cara mana yang anda terapkan terserah anda. Meninggalkan beberapa cara tidak diterapkan akan menghasilkan antarmuka sebagian (kemungkinan rusak).

source: You'll also usually want to use hooks specifically designed for custom storage objects. These are:
el: Επίσης, ίσως να θέλατε να χρησιμοποιήσετε κάποια hooks τα οποία έχουν σχεδιαστεί για παραμετροποιήσιμα συστήματα αποθήκευσης. Αυτά είναι:
id: Anda akan juga ingin menggunakan penghubung khususnya dirancang untuk obyek penyimpanan disesuaikan. Ini adalah:

source: **Required**.
el: Υποχρεωτικό
id: **Wajib**.

source: Called by ``Storage.open()``, this is the actual mechanism the storage class uses to open the file. This must return a ``File`` object, though in most cases, you'll want to return some subclass here that implements logic specific to the backend storage system.
el: Η μέθοδος αυτή καλείται από την ``Storage.open()``. Αυτός είναι ο ουσιαστικός μηχανισμός της κλάσης αποθήκευσης για να ανοίξει ένα αρχείο. Πρέπει να επιστρέφει ένα ``File`` object, αλλά στις περισσότερες περιπτώσεις, θα θέλατε να επιστρέφει κάποια subclass η οποία θα υλοποιεί τη λογική που βασίζεται πάνω στο σύστημα αποθήκευσης.
id: Dipanggil oleh ``Storage.open()``, ini adalah mekanisme sesungguhnya kelas penyimpanan digunakan untuk membuka berkas. Ini harus mengembalikan sebuah obyek ``File``, meskipun dalam kebanyakan kasus, anda ingin mengembalikan beberapa subkelas disini yang menerapkan logika spesifik ke sistem penyimpanan belakang.

source: Called by ``Storage.save()``. The ``name`` will already have gone through ``get_valid_name()`` and ``get_available_name()``, and the ``content`` will be a ``File`` object itself.
el: Η μέθοδος αυτή καλείται από την ``Storage.save()``. Το όρισμα ``name`` θα έχει περάσει ήδη από την μέθοδο ``get_valid_name()`` και ``get_available_name()`` και το όρισμα ``content`` θα είναι ένα ``File`` object.
id: Dipanggil oleh ``Storage.save()``, ``name`` sudah telah melalui ``get_valid_name()`` dan ``get_available_name()``, dan ``content`` akan menjadi obyek ``File`` itu sendiri.
