Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: Any website which allows users to log in should enforce site-wide HTTPS to avoid transmitting access tokens in clear. In Django, access tokens include the login/password, the session cookie, and password reset tokens. (You can't do much to protect password reset tokens if you're sending them by email.)
el: Κάθε website το οποίο επιτρέπει σε χρήστες να κάνουν log in, θα πρέπει να χρησιμοποιούν HTTPS πρόσβαση για την αποφυγή της εκπομπής των διακριτικών πρόσβασης χωρίς κρυπτογράφηση. Στο Django, τα διακριτικά πρόσβασης περιλαμβάνουν τα login/password, το session cookie και τα password reset tokens. (Δεν μπορείτε να κάνετε και πολλά για να προστατέψετε τα password reset tokens αν τα στέλνετε με email.)
id: Jaringan situs apapun yang mengizinkan pengguna untuk masuh harus melaksanakan lebar-situs HTTPS untuk menghindari token transmisi akses jelas. Di Django, token akses menyertakan masuk/sandi, sesi kue, dan setel kembali sandi token. (Anda tidak dapat melakukan banyak untuk melindungi sandi setel kembali token jika anda mengirim mereka dengan email.)

source: Protecting sensitive areas such as the user account or the admin isn't sufficient, because the same session cookie is used for HTTP and HTTPS. Your web server must redirect all HTTP traffic to HTTPS, and only transmit HTTPS requests to Django.
el: Η προστασία των ευαίσθητων τομέων όπως ο λογαριασμός του χρήστη ή του admin δεν είναι αρκετή, επειδή το ίδιο το session cookie χρησιμοποιείται για το HTTP και το HTTPS. Ο Web server σας θα πρέπει αν ανακατευθύνει όλη την HTTP κίνηση στην HTTPS και να εκπέμπει μόνο HTTPS requests στο Django.
id: Melindungi kawasan sensitif seperti akun pengguna atau admin tidak cukuo, karena sesi kue sama digunakan untuk HTTP dan HTTPS. Peladen jaringan anda ahrus mengalihkan semua lalu lintas HTTP ke HTTPS, dan hanya mengirimkan permintaan HTTPS ke Django.

source: Once you've set up HTTPS, enable the following settings.
el: Όταν ρυθμίσετε το HTTPS, ενεργοποιήστε τις ακόλουθες ρυθμίσεις.
id: Sekali anda telah menyetel HTTPS, adakan pengaturan berikut.

source: Set this to ``True`` to avoid transmitting the CSRF cookie over HTTP accidentally.
el: Θέστε το σε ``True`` για να αποφύγετε την ακούσια εκπομπή του CSRF cookie μέσω HTTP.
id: Setel ini menjadi ``True`` untuk menghindari mengirimkan kue CSRF melalui HTTP dengan tidak sengaja.

source: Set this to ``True`` to avoid transmitting the session cookie over HTTP accidentally.
el: Θέστε το σε ``True`` για να αποφύγετε την ακούσια εκπομπή του session cookie μέσω HTTP.
id: Ubah jadi ``True`` untuk menghindari pengiriman cookie sesi melalui HTTP secara tidak sengaja.

source: Performance optimizations
el: Βελτιστοποιήσεις απόδοσης
id: Optimalisasi penampilan

source: Setting :setting:`DEBUG = False <DEBUG>` disables several features that are only useful in development. In addition, you can tune the following settings.
el: Θέτοντας το :setting:`DEBUG = False <DEBUG>` απενεργοποιεί πολλά χαρακτηριστικά τα οποία είναι χρήσιμα μόνο στο development. Επιπροσθέτως, μπορείτε να φέρετε στα μέτρα σας τις ακόλουθες ρυθμίσεις.
id: Pengaturan :setting:`DEBUG = False <DEBUG>` meniadakan beberapa fitur yang hanya berguna dalam pengembangan. Dalam tambahan, anda dapat menyesuaikan pengaturan berikut.

source: Enabling :ref:`persistent database connections <persistent-database-connections>` can result in a nice speed-up when connecting to the database accounts for a significant part of the request processing time.
el: Ενεργοποιώντας τις :ref:`μόνιμες συνδέσεις στη βάση δεδομένων <persistent-database-connections>` θα έχετε, ως αποτέλεσμα, περισσότερη ταχύτητα όταν συνδέεστε στη βάση δεδομένων σας για πολλαπλά request. Με άλλα λόγια, δεν θέλετε να περιλαμβάνεται το ovehead για την εγκαθίδρυση νέας σύνδεσης στη βάση για κάθε νέο request.
id: Mengadakan :ref:`persistent database connections <persistent-database-connections>` dapat menghasilkan sebuah kecepatan bagus ketika berhubung ke akun basisdata untuk bagian khusus dari waktu pengolahan permintaan.

source: This helps a lot on virtualized hosts with limited network performance.
el: Αυτό βοηθάει πολύ σε virtualized hosts με περιορισμένη απόδοση του δικτύου.
id: Ini membantu banyak pada rumah virtual dengan penampilan jaringan terbatas.

source: Enabling the cached template loader often improves performance drastically, as it avoids compiling each template every time it needs to be rendered. See the :ref:`template loaders docs <template-loaders>` for more information.
el: Ενεργοποιώντας τον cached template loader, συχνά βελτιώνει δραστικά την απόδοση, αφού αποφεύγει το compiling κάθε template κάθε φορά που χρειάζεται να γίνει rendered. Δείτε στο άρθρο :ref:`template loaders <template-loaders>` για περισσότερες πληροφορίες.
id: Mengadakan pemuat cetakan tembolok sering memperbaiki penampilan secaradrastis, seperti dia menghindari menyusun setiap cetakan setiap kali dia dibutuhkan untuk dibangun. Lihat :ref:`template loaders docs <template-loaders>` untuk informasi lebih.

source: Error reporting
el: Αναφορά σφαλμάτων
id: Pelaporan kesalahan

source: By the time you push your code to production, it's hopefully robust, but you can't rule out unexpected errors. Thankfully, Django can capture errors and notify you accordingly.
el: Όταν ανεβάσετε το site σας για το ευρύ κοινό, θα είναι πιθανόν σταθερό και πλήρως λειτουργικό, αλλά αυτό δε σημαίνει ότι έχετε υπολογίσει κάθε σφάλμα που μπορεί να προκύψει. Ευτυχώς, το Django μπορεί να αιχμαλωτίσει τα σφάλματα και να σας ειδοποιήσει καταλλήλως.
id: Seiring waktu anda mendorong kode anda ke produksi, semoga kuat, tetapi anda tidak dapat mengesampingkan kesalahan-kesalahan tidak diharapkan. Terima kasih, Django dapat menangkap kesalahan-kesalahan dan membuertahu anda yang sesuai.

source: Review your logging configuration before putting your website in production, and check that it works as expected as soon as you have received some traffic.
el: Επανεξετάστε τις ρυθμίσεις του logging σας πριν ανεβάσετε το website σας και ελέγξτε ότι δουλεύει πλήρως, μόλις αποκτήσετε κάποια κίνηση.
id: Pratinjau konfigurasi pencatatan anda sebelum menaruh situs jaringan anda dalam produksi, dan periksa bahwa dia bekerja seauai harapan setelah anda menerima beberapa lalu lintas.

source: See :doc:`/topics/logging` for details on logging.
el: Δείτε στο άρθρο :doc:`/topics/logging` για περισσότερες πληροφορίες σχετικά με το logging.
id: Lihat :doc:`/topics/logging` untuk rincian pada tempuhan.

source: :setting:`ADMINS` and :setting:`MANAGERS`
el: :setting:`ADMINS` και :setting:`MANAGERS`
id: :setting:`ADMINS` dan :setting:`MANAGERS`

source: :setting:`ADMINS` will be notified of 500 errors by email.
el: Οι :setting:`ADMINS` θα ειδοποιηθούν για σφάλματα τύπου 500 μέσω email.
id: :setting:`ADMINS` akan diberitahu dari 500 kesalahan oleh email.

source: :setting:`MANAGERS` will be notified of 404 errors. :setting:`IGNORABLE_404_URLS` can help filter out spurious reports.
el: Οι :setting:`MANAGERS` θα ειδοποιηθούν για σφάλματα τύπου 404. Η ρύθμιση :setting:`IGNORABLE_404_URLS` μπορεί να σας βοηθήσει να φιλτράρετε τυχόν ψεύτικες αναφορές. Δείτε στο άρθρο :doc:`αναφορές σφαλμάτων </howto/error-reporting>` για λεπτομέρειες σχετικά με αναφορές σφαλμάτων μέσω email.
id: :setting:`MANAGERS` akan diberitahu kesalahan 404. :setting:`IGNORABLE_404_URLS` dapat membantu saringan laporan palsu.

source: See :doc:`/howto/error-reporting` for details on error reporting by email.
el: Δείτε στο άρθρο :doc:`αναφορές σφαλμάτων </howto/error-reporting>` για λεπτομέρειες σχετικά με αναφορές σφαλμάτων μέσω email.
id: Lihat :doc:`/howto/error-reporting` untuk rincian di pelaporan kesalahan oleh email.

source: Error reporting by email doesn't scale very well
el: Οι αναφορές σφαλμάτων μέσω email δεν κλιμακώνονται πολύ καλά
id: Pelaporan error melalui email tidak dapat dikembangkan pada skala lebih lebih besar dengan baik

source: Consider using an error monitoring system such as Sentry_ before your inbox is flooded by reports. Sentry can also aggregate logs.
el: Σκεφτείτε να χρησιμοποιήσετε ένα σύστημα παρακολούθησης όπως το Sentry_ πριν τα εισερχόμενα σας ξεχειλίσουν από αναφορές. Το Sentry μπορεί επίσης να ομαδοποιήσει τα logs.
id: Pertimbangkan menggunakan sistem pengamatan kesalahan seperti Sentry_ sebelum kotak masuk anda dibanjiri oleh laporan. Sentry dapat juga mengumpulkan catatan.

source: Customize the default error views
el: Παραμετροποιώντας τα προεπιλεγμένα views σφαλμάτων
id: Sesuaikan tampilan kesalahan awal

source: Django includes default views and templates for several HTTP error codes. You may want to override the default templates by creating the following templates in your root template directory: ``404.html``, ``500.html``, ``403.html``, and ``400.html``. The default views should suffice for 99% of Web applications, but if you desire to customize them, see these instructions which also contain details about the default templates:
el: Το Django περιλαμβάνει μερικά προεπιλεγμένα views και templates για διάφορους HTTP κωδικούς σφαλμάτων. Αυτά τα templates ίσως να μην αντιπροσωπεύουν πλήρως την αίσθηση και την εμφάνιση με το υπόλοιπο site σας, οπότε ίσως να θέλετε να τα αλλάξετε. Μπορείτε, βεβαίως, παρακάμπτοντας τα προεπιλεγμένα templates και δημιουργώντας δικά σας μέσα στον πηγαίο φάκελο που κρατάτε τα templates σας: ``404.html``, ``500.html``, ``403.html`` και ``400.html``. Τα προεπιλεγμένα views αρκούν για το 99% των Web εφαρμογών, αλλά αν θέλετε να τα παραμετροποιήσετε, δείτε αυτές τις οδηγίες οι οποίες περιλαμβάνουν, επίσης, λεπτομέρειες σχετικά με τα προεπιλεγμένα templates:
id: Django menyertakan tampilan dan cetakan awal untuk beberapa kode kesalahan HTTP. Anda mungkin ingin mengesampingkan cetakan awal dengan membuat cetakam berikut di direktori cetakan akar anda: ``404.html``, ``500.html``, ``403.html``, dan ``400.html``. Tampilan awal harus mencukupi untuk 99% dari aplikasi Jaringan, tetapi jika anda menginginkan menyesuaikan mereka, lihat perintah ini yang juga mengandung rincian tentang cetakan awal:

source: Python Options
el: Επιλογές Python
id: Pilihan Phyton

source: It's strongly recommended that you invoke the Python process running your Django application using the `-R`_ option or with the :envvar:`PYTHONHASHSEED` environment variable set to ``random``. This option is enabled by default starting with Python 3.3.
el: Προτείνεται να ενεργοποιείτε την Python process η οποία τρέχει την Django εφαρμογή σας, χρησιμοποιώντας την επιλογή `-R`_ ή με την environment variable :envvar:`PYTHONHASHSEED` της οποίας η τιμή θα είναι ``random``. Αυτή η επιλογή είναι ενεργοποιημένη, από προεπιλογή, στην Python 3.3.
id: Sangat kuta dianjurkan bahwa anda meminta pengolahan Python menjalankan aplikasi Django anda menggunakan pilihan `-R`_ atau dengan lingkungan :envvar:`PYTHONHASHSEED` variabel disetel ke ``random``. Pilihan ini diadakan secara awal mulai dengan Python 3.3.

source: These options help protect your site from denial-of-service (DoS) attacks triggered by carefully crafted inputs. Such an attack can drastically increase CPU usage by causing worst-case performance when creating ``dict`` instances. See `oCERT advisory #2011-003 <http://www.ocert.org/advisories/ocert-2011-003.html>`_ for more information.
el: Αυτές οι επιλογές, σας βοηθούν να προστατέψετε το site σας από denial-of-service (DoS) επιθέσεις οι οποίες ενεργοποιούνται από προσεκτικά δημιουργημένα inputs. Αυτού του είδους η επίθεση μπορεί να αυξήσει σημαντικά την χρήση της CPU προκαλώντας πτώση της απόδοσης όταν δημιουργείτε ``dict`` instances. Δείτε στο `oCERT advisory #2011-003 <http://www.ocert.org/advisories/ocert-2011-003.html>`_ για περισσότερες πληροφορίες.
id: Pilihan ini membantu melindungi situs anda dari serangan denial-of-service (DoS) dipicu oleh masukan dibuat. Sebuah serangan dapat secara drastis meningkatkan penggunaan CPU dengan menyebabkan penampilan kasus-buruk ketika membuat instance ``dict``. Lihat `oCERT advisory #2011-003 <http://www.ocert.org/advisories/ocert-2011-003.html>`_ untuk informasi lebih.

source: Deploying Django
el: Ανεβάζοντας το Django site σας για το ευρύ κοινό (deploying)
id: Menyebarkan Django

source: Django's chock-full of shortcuts to make Web developer's lives easier, but all those tools are of no use if you can't easily deploy your sites. Since Django's inception, ease of deployment has been a major goal.
el: Το Django είναι γεμάτο συντομεύσεις για να κάνει τη ζωή των Web developers ευκολότερη, αλλά όλα αυτά τα εργαλεία είναι άχρηστα αν δεν μπορείτε να ανεβάσετε εύκολα τα sites σας στο internet (deployment). Από την αρχή που ξεκίνησε το Django, η ευκολία του deployment υπήρξε πάντα ένας σημαντικός στόχος.
id: Sokongan penuh Django dari jalan pintas untuk membuat hidup pengembang Jaringan lebih mudah, tetapi semua alat-alat tersebut tidak berguna jika anda tidak dapat dengan mudah menyebarkan situs anda. Sejak lahirnya Django, pengembangan mudah telah menjadi sasaran utama.

source: If you're new to deploying Django and/or Python, we'd recommend you try :doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>` first. In most cases it'll be the easiest, fastest, and most stable deployment choice.
el: Αν είστε νέος σχετικά με το deployment στο Django και/η της Python, προτείνουμε να δοκιμάστε πρώτα το :doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>`. Στις περισσότερες περιπτώσεις θα είναι η ευκολότερη, γρηγορότερη και η περισσότερο σταθερή deployment επιλογή.
id: Jika anda baru untuk menyebarkan Django dan/atau Phyton, kami menganjurkan anda mencoba :doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>` dahulu. Dalam kebanyakan kasus itu akan paling mudah, paling cepat dan pilihan penyebaran paling stabil.

source: Authenticating against Django's user database from Apache
el: Πιστοποίηση της βάσης δεδομένων ενός Django χρήστη μέσω Apache
id: Pembuktian keaslian terhadap pengguna basisdata Django dari Apache

source: Since keeping multiple authentication databases in sync is a common problem when dealing with Apache, you can configure Apache to authenticate against Django's :doc:`authentication system </topics/auth/index>` directly. This requires Apache version >= 2.2 and mod_wsgi >= 2.0. For example, you could:
el: Επειδή το να συγχρονίζετε πολλές πιστοποιημένες βάσεις δεδομένων είναι κοινό πρόβλημα, μπορείτε να παραμετροποιήσετε τον Apache ούτως ώστε να πιστοποιήσει εκείνος απ’ ευθείας το :doc:`σύστημα πιστοποίησης </topics/auth/index>` του Django. Αυτό απαιτεί έκδοση του Apache >= 2.2 και mod_wsgi >= 2.0. Για παράδειγμα, θα μπορούσατε να:
id: Sejak menjaga banyak pembuktian keaslian basisdata di sinkronasi adalah masalah utama ketika berhadapan dengan Apache, anda dapat mengkonfigurasi Apache untuk membuktikan keaslian terhadap :doc:`sistem pembuktian keaslian </topics/auth/index>` Django secara langsung. Ini membutuhkan Apache versi >= 2.2 dan mod_wsgi >= 2.0. Sebagai contoh, anda dapat:

source: Serve static/media files directly from Apache only to authenticated users.
el: Εξυπηρετήσετε τα static/media αρχεία απ’ ευθείας από τον Apache, μόνο σε πιστοποιημένους χρήστες.
id: Melayani berkas statis/media secara langsung dari Apache hanya untuk membuktikan keaslian pengguna.

source: Authenticate access to a Subversion_ repository against Django users with a certain permission.
el: Πιστοποιήσετε την πρόσβαση σε ένα Subversion_ repository για χρήστες του Django με συγκεκριμένα δικαιώματα.
id: Akses pembuktian keaslian pada sebuah gudang Subversion_ terhadap pengguna Django dengan perizinan tertentu.

source: Allow certain users to connect to a WebDAV share created with mod_dav_.
el: Επιτρέπετε σε συγκεκριμένους χρήστες να συνδεθούν σε ένα κοινόχρηστο WebDAV με το mod_dav_.
id: Mengizinkan pengguna tertentu untuk terhubung ke berbagi WebDAV dibuat dengan mod_dav_.

source: If you have installed a :ref:`custom User model <auth-custom-user>` and want to use this default auth handler, it must support an ``is_active`` attribute. If you want to use group based authorization, your custom user must have a relation named 'groups', referring to a related object that has a 'name' field. You can also specify your own custom mod_wsgi auth handler if your custom cannot conform to these requirements.
el: Αν έχετε εγκαταστήσει ένα :ref:`δικό σας μοντέλο Χρήστη <auth-custom-user>` και θέλετε να χρησιμοποιήσετε αυτόν τον προεπιλεγμένο διαχειριστή πιστοποίησης, τότε το δικό σας μοντέλο χρήστη θα πρέπει να υποστηρίζει το attribute ``is_active``. Αν θέλετε να χρησιμοποιήσετε πιστοποίηση η οποία βασίζεται σε ομάδα (group), το δικό σας μοντέλο χρήστη θα πρέπει να έχει μια συσχέτιση με το όνομα 'groups', που θα αναφέρεται σε ένα συσχετισμένο object που θα έχει το πεδίο 'name'. Μπορείτε, επίσης, να προσδιορίσετε το δικό σας mod_wsgi διαχειριστή πιστοποίησης, αν το δικό σας μοντέλο χρήστη δεν μπορεί να ανταποκριθεί στις παραπάνω απαιτήσεις.
id: Jika anda telah memasang sebuah :ref:`custom User model <auth-custom-user>` dan ingin menggunakan penangan pembuktian keaslian awal ini, itu harus mendukung sebuah atribut ``is_active``. Jika anda ingin menggunakan kelompok berdasarkan pembuktian keaslian, pengguna disesuaikan anda harus mempunyai hubungan dinamai 'groups', mengacu pada obyek terhubung yang mempunyai bidang 'name'. Anda dapat juga menentukan penangan pembuktian keaslian mod_wsgi disesuaikan jika sistem anda tidak dapat sesuai ke persyaratan ini.

source: Authentication with ``mod_wsgi``
el: Πιστοποίηση με το ``mod_wsgi``
id: Pembuktian keaslian dengan ``mod_wsgi``

source: The use of ``WSGIApplicationGroup %{GLOBAL}`` in the configurations below presumes that your Apache instance is running only one Django application. If you are running more than one Django application, please refer to the `Defining Application Groups`_ section of the mod_wsgi docs for more information about this setting.
el: Η χρήση του ``WSGIApplicationGroup %{GLOBAL}`` στις παραμετροποιήσεις παρακάτω, προϋποθέτει ότι το δικό σας instance του Apache τρέχει μόνο μια Django εφαρμογή. Αν τρέχετε παραπάνω από μια Django εφαρμογές, παρακαλούμε ανατρέξτε στην ενότητα `Defining Application Groups`_ του εγχειριδίου του mod_wsgi για περισσότερες πληροφορίες σχετικά με αυτή τη ρύθμιση.
id: Penggunaan dari ``WSGIApplicationGroup %{GLOBAL}`` di konfigurasi dibawah menganggap bahwa instance Apache anda sedang menjalankan hanya satu alikasi Django. Jika anda sedang menjalankan lebih dati satu aplikasi Django, silahkan mengacu pada bagian `Menentukan Aplikasi Kelompok`_ dari dokumen mod_wsgi untuk informasi lebih tentang pengaturan ini.

source: Make sure that mod_wsgi is installed and activated and that you have followed the steps to setup :doc:`Apache with mod_wsgi </howto/deployment/wsgi/modwsgi>`.
el: Σιγουρευτείτε ότι το mod_wsgi είναι εγκατεστημένο, ενεργοποιημένο και έχετε ακολουθήσει τα βήματα για να εγκαταστήσετε το :doc:`Apache με το mod_wsgi </howto/deployment/wsgi/modwsgi>`.
id: Pastikan bahwa mod_wsgi telah dipasang dan diaktivasi dan bahwa anda telah mengikuti langkah-langkah untuk mengatur :doc:`Apache dengan mod_wsgi </howto/deployment/wsgi/modwsgi>`.

source: Next, edit your Apache configuration to add a location that you want only authenticated users to be able to view:
el: Επόμενο βήμα είναι να επεξεργαστείτε τον Apache server σας για να προσθέσετε μια τοποθεσία (location) όπου μόνο οι πιστοποιημένοι χρήστες θα μπορούν να βλέπουν:
id: Selanjutnya, sunting konfigurasi Apache anda untuk menambahkan tempat yang anda ingin dibuktikan keaslian pengguna untuk dapat melihat:

source: The ``WSGIAuthUserScript`` directive tells mod_wsgi to execute the ``check_password`` function in specified wsgi script, passing the user name and password that it receives from the prompt. In this example, the ``WSGIAuthUserScript`` is the same as the ``WSGIScriptAlias`` that defines your application :doc:`that is created by django-admin startproject </howto/deployment/wsgi/index>`.
el: Το directive ``WSGIAuthUserScript`` λέει στο mod_wsgi να εκτελέσει τη συνάρτηση ``check_password`` στο προσδιορισμένο wsgi script, περνώντας το user name και το password το οποίο λαμβάνει από την είσοδο (πχ κονσόλα). Σε αυτό το παράδειγμα, το ``WSGIAuthUserScript`` είναι το ίδιο με το ``WSGIScriptAlias`` που ορίζει την εφαρμογή σας :doc:`η οποία δημιουργήθηκε με την εντολή django-admin startproject </howto/deployment/wsgi/index>`.
id: ``WSGIAuthUserScript`` yang memerintahkan memberitahu mod_wsgi untuk menjalankan fungsi ``check_password`` di tulisan wsgi yang lebih khusus, melewati nama pengguna dan sandi yang dia menerimanya dari prompt. Di contoh ini, ``WSGIAuthUserScript`` adalah sama seperti ``WSGIScriptAlias`` yang menentukan aplikasi anda :doc:`yang dibuat oleh django-admin startproject </howto/deployment/wsgi/index>`.

source: Using Apache 2.2 with authentication
el: Χρησιμοποιώντας τον Apache 2.2 με πιστοποίηση
id: Menggunakan Apache 2.2 dengan pembuktian keaslian

source: Make sure that ``mod_auth_basic`` and ``mod_authz_user`` are loaded.
el: Σιγουρευτείτε ότι τα modules ``mod_auth_basic`` και ``mod_authz_user`` είναι φορτωμένα.
id: Pastikan bahwa ``mod_auth_basic`` and ``mod_authz_user`` dimuat.

source: These might be compiled statically into Apache, or you might need to use LoadModule to load them dynamically in your ``httpd.conf``:
el: Αυτά τα modules θα μπορούσαν να συγκεντρωθούν στατικά μέσα στον Apache ή θα μπορούσατε να χρησιμοποιήσετε το LoadModule για να τα φορτώσετε δυναμικά μέσα στο αρχείο ``httpd.conf``:
id: Ini mungkin disusun secara tetap kedalam Apache, atau anda mungkin butuh menggunakan LoadModule untuk memuat mereka secara dinamis dalam ``httpd.conf`` anda:

source: Finally, edit your WSGI script ``mysite.wsgi`` to tie Apache's authentication to your site's authentication mechanisms by importing the ``check_password`` function::
el: Τέλος, επεξεργαστείτε το WSGI script σας ``mysite.wsgi`` για να συνδέσετε την πιστοποίηση του Apache με τους μηχανισμούς πιστοποίησης του site σας, κάνοντας importing τη συνάρτηση ``check_password``::
id: Akhirnya sunting tulisan WSGI anda ``mysite.wsgi`` ke pembuktian keaslian Apache ke mekanisme pembuktian keaslian situs anda dengan mengimpor fungsi ``check_password``::

source: Requests beginning with ``/secret/`` will now require a user to authenticate.
el: Πλέον, τα requests που θα αρχίζουν με ``/secret/`` θα απαιτούν πιστοποίηση από τον χρήστη.
id: Permintaan dimulai dengan ``/secret/`` akan sekarang membutuhkan pengguna untuk dibuktikan keasliannya.

source: The mod_wsgi `access control mechanisms documentation`_ provides additional details and information about alternative methods of authentication.
el: Το mod_wsgi `access control mechanisms documentation`_ παρέχει επιπρόσθετες λεπτομέρειες και πληροφορίες σχετικά με εναλλακτικές μεθόδους πιστοποίησης.
id: mod_wsgi `dokumentasi mekanisme kendali akses`_ menyediakan tambahan rincian dan informasi tentang cara lain dari pembuktian keaslian.

source: Authorization with ``mod_wsgi`` and Django groups
el: Πιστοποίηση με το ``mod_wsgi`` και τις ομάδες του Django
id: Otorisasi dengan ``mod_wsgi`` dan kelompok Django

source: mod_wsgi also provides functionality to restrict a particular location to members of a group.
el: Το mod_wsgi προσφέρει, επίσης, τη δυνατότητα να απαγορεύει την είσοδο σε μια συγκεκριμένη τοποθεσία για κάποια μέλη μιας ομάδας.
id: mod_wsgi juga menyediakan fungsi untuk membatasi sebagian tempat untuk anggota kelompok.

source: In this case, the Apache configuration should look like this:
el: Σε αυτή την περίπτωση, ο Apache server σας θα πρέπει να δείχνει κάπως έτσι:
id: Dalam kasus ini, konfigurasi Apache harus kelihatan seperti ini:
