Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: However, running with :setting:`DEBUG` set to ``False`` means you'll never see errors generated by your site -- everyone will just see your public error pages. You need to keep track of errors that occur in deployed sites, so Django can be configured to create reports with details about those errors.
el: Ωστόσο, αν η επιλογή :setting:`DEBUG` είναι ``False`` τότε δεν θα μπορέσετε ποτέ να δείτε τυχόν σφάλματα της σελίδας σας -- όλοι, ακόμη και εσείς οι ίδιοι, θα βλέπουν τις δημόσιες σελίδες σφαλμάτων (πχ internal server error 500, page not found 404 κλπ). Θα χρειαστεί, λοιπόν, να παρακολουθείτε τα σφάλματα τα οποία προκύπτουν στις σελίδες που είναι στον αέρα, ούτως ώστε το Django να μπορεί να παραμετροποιηθεί για να δημιουργεί λεπτομερείς αναφορές σφαλμάτων.
id: Bagaimanapun, menjalankan dengan :setting:`DEBUG` disetel ke ``False`` berarti anda akan tidak pernah melihat kesalahan dibangkitkan oleh situs anda -- semua orang akan hanya melihat halaman-halaman kesalahan umum anda. Anda butuh menjaga jalur kesalahan-kesalahan yang muncul dalam situs yang disebar, sehingga Django dapat dikonfigurasikan untuk membuat laporan dengan rincian tentang kesalahan-kesalahan tersebut.

source: Email reports
el: Αναφορές email
id: Email laporan

source: Server errors
el: Σφάλματα server
id: Kesalahan peladen

source: When :setting:`DEBUG` is ``False``, Django will email the users listed in the :setting:`ADMINS` setting whenever your code raises an unhandled exception and results in an internal server error (HTTP status code 500). This gives the administrators immediate notification of any errors. The :setting:`ADMINS` will get a description of the error, a complete Python traceback, and details about the HTTP request that caused the error.
el: Όταν η ρύθμιση :setting:`DEBUG` είναι ``False``, το Django θα στείλει email στους χρήστες που βρίσκονται στη λίστα της ρύθμισης :setting:`ADMINS`, οποτεδήποτε ο κώδικας σας κάνει raise κάποιο unhandled exception και έχει ως αποτέλεσμα ένα εσωτερικό σφάλμα server (HTTP status code 500). Αυτό δίνει στους διαχειριστές (administrators) μια άμεση ειδοποίηση σχετικά με τυχόν σφάλματα. Η επιλογή :setting:`ADMINS` θα λάβει μια περιγραφή του σφάλματος, ένα πλήρες Python traceback και λεπτομέρειες σχετικά με το HTTP request το οποίο προκάλεσε το σφάλμα.
id: Ketika :setting:`DEBUG` adalah ``False``, Django akan mensurelkan pengguna terdaftar dalam pengaturan :setting:`ADMINS` kapanpun kode anda memunculkan pengecualian yang tidak ditangani dan menghasilkan dalam kesalahan peladen dalam (kode status HTTP 500). Ini memberikan administrator pemberitahuan segera dari pelacakan kebelakang apapun, dan rincian tentang permintaan HTTP yang menyebabkan kesalahan.

source: In order to send email, Django requires a few settings telling it how to connect to your mail server. At the very least, you'll need to specify :setting:`EMAIL_HOST` and possibly :setting:`EMAIL_HOST_USER` and :setting:`EMAIL_HOST_PASSWORD`, though other settings may be also required depending on your mail server's configuration. Consult :doc:`the Django settings documentation </ref/settings>` for a full list of email-related settings.
el: Για να σταλεί το email, το Django απαιτεί μερικές ρυθμίσεις συνδεσιμότητας με τον δικό σας mail server. Θα πρέπει, τουλάχιστον, να προσδιορίσετε την επιλογή :setting:`EMAIL_HOST` και πιθανόν την :setting:`EMAIL_HOST_USER` και :setting:`EMAIL_HOST_PASSWORD`. Ωστόσο, ίσως χρειαστεί να προσδιορίσετε και άλλες επιλογές ανάλογα την παραμετροποίηση του mail server σας. Συμβουλευτείτε το :doc:`εγχειρίδιο γενικών ρυθμίσεων του Django </ref/settings>` για μια πλήρη λίστα σχετικά με τις ρυθμίσεις του email.
id: Agar mengirim surel, Django membutuhkan beberapa pengaturan mengatakannya bagaimana terhubung ke peladen surat anda. Setidaknya, anda akan butuh menentukan :setting:`EMAIL_HOST` dan kemungkinan :setting:`EMAIL_HOST_USER` dan :setting:`EMAIL_HOST_PASSWORD`, meskipun pengaturan lainnya mungkin tidak juga dibutuhkan tergantung pada konfigurasi peladen surat anda. Rundingkan :doc:`the Django settings documentation </ref/settings>` untuk daftar penuh dari pengaturan terkait-email.

source: By default, Django will send email from root@localhost. However, some mail providers reject all email from this address. To use a different sender address, modify the :setting:`SERVER_EMAIL` setting.
el: Από προεπιλογή, το Django θα στείλει email από τη διεύθυνση root@localhost. Ωστόσο, κάποιοι πάροχοι ηλεκτρονικού ταχυδρομείου θα απορρίψουν όλα τα emails από αυτή τη διεύθυνση. Για να χρησιμοποιήσετε μια διαφορετική διεύθυνση αποστολέα, αλλάξτε τη ρύθμιση :setting:`SERVER_EMAIL`.
id: Secara awal, Django akan mengirim surel dari root@localhost. Bagaimanapun, beberapa penyedia surat menolak semua surel dari alamat ini. Untuk menggunakan alamat pengirim berbeda, rubah pengaturan :setting:`SERVER_EMAIL`.

source: To activate this behavior, put the email addresses of the recipients in the :setting:`ADMINS` setting.
el: Για να ενεργοποιήσετε αυτή τη συμπεριφορά, εισάγετε τις διευθύνσεις email των παραληπτών μέσα στη ρύθμιση :setting:`ADMINS`.
id: Untuk mengaktifkan perilaku ini, masukkan alamat email dari penerima di bagian :setting:`ADMINS`.

source: Server error emails are sent using the logging framework, so you can customize this behavior by :doc:`customizing your logging configuration </topics/logging>`.
el: Για την αποστολή των emails που στέλνονται όταν προκύπτει σφάλμα στον server, χρησιμοποιείται το logging framework, οπότε μπορείτε να παραμετροποιήσετε αυτή τη συμπεριφορά :doc:`φέρνοντας στα μέτρα σας την παραμετροποίηση του logging </topics/logging>`.
id: Surel kesalahan peladen dikirim menggunakan kerangka pencatatan, jadi anda dapat menyesuaikan perilaku ini dengan :doc:`customizing your logging configuration </topics/logging>`.

source: 404 errors
el: Σφάλματα 404
id: kesalahan 404

source: Django can also be configured to email errors about broken links (404 "page not found" errors). Django sends emails about 404 errors when:
el: Το Django μπορεί, επίσης, να παραμετροποιηθεί για να στέλνει email όταν προκύπτουν σπασμένοι σύνδεσμοι (broken links – σφάλμα 404 "page not found"). Το Django στέλνει emails σχετικά με σφάλματα 404 όταν:
id: Django juga dapat dikonfirgasi untuk mengirimkan email kesalahan tentang tautan yang tidak ditemukan (404 "page not found" errors). Django mengirim email tentang error 404 ketika:

source: :setting:`DEBUG` is ``False``;
el: Η ρύθμιση :setting:`DEBUG` είναι ``False`` και
id: :setting:`DEBUG` adalah ``False``;

source: Your :setting:`MIDDLEWARE_CLASSES` setting includes :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.
id: Pengaturan :setting:`MIDDLEWARE_CLASSES` anda termasuk :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.

source: If those conditions are met, Django will email the users listed in the :setting:`MANAGERS` setting whenever your code raises a 404 and the request has a referer. It doesn't bother to email for 404s that don't have a referer -- those are usually just people typing in broken URLs or broken Web bots. It also ignores 404s when the referer is equal to the requested URL, since this behavior is from broken Web bots too.
el: Αν ισχύουν τα παραπάνω, το Django θα στείλει email στους χρήστες οι οποίοι βρίσκονται στη λίστα της ρύθμισης :setting:`MANAGERS` οποτεδήποτε ο κώδικας σας κάνει raise ένα σφάλμα 404 και το request έχει έναν referer. Δεν στέλνει email για σφάλματα 404 τα οποία δεν έχουν referer -- αυτά είναι συνήθως σφάλματα που προκύπτουν από χρήστες που γράφουν οι ίδιοι σπασμένα URLs ή από broken Web bots. Αγνοεί, επίσης, σφάλματα 404 όταν ο referer είναι ίδιος με το ζητούμενο URL, αφού αυτή η συμπεριφορά προέρχεται, επίσης, από broken Web bots.
id: Jika kondisi tersebut bertemu, Django akan surel pengguna terdaftar di pengaturan :setting:`MANAGERS` kapanpun kode anda memunculkan 404 dan permintaan mempunyai acuan. Dia tidak mengganggu ke surel untuk 404 yang tidak punya acuan -- yaitu biasanya hanya orang mengetikkan dalam URL rusak atau robot Jaringan rusak. Dia juga mengabaikan 404 ketika acuan sama pada URL yang diminta, sejak perilaku ini dari robot Jaringan rusak juga.

source: In older versions, 404s were not ignored when the referer was equal to the requested URL.
el: Σε παλαιότερες εκδόσεις, τα σφάλματα 404 δεν αγνοούνταν όταν ο referer ήταν ο ίδιος με το ζητούμενο URL.
id: Di versi yang lama, 404 tidak diabaikan ketika referer sama dengan URL yang diminta.

source: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` must appear before other middleware that intercepts 404 errors, such as :class:`~django.middleware.locale.LocaleMiddleware` or :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Put it towards the top of your :setting:`MIDDLEWARE_CLASSES` setting.
id: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` harus muncul sebelum middleware lain yang mencegat kesalahan 404, seperti :class:`~django.middleware.locale.LocaleMiddleware` atau :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Taruh dia menuju atas dari pengaturan :setting:`MIDDLEWARE_CLASSES` anda.

source: You can tell Django to stop reporting particular 404s by tweaking the :setting:`IGNORABLE_404_URLS` setting. It should be a list of compiled regular expression objects. For example::
el: Μπορείτε να ρυθμίσετε το Django να σταματήσει την αναφορά συγκεκριμένων σφαλμάτων 404 πειράζοντας την ρύθμιση :setting:`IGNORABLE_404_URLS`. Αυτή είναι μια λίστα από regular expression objects. Για παράδειγμα::
id: Anda dapat memberitahu Django untuk menghentikan pelaporan tertentu 404 dengan merubah pengaturan :setting:`IGNORABLE_404_URLS`. Dia harus menjadi daftar dari obyek ekspresi biasa tersusun. Sebagai contoh::

source: In this example, a 404 to any URL ending with ``.php`` or ``.cgi`` will *not* be reported. Neither will any URL starting with ``/phpmyadmin/``.
el: Σε αυτό το παράδειγμα, ένα σφάλμα 404 σε οποιοδήποτε URL που τελειώνει με ``.php`` ή ``.cgi`` *δεν* θα αναφερθεί. Ούτε, επίσης, οποιοδήποτε URL που ξεκινά με το ``/phpmyadmin/``.
id: Dalam contoh ini, sebuah 404 pada setiap URL berakhiran dengan ``.php`` atau ``.cgi`` akan *tidak* dilaporkan. Juga tidak akan URL apapun dimulai dengan ``/phpmyadmin/``.

source: The following example shows how to exclude some conventional URLs that browsers and crawlers often request::
el: Το ακόλουθο παράδειγμα δείχνει πως να εξαιρέσετε μερικά συμβατικά URLs τα οποία οι browsers και οι crawlers ζητούν συχνά::
id: Contoh berikut menunjukkan bagaimana mengeluarkan beberapa URL biasa yang perambah dan penjilat sering diminta::

source: (Note that these are regular expressions, so we put a backslash in front of periods to escape them.)
el: (Σημειώστε ότι αυτά είναι regular expressions, οπότε βάζουμε ένα backslash μπροστά από τους χαρακτήρες της τελείας για να τις κάνουμε escape.)
id: (Perhatikan bahwa ini adalah ekspresi regular, jadi kita tuliskan backslash di depan titik untuk melepaskannya)

source: If you'd like to customize the behavior of :class:`django.middleware.common.BrokenLinkEmailsMiddleware` further (for example to ignore requests coming from web crawlers), you should subclass it and override its methods.
el: Αν θέλετε να αλλάξετε τη συμπεριφορά της middleware κλάσης :class:`django.middleware.common.BrokenLinkEmailsMiddleware` (πχ να αγνοήσει τα requests που προέρχονται από τους web crawlers), θα πρέπει να την κάνετε subclass, να παρακάμψετε (override) τις μεθόδους της και να χρησιμοποιήσετε τη δική σας στη ρύθμιση :setting:`MIDDLEWARE`.
id: Jika anda suka menyesuaikan perilaku dari :class:`django.middleware.common.BrokenLinkEmailsMiddleware` lebih lanjut (sebagai contoh untuk mengabaikan permintaan datang dari penjilat jaringan), anda harus mensubkelaskannya dan mengesampingkan caranya.

source: 404 errors are logged using the logging framework. By default, these log records are ignored, but you can use them for error reporting by writing a handler and :doc:`configuring logging </topics/logging>` appropriately.
el: Τα σφάλματα 404 γίνονται logged χρησιμοποιώντας το logging framework της Python. Από προεπιλογή, αυτά τα log αρχεία αγνοούνται, αλλά μπορείτε να τα χρησιμοποιήσετε για αναφορά σφαλμάτων γράφοντας έναν handler και :doc:`παραμετροποιώντας το logging </topics/logging>` καταλλήλως.
id: Kesalahan 404 dicatat menggunakan kerangka pencatatan. Secara awal, rekaman catatan ini diabaikan, tetapi anda dapat menggunakan mereka untuk kesalahan pelaporan dengan menulis sebuah penanganan :doc:`configuring logging </topics/logging>` dengan benar.

source: Filtering error reports
el: Φιλτράροντας τις αναφορές σφαλμάτων
id: Menyaring laporan kesalahan

source: Filtering sensitive data is a hard problem, and it's nearly impossible to guarantee that sensitive won't leak into an error report. Therefore, error reports should only be available to trusted team members and you should avoid transmitting error reports unencrypted over the Internet (such as through email).
el: Το φιλτράρισμα των ευαίσθητων δεδομένων είναι ένα δύσκολο πρόβλημα και είναι σχεδόν αδύνατο να εγγυηθείτε ότι τα ευαίσθητα δεδομένα δεν θα καταγραφούν σε κάποια αναφορά σφάλματος. Επομένως, οι αναφορές σφάλματος θα πρέπει να είναι διαθέσιμες μόνο σε μέλη της ομάδας και θα πρέπει να αποφεύγετε να στέλνετε αναφορές σφαλμάτων χωρίς κρυπτογράφηση στο διαδίκτυο (όπως μέσω email).
id: Menyaring data sensitif adalah masalah sulit, dan hampur tidak mungkin menjamin bahwa sensitif tidak akan bocor kedalam sebuah laporan kesalahan. Karena itu, laporan kesalahan harus hanya tersedia pada anggota tim yang dapat dipercaya dan harus menghindari perpindahan laporan kesalahan tidak disandikan di Internet (seperti surel).

source: Filtering sensitive information
el: Φιλτράροντας ευαίσθητα δεδομένα
id: Menyaring informasi rahasia

source: Error reports are really helpful for debugging errors, so it is generally useful to record as much relevant information about those errors as possible. For example, by default Django records the `full traceback`_ for the exception raised, each `traceback frame`_’s local variables, and the :class:`~django.http.HttpRequest`’s :ref:`attributes<httprequest-attributes>`.
el: Οι αναφορές σφαλμάτων είναι πολύ χρήσιμες για την αποσφαλμάτωση, οπότε είναι γενικά χρήσιμο να καταγράφετε όσο το δυνατόν περισσότερη πληροφορία σχετικά με αυτά τα λάθη γίνεται. Για παράδειγμα, από προεπιλογή, το Django καταγράφει το `πλήρες traceback <https://en.wikipedia.org/wiki/Stack_trace>`_ για το exception που έγινε raised, κάθε τοπική μεταβλητή ενός `traceback frame <https://en.wikipedia.org/wiki/Stack_frame>`_’ και τα :ref:`attributes<httprequest-attributes>` του :class:`~django.http.HttpRequest`.
id: Laporan kesalahan sangat membantu untuk memeriksa kesalahan, jadi dia umumnya berguna untuk merekam informasi terkait tentang kesalahan-kesalahan tersebut sebanyak mungkin. Sebagai contoh, secara awal rekaman Django `full traceback`_ untuk dimunculkan pengecualian, setiap variabel lokal `full traceback`_, dan :ref:`attributes<httprequest-attributes>` :class:`~django.http.HttpRequest`.

source: However, sometimes certain types of information may be too sensitive and thus may not be appropriate to be kept track of, for example a user's password or credit card number. So Django offers a set of function decorators to help you control which information should be filtered out of error reports in a production environment (that is, where :setting:`DEBUG` is set to ``False``): :func:`sensitive_variables` and :func:`sensitive_post_parameters`.
id: Bagaimanapun, terkadang jenis-jenis tertentu dari informasi mungkin terlalu sensitif dan demikian mungkin tidak sesuai akan terus dilacak, sebagai contoh san pengguna atau angka kartu kredit. Jadi Django menawarkan sekumpulan fungsi decorator untuk membantu anda mengendalikan informasi mana harus disaring keluar dari laporan kesalahan dalam lingkungan produksi (yaitu, dimana :setting:`DEBUG` disetel ke ``False``): :func:`sensitive_variables` dan :func:`sensitive_post_parameters`.

source: If a function (either a view or any regular callback) in your code uses local variables susceptible to contain sensitive information, you may prevent the values of those variables from being included in error reports using the ``sensitive_variables`` decorator::
el: Αν μια συνάρτηση (είτε ένα view είτε κάποιο συνηθισμένο callback) μέσα στον κώδικα σας χρησιμοποιεί τοπικές μεταβλητές ικανές για να κρατήσουν ευαίσθητα δεδομένα, μπορείτε να εμποδίσετε τις τιμές των μεταβλητών αυτών να συμπεριληφθούν στις αναφορές σφαλμάτων, χρησιμοποιώντας τον decorator ``sensitive_variables``::
id: Jika sebuah fungsi (baik sebuah tampilan atau callback umum apapun) dalam kode anda menggunakan variabel lokal rentan mengandung informasi sensitif, anda mungkin mencegah nilai-nilai variabel tersebut dari menjadi disertakan dalam laporan kesalahan menggunakan decorator ``sensitive_variables``::

source: In the above example, the values for the ``user``, ``pw`` and ``cc`` variables will be hidden and replaced with stars (`**********`) in the error reports, whereas the value of the ``name`` variable will be disclosed.
el: Στο παραπάνω παράδειγμα, οι τιμές των μεταβλητών ``user``, ``pw`` και ``cc`` δεν θα εμφανιστούν και θα αντικατασταθούν με αστερίσκους (`**********`) στις αναφορές σφαλμάτων, αλλά η τιμή της μεταβλητής ``name`` θα εμφανιστεί ως έχει.
id: Dalam contoh diatas, nilai-nilai untuk variabel ``user``, ``pw`` dan ``cc`` akan disembunyikan dan diganti dengan bintang (`**********`) dalam laporan kesalahan, dimana nilai dari variabel ``name`` akan diungkapkan.

source: To systematically hide all local variables of a function from error logs, do not provide any argument to the ``sensitive_variables`` decorator::
el: Αν θέλετε να κρύψετε όλες τις τοπικές μεταβλητές μια συνάρτησης από τις αναφορές σφαλμάτων, δεν έχετε παρά να μην δώσετε καμία παράμετρο στον decorator ``sensitive_variables``::
id: Untuk secara sistematis menyembunyikan semua variabel lokal dari sebuah fungsi dari laporan kesalahan, jangan menyediakan argumen apapun pada decorator ``sensitive_variables``::

source: When using multiple decorators
el: Όταν χρησιμοποιείτε πολλούς decorators
id: Ketika menggunakan sejumlah dekorator

source: If the variable you want to hide is also a function argument (e.g. '``user``’ in the following example), and if the decorated function has multiple decorators, then make sure to place ``@sensitive_variables`` at the top of the decorator chain. This way it will also hide the function argument as it gets passed through the other decorators::
el: Αν η τιμή που θέλετε να αποκρύψετε είναι μια παράμετρος μιας συνάρτησης (πχ η '``user``’ στο παρακάτω παράδειγμα) και αν η διακοσμημένη συνάρτηση (συνάρτηση στην οποία έχει εφαρμοστεί ένας decorator) έχει πολλούς decorators, τότε σιγουρευτείτε ότι το ``@sensitive_variables`` βρίσκεται στην κορυφή της αλυσίδας των decorators. Με αυτό τον τρόπο θα αποκρύψει, επίσης, την παράμετρο της συνάρτησης όσο αυτή περνάει στους επόμενους decorators, κάτω στην αλυσίδα::
id: Jika variabel anda ingin sembunyikan adalah juga argumen fungsi (sebagai contoh '``user``’ dalam contoh berikut), dan jika fungsi dihiasi mempunyai banyak decorator, kemudian pastikan menempatkan ``@sensitive_variables`` pda atas dari rantai decorator. Cara ini dia akan juga menyembunyikan argumen fungsi ketika dia mendapatkan dilewati melalui decorator lain::

source: If one of your views receives an :class:`~django.http.HttpRequest` object with :attr:`POST parameters<django.http.HttpRequest.POST>` susceptible to contain sensitive information, you may prevent the values of those parameters from being included in the error reports using the ``sensitive_post_parameters`` decorator::
el: Αν ένα από τα views σας, λαμβάνει ένα object τύπου :class:`~django.http.HttpRequest` το οποίο έχει ικανές να αποθηκεύουν ευαίσθητα δεδομένα :attr:`παραμέτρους POST <django.http.HttpRequest.POST>`, μπορείτε να αποτρέψετε τις τιμές αυτών των παραμέτρων να καταγραφούν στις αναφορές σφαλμάτων χρησιμοποιώντας τον decorator ``sensitive_post_parameters``::
id: Jika satu dari tampilan anda menerima sebuah obyek :class:`~django.http.HttpRequest` dengan :attr:`POST parameters<django.http.HttpRequest.POST>` rentan utnuk mengandung informasi sensitif, anda mungkin mencegah nilai-nilai dari parameter tersebut dari menjadi disertakan dalam laporan kesalahan menggunakan decorator ``sensitive_post_parameters``::

source: In the above example, the values for the ``pass_word`` and ``credit_card_number`` POST parameters will be hidden and replaced with stars (`**********`) in the request's representation inside the error reports, whereas the value of the ``name`` parameter will be disclosed.
el: Στο παραπάνω παράδειγμα, οι τιμές των POST παραμέτρων ``pass_word`` και ``credit_card_number`` δεν θα εμφανιστούν και θα αντικατασταθούν με αστερίσκους (`**********`) στην αναπαράσταση του request μέσα στις αναφορές σφαλμάτων, αλλά η τιμή της παραμέτρου ``name`` θα εμφανιστεί ως έχει.
id: Dalam contoh diatas, nilai-nilai untuk parameter POST ``pass_word`` dan ``credit_card_number`` akan disembunyikan dan diganti dengan bintang (`**********`) dalam laporan kesalahan, dimana nilai dari variabel ``name`` akan diungkapkan.

source: To systematically hide all POST parameters of a request in error reports, do not provide any argument to the ``sensitive_post_parameters`` decorator::
el: Για να αποκρύψετε όλες τις POST παραμέτρους ενός request στις αναφορές σφαλμάτων, δεν έχετε παρά να μην περάσετε καμία παράμετρο στον decorator ``sensitive_post_parameters``::
id: Untuk secara sistematis menyembunyikan semua parameter POST dari sebuah permintaan dalam laporan kesalahan, jangan menyediakan argumen apapun pada decorator ``sensitive_variables``::

source: All POST parameters are systematically filtered out of error reports for certain :mod:`django.contrib.auth.views` views (``login``, ``password_reset_confirm``, ``password_change``, and ``add_view`` and ``user_change_password`` in the ``auth`` admin) to prevent the leaking of sensitive information such as user passwords.
el: Για συγκεκριμένα :mod:`django.contrib.auth.views` views (``login``, ``password_reset_confirm``, ``password_change`` και ``add_view``, ``user_change_password`` για το ``auth`` admin), όλες οι POST παράμετροι μένουν εκτός των αναφορών σφαλμάτων για να εμποδίσουν τυχόν διαρροές ευαίσθητων δεδομένων, όπως είναι τα passwords των χρηστών.
id: Semua parameter POST adalah sistematis disaring keluar dari laporan kesalahan untuk tampilan :mod:`django.contrib.auth.views` tertentu (``login``, ``password_reset_confirm``, ``password_change``, dan ``add_view`` dan ``user_change_password`` dalam admin ``auth``) untuk mencegah dari pembocoran dari informasi sensitif seperti sandi pengguna.

source: Custom error reports
el: Παραμετροποιήσιμες αναφορές σφαλμάτων
id: Penyesuaian laporan kesalahan
