Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: If you haven't added any extra options on top of the field you inherited from, then there's no need to write a new ``deconstruct()`` method. If, however, you're changing the arguments passed in ``__init__()`` (like we are in ``HandField``), you'll need to supplement the values being passed.
el: Αν δεν έχετε προσθέσει τυχόν έξτρα επιλογές στη μέθοδο ``__init__()`` του δικού σας πεδίου, δεν χρειάζεται να γράψετε κάποια νέα μέθοδο ``deconstruct()``. Αν, ωστόσο, αλλάξετε τα arguments που περνούν στην ``__init__()`` (όπως κάναμε στην κλάση ``HandField`` που αλλάξαμε το ``kwargs['max_length']``), θα χρειαστεί να προσθέσετε τις τιμές που περάσατε.
id: Jika anda belum menambahkan pilihan tambahan pada bagian atas bidang anda warisi, lalu tidak perlu untuk menulis cara ``deconstruct()`` baru. Jika, bagaimanapun, anda sedang merubah argumen dilewati dalam ``__init__()`` (seperti kami dalam ``HandField``), anda akan butuh tambahan nilai yang sedang dilewati.

source: The contract of ``deconstruct()`` is simple; it returns a tuple of four items: the field's attribute name, the full import path of the field class, the positional arguments (as a list), and the keyword arguments (as a dict). Note this is different from the ``deconstruct()`` method :ref:`for custom classes <custom-deconstruct-method>` which returns a tuple of three things.
el: Το συμβόλαιο με την μέθοδο ``deconstruct()`` είναι απλό. Επιστρέφει ένα tuple τεσσάρων στοιχείων: το όνομα του attribute του field, το πλήρες import path της κλάσης του πεδίου, τα positional arguments (ως λίστα) και τα keyword arguments (ως dictionary). Σημειώστε ότι αυτή η μέθοδος είναι διαφορετική από τη μέθοδο ``deconstruct()`` :ref:`όταν γράφεται δικές σας κλάσεις <custom-deconstruct-method>` η οποία επιστρέφει ένα tuple τριών στοιχείων.
id: Kontrak dari ``deconstruct()`` adalah sederhana; dia mengembalikan sebuah tuple dari empat barang: nama atribut bidang, jalur impor penuh dari kelas bidang, penempatan argumen (sebagai sebuah daftar), dan argumen kata kunci (sebagai pendiktean). Catat bahwa ini berbeda dari cara ``deconstruct()`` :ref:`for custom classes <custom-deconstruct-method>` yang mengembalikan sebuah tuple dari tiga hal.

source: As a custom field author, you don't need to care about the first two values; the base ``Field`` class has all the code to work out the field's attribute name and import path. You do, however, have to care about the positional and keyword arguments, as these are likely the things you are changing.
el: Ως συντάκτης του δικού σας πεδίου, δεν θα σας απασχολήσουν τα δύο πρώτα στοιχεία του tuple. Η κύρια κλάση της ``Field`` έχει όλο τον απαραίτητο κώδικα για να υπολογίσει το όνομα και το import path του πεδίου σας. Ωστόσο, σίγουρα θα σας απασχολήσουν τα positional και keyword arguments, αφού αυτά είναι τα στοιχεία που πιθανόν να αλλάξετε.
id: Sebagai sebuah penyesuaian bidang penulis, anda tidak perlu memperhatikan tentang dua nilai pertama; kelas ``Field`` dasar mempunyai semua kode untuk bekerja nama atribut bidang dan mengimpor jalur. Anda, bagaimanapun, harus memperhatikan tentang penempatan dan katakunci argumen, seperti ini mirip hal-hal anda sedang rubah.

source: For example, in our ``HandField`` class we're always forcibly setting max_length in ``__init__()``. The ``deconstruct()`` method on the base ``Field`` class will see this and try to return it in the keyword arguments; thus, we can drop it from the keyword arguments for readability::
el: Για παράδειγμα, στην κλάση ``HandField`` θέτουμε το ``max_length`` μέσα στην ``__init__()``. Η μέθοδος ``deconstruct()`` της κλάσης ``Field`` (την οποία καλούμε - ``super(HandField, self).deconstruct()``) θα δει ότι έχει οριστεί το ``max_length`` και θα το επιστρέψει μέσα στο ``kwargs`` dictionary. Για λόγους αναγνωσιμότητας μπορούμε να το διαγράψουμε από το dictionary και έτσι το ``kwargs`` να είναι κενό. Όταν, επομένως, πάρουμε αυτό το tuple των τεσσάρων στοιχείων και προσπαθήσουμε να χτίσουμε ένα instance του ``HandField`` δεν έχει πολύ νόημα το ``kwargs`` να περιέχει το ``max_length`` αφού κατά το χτίσιμο του instance θα κληθεί η ``__init__`` η οποία το ορίζει μέσα της::
id: Sebagai contoh, dalam kelas ``HandField`` kami selalu memaksa menyetel max_length dalam ``__init__()``. Cara ``deconstruct()`` dalam basis kelas ``Field`` akan melihat ini dan mencoba mengembalikannya dalam argumen katakunci; demikian, kami dapat membuangnya dari argumen katakunci untuk kesiapan::

source: If you add a new keyword argument, you need to write code to put its value into ``kwargs`` yourself::
el: Αν προσθέσετε ένα νέο keyword argument, θα χρειαστεί να γράψετε κώδικα για να προσθέσετε την τιμή του στο ``kwargs``::
id: Jika anda menambahkan argumen kata kunci, anda perlu menuliskan sendiri kode untuk menambahkan nilai ke ``kwargs`` ::

source: More complex examples are beyond the scope of this document, but remember - for any configuration of your Field instance, ``deconstruct()`` must return arguments that you can pass to ``__init__`` to reconstruct that state.
el: Πιο περίπλοκα παραδείγματα είναι πέρα από τους σκοπούς αυτού του άρθρου, αλλά να θυμάστε – για κάθε παραμετροποίηση του instance του Field, η μέθοδος ``deconstruct()`` πρέπει να επιστρέφει arguments τα οποία αν περάσετε στην ``__init__`` θα ξαναφτιάξετε το πεδίο σας.
id: Contoh lebih rumit diluar cakupan dari dokumen ini, tetapi ingat - untuk konfigurasi apapun dari instance Field anda, ``deconstruct()`` harus mengembalikan argumen yang anda dapat lewati ke ``__init__`` untuk membangun kembali keadaan tersebut.

source: Pay extra attention if you set new default values for arguments in the ``Field`` superclass; you want to make sure they're always included, rather than disappearing if they take on the old default value.
el: Δώστε μεγάλη προσοχή στην περίπτωση που δώσετε τυχόν νέες προεπιλεγμένες τιμές στα arguments της superclass της ``Field``. Πρέπει να εξασφαλίσετε ότι πάντοτε περιλαμβάνονται παρά εξαφανίζονται όταν λαμβάνουν την παλιά προεπιλεγμένη τιμή.
id: Beri perhatian lebih jika anda menyetel nilai baru awal untuk argumen dalam super kelas ``Field``; anda ingin memastikan mereka selalu disertakan, daripada menghilang jika mereka mengambil nilai awal lama.

source: In addition, try to avoid returning values as positional arguments; where possible, return values as keyword arguments for maximum future compatibility. Of course, if you change the names of things more often than their position in the constructor's argument list, you might prefer positional, but bear in mind that people will be reconstructing your field from the serialized version for quite a while (possibly years), depending how long your migrations live for.
el: Επιπροσθέτως, προσπαθήστε να αποφύγετε να περάσετε τιμές ως positional arguments, όπου δυνατόν και αντί αυτού να επιστρέφετε τις τιμές ως keyword arguments για περισσότερη συμβατότητα στο μέλλον. Φυσικά, αν αλλάζετε τα ονόματα πιο συχνά από τη θέση τους στη λίστα των arguments του constructor, ίσως να προτιμήσετε τα positional arguments, αλλά έχετε στο μυαλό σας ότι άλλοι προγραμματιστές θα κάνουν reconstruct το πεδίο σας από την σειριακή έκδοση του για αρκετό καιρό (πιθανόν χρόνια), αναλόγως το χρόνο ζωής των migration σας.
id: Dalam tambahan, coba untuk menghindari nilai kembalian sebagai argumen penempatan; jika memungkinkan, kembalikan nilai sebagai argumen katakunci untuk kesesuaian masa depan maksimal. Tentu saja, jika anda merubah nama dari hal-hal sering daripada penempatan mereka dalam daftar argumen pembangun, anda mungkin memilih penempatan, tetapi ingatlah bahwa orang akan membangun kembali bidang ada dari versi bersambung untuk sejenak (mungkin tahunan), tergantung berapa lama perpindahan langsung anda.

source: You can see the results of deconstruction by looking in migrations that include the field, and you can test deconstruction in unit tests by just deconstructing and reconstructing the field::
el: Μπορείτε να δείτε τα αποτελέσματα του deconstruction κοιτάζοντας τα migrations τα οποία περιέχουν το πεδίο και μπορείτε, επίσης, να τεστάρετε το deconstruction σε unit tests απλώς κάνοντας deconstruct και reconstruct το πεδίο::
id: Anda dapat melihat hasil dari membongkar dengan mencari dalam perpindahan yang menyertakan bidang, dan anda dapat menguji pembongkaran dalam satuan percobaan dengan hanya membongkar dan membangun kembali bidang.

source: Documenting your custom field
el: Τεκμηριώνοντας το δικό σας πεδίο
id: Mendokumentasikan bidang penyesuaian anda

source: As always, you should document your field type, so users will know what it is. In addition to providing a docstring for it, which is useful for developers, you can also allow users of the admin app to see a short description of the field type via the :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>` application. To do this simply provide descriptive text in a :attr:`~Field.description` class attribute of your custom field. In the above example, the description displayed by the ``admindocs`` application for a ``HandField`` will be 'A hand of cards (bridge style)'.
el: Όπως πάντα, θα πρέπει να τεκμηριώνετε (περιγραφικά και βοηθητικά σχόλια) τον τύπο του πεδίου σας, προκειμένου οι χρήστες αυτού να γνωρίζουν περί τίνος πρόκειται. Πέρα από το γεγονός του να γράψετε ένα docstring για αυτό, το οποίο είναι χρήσιμο για τους developers, μπορείτε επίσης να προσφέρετε στους χρήστες του Django admin να δουν μια μικρή περιγραφή του τύπου του πεδίου μέσω της εφαρμογής :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>`. Για να γίνει αυτό απλώς προσθέστε ένα περιγραφικό κείμενο στο class attribute :attr:`~Field.description` του δικού σας πεδίου. Στο παραπάνω παράδειγμα, η περιγραφή που εμφανίζεται από την εφαρμογή ``admindocs`` για το πεδίο ``HandField`` θα είναι η 'A hand of cards (bridge style)'.
id: Seperti biasa, anda harus mendokumentasikan jenis bidang anda, sehingga pengguna akan mengetahui apa itu. Dalam tambahan untuk menyediakan docstring untuknya, mana yang berguna untuk pengembang, anda dapat juga mengizinkan aplikasi admin untuk melihat gambaran pendek dari jenis bidang melalui aplikasi :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>`. Untuk melakukan ini cukup menyediakan gambaran teks dalam sebuah atribut kelas :attr:`~Field.description` dari bidang penyesuaian anda. Dalam contoh diatas, gambaran ditampilkan oleh aplikasi ``admindocs`` untuk sebuah ``HandField`` akan menjadi 'Sebuah tangan dari kartu (gaya bridge)'.

source: In the :mod:`django.contrib.admindocs` display, the field description is interpolated with ``field.__dict__`` which allows the description to incorporate arguments of the field. For example, the description for :class:`~django.db.models.CharField` is::
el: Στην εμφάνιση του module :mod:`django.contrib.admindocs`, η περιγραφή του πεδίου ενσωματώνεται στο ``field.__dict__`` το οποίο επιτρέπει στην περιγραφή να συνεργαστεί με arguments του πεδίου. Για παράδειγμα, η περιγραφή του :class:`~django.db.models.CharField` είναι η::
id: Dalam tampilan :mod:`django.contrib.admindocs`, gambaran bidang ditambahkan dengan ``field.__dict__`` yang mengizinkan gambaran pada argumen yang digabungkan dari bidang. Sebagai contoh, gambaran untuk :class:`~django.db.models.CharField` adalah::

source: Useful methods
el: Χρήσιμες μέθοδοι
id: Cara berguna

source: Once you've created your :class:`~django.db.models.Field` subclass, you might consider overriding a few standard methods, depending on your field's behavior. The list of methods below is in approximately decreasing order of importance, so start from the top.
el: Όταν φτιάξετε την subclass της κλάσης :class:`~django.db.models.Field`, μπορείτε, αν θέλετε, να παρακάμψετε (override) μερικές στάνταρντ μεθόδους, ανάλογα τη συμπεριφορά του πεδίου σας. Η λίστα με τις μεθόδους, παρακάτω, είναι περίπου κατά φθίνουσα σειρά σπουδαιότητας, οπότε ξεκινήστε από πάνω προς τα κάτω.
id: Sekali anda telah membuat subkelas :class:`~django.db.models.Field` anda, anda boleh mempertimbangkan mengesampingkan sedikit cara standar, tergantung pada kebiasaan bidang anda. Daftar dari cara dibawah ini adalah dalam lebih kurang menurun urutan dari kepentingan, jadi mulai dari atas.

source: Custom database types
el: Δικά σας πεδία βάσης δεδομένων
id: Jenis basisdata penyesuaian

source: Say you've created a PostgreSQL custom type called ``mytype``. You can subclass ``Field`` and implement the :meth:`~Field.db_type` method, like so::
el: Ας υποθέσουμς ότι έχετε δημιουργήσει ένα δικό σας πεδίο στη PostgreSQL με το όνομα ``mytype``. Μπορείτε να κάνετε subclass τη κλάση ``Field`` και να υλοποιήσετε τη μέθοδο :meth:`~Field.db_type`, ως εξής::
id: Katakan anda telah membuat jenis penyesuaian PostgreSQL dipanggil ``mtype``. Anda dapat mensubkelaskan ``Field`` dan menerapkan cara :meth:`~Field.db_type`, seperti begitu::

source: Once you have ``MytypeField``, you can use it in any model, just like any other ``Field`` type::
el: Όταν θα έχετε γράψει το ``MytypeField``, μπορείτε να το χρησιμοποιήσετε σε οποιοδήποτε από τα μοντέλα σας, όπως ακριβώς με οποιοδήποτε άλλο τύπο ``Field``::
id: Sekali anda mempunyai ``MytypeField``, anda dapat menggunakannya di model apapun, seperti jenis ``Field`` apapun lainnya ::

source: If you aim to build a database-agnostic application, you should account for differences in database column types. For example, the date/time column type in PostgreSQL is called ``timestamp``, while the same column in MySQL is called ``datetime``. The simplest way to handle this in a :meth:`~Field.db_type` method is to check the ``connection.settings_dict['ENGINE']`` attribute.
el: Αν σκοπεύετε να φτιάξετε μια εφαρμογή η οποία είναι ανεξάρτητη από τη βάση δεδομένων που χρησιμοποιείται, θα πρέπει να λάβετε υπόψη σας τις διαφορές τύπων στηλών μεταξύ των βάσεων δεδομένων. Για παράδειγμα, η στήλη τύπου date/time στην PostgreSQL καλείτε ``timestamp``, ενώ η ίδια στήλη στη MySQL καλείται ``datetime``. Ο πιο απλός τρόπος να χειριστείτε αυτή την κατάσταση μέσα στη μέθοδο :meth:`~Field.db_type` είναι να ελέγξετε το attribute ``connection.settings_dict['ENGINE']``.
id: Jika anda menuju membangun aplikasi agnostik-basisdata, anda harus melaporkan untuk perbedaan dalam jenis kolom basisdata. Sebagai contoh, jenis kolom date/time dalam PostgreSQL dipanggil ``timestamp``, sementara kolom yang sama dalam MySQL dipanggil ``datetime``. Jalan termudah untuk menangani ini dalam cara :meth:`~Field.db_type` adalah untuk memeriksa atribut ``connection.settings_dict['ENGINE']``.

source: For example::
el: Για παράδειγμα::
id: Sebagai contoh::

source: The :meth:`~Field.db_type` method is called by Django when the framework constructs the ``CREATE TABLE`` statements for your application -- that is, when you first create your tables. It is also called when constructing a ``WHERE`` clause that includes the model field -- that is, when you retrieve data using QuerySet methods like ``get()``, ``filter()``, and ``exclude()`` and have the model field as an argument. It's not called at any other time, so it can afford to execute slightly complex code, such as the ``connection.settings_dict`` check in the above example.
id: Cara :meth:`~Field.db_type` dipanggil oleh Django ketika kerangka membangun pernyataan ``CREATE TABLE`` untuk aplikasi anda -- yaitu, ketika anda pertama kali membuat tabel anda. Dia juga dipanggil ketika membangun klausa ``WHERE`` yang menyertakan bidang model -- yaitu, ketika anda mengambil data menggunakan cara QuerySet seperti ``get()``, ``filter()``, dan ``exclude()`` dan mempunyai bidang model sebagai sebuah argumen. Dia tidak dipanggil pada lain waktu, jadi dia dapat mampu menjalankan sedikit kode rumit , seperti ``connection.settings_dict`` diperiksa dalam contoh diatas.

source: Some database column types accept parameters, such as ``CHAR(25)``, where the parameter ``25`` represents the maximum column length. In cases like these, it's more flexible if the parameter is specified in the model rather than being hard-coded in the ``db_type()`` method. For example, it wouldn't make much sense to have a ``CharMaxlength25Field``, shown here::
el: Μερικοί τύποι στηλών βάσης δεδομένων δέχονται παραμέτρους, όπως ``CHAR(25)``, όπου η παράμετρος ``25`` αναπαριστά το μέγιστο μήκος χαρακτήρων της στήλης. Σε παρόμοιες περιπτώσεις, είναι πιο ευέλικτο η παράμετρος να δηλωθεί στο μοντέλο (ως ``max_length`` attribute) παρά να γραφεί με το χέρι μέσα στη μέθοδο ``db_type()``. Για παράδειγμα, δεν θα είχε πολύ νόημα να είχατε ένα πεδίο ``CharMaxlength25Field``, όπως φαίνεται εδώ::
id: Beberapa jenis kolom basisdata menerima parameter, seperti ``CHAR(25)``, dimana parameter ``25`` mewakili panjang kolom maksimum. Dalam kasus seperti ini, dia lebih supel jika parameter ditentukan dalam model daripada menjadi kode-keras dalam cara ``db_type()``. Sebagai contoh, dia tidak akan masuk akan untuk mempunyai ``CharMaxlength25Field``, ditampilkan disini::

source: The better way of doing this would be to make the parameter specifiable at run time -- i.e., when the class is instantiated. To do that, just implement ``Field.__init__()``, like so::
el: Ένας καλύτερος τρόπος είναι να προσδιορίσετε την παράμετρο κατά τη διάρκεια του run time -- πχ, όταν η κλάση αρχικοποιείται. Για να το κάνετε αυτό, απλώς υλοποιήστε την ``Field.__init__()``, ως εξής (εδώ περνάμε την παράμετρο max_length ως positional argument)::
id: Jalan lebih baik dari mengerjakan ini adalah membuat parameter dapat lebih khusus pada wktu berjalan -- yaitu, ketika kelas dipakai. Untuk melakukan itu, cukup terapkan ``Field.__init__()``, seperti begitu::

source: Finally, if your column requires truly complex SQL setup, return ``None`` from :meth:`.db_type`. This will cause Django's SQL creation code to skip over this field. You are then responsible for creating the column in the right table in some other way, of course, but this gives you a way to tell Django to get out of the way.
el: Εν τέλει, αν η στήλη σας απαιτεί πραγματικά περίπλοκο SQL στήσιμο, επιστρέψτε ``None`` από την μέθοδο :meth:`.db_type`. Αυτό θα επιτρέψει στον κώδικα του Django που παράγει την SQL να προσπεράσει αυτό το πεδίο. Είστε, πλέον, υπεύθυνοι να δημιουργήσετε εσείς τη στήλη στο σωστό πίνακα με κάποιον άλλο τρόπο. Αυτό, φυσικά, λέει στο Django να βγει από τη μέση.
id: Akhirnya, jika kolom anda membutuhkan pengaturan SQL yang rumit, kembalikan ``None`` dari :meth:`.db_type`. Ini akan menyebabkan kode pembuatan SQL Django melewati terhadap bidang ini. Anda kemudian bertanggung jawab untuk membuat kolom dalam tabel yang benar dalam cara lain, tentu saja, tetapi ini memberikan anda sebuah jalan untuk memberitahu Django untuk keluar dari jalan.

source: Converting values to Python objects
el: Μετατρέποντας τιμές σε Python objects
id: Mengubah nilai menjadi obyek Python

source: Historically, Django provided a metaclass called ``SubfieldBase`` which always called :meth:`~Field.to_python` on assignment. This did not play nicely with custom database transformations, aggregation, or values queries, so it has been replaced with :meth:`~Field.from_db_value`.
id: Sejarahnya, Django menyediakan kelas meta dipanggil ``SubfieldBase`` yang selalu dipanggil :meth:`~Field.to_python` pada penugasan. Ini tidak bermain dengan baik dengan perubahan basisdata disesuaikan, pengumpulan, atau permintaan nilai, jadi dia telah diganti dengan :meth:`~Field.from_db_value`.

source: If your custom :class:`~Field` class deals with data structures that are more complex than strings, dates, integers, or floats, then you may need to override :meth:`~Field.from_db_value` and :meth:`~Field.to_python`.
el: Αν η δικιά σας κλάση :class:`~Field` ασχολείται με δομές δεδομένων (data structures) οι οποίες είναι πιο περίπλοκες από strings, dates, integers, ή floats, τότε ίσως χρειαστεί να παρακάμψετε (override) τις μέθοδους :meth:`~Field.from_db_value` και :meth:`~Field.to_python`.
id: Jika penyesuaian kelas :class:`~Field` anda berhubungan dengan struktur dara yang lebih rumit daripada deretan karakter, tanggal, integer, atau float, kemudian anda butuh untuk mengesampingkan :meth:`~Field.from_db_value` dan :meth:`~Field.to_python`.

source: If present for the field subclass, ``from_db_value()`` will be called in all circumstances when the data is loaded from the database, including in aggregates and :meth:`~django.db.models.query.QuerySet.values` calls.
el: Αν η μέθοδος ``from_db_value()`` έχει υλοποιηθεί στη subclass του πεδίου, τότε θα καλείται σε όλες τις περιπτώσεις που τα δεδομένα φορτώνονται από τη βάση δεδομένων, συμπεριλαμβανομένων των κλήσεων των aggregate και :meth:`~django.db.models.query.QuerySet.values`.
id: Jika ada untuk bidang subkelas, ``from_db_value()`` akan dipanggil dalam semua keadaan ketika data dimuat dari basisdata, termasuk dalam keseluruhan dan panggilan :meth:`~django.db.models.query.QuerySet.values`.

source: ``to_python()`` is called by deserialization and during the :meth:`~django.db.models.Model.clean` method used from forms.
el: Η μέθοδος ``to_python()`` καλείται κατά το deserialization και κατά τη διάρκεια της μεθόδου :meth:`~django.db.models.Model.clean` που χρησιμοποιείται από τις φόρμες.
id: ``to_python()`` dipanggil dengan memutuskan dan selama cara :meth:`~django.db.models.Model.clean` digunakan dari formulir.

source: As a general rule, ``to_python()`` should deal gracefully with any of the following arguments:
el: Ως γενικός κανόνας, η μέθοδος ``to_python()`` θα πρέπει συνεργάζεται με οποιοδήποτε από τα ακόλουθα arguments:
id: Sebagai aturan umum, ``to_python()`` harus berurusan secara anggun dengan salah satu dari argumen berikut:

source: An instance of the correct type (e.g., ``Hand`` in our ongoing example).
el: Ένα instance ενός σωστού τύπου (πχ, του ``Hand`` στο τρέχων παράδειγμα μας).
id: Sebuah instance dari jenis yang benar (sebagai contoh, ``Hand`` dalam contoh kami yang sedang berjalan).

source: A string
el: Ένα string
id: Sebuah string

source: ``None`` (if the field allows ``null=True``)
el: ``None`` (αν το πεδίο επιτρέπει ``null=True``)
id: ``None`` (jika bidang mengizinkan ``null=True``)

source: In our ``HandField`` class, we're storing the data as a VARCHAR field in the database, so we need to be able to process strings and ``None`` in the ``from_db_value()``. In ``to_python()``, we need to also handle ``Hand`` instances::
el: Στην κλάση ``HandField``, αποθηκεύουμε τα δεδομένα ως ένα πεδίο VARCHAR στη βάση δεδομένων, οπότε θα πρέπει να είμαστε σε θέση να επεξεργαστούμε τύπου strings και τύπου ``None`` στη μέθοδο ``from_db_value()``. Στη μέθοδο ``to_python()``, θα πρέπει, επίσης, να δουλέψουμε με instances της κλάσης ``Hand``::
id: Dalam kelas ``HandField``, kami menyimpan data sebagai bidang VARCHAR dalam basisdata, jadi kami butuh dapat mengolah deretan karakter dan ``None`` dalam ``from_db_value()``. Di ``to_python()``, kami butuh juga menangani instance ``Hand``::

source: Notice that we always return a ``Hand`` instance from these methods. That's the Python object type we want to store in the model's attribute.
el: Σημειώστε ότι πάντα επιστρέφουμε ένα instance του ``Hand`` από αυτές τις μεθόδους. Αυτός είναι ο τύπος του Python object που θέλουμε να αποθηκεύσουμε στο attribute του model.
id: Perhatikan bahwa kami selalu mengembalikan sebuah instance ``hand`` dari cara ini. Itu adalah jenis obyek Python kami ingin simpan dalam atribut model.
