Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: el, id

source: To support the ``WSGIAuthGroupScript`` directive, the same WSGI script ``mysite.wsgi`` must also import the ``groups_for_user`` function which returns a list groups the given user belongs to.
el: Για την υποστήριξη του directive ``WSGIAuthGroupScript``, το ίδιο WSGI script ``mysite.wsgi`` πρέπει να κάνει import τη συνάρτηση ``groups_for_user`` η οποία επιστρέφει μια λίστα από ομάδες στις οποίες ανήκει ο συγκεκριμένος χρήστης.
id: Untuk mendukung perintah ``WSGIAuthGroupScript``, tulisan WSGI sama ``mysite.wsgi`` harus juga mengimpor fungsi ``groups_for_user`` yang mengembalikan daftar kelompok milik pengguna yang diberikan.

source: Requests for ``/secret/`` will now also require user to be a member of the "secret-agents" group.
el: Πλέον, τα requests που θα ξεκινούν με ``/secret/`` θα απαιτούν, επίσης, από τον χρήστη να είναι μέλος της ομάδας με το όνομα "secret-agents".
id: Permintaan untuk ``/secret/`` akan juga membutuhkan pengguna menjadi anggota dari kelompok "secret-agents".

source: How to use Django with Gunicorn
el: Πως να χρησιμοποιήσετε το Django με το Gunicorn
id: Bagaimana menggunakan Django dengan Gunicorn

source: Gunicorn_ ('Green Unicorn') is a pure-Python WSGI server for UNIX. It has no dependencies and is easy to install and use.
el: Ο Gunicorn_ ('Green Unicorn') είναι ένας αμιγώς Python WSGI server για το UNIX. Δεν έχει dependencies και είναι εύκολος στη χρήση και την εγκατάσταση.
id: Gunicorn_ ('Green Unicorn') adalah peladen murni-Phyton WSGI untuk UNIX. Dia juga tidak tergantung dan mudah dipasang dan digunakan.

source: Installing Gunicorn
el: Εγκαθιστώντας τον Gunicorn
id: Memasang Gunicorn

source: Installing gunicorn is as easy as ``pip install gunicorn``. For more details, see the `gunicorn documentation`_.
el: Η εγκατάσταση του gunicorn είναι τόσο εύκολη όσο το να γράψετε ``pip install gunicorn``. Για περισσότερες πληροφορίες δείτε στο `gunicorn documentation`_.
id: Memasang gunicorn adalah semudah seperti ``pip install gunicorn``. Untuk rincian lebih, lihat `dokumentasi gunicorn`_.

source: Running Django in Gunicorn as a generic WSGI application
el: Τρέχοντας το Django στον Gunicorn ως μια γενική WSGI εφαρμογή
id: Menjalankan Django di Gunicorn sebagai aplikasi WSGI umum.

source: When Gunicorn is installed, a ``gunicorn`` command is available which starts the Gunicorn server process. At its simplest, gunicorn just needs to be called with the location of a module containing a WSGI application object named `application`. So for a typical Django project, invoking gunicorn would look like::
el: Όταν εγκατασταθεί ο Gunicorn server, η εντολή ``gunicorn`` θα είναι διαθέσιμη στο σύστημα σας η οποία ξεκινά τον Gunicorn server. Στην πιο απλή μορφή της, η εντολή gunicorn χρειάζεται μια παράμετρο η οποία θα δείχνει την τοποθεσία του module που περιέχει ένα WSGI application object με το όνομα `application`. Άρα, σε ένα συνηθισμένο Django project, η ενεργοποίηση του gunicorn θα έμοιαζε κάπως έτσι::
id: Ketika Gunicorn dipasang, sebuah perintah ``gunicorn`` tersedia yang memulai pengolahan peladen Gunicorn. Pada sederhananya, gunicorn hanya butuh dipanggil dengan tempat dari modul mengandung obyek aplikasi WSGI dinamai `application`. Sehingga untuk proyek Django khusus, meminta gunicorn kelihatan seperti::

source: This will start one process running one thread listening on ``127.0.0.1:8000``. It requires that your project be on the Python path; the simplest way to ensure that is to run this command from the same directory as your ``manage.py`` file.
el: Αυτή η εντολή θα ξεκινήσει ένα process το οποίο τρέχει ένα thread που ακούει στην πόρτα ``127.0.0.1:8000``. Απαιτεί ότι το project σας βρίσκεται στο Python path. Για να βεβαιωθείτε ότι βρίσκεται, απλώς τρέξετε την παραπάνω εντολή καθώς θα βρίσκεστε στον ίδιο φάκελο που βρίσκεται το αρχείο ``manage.py``.
id: Ini akan memulai satu pengolahan menjalankan satu rangkaian pada ``127.0.0.1:8000``. Dia mengharuskan bahwa proyek anda berada di jalur Phyton; cara sederhana untuk memastikan bahwa menjalankan perintah ini dari direktori sama seperti berkas ``manage.py`` anda.

source: See Gunicorn's `deployment documentation`_ for additional tips.
el: Δείτε στο `deployment documentation`_ του Gunicorn για περισσότερες συμβουλές.
id: Lihat `dokumentasi penyebaran`_ Gunicorn untuk tips tambahan.

source: How to deploy with WSGI
el: Πως να ανεβάσετε το site σας χρησιμοποιώντας το WSGI
id: Bagaimana menyebarkan dengan WSGI

source: Django's primary deployment platform is WSGI_, the Python standard for web servers and applications.
el: Η βασική πλατφόρμα του Django για να ανεβάσετε το site σας (deploying) είναι το WSGI_, το Python στάνταρντ για τους Web servers και τις εφαρμογές. Αν δεν γνωρίζετε τι είναι το WSGI (Web Server Gateway Interface) θα προσπαθήσουμε να σας το εξηγήσουμε με λίγα λόγια εδώ: ένας παραδοσιακός Web server δεν καταλαβαίνει ή δεν γνωρίζει πως να τρέξει μια Python εφαρμογή. Για το λόγο αυτό χρειάζεται να υπάρξει ένας μεσολαβητής ο οποίος θα στέκεται μεταξύ του Web server και της εφαρμογής σας (πχ μια Django ή κάποια άλλη Python εφαρμογή). Αυτός ο μεσολαβητής ονομάζεται WSGI server και μια από τις αρμοδιότητες του είναι να καλεί ένα callable object που βρίσκεται στην Python εφαρμογή σας. Ο WSGI server τρέχει ως ένα διαφορετικό process και ακούει σε διαφορετική πόρτα από αυτή που ακούει ο Web server. Η πιο συνηθισμένη υλοποίηση ενός WSGI server είναι η εξής: ένας browser ζητά την εμφάνιση μιας HTML σελίδας, στην πόρτα 80 όπου ακούει ο Web server. Αφού πάρει το αίτημα ο Web server ζητάει από τον WSGI server, μέσω μιας άλλης πόρτας πχ 8000, να του δώσει την HTML που ζητήθηκε. Ο WSGI server, με τη σειρά του, καλεί το callable object της εφαρμογής σας και εκείνη τη στιγμή ξεκινούν οι απαραίτητες διαδικασίες για να παραχθεί η ζητούμενη HTML. Τέλος, η εφαρμογή σας δίνει την HTML στον WSGI server, αυτός στον Web server και τελικά φθάνει στον browser όπου προβάλλεται.
id: Platform penyebaran utama Django adalah WSGI_, standar Phyton untuk peladen jaringan dan aplikasi.

source: Django's :djadmin:`startproject` management command sets up a simple default WSGI configuration for you, which you can tweak as needed for your project, and direct any WSGI-compliant application server to use.
el: Η διαχειριστική εντολή του Django :djadmin:`startproject` δημιουργεί μια μικρή προεπιλεγμένη παραμετροποίηση του WSGI για εσάς, την οποία μπορείτε να αλλάξετε για τις ανάγκες του project σας και να κατευθύνετε οποιονδήποτε συμβατό με το WSGI application server, για χρήση.
id: Perintah pengelolaan :djadmin:`startproject` Django mengatur konfigurasi WSGI awal sederhana untuk anda, yang anda dapat tarik sesuai kebutuhan untuk proyek anda, dan langsung peladen aplikasi WSGI untuk digunakan.

source: Django includes getting-started documentation for the following WSGI servers:
el: Το Django περιλαμβάνει εγχειρίδια για αρχάριους για τους ακόλουθους WSGI servers:
id: Django menyertakan dokumentasi mulai untuk peladen WSGI berikut:

source: The ``application`` object
el: Το ``application`` object
id: Obyek ``aplikasi``

source: The key concept of deploying with WSGI is the ``application`` callable which the application server uses to communicate with your code. It's commonly provided as an object named ``application`` in a Python module accessible to the server.
el: Η έννοια κλειδί του deploying με το WSGI είναι το ``application`` callable το οποίο χρησιμοποιεί ο application server για να επικοινωνήσει με τον κώδικα σας. Συνήθως χρησιμοποιείται ως object με το όνομα ``application`` σε κάποιο Python module στο οποίο έχει πρόσβαση ο server.
id: Konsep kunci dari penyebaran dengan WSGI adalah ``application`` dapat dipanggil dimana peladen aplikasi gunakan untuk komunikasi dengan kode anda. Dia umumnya disediakan sebagai sebuah obyek dinamai ``application`` di modul Phyton dapat diakses ke peladen.

source: The :djadmin:`startproject` command creates a file :file:`<project_name>/wsgi.py` that contains such an ``application`` callable.
el: Η εντολή :djadmin:`startproject` δημιουργεί ένα αρχείο :file:`<project_name>/wsgi.py` το οποίο περιέχει ένα τέτοιο ``application`` callable.
id: Perintah :djadmin:`startproject` membuat sebuah berkas :file:`<project_name>/wsgi.py` yang mengandung seperti ``aplication`` dapat dipanggil.

source: It's used both by Django's development server and in production WSGI deployments.
el: Χρησιμοποιείται όχι μόνο από τον development server του Django αλλά και σε παραγωγικό περιβάλλον από WSGI deployments.
id: Itu digunakan kedua oleh peladen pengembangan Django dan dalam produksi penyebaran WSGI.

source: WSGI servers obtain the path to the ``application`` callable from their configuration. Django's built-in server, namely the :djadmin:`runserver` command, read it from the :setting:`WSGI_APPLICATION` setting. By default, it's set to ``<project_name>.wsgi.application``, which points to the ``application`` callable in :file:`<project_name>/wsgi.py`.
id: Peladen WSGI mendapatkan jalur ke ``application`` dapat dipanggil dari konfigurasi mereka. Peladen siap pakai Django, dinamakan perintah :djadmin:`runserver`, membacanya dari pengaturan :setting:`WSGI_APPLICATION`. Secara awal, dia disetel ke ``<project_name>.wsgi.application``, yang menunjuk ke ``application`` yang dapat dipanggil dalam :file:`<project_name>/wsgi.py`.

source: Configuring the settings module
el: Παραμετροποιώντας το module των ρυθμίσεων
id: Konfigurasi modul pengaturan

source: When the WSGI server loads your application, Django needs to import the settings module — that's where your entire application is defined.
el: Όταν ο WSGI server φορτώσει την εφαρμογή σας, το Django χρειάζεται να κάνει import το module των γενικών ρυθμίσεων σας — εκεί είναι το μέρος όπου ορίζεται ολόκληρη η εφαρμογή σας.
id: Ketika peladen WSGI memuat aplikasi anda, Django butuh mengimpor modul pengaturan -- itu dimana aplikasi keseluruhan anda ditentukan.

source: Django uses the :envvar:`DJANGO_SETTINGS_MODULE` environment variable to locate the appropriate settings module. It must contain the dotted path to the settings module. You can use a different value for development and production; it all depends on how you organize your settings.
el: Το Django χρησιμοποιεί την environment variable :envvar:`DJANGO_SETTINGS_MODULE` για να εντοπίσει το κατάλληλο module ρυθμίσεων. Η τιμή αυτή πρέπει να περιέχει το μονοπάτι για το module των ρυθμίσεων σύμφωνα με τελείες (πχ ``myproject.settings`` και όχι ``myproject/settings.py``). Μπορείτε να χρησιμοποιήσετε διαφορετική τιμή αυτής της μεταβλητής για development και production περιβάλλοντα. Όλα εξαρτώνται από το πως έχετε οργανώσει τις ρυθμίσεις σας.
id: Django menggunakan lingkungan variabel :envvar:`DJANGO_SETTINGS_MODULE` utnuk menempatkan modul pengaturan yang sesuai. Dia harus mengandung jalur titik pada modul pengaturan. Anda dapat menggunakan nilai berbeda untuk pengembangan dan produksi; dia semua tergantung pada bagaimana anda mengorganisasikan pengaturan anda.

source: If this variable isn't set, the default :file:`wsgi.py` sets it to ``mysite.settings``, where ``mysite`` is the name of your project. That's how :djadmin:`runserver` discovers the default settings file by default.
el: Αν αυτή η μεταβλητή δεν έχει οριστεί, το προεπιλεγμένο αρχείο :file:`wsgi.py` τη θέτει στην τιμή ``mysite.settings``, όπου το ``mysite`` είναι το όνομα του project σας. Με αυτό τον τρόπο, από προεπιλογή, η εντολή :djadmin:`runserver` ανακαλύπτει το προεπιλεγμένο αρχείο ρυθμίσεων.
id: Jika variabel ini belum disetel, nilai awal :file:`wsgi.py` disetel ke ``mysite.settings``, dinama ``mysite`` adalah nama dari proyek anda. Itu bagaimana :djadmin:`runserver` menemukan berkas pengaturan awal secara awal.

source: Since environment variables are process-wide, this doesn't work when you run multiple Django sites in the same process. This happens with mod_wsgi.
el: Εφόσον τις environment variables τις βλέπει όλο το σύστημα καθολικώς, αυτή η μέθοδος δεν θα δουλέψει αν έχετε πολλά Django sites μέσα στο ίδιο process. Αυτό συμβαίνει με το mod_wsgi (ένας WSGI server από αρκετούς που είναι διαθέσιμοι).
id: Sejak lingkungan variabel diproses luas, ini tidak bekerja ketika anda menjalankan banyak situs Django dalam pengolahan yang sama. Ini terjadi dengan mod_wsgi.

source: To avoid this problem, use mod_wsgi's daemon mode with each site in its own daemon process, or override the value from the environment by enforcing ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` in your :file:`wsgi.py`.
el: Για να αποφύγετε τέτοιου είδους προβλήματα, χρησιμοποιήστε το mod_wsgi σε daemon mode με κάθε site σε δικό του daemon process ή παρακάμψτε (override) την τιμή από το environment θέτοντας μια διαφορετική, ως ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` μέσα στο αρχείο :file:`wsgi.py`.
id: Untuk menghindari masalah ini, gunakan suasana daemon wsgi dengan setiap situs di pengolahan daemon itu sendiri, atau kesampingkan nilai dari lingkungan dengan memaksa ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` dalam :file:`wsgi.py` anda.

source: Applying WSGI middleware
el: Εφαρμόζοντας ένα WSGI middleware
id: Memberlakukan middleware WSGI

source: To apply `WSGI middleware`_ you can simply wrap the application object. For instance you could add these lines at the bottom of :file:`wsgi.py`::
el: Για να εφαρμόσετε ένα `WSGI middleware`_ μπορείτε, απλώς, να κάνετε wrap το application object. Για παράδειγμα, θα μπορούσατε να προσθέσετε αυτές τις γραμμές στο τέλος του αρχείου :file:`wsgi.py`::
id: Untuk meberlakukan `WSGI middleware`_ anda dapat dengan mudah membungkus obyek aplikasi. Sebagai contoh anda dapat menambah baris-baris ini pada bagian bawah dari :file:`wsgi.py`::

source: You could also replace the Django WSGI application with a custom WSGI application that later delegates to the Django WSGI application, if you want to combine a Django application with a WSGI application of another framework.
el: Μπορείτε επίσης να αντικαταστήσετε το Django WSGI application με ένα δικό σας WSGI application που το τελευταίο θα ανατεθεί στο Django WSGI application, αν θέλετε να συνδυάσετε μια Django εφαρμογή με μια WSGI εφαρμογή από ένα άλλο framework.
id: Anda juga dapar mengganti aplikasi WSGI Django dengan penyesuaian aplikasi WSGI yang diutuskan kemudian pada aplikasi WSGI Django, jika anda ingin menggabungkan aplikasi Django dengan aplikasi WSGI dari kerangka lain.

source: Some third-party WSGI middleware do not call ``close`` on the response object after handling a request. In those cases the :data:`~django.core.signals.request_finished` signal isn't sent. This can result in idle connections to database and memcache servers.
el: Μερικά τρίτα WSGI middleware δεν καλούν τη μέθοδο ``close`` στο response object αφού έχουν τελειώσει με το request. Σε αυτές τις περιπτώσεις το σήμα :data:`~django.core.signals.request_finished` δεν στέλνεται. Αυτό μπορεί να προκαλέσει αδρανείς συνδέσεις (idle connections) στη βάση δεδομένων και στους memcache servers.
id: Beberapa middleware WSGI pihak-ketiga tidak memanggil ``close`` pada obyek tanggapan setelah menangani sebuah permintaan. Dalam kasus tersebut sinyal :data:`~django.core.signals.request_finished` tidak dikirim. Ini dapat dihasilkan di hubungan diam ke basisdata dan peladen memcache.

source: How to use Django with Apache and ``mod_wsgi``
el: Πως να χρησιμοποιήσετε το Django με τον Apache και το ``mod_wsgi``
id: Bagaimana menggunakan Django dengan Apache dan ``mod_wsgi``

source: Deploying Django with Apache_ and `mod_wsgi`_ is a tried and tested way to get Django into production.
el: Το να ανεβάσετε το Django site σας (deploying) στην παραγωγή (production) χρησιμοποιώντας τον Apache_ Web server και το `mod_wsgi`_ είναι μια δοκιμασμένη και πετυχημένη μέθοδος.
id: Menyebarkan Django dengan Apache_ dan ``mod_wsgi`_ adalah jalan percobaan dan pengujian utnuk mendapatkan Django dalam produksi.

source: mod_wsgi is an Apache module which can host any Python WSGI_ application, including Django. Django will work with any version of Apache which supports mod_wsgi.
el: Το mod_wsgi είναι ένα Apache module το οποίο μπορεί να φιλοξενήσει κάθε Python WSGI_ εφαρμογή, συμπεριλαμβανομένου και του Django. Το Django θα δουλέψει με κάθε έκδοση του Apache που υποστηρίζει το mod_wsgi.
id: mod_wsgi adalah sebuah modul Apache yang dapat merumahkan aplikasi WSGI_Python apapun, termasuk Django. Django akan bekerja dengan versi apapun dari Apache yang mendukung mod_wsgi.

source: The `official mod_wsgi documentation`_ is fantastic; it's your source for all the details about how to use mod_wsgi. You'll probably want to start with the `installation and configuration documentation`_.
el: Το `official mod_wsgi documentation`_ είναι φανταστικό. Είναι η πηγή για όλες τις λεπτομέρειες σχετικά με τη χρήση του mod_wsgi. Το πιο πιθανό είναι να ξεκινήσετε με το `installation and configuration documentation`_.
id: `official mod_wsgi documentation`_ adalah hebat; itu adalah sumber untuk semua rincian tentang bagaimana menggunakan mod_wsgi. Anda akan mungkin ingin memulai dengan `installation and configuration documentation`_.

source: Basic configuration
el: Βασική παραμετροποίηση
id: Konfigurasi dasar

source: Once you've got mod_wsgi installed and activated, edit your Apache server's `httpd.conf`_ file (or a `virtual host`_ file) and add the following. If you are using a version of Apache older than 2.4, replace ``Require all granted`` with ``Allow from all`` and also add the line ``Order deny,allow`` above it.
id: Sekali anda telah mendapatkan mod_wsgi terpasang dan aktif, sunting berkas `httpd.conf`_ peladen Apache (atau berkas `virtual host`_) dan tambah berikut. Jika anda menggunakan versi Apache lebih lama dari 1.4, ganti ``Require all granted`` dengan ``Allow from all`` dan juga tambah baris ``Order deny,allow`` diatasnya.

source: The first bit in the ``WSGIScriptAlias`` line is the base URL path you want to serve your application at (``/`` indicates the root url), and the second is the location of a "WSGI file" -- see below -- on your system, usually inside of your project package (``mysite`` in this example). This tells Apache to serve any request below the given URL using the WSGI application defined in that file.
el: Η πρώτη παράμετρος στη γραμμή του ``WSGIScriptAlias`` είναι το βασικό URL path που θέλετε να εξυπηρετηθεί η εφαρμογή σας (η κάθετος, ``/``, υποδεικνύει το root url) και η δεύτερη είναι η τοποθεσία που βρίσκεται το "WSGI file" -- δείτε παρακάτω -- στο σύστημα σας, συνήθως μέσα στο φάκελο του project σας (``mysite``, σε αυτό το παράδειγμα). Αυτό λέει στον Apache να εξυπηρετήσει κάθε request κάτω από αυτό το url (αν κατέχετε το url με το όνομα πχ www.mysite.com τότε θα εξυπηρετηθούν όλα τα urls που ξεκινούν με αυτό το όνομα) χρησιμοποιώντας την WSGI εφαρμογή η οποία ορίζεται σε αυτό το αρχείο (``wsgi.py``).
id: Bit pertama dalam baris ``WSGIScriptAlias`` adalah jalur URL dasar anda ingin melayani aplikasi anda pada (``/`` mengindikasikan url akar), dan kedua adalah tempat dari "berkas WSGI" -- lihat dibawa -- pada sistem anda, biasanya didalam paket proyek anda (``mysite`` di contoh ini). Ini memberitahu Apache untuk melayani setiap permintaan dibawah URL yang diberikan menggunakan aplikasi WSGI yang ditentukan dalam berkas itu.

source: The ``WSGIPythonPath`` line ensures that your project package is available for import on the Python path; in other words, that ``import mysite`` works.
el: Η γραμμή ``WSGIPythonPath`` βεβαιώνει ότι το project σας θα είναι διαθέσιμο για να γίνει import στο Python path. Με άλλα λόγια, ότι το ``import mysite`` δουλεύει.
id: Baris ``WSGIPythonPath`` memastikan bahwa paket proyek anda tersedia untuk diimpor pada jalur Python; dengan kata lain, bahwa ``import mysite`` bekerja.

source: The ``<Directory>`` piece just ensures that Apache can access your :file:`wsgi.py` file.
el: Το κομμάτι του ``<Directory>`` απλώς βεβαιώνει ότι ο Apache μπορεί να έχει πρόσβαση στο αρχείο σας :file:`wsgi.py`.
id: Potongan ``<Directory>`` hanya memastikan bahwa Apache dapat mengakses berkas :file:`wsgi.py` anda.

source: Next we'll need to ensure this :file:`wsgi.py` with a WSGI application object exists. As of Django version 1.4, :djadmin:`startproject` will have created one for you; otherwise, you'll need to create it. See the :doc:`WSGI overview documentation</howto/deployment/wsgi/index>` for the default contents you should put in this file, and what else you can add to it.
el: Επόμενο βήμα είναι να σιγουρευτούμε ότι υπάρχει το αρχείο :file:`wsgi.py` με το WSGI application object. Από την έκδοση του Django 1.4 και μετά, η εντολή :djadmin:`startproject` θα δημιουργήσει ένα τέτοιο αρχείο. Αν όχι, θα χρειαστεί να το δημιουργήσετε εσείς. Δείτε στο :doc:`εγχειρίδιο του WSGI </howto/deployment/wsgi/index>` για τα προεπιλεγμένα περιεχόμενα που μπορείτε να βάλτε σε αυτό το αρχείο καθώς και άλλα πράγματα που μπορείτε να προσθέσετε.
id: Selanjutnya kami akan butuh memastikan berkas ini :file:`wsgi.py` dengan obyek aplikasi WSGI ada. Sehingga Django versi 1.4, :djadmin:`startproject` akan membuat satu untuk anda; jika tidak, anda akan butuh membuatnya. Lihat :doc:`Dokumentasi ikhtisar WSGI</howto/deployment/wsgi/index>` untuk isi awal anda harus tempatkan dalam berkas ini, dan apa lagi yang anda dapat tambahkan.

source: If multiple Django sites are run in a single mod_wsgi process, all of them will use the settings of whichever one happens to run first. This can be solved by changing::
el: Αν μια mod_wsgi process τρέχει πολλά Django sites, τότε όλα τα sites θα χρησιμοποιήσουν τις ρυθμίσεις του Django της εφαρμογής που θα τύχει να τρέξει πρώτη. Αυτό το πρόβλημα μπορεί να λυθεί αλλάζοντας το::
id: Jika situs Django banyak berjalan dalam pengolahan mod_wsgi tunggal, semua dari mereka akan menggunakan pengaturan dari manasaja satu terjadi untuk dijalankan pertama kali. Ini dapat diselesaikan dengan merubah::

source: in ``wsgi.py``, to::
el: μέσα στο αρχείο ``wsgi.py``, με το::
id: di ``wsgi.py``, untuk::

source: or by :ref:`using mod_wsgi daemon mode<daemon-mode>` and ensuring that each site runs in its own daemon process.
el: ή :ref:`χρησιμοποιώντας το mod_wsgi daemon mode <daemon-mode>` και βεβαιώνοντας ότι κάθε site τρέχει σε ένα δικό του daemon process.
id: atau dengan :ref:`using mod_wsgi daemon mode<daemon-mode>` dan memastikan bahwa setiap situs berjalan dalam pengolahan daemon nya sendiri.

source: Fixing ``UnicodeEncodeError`` for file uploads
el: Διορθώνοντας το σφάλμα ``UnicodeEncodeError`` για uploads αρχείων
id: Memperbaiki ``UnicodeEncodeError`` untuk mengunggah berkas

source: If you get a ``UnicodeEncodeError`` when uploading files with file names that contain non-ASCII characters, make sure Apache is configured to accept non-ASCII file names::
el: Αν λαμβάνετε το σφάλμα ``UnicodeEncodeError`` όταν ανεβάζετε αρχεία που τα ονόματα τους περιέχουν χαρακτήρες που δεν ανήκουν στον ASCII κώδικα (όπως είναι οι ελληνικοί χαρακτήρες), σιγουρευτείτε ότι ο Apache είναι ρυθμισμένος να δέχεται ονόματα αρχείων με χαρακτήρες που δεν είναι ASCII::
id: Jika anda mendapatkan sebuah `UnicodeEncodeError`` ketika mengunggah berkas-berkas dengan nama berkas yang mengandung karakter bukan ASCII, pastikan Apache dikonfigurasi untuk menerima nama-nama berkas bukan ASCII::

source: A common location to put this configuration is ``/etc/apache2/envvars``.
el: Ένα συνηθισμένο μέρος για να βάλετε τα άνωθεν είναι το ``/etc/apache2/envvars``.
id: Lokasi biasa tempat meletakkan konfigurasi ini di ``/etc/apache2/envvars``.

source: See the :ref:`unicode-files` section of the Unicode reference guide for details.
el: Δείτε στην ενότητα :ref:`Αρχεία <unicode-files>` του Unicode οδηγού για λεπτομέρειες.
id: Lihat bagian :ref:`unicode-files` dari panduan acuan Unicode untuk rincian.
