Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/index.po
Languages: el, es, id, ja, pt_br

source: **The basics:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Shortcuts <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>`
el: **Τα βασικά:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Συντομεύσεις <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>`
es: **Lo básico:** :doc:`URLconfs <topics/http/urls>` | :doc:`Funciones de vista <topics/http/views>` | :doc:`Atajos <topics/http/shortcuts>` | :doc:`Decoradores <topics/http/decorators>`
id: **Dasar:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Shortcuts <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>`
ja: **ビューの基本:** :doc:`URLconf とは <topics/http/urls>` | :doc:`ビュー関数とは <topics/http/views>` | :doc:`便利なショートカット <topics/http/shortcuts>` | :doc:`デコレータ <topics/http/decorators>`
pt_br: **O básico:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Atalhos <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>`

source: **Reference:** :doc:`Built-in Views <ref/views>` | :doc:`Request/response objects <ref/request-response>` | :doc:`TemplateResponse objects <ref/template-response>`
el: **Αναφορά:** :doc:`Built-in Views <ref/views>` | :doc:`Request/response objects <ref/request-response>` | :doc:`TemplateResponse objects <ref/template-response>`
es: **Referencia:** :doc:`Vistas incluidas en Django <ref/views>` | :doc:`Objetos petición/respuesta <ref/request-response>` | :doc:`Objetos TemplateResponse <ref/template-response>`
id: **Acuan:** :doc:`Built-in Views <ref/views>` | :doc:`Request/response objects <ref/request-response>` | :doc:`TemplateResponse objects <ref/template-response>`
ja: **リファレンス:** :doc:`組み込みのビュー <ref/views>` | :doc:`リクエスト/レスポンスオブジェクト <ref/request-response>` | :doc:`テンプレートレスポンスオブジェクト <ref/template-response>`
pt_br: **Referência:** :doc:`Views nativas <ref/views>` | :doc:`Objetos request/response <ref/request-response>` | :doc:`Objetos TemplateResponse <ref/template-response>`

source: **File uploads:** :doc:`Overview <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Managing files <topics/files>` | :doc:`Custom storage <howto/custom-file-storage>`
el: **Ανέβασμα αρχείων:** :doc:`Επισκόπηση <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Διαχειρίζοντας τα αρχεία <topics/files>` | :doc:`Προσαρμοσμένο storage <howto/custom-file-storage>`
es: **Carga de archivos:** :doc:`Visión general <topics/http/file-uploads>` | :doc:`Objetos de archivo <ref/files/file>` | :doc:`API de almacenamiento <ref/files/storage>` | :doc:`Gestión de archivos <topics/files>` | :doc:`Almacenamiento personalizado <howto/custom-file-storage>`
id: **Unggah berkas:** :doc:`Overview <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Managing files <topics/files>` | :doc:`Custom storage <howto/custom-file-storage>`
ja: **ファイルアップロードに対応するには:** :doc:`ファイルアップロード対応の概要 <topics/http/file-uploads>` | :doc:`File オブジェクトリファレンス <ref/files/file>` | :doc:`ストレージ API <ref/files/storage>` | :doc:`ファイルの管理 <topics/files>` | :doc:`ストレージを自作するには <howto/custom-file-storage>`
pt_br: **File uploads:** :doc:`Visão Geral <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Managing files <topics/files>` | :doc:`Custom storage <howto/custom-file-storage>`

source: **Class-based views:** :doc:`Overview <topics/class-based-views/index>` | :doc:`Built-in display views <topics/class-based-views/generic-display>` | :doc:`Built-in editing views <topics/class-based-views/generic-editing>` | :doc:`Using mixins <topics/class-based-views/mixins>` | :doc:`API reference <ref/class-based-views/index>` | :doc:`Flattened index<ref/class-based-views/flattened-index>`
el: **Class-based views:** :doc:`Επισκόπηση <topics/class-based-views/index>` | :doc:`Built-in views για εμφάνιση <topics/class-based-views/generic-display>` | :doc:`Built-in views για επεξεργασία <topics/class-based-views/generic-editing>` | :doc:`Χρησιμοποιώντας mixins <topics/class-based-views/mixins>` | :doc:`Αναφορά του API <ref/class-based-views/index>` | :doc:`Flattened index <ref/class-based-views/flattened-index>`
es: **Vistas basadas en clases:** :doc:`Visión general <topics/class-based-views/index>` | :doc:`Vistas incluidas para visualización <topics/class-based-views/generic-display>` | :doc:`Vistas incluidas para edición <topics/class-based-views/generic-editing>` | :doc:`Usando Mixins <topics/class-based-views/mixins>` | :doc:`Referencia del API <ref/class-based-views/index>` | :doc:`Índice estático <ref/class-based-views/flattened-index>`
id: **Tampilan berbasis-kelas:** :doc:`Overview <topics/class-based-views/index>` | :doc:`Built-in display views <topics/class-based-views/generic-display>` | :doc:`Built-in editing views <topics/class-based-views/generic-editing>` | :doc:`Using mixins <topics/class-based-views/mixins>` | :doc:`API reference <ref/class-based-views/index>` | :doc:`Flattened index<ref/class-based-views/flattened-index>`
ja: **クラスベースビュー:** :doc:`クラスベースビューの概要 <topics/class-based-views/index>` | :doc:`組み込みの表示用ビュー <topics/class-based-views/generic-display>` | :doc:`組み込みの編集用ビュー <topics/class-based-views/generic-editing>` | :doc:`Mixin を使うには <topics/class-based-views/mixins>` | :doc:`API リファレンス <ref/class-based-views/index>` | :doc:`索引<ref/class-based-views/flattened-index>`
pt_br: **Class-based views:** :doc:`Visão Geral <topics/class-based-views/index>` | :doc:`modo interno para views <topics/class-based-views/generic-display>` | :doc:`edição interna para views <topics/class-based-views/generic-editing>` | :doc:`Usando mixins <topics/class-based-views/mixins>` | :doc:`API referência <ref/class-based-views/index>` | :doc:`index plana<ref/class-based-views/flattened-index>`

source: **Advanced:** :doc:`Generating CSV <howto/outputting-csv>` | :doc:`Generating PDF <howto/outputting-pdf>`
el: **Για προχωρημένους:** :doc:`Δημιουργώντας CSV <howto/outputting-csv>` | :doc:`Δημιουργώντας PDF <howto/outputting-pdf>`
es: **Avanzado:** :doc:`Generación de archivos CSV <howto/outputting-csv>` | :doc:`Generación de archivos PDF <howto/outputting-pdf>`
id: **Lanjutan:** :doc:`Generating CSV <howto/outputting-csv>` | :doc:`Generating PDF <howto/outputting-pdf>`
ja: **より高度なビューの話題:** :doc:`CSV を出力するには <howto/outputting-csv>` | :doc:`PDF を出力するには <howto/outputting-pdf>`
pt_br: **Avançado:** :doc:`Gerando CSV <howto/outputting-csv>` | :doc:`Gerando PDF <howto/outputting-pdf>`

source: **Middleware:** :doc:`Overview <topics/http/middleware>` | :doc:`Built-in middleware classes <ref/middleware>`
el: **Middleware:** :doc:`Επισκόπηση <topics/http/middleware>` | :doc:`Built-in middleware classes <ref/middleware>`
es: **Middleware:** :doc:`Visión general <topics/http/middleware>` | :doc:`Clases de Middleware incluidas <ref/middleware>`
ja: **ミドルウェア:** :doc:`ミドルウェアとは <topics/http/middleware>` | :doc:`組み込みのミドルウェアクラス <ref/middleware>`
pt_br: **Middleware:** :doc:`Visão geral <topics/http/middleware>` | :doc:`Classes de Middleware embutidas <ref/middleware>`

source: The template layer
el: Το επίπεδο template
es: La capa de plantilla
id: Lapisan cetakan
ja: テンプレート層
pt_br: A camada de template

source: The template layer provides a designer-friendly syntax for rendering the information to be presented to the user. Learn how this syntax can be used by designers and how it can be extended by programmers:
el: Το επίπεδο template παρέχει ένα φιλικό προς τον designer συντακτικό για να γίνει render η πληροφορία που παρουσιάζεται στον χρήστη. Μάθετε πως αυτό το συντακτικό μπορεί να χρησιμοποιηθεί από τους designers και πως μπορεί να επεκταθεί από τους προγραμματιστές:
es: La capa de plantilla provee una sintaxis amigable para diseñadores que permite mostrar la información que se presentará al usuario. Aprende cómo esta sintaxis puede ser usada por los diseñadores y extendida por los programadores:
id: Lapisan cetakan menyediakan sintaksis ramah-perancang utnuk membangun informasi untuk dibawakan ke pengguna. Pelajari bagaimana sinktaksis ini dapat digunakan oleh perancang dan bagaimana dia dapat diperluas oleh pemrogram.
ja: テンプレート層はユーザに提示される情報の描画を行います。テンプレートはデザイナーに書きやすいものになっています。テンプレートの構文がデザイナーにどのように使われるか、またプログラマーがどのように拡張できるのかを学びましょう:
pt_br: A camada de template fornece uma sintaxe amigável para designers para o processamento de informações a serem apresentadas para o usuário. Aprenda como essa sintaxe pode ser usada por designers e como ela pode ser estendida por programadores:

source: **The basics:** :doc:`Overview <topics/templates>`
el: **Τα βασικά:** :doc:`Επισκόπηση <topics/templates>`
es: **Lo básico:** :doc:`Resumen <topics/templates>`
id: **Dasar:** :doc:`Overview <topics/templates>`
ja: **基本:** :doc: `概要 <topics/templates>`
pt_br: **O basico:** :doc:`Visão geral <topics/templates>`

source: **For designers:** :doc:`Language overview <ref/templates/language>` | :doc:`Built-in tags and filters <ref/templates/builtins>` | :doc:`Humanization <ref/contrib/humanize>`
el: **Για τους designers:** :doc:`Επισκόπηση της γλώσσας <ref/templates/language>` | :doc:`Built-in tags και φίλτρα (filters) <ref/templates/builtins>` | :doc:`Humanization <ref/contrib/humanize>`
es: **Para los diseñadores:**: doc: `información general del lenguaje <ref/templates/language>` | : doc: `Etiquetas y filtros integrados <ref/templates/builtins>` | : doc: `Humanización <ref/contrib/humanize>`
id: **Untuk perancang:** :doc:`Language overview <ref/templates/language>` | :doc:`Built-in tags and filters <ref/templates/builtins>` | :doc:`Humanization <ref/contrib/humanize>`
ja: **デザイナー向けの情報:** :doc:`テンプレートの書き方概要 <ref/templates/language>` | :doc:`組み込みタグとフィルタ <ref/templates/builtins>` | :doc:`人間にやさしい出力生成 <ref/contrib/humanize>`
pt_br: **Para designers:** :doc:`Visão geral da linguagem <ref/templates/language>` | :doc:`Tags e filtros incluídos <ref/templates/builtins>` | :doc:`Humanização <ref/contrib/humanize>`

source: **For programmers:** :doc:`Template API <ref/templates/api>` | :doc:`Custom tags and filters <howto/custom-template-tags>`
el: **Για τους προγραμματιστές:** :doc:`Template API <ref/templates/api>` | :doc:`Προσαρμοσμένα tags και φίλτρα (filters) <howto/custom-template-tags>`
es: **Para programadores:** :doc:`API de las plantillas <ref/templates/api>` | :doc:`Etiquetas y filtros personalizados <howto/custom-template-tags>`
id: **Untuk pemrogram:** :doc:`Template API <ref/templates/api>` | :doc:`Custom tags and filters <howto/custom-template-tags>`
ja: **プログラマー向けの情報:** :doc:`テンプレート API <ref/templates/api>` | :doc:`タグやフィルタを自作するには <howto/custom-template-tags>`
pt_br: **Para programadores:** :doc:`API de Template<ref/templates/api>` | :doc:`Tags e filtros customizados <howto/custom-template-tags>`

source: Forms
el: Φόρμες
es: Formularios
id: Formulir
ja: フォーム
pt_br: Formulários

source: Django provides a rich framework to facilitate the creation of forms and the manipulation of form data.
el: Το Django παρέχει ένα πλούσιο framework για να σας διευκολύνει με την δημιουργία των φορμών και τον χειρισμό των δεδομένων των φορμών (form data).
es: Django provee un poderoso framework para facilitar la creación de formularios y la manipulación de sus datos.
id: Django menyediakan kerangka kaya untuk memfasilitasi pembuatan formulir dan manipulasi data.
ja: Django はフォームの作成とフォームデータの操作を容易にする、多機能フレームワークを提供しています。
pt_br: Django fornece um framework rico para facilitar a criação de formulários de a manipulacação de dados do formulário.

source: **The basics:** :doc:`Overview <topics/forms/index>` | :doc:`Form API <ref/forms/api>` | :doc:`Built-in fields <ref/forms/fields>` | :doc:`Built-in widgets <ref/forms/widgets>`
el: **Τα βασικά:** :doc:`Επισκόπηση <topics/forms/index>` | :doc:`Form API <ref/forms/api>` | :doc:`Built-in πεδία (fields) <ref/forms/fields>` | :doc:`Built-in widgets <ref/forms/widgets>`
es: **Lo básico:** :doc:`Visión general <topics/forms/index>` | :doc:`API de formularios <ref/forms/api>` | :doc:`Campos incluidos <ref/forms/fields>` | :doc:`Widgets incluidos <ref/forms/widgets>`
id: **Dasar** :doc:`Overview <topics/forms/index>` | :doc:`Form API <ref/forms/api>` | :doc:`Built-in fields <ref/forms/fields>` | :doc:`Built-in widgets <ref/forms/widgets>`
ja: **フォームの基礎:** :doc:`フォーム機能の概要 <topics/forms/index>` | :doc:`フォーム API <ref/forms/api>` | :doc:`組み込みフォームフィールドリファレンス <ref/forms/fields>` | :doc:`組み込みウィジェットリファレンス <ref/forms/widgets>`
pt_br: **O básico:** :doc:`Visão geral <topics/forms/index>` | :doc:`Formulário API <ref/forms/api>` | :doc:`Built-in fields <ref/forms/fields>` | :doc:`Widgets embutidos <ref/forms/widgets>`

source: **Advanced:** :doc:`Forms for models <topics/forms/modelforms>` | :doc:`Integrating media <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Customizing validation <ref/forms/validation>`
el: **Για προχωρημένους:** :doc:`Φόρμες για μοντέλα <topics/forms/modelforms>` | :doc:`Ενσωματώνοντας αρχεία πολυμέσων <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Προσαρμοσμένo validation <ref/forms/validation>`
es: **Avanzado:** :doc:`Formularios para modelos <topics/forms/modelforms>` | :doc:`Integración de medios <topics/forms/media>` | :doc:`Juegos de formularios <topics/forms/formsets>` | :doc:`Personalización de la validación <ref/forms/validation>`
id: **Lanjutan:** :doc:`Forms for models <topics/forms/modelforms>` | :doc:`Integrating media <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Customizing validation <ref/forms/validation>`
ja: **高度な話題:** :doc:`モデルに対応したフォームを生成するには <topics/forms/modelforms>` | :doc:`メディアファイルを組み込むには <topics/forms/media>` | :doc:`フォームセットを扱うには <topics/forms/formsets>` | :doc:`バリデータを自作するには <ref/forms/validation>`
pt_br: **Avançado:** :doc:`Forms para models <topics/forms/modelforms>` | :doc:`integrando media <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Customizando a validação <ref/forms/validation>`

source: The development process
el: Η διαδικασία της ανάπτυξης (development proccess)
es: El proceso de desarrollo
id: Pengolahan pengembangan
ja: 開発プロセス
pt_br: O processo de desenvolvimento

source: Learn about the various components and tools to help you in the development and testing of Django applications:
el: Μάθετε για τα διάφορα components και εργαλεία του Django προκειμένου να σας βοηθήσουν στην ανάπτυξη και στο testing της εφαρμογής σας:
es: Aprende sobre los diversos componentes y herramientas para ayudarte en el desarrollo y pruebas de aplicaciones Django:
id: Pelajari tentang beragam komponen dan alat utnuk membantu anda dalam mengembangkan dan mencoba aplikasi Django:
ja: Django アプリケーションの開発とテストに役立つ、さまざまなコンポーネントとツールについて学ましょう:
pt_br: Aprenda sobre os vários componentes e ferramentas para ajudá-lo no desenvolvimento e teste de aplicações Django:

source: **Settings:** :doc:`Overview <topics/settings>` | :doc:`Full list of settings <ref/settings>`
el: **Ρυθμίσεις:** :doc:`Επισκόπηση <topics/settings>` | :doc:`Πλήρης λίστα με τις ρυθμίσεις <ref/settings>`
es: **Ajustes:** :doc:`Visión general <topics/settings>` | :doc:`Lista completa de ajustes <ref/settings>`
id: **Pengaturan:** :doc:`Overview <topics/settings>` | :doc:`Full list of settings <ref/settings>`
ja: **設定:** :doc:`設定ファイルとは <topics/settings>` | :doc:`設定項目リファレンス <ref/settings>`
pt_br: **Configurações:** :doc:`Visão global <topic/settings>` | :doc:`Lista completa de configurações <ref/settings>`

source: **Applications:** :doc:`Overview <ref/applications>`
el: **Εφαρμογές:** :doc:`Επισκόπηση <ref/applications>`
es: **Aplicaciones:** :doc:`Reseña <ref/applications>`
id: **Aplikasi:** :doc:`Overview <ref/applications>`
ja: **アプリケーション:** :doc:`概要 <ref/applications>`
pt_br: **Aplicações:** :doc:`Visão geral <ref/applications>`

source: **Exceptions:** :doc:`Overview <ref/exceptions>`
el: **Exceptions:** :doc:`Επισκόπηση <ref/exceptions>`
es: **Excepciones:** :doc:`Visión general <ref/exceptions>`
id: **Pengecualian:** :doc:`Overview <ref/exceptions>`
ja: **例外:** :doc:`例外の概要 <ref/exceptions>`
pt_br: **Exceções:** :doc:`Visão global <ref/exceptions>`

source: **django-admin and manage.py:** :doc:`Overview <ref/django-admin>` | :doc:`Adding custom commands <howto/custom-management-commands>`
el: **django-admin και manage.py:** :doc:`Επισκόπηση <ref/django-admin>` | :doc:`Προσθέτοντας δικές σας διαχειριστικές εντολές <howto/custom-management-commands>`
es: ** django-admin y manage.py:**: doc: `Información general <ref/django-admin> `| : doc: `Añadiendo comandos personalizados <howto/custom-management-commands> `
id: **django-admin dan manage.py:** :doc:`Overview <ref/django-admin>` | :doc:`Adding custom commands <howto/custom-management-commands>`
ja: **django-admin.py と manage.py:** :doc:`概要 <ref/django-admin>` | :doc:`自作の管理コマンドを追加するには <howto/custom-management-commands>`
pt_br: **django-admin e manage.py:** :doc:`Visão geral <ref/django-admin>` | :doc:`Adicionando comandos personalizados <howto/custom-management-commands>`

source: **Testing:** :doc:`Introduction <topics/testing/index>` | :doc:`Writing and running tests <topics/testing/overview>` | :doc:`Included testing tools <topics/testing/tools>` | :doc:`Advanced topics <topics/testing/advanced>`
el: **Τεστ:** :doc:`Εισαγωγή <topics/testing/index>` | :doc:`Γράφοντας και τρέχοντας τα τεστ <topics/testing/overview>` | :doc:`Συμπεριλαμβανόμενα εργαλεία για τεστ <topics/testing/tools>` | :doc:`Θέματα για προχωρημένους <topics/testing/advanced>`
es: **Pruebas:** :doc:`Introducción <topics/testing/index>` | :doc:`Confección y ejecución de pruebas <topics/testing/overview>` | :doc:`Herramientas de pruebas incluidas <topics/testing/tools>` | :doc:`Temas avanzados <topics/testing/advanced>`
id: **Percobaan:** :doc:`Introduction <topics/testing/index>` | :doc:`Writing and running tests <topics/testing/overview>` | :doc:`Included testing tools <topics/testing/tools>` | :doc:`Advanced topics <topics/testing/advanced>`
ja: **テスト:** :doc:`テストの紹介 <topics/testing/index>` | :doc:`テストの書き方と実行方法 <topics/testing/overview>` | :doc:`テストのツール <topics/testing/tools>` | :doc:`高度な話題 <topics/testing/advanced>`
pt_br: **Testando:** :doc:`Introdução <topics/testing/index>` | :doc:`Escrevendo e rodando testes <topics/testing/overview>` | :doc:`Ferramentas de testes inclusas <topics/testing/tools>` | :doc:`Tópicos avançados <topics/testing/advanced>`

source: **Deployment:** :doc:`Overview <howto/deployment/index>` | :doc:`WSGI servers <howto/deployment/wsgi/index>` | :doc:`Deploying static files <howto/static-files/deployment>` | :doc:`Tracking code errors by email <howto/error-reporting>`
el: **Deployment:** :doc:`Επισκόπηση <howto/deployment/index>` | :doc:`WSGI servers <howto/deployment/wsgi/index>` | :doc:`Production server και static files <howto/static-files/deployment>` | :doc:`Αναφορά σφάλματος μέσω email <howto/error-reporting>`
es: **Implementación:**: doc: `Información general <howto/deployment/index>` | : doc: `Servidores WSGI <howto/deployment/wsgi/index>` | : doc: `Implementando archivos estáticos <howto/static-files/deployment>` | : doc: `Rastreando errores de código por correo electrónico<howto/er ror-reporting>`
id: **Penyebaran:** :doc:`Overview <howto/deployment/index>` | :doc:`WSGI servers <howto/deployment/wsgi/index>` | :doc:`Deploying static files <howto/static-files/deployment>` | :doc:`Tracking code errors by email <howto/error-reporting>`
ja: **デプロイ:** :doc:`デプロイの概要 <howto/deployment/index>` | :doc:`WSGI サーバ <howto/deployment/wsgi/index>` | :doc:`静的ファイルのデプロイ <howto/static-files/deployment>` | :doc:`エラーの発生をメールで追跡するには <howto/error-reporting>`
pt_br: **Implantação:** :doc:`Visão Geral <howto/deployment/index>` | :doc:`Servidores WSGI <howto/deployment/wsgi/index>` | :doc:`Implantando arquivos estáticos <howto/static-files/deployment>` | :doc:`Reportando códigos de erros por e-mail <howto/error-reporting>`

source: The admin
el: Το site διαχείρισης
es: La administración
id: Admin
ja: 管理インタフェース
pt_br: O Admin

source: Find all you need to know about the automated admin interface, one of Django's most popular features:
el: Βρείτε όλα όσα θα θέλατε να μάθετε σχετικά με το αυτοματοποιημένο διαχειριστικό site του Django, ένα από τα πιο δημοφιλή features του Django:
es: Encuentre todo lo que necesita saber acerca de la interfaz automatizada de administración, uno de las características más populares de Django:
id: Temukan semua anda butuhkan untuk mengetahui tentang otomatisasi antarmuka admin, satu dari fitur paling terkenal Django:
ja: Django の目玉機能の一つである、自動生成の管理インタフェースのすべてを学べます:
pt_br: Encontre tudo o que você precisa para conhecer sobre a interface automatizada de administração, uma das funcionalidades mais popular do Django:

source: :doc:`Admin site <ref/contrib/admin/index>`
el: :doc:`Το site διαχείρισης <ref/contrib/admin/index>`
es: :doc:`Sitio de administración <ref/contrib/admin/index>`
ja: :doc:`管理サイト <ref/contrib/admin/index>`
pt_br: :doc:`Site Admin <ref/contrib/admin/index>`

source: :doc:`Admin actions <ref/contrib/admin/actions>`
el: :doc:`Ενέργειες (actions) admin <ref/contrib/admin/actions>`
es: :doc:`Acciones de administración <ref/contrib/admin/actions>`
ja: :doc:`管理アクションを組み込むには <ref/contrib/admin/actions>`
pt_br: :doc:`Ações do Admin <ref/contrib/admin/actions>`

source: :doc:`Admin documentation generator<ref/contrib/admin/admindocs>`
el: :doc:`Γεννήτρια documentation του admin <ref/contrib/admin/admindocs>`
es: :doc:`Generador de documentación de la administración <ref/contrib/admin/admindocs>`
ja: :doc:`管理サイトのドキュメントを生成する<ref/contrib/admin/admindocs>`
pt_br: :doc:`Gerador de documentação do Admin<ref/contrib/admin/admindocs>`

source: Security
el: Ασφάλεια
es: Seguridad
id: Keamanan
ja: セキュリティ
pt_br: Segurança

source: Security is a topic of paramount importance in the development of Web applications and Django provides multiple protection tools and mechanisms:
el: Η ασφάλεια είναι ένα θέμα υψίστης σημασίας στην ανάπτυξη των Web εφαρμογών. Το Django παρέχει πολλαπλά προστατευτικά εργαλεία και μηχανισμούς:
es: La seguridad es un tema de suma importancia en el desarrollo de aplicaciones Web y Django provee múltiples herramientas y mecanismos de protección:
id: Keamanan adalah sebuah topik dari sangat penting dalam pengembangan aplikasi jaringan dan Django menyediakan banyak alat perlindungan dan mekanisme:
ja: セキュリティは Web アプリケーションを開発するなかで最も重要なトピックです。 Django は複数のプロテクションツールとメカニズムを提供しています:
pt_br: Segurança é um tema de suma importância para o desenvolvimento de aplicações Web e Django fornece várias ferramentas e mecanismos de proteção:

source: :doc:`Security overview <topics/security>`
el: :doc:`Επισκόπηση ασφάλειας <topics/security>`
es: :doc:`Visión general de la seguridad <topics/security>`
ja: :doc:`セキュリティの概要 <topics/security>`
pt_br: :doc:`Visão geral sobre segurança <topics/security>`

source: :doc:`Disclosed security issues in Django <releases/security>`
el: :doc:`Αποκαλυφθέντα θέματα ασφαλείας στο Django <releases/security>`
es: :doc:`Problemas de seguridad en Django revelados <releases/security>`
ja: :doc:`Django のセキュリティ問題についてはこちらを参照 <releases/security>`
pt_br: :doc:`Questões de segurança divulgadas no Django <releases/security>`

source: :doc:`Clickjacking protection <ref/clickjacking>`
el: :doc:`Προστασία από clickjacking <ref/clickjacking>`
es: :doc:`Protección contra Clickjacking <ref/clickjacking>`
ja: :doc:`クリックジャッキング対策 <ref/clickjacking>`
pt_br: :doc:`Proteção Clickjacking <ref/clickjacking>`
