Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/index.po
Languages: el, es, id, ja, pt_br

source: :doc:`Cross Site Request Forgery protection <ref/csrf>`
el: :doc:`Προστασία από Cross Site Request Forgery <ref/csrf>`
es: : doc: `Protección de falsificación de petición en Sitios Cruzados <ref/csrf> `
ja: :doc:`Cross Site Request Forgery 対策 <ref/csrf>`
pt_br: :doc:`Proteção contra Cross Site Request Forgery <ref/csrf>`

source: :doc:`Cryptographic signing <topics/signing>`
es: :doc:`Firma criptográfica <topics/signing>`
ja: :doc:`暗号による署名 <topics/signing>`
pt_br: :doc:`Assinatura criptográfica <topics/signing>`

source: :ref:`Security Middleware <security-middleware>`
es: :ref:`Software intermediario para seguridad <security-middleware>`
ja: :ref:`ミドルウェアのセキュリティ <security-middleware>`
pt_br: :ref:`Middleware de segurança <security-middleware>`

source: Internationalization and localization
el: Internationalization και localization
es: Internacionalización y localización
id: Internasionalisasi dan lokalisasi
ja: 国際化と局地化
pt_br: Internacionalização e localização

source: Django offers a robust internationalization and localization framework to assist you in the development of applications for multiple languages and world regions:
el: Το Django προσφέρει ένα ισχυρό και σταθερό framework όσον αφορά το internationalization και το localization προκειμένου να σας βοηθήσει στην ανάπτυξη εφαρμογών σε πολλές γλώσσες και περιοχές ανά τον κόσμο:
es: Django ofrece un robusto framework de internacionalización y localización para ayudarte en el desarrollo de aplicaciones para múltiples idiomas y regiones del mundo:
id: Django menawarkan kerangka internasionalisasi dan lokalisasi yang kuat untuk memandu anda dalam mengembangkan aplikasi untuk banyak bahasa dan wilayah dunia:
ja: Django は堅牢な国際化 (internationalization) 、ローカライズ (localization) フレームワークを提供しています。多言語、世界の各地域に対応したアプリケーションを開発する助けになります:
pt_br: Django oferece um robusto framework para internacionalização e localização para a auxiliá-lo no desenvolvimento de aplicações para vários idiomas e regiões do mundo:

source: :doc:`Overview <topics/i18n/index>` | :doc:`Internationalization <topics/i18n/translation>` | :ref:`Localization <how-to-create-language-files>` | :doc:`Localized Web UI formatting and form input <topics/i18n/formatting>`
el: :doc:`Επισκόπηση <topics/i18n/index>` | :doc:`Internationalization <topics/i18n/translation>` | :ref:`Localization <how-to-create-language-files>` | :doc:`Localized Web UI formatting και form input <topics/i18n/formatting>`
es: :doc:`Reseña <topics/i18n/index>` | :doc:`Internacionalización <topics/i18n/translation>` | :ref:`Localización <how-to-create-language-files>` | :doc:`Localización del formateo de interfaz de usuario Web y formulario de entrada <topics/i18n/formatting>`
ja: :doc:`概要 <topics/i18n/index>` | :doc:`国際化 <topics/i18n/translation>` | :ref:`地域化 <how-to-create-language-files>` | :doc:`地域化されたUIフォーマットとフォームインプット <topics/i18n/formatting>`
pt_br: :doc:`Visão geral <topics/i18n/index>` | :doc:`Internacionalização <topics/i18n/translation>` | :ref:`Localização <how-to-create-language-files>` | :doc:`Formatação de UI Web localizada e entrada de formulário <topics/i18n/formatting>`

source: :doc:`Time zones </topics/i18n/timezones>`
el: :doc:`Ζώνες ώρας (time zones) </topics/i18n/timezones>`
es: :doc:`Husos horarios </topics/i18n/timezones>`
ja: :doc:`タイムゾーン </topics/i18n/timezones>`
pt_br: :doc:`Fusos horários </topics/i18n/timezones>`

source: Performance and optimization
el: Απόδοση και βελτιστοποίηση
es: Rendimiento y optimización
id: Penampilan dan optimalisasi
ja: パフォーマンスと最適化
pt_br: Performance e otimização

source: There are a variety of techniques and tools that can help get your code running more efficiently - faster, and using fewer system resources.
el: Υπάρχουν πολλές τεχνικές και εργαλεία που μπορούν να σας βοηθήσουν στο να κάνετε τον κώδικα σας πιο αποτελεσματικό και γρήγορο, χρησιμοποιώντας λιγότερους πόρους από το σύστημα σας.
es: Existe una variedad de técnicas y herramientas que lo pueden ayudar a ejecutar el código más eficientemente y con menos uso de recursos del sistema.
id: Terdapat beragam teknik dan alat yang dapat membantu mendapatkan kode anda berjalan efesien - cepat, dan menggunakan sedikit sumberdaya sistem.
ja: ソースコードをより短く、さらに効率的かつ高速に実行するのを助けてくれる、様々な技術とツールが存在します。
pt_br: Há uma variedade de técnicas e ferramentas que podem ajudar a fazer com que o seu código execute com mais eficiência - mais rápido e usando menos recursos do sistema.

source: :doc:`Performance and optimization overview <topics/performance>`
el: :doc:`Επισκόπηση απόδοσης και βελτιστοποίησης <topics/performance>`
es: :doc:`Reseña sobre rendimiento y optimización <topics/performance>`
ja: :doc:`パフォーマンスと最適化の概要 <topics/performance>`
pt_br: :doc:`Visão geral do desempenho e otimização <topics/performance>`

source: Python compatibility
el: Συμβατότητα Python
es: Compatibilidad con Python
id: Kesesuaian Python
ja: 異なる Python への互換性
pt_br: Compatibilidade com o Python

source: Django aims to be compatible with multiple different flavors and versions of Python:
el: Το Django προσπαθεί να είναι συμβατό με πολλές εφαρμογές και εκδόσεις της Python:
es: Django pretende ser compatible con múltiples versiones de Python:
id: Django bertujuan menjadi sesuai dengan banyak perbedaan rasa dan versi dari Phyton:
ja: Django は複数の異なる Python のバージョン、実装に互換性があります:
pt_br: Django pretente ser compatível com vários sabores e versões diferentes do Python:

source: :doc:`Jython support <howto/jython>`
el: :doc:`Υποστήριξη Jython <howto/jython>`
es: :doc:`Soporte para Jython <howto/jython>`
ja: Jython で動かす
pt_br: :doc:`Suporte ao Jython <howto/jython>`

source: :doc:`Python 3 compatibility <topics/python3>`
es: :doc:`Compatibilidad con Python 3 <topics/python3>`
ja: Python 3 対応
pt_br: :doc:`Compatibilidade com o Python 3 <topics/python3>`

source: Geographic framework
el: Γεωγραφικό framework
es: Framework geográfico
id: Kerangka geografis
ja: ジオグラフィックフレームワーク
pt_br: Framework geográfico

source: :doc:`GeoDjango <ref/contrib/gis/index>` intends to be a world-class geographic Web framework. Its goal is to make it as easy as possible to build GIS Web applications and harness the power of spatially enabled data.
el: Το :doc:`GeoDjango <ref/contrib/gis/index>` σκοπεύει να γίνει ένα παγκόσμιο γεωγραφικό (geographic) Web framework. Ο στόχος του είναι να κάνει όσο το δυνατόν πιο εύκολη τη συγγραφή GIS Web εφαρμογών και να εκμεταλλευτεί τη δύναμη των χωρικά ενεργοποιημένων δεδομένων (spatially enabled data).
es: :doc:`GeoDjango <ref/contrib/gis/index>` tiene como propósito ser un framework para el desarrollo geográfico de clase mundial. Su meta es hacer lo más fácil posible construir aplicaciones GIS Web y aprovechar el poder de los datos habilitados de forma espacial.
id: :doc:`GeoDjango <ref/contrib/gis/index>` bermaksud menjadi kerangka Jaringan geografis kelas-dunia. Tujuannya adalah membuat dia semudah mungkin membangun aplikasi Jaringan GIS dan memanfaatkan kekuatan dari data spasial diadakan.
ja: :doc:`GeoDjango <ref/contrib/gis/index>` は世界規模のジオグラフィック Web フレームワークを目指しています。 GeoDjango の目的は、地理情報システム (GIS) のWeb アプリケーションの開発をより簡単にし、空間データ (spatially enabled data) を活用することにあります。
pt_br: :doc:`GeoDjango <ref/contrib/gis/index>` pretende ser um Framework web world-class geográfico. O objetivo é torná-lo tão fácil quanto possível para construir aplicações GIS Web e aproveitar o poder da disponibilidade de dados espaciais

source: Common Web application tools
el: Κοινά εργαλεία web application
es: Herramientas comunes para aplicaciones Web
id: Alat aplikasi Jaringan Umum
ja: 一般的な Web アプリケーションツール群
pt_br: Ferramentas genéricas para aplicações Web

source: Django offers multiple tools commonly needed in the development of Web applications:
el: Το Django προσφέρει πολλά εργαλεία τα οποία χρησιμοποιούνται συχνά στην ανάπτυξη Web εφαρμογών:
es: Django ofrece múltiples herramientas que son necesarias para el desarrollo de aplicaciones Web:
id: Django menawarkan alat-alat banyak umumnya dibutuhkan dalam pengembangan aplikasi Jaringan:
ja: Django は Web アプリケーションの開発でいつも必要になるツール群を提供しています:
pt_br: Django oferece várias ferramentas genéricas necessárias para o desenvolvimento de aplicações Web:

source: **Authentication:** :doc:`Overview <topics/auth/index>` | :doc:`Using the authentication system <topics/auth/default>` | :doc:`Password management <topics/auth/passwords>` | :doc:`Customizing authentication <topics/auth/customizing>` | :doc:`API Reference <ref/contrib/auth>`
el: **Authentication:** :doc:`Επισκόπηση <topics/auth/index>` | :doc:`Χρησιμοποιώντας το σύστημα authentication <topics/auth/default>` | :doc:`Διαχείριση password <topics/auth/passwords>` | :doc:`Παραμετροποιώντας το authentication <topics/auth/customizing>` | :doc:`API Reference <ref/contrib/auth>`
es: ** Autenticación:**: doc: `Información general <topics/auth/index> `| : doc: `Usando el sistema de autenticación <topics/auth/default>` | : doc: `Gestión de contraseñas <topics/auth/passwords>` | : doc: `Personalizando la autenticación <topics/auth/customizing>` | : doc: `Referencia de la API <ref/contrib/auth>`
id: **Pembuktian keaslian:** :doc:`Overview <topics/auth/index>` | :doc:`Using the authentication system <topics/auth/default>` | :doc:`Password management <topics/auth/passwords>` | :doc:`Customizing authentication <topics/auth/customizing>` | :doc:`API Reference <ref/contrib/auth>`
ja: **認証:** :doc:`概要 <topics/auth/index>` | :doc:`認証システムを使う <topics/auth/default>` | :doc:`パスワードを管理する <topics/auth/passwords>` | :doc:`認証の処理を自作する <topics/auth/customizing>` | :doc:`API 仕様書 <ref/contrib/auth>`
pt_br: **Autenticação:** :doc:`Visão feral <topics/auth/index>` | :doc:`Usando o sistemas de autenticação <topics/auth/default>` | :doc:`gerenciamento de senhas <topics/auth/passwords>` | :doc:`Autenticação personalizada <topics/auth/customizing>` | :doc:`API de referencia <ref/contrib/auth>`

source: :doc:`Caching <topics/cache>`
es: :doc:`Almacenamiento en caché <topics/cache>`
ja: :doc:`キャッシュシステム <topics/cache>`
pt_br: :doc:`Cacheamento <topics/cache>`

source: :doc:`Logging <topics/logging>`
es: :doc:`Registro de trazas <topics/logging>`
ja: :doc:`ログ出力 <topics/logging>`

source: :doc:`Sending emails <topics/email>`
el: :doc:`Αποστολή emails <topics/email>`
es: :doc:`Enviando correos <topics/email>`
ja: :doc:`メール送信 <topics/email>`
pt_br: :doc:`Enviando emails <topics/email>`

source: :doc:`Syndication feeds (RSS/Atom) <ref/contrib/syndication>`
es: :doc:`Formato de redifusión (RSS/Atom) <ref/contrib/syndication>`
ja: :doc:`配信フィード (RSS/Atom) <ref/contrib/syndication>`
pt_br: :doc:`Feeds (RSS/Atom) <ref/contrib/syndication>`

source: :doc:`Pagination <topics/pagination>`
el: :doc:`Σελιδοποίηση (pagination) <topics/pagination>`
es: :doc:`Paginado <topics/pagination>`
ja: :doc:`ページ分割表示 <topics/pagination>`
pt_br: :doc:`Paginação <topics/pagination>`

source: :doc:`Messages framework <ref/contrib/messages>`
es: :doc:`Framework de mensajes <ref/contrib/messages>`
ja: :doc:`メッセージフレームワーク <ref/contrib/messages>`
pt_br: :doc:`Framework de mensagens <ref/contrib/messages>`

source: :doc:`Serialization <topics/serialization>`
es: :doc:`Serialización <topics/serialization>`
ja: :doc:`データのシリアライズ <topics/serialization>`
pt_br: :doc:`Serialização <topics/serialization>`

source: :doc:`Sessions <topics/http/sessions>`
es: :doc:`Sesiones <topics/http/sessions>`
ja: :doc:`セッションデータの操作 <topics/http/sessions>`
pt_br: :doc:`Sessões <topics/http/sessions>`

source: :doc:`Sitemaps <ref/contrib/sitemaps>`
es: :doc:`Mapas de sitio <ref/contrib/sitemaps>`
ja: :doc:`サイトマップ <ref/contrib/sitemaps>`

source: :doc:`Static files management <ref/contrib/staticfiles>`
el: :doc:`Διαχείριση των στατικών αρχείων <ref/contrib/staticfiles>`
es: :doc:`Gestión de archivos estáticos <ref/contrib/staticfiles>`
ja: :doc:`静的ファイルの扱い方 <ref/contrib/staticfiles>`
pt_br: :doc:`Gerenciamento de arquivos estáticos <ref/contrib/staticfiles>`

source: :doc:`Data validation <ref/validators>`
es: :doc:`Validación de datos <ref/validators>`
ja: :doc:`バリデータ <ref/validators>`
pt_br: :doc:`Validação de dados <ref/validators>`

source: Other core functionalities
el: Άλλες κύριες λειτουργίες
es: Otras funcionalidades básicas
id: Fungsionalitas inti lain
ja: その他のコア機能
pt_br: Outras funcionalidades

source: Learn about some other core functionalities of the Django framework:
el: Μάθετε για άλλες κύριες λειτουργίες του Django framework:
es: Aprende sobre otras funcionalidades básicas del framework Django
id: Pelajari tentang beberapa fungsi inti lainnya dari kerangka Django:
ja: Django フレームワークの、その他の主要機能について学びましょう:
pt_br: Saiba mais sobre algumas outras funcionalidades do núcleo do Django framework:

source: :doc:`Conditional content processing <topics/conditional-view-processing>`
es: :doc:`Procesamiento condicional de contenido <topics/conditional-view-processing>`
ja: :doc:`条件付きコンテンツ処理 <topics/conditional-view-processing>`
pt_br: :doc:`Processamento condicional de conteúdo <topics/conditional-view-processing>`

source: :doc:`Content types and generic relations <ref/contrib/contenttypes>`
el: :doc:`Content types και generic relations <ref/contrib/contenttypes>`
es: :doc:`Tipos de contenido y relaciones genéricas <ref/contrib/contenttypes>`
ja: :doc:`コンテンツタイプと汎用リレーション <ref/contrib/contenttypes>`
pt_br: :doc:`Tipos de conteúdos e relações genéricas <ref/contrib/contenttypes>`

source: :doc:`Flatpages <ref/contrib/flatpages>`
es: :doc:`Páginas estáticas <ref/contrib/flatpages>`
ja: :doc:`flatpages: フラットページコンテンツの管理 <ref/contrib/flatpages>`

source: :doc:`Redirects <ref/contrib/redirects>`
el: :doc:`Ανακατευθύνσεις (redirects) <ref/contrib/redirects>`
es: :doc:`Redirecciones <ref/contrib/redirects>`
ja: :doc:`リクエストのリダイレクト <ref/contrib/redirects>`
pt_br: :doc:`Redirecionamentos <ref/contrib/redirects>`

source: :doc:`Signals <topics/signals>`
es: :doc:`Señales <topics/signals>`
ja: :doc:`イベントのシグナル <topics/signals>`

source: :doc:`System check framework <topics/checks>`
es: :doc:`Framework de comprobación de sistema <topics/checks>`
ja: :doc:`システムチェックフレームワーク <topics/checks>`
pt_br: :doc:`Framework de verificação do sistema <topics/checks>`

source: :doc:`The sites framework <ref/contrib/sites>`
el: :doc:`Το framework sites <ref/contrib/sites>`
es: :doc:`El framework de sitios <ref/contrib/sites>`
ja: :doc:`サイトフレームワーク <ref/contrib/sites>`
pt_br: :doc:`O framework Sites<ref/contrib/sites>`

source: :doc:`Unicode in Django <ref/unicode>`
el: :doc:`Το unicode στο Django <ref/unicode>`
es: :doc:`Unicode en Django <ref/unicode>`
ja: :doc:`Django での Unicode の扱い方 <ref/unicode>`
pt_br: :doc:`Unicode no Django <ref/unicode>`

source: The Django open-source project
el: Το ανοιχτού κώδικα project Django
es: El proyecto de código abierto Django
id: Proyek sumber-terbuka Django
ja: オープンソースプロジェクトとしての Django
pt_br: O projeto de código-aberto Django

source: Learn about the development process for the Django project itself and about how you can contribute:
el: Μάθετε για τη διαδικασία ανάπτυξης του Django project και το πώς μπορείτε να συνεισφέρετε:
es: Aprende sobre el proceso de desarrollo para el proyecto Django en sí y sobre cómo puedes contribuir:
id: Mempelajari bagaimana pengolahan pengembangan untuk proyek Django itu sendiri dan tentang bagaimana anda dapat membantu:
ja: Django プロジェクト自身の開発プロセスと、どのようにプロジェクトに貢献するのかを学びましょう:
pt_br: Saiba mais sobre o processo de desenvolvimento do próprio Django e como você pode contribuir:

source: **Community:** :doc:`How to get involved <internals/contributing/index>` | :doc:`The release process <internals/release-process>` | :doc:`Team organization <internals/organization>` | :doc:`Meet the team <internals/team>` | :doc:`Current roles <internals/roles>` | :doc:`The Django source code repository <internals/git>` | :doc:`Security policies <internals/security>` | :doc:`Mailing lists <internals/mailing-lists>`
es: **Comunidad:** : doc: `Cómo participar <internals/contributing/index>` | : doc: `El proceso de liberación <internals/release-process>` | : doc: `Organización del equipo <internals/organization>` | : doc: `Conozca al equipo <internals/team> `| : doc: ` Actuales funciones <internals/roles>` | : doc: `El repositorio de código fuente de Django <internals/git>`| : doc: `Las políticas de seguridad <internals/security> `| : doc: `Listas de correo <internals/mailing-lists> `
id: **Komunitas:** :doc:`How to get involved <internals/contributing/index>` | :doc:`The release process <internals/release-process>` | :doc:`Team organization <internals/organization>` | :doc:`Meet the team <internals/team>` | :doc:`Current roles <internals/roles>` | :doc:`The Django source code repository <internals/git>` | :doc:`Security policies <internals/security>` | :doc:`Mailing lists <internals/mailing-lists>`
ja: **コミュニティ:** :doc:`参加するには <internals/contributing/index>` | :doc:`リリースプロセス <internals/release-process>` | :doc:`この団体について <internals/organization>` | :doc:`チームに会おう <internals/team>` | :doc:`現在の役割 <internals/roles>` | :doc:`Djangoのソースコードリポジトリ <internals/git>` | :doc:`セキュリティポリシー <internals/security>` | :doc:`メーリングリスト <internals/mailing-lists>`
pt_br: **Comunidade:** :doc:`Como se envolver <internals/contributing/index>` | :doc:`O processo de publicação <internals/release-process>` | :doc:`Organização da equipe <internals/organization>` | :doc:`Encontre a equipe <internals/team>` | :doc:`Regras correntes <internals/roles>` | :doc:`O repositório de código do Django <internals/git>` | :doc:`Políticas de segurança <internals/security>` | :doc:`listas de e-mail <internals/mailing-lists>`

source: **Design philosophies:** :doc:`Overview <misc/design-philosophies>`
el: **Φιλοσοφίες σχεδιασμού κώδικα:** :doc:`Επισκόπηση <misc/design-philosophies>`
es: **Filosofía de diseño:** :doc:`Visión general <misc/design-philosophies>`
id: **Filosofi rancangan:** :doc:`Overview <misc/design-philosophies>`
ja: **設計哲学:** :doc:`概要 <misc/design-philosophies>`
pt_br: **Filosofias de design:** :doc:`Visão geral <misc/design-philosophies>`

source: **Documentation:** :doc:`About this documentation <internals/contributing/writing-documentation>`
el: **Documentation:** :doc:`Σχετικά με αυτό το εγχειρίδιο <internals/contributing/writing-documentation>`
es: **Documentación:** :doc:`Sobre esta documentación <internals/contributing/writing-documentation>`
id: **Dokumentasi:** :doc:`Tentang dokumentasi ini <internals/contributing/writing-documentation>`
ja: **ドキュメントの仕組み:** :doc:`ドキュメントの仕組みと書き方 <internals/contributing/writing-documentation>`
pt_br: **Documentação:** :doc:`Sobre esta documentação <internals/contributing/writing-documentation>`

source: **Third-party distributions:** :doc:`Overview <misc/distributions>`
el: **Διανομές του Django από τρίτους:** :doc:`Επισκόπηση <misc/distributions>`
es: **Distribuciones de terceros:** :doc:`Visión general <misc/distributions>`
id: **Sebaran pihak-ketiga:** :doc:`Overview <misc/distributions>`
ja: **サードパーティが配布している Django:** :doc:`概要と、ディストリビュータへのお願い <misc/distributions>`
pt_br: **Distribuição de terceiros:** :doc:`Visão geral <misc/distributions>`

source: **Django over time:** :doc:`API stability <misc/api-stability>` | :doc:`Release notes and upgrading instructions <releases/index>` | :doc:`Deprecation Timeline <internals/deprecation>`
el: **Το Django μέσα στο πέρασμα του χρόνου:** :doc:`Σταθερότητα του API <misc/api-stability>` | :doc:`Release notes και συμβουλές αναβάθμισης <releases/index>` | :doc:`Χρονοδιάγραμμα των deprecations <internals/deprecation>`
es: **Django en el tiempo:** :doc:`Estabilidad del API <misc/api-stability>` | :doc:`Notas de liberación e instrucciones de actualización <releases/index>` | :doc:`Linea de tiempo de funcionalidades en desuso <internals/deprecation>`
id: **Django berkali-kali:** :doc:`API stability <misc/api-stability>` | :doc:`Release notes and upgrading instructions <releases/index>` | :doc:`Deprecation Timeline <internals/deprecation>`
ja: **Django と長く付き合うために:** :doc:`どの API が安定なのか <misc/api-stability>` | :doc:`リリースノート一覧とアップグレードの手順 <releases/index>` | :doc:`不要な機能の撤廃、削除スケジュール <internals/deprecation>`
pt_br: **Django ao longo do tempo:** :doc:`Estabilidade da AP <misc/api-stability>` | :doc:`Notas de lançamento e instruções de atualização <releases/index>` | :doc:`Cronograma de depreciação <internals/deprecation>`

source: **Models:** :doc:`Introduction to models <topics/db/models>` | :doc:`Field types <ref/models/fields>` | :doc:`Indexes <ref/models/indexes>` | :doc:`Meta options <ref/models/options>` | :doc:`Model class <ref/models/class>`
el: **Μοντέλα:** :doc:`Εισαγωγή στα μοντέλα <topics/db/models>` | :doc:`Τύποι πεδίων <ref/models/fields>` | :doc:`Ευρετήρια (indexes) <ref/models/indexes>` | :doc:`Επιλογές Meta <ref/models/options>` | :doc:`Η κλάση Model <ref/models/class>`

source: **Advanced:** :doc:`Managers <topics/db/managers>` | :doc:`Raw SQL <topics/db/sql>` | :doc:`Transactions <topics/db/transactions>` | :doc:`Aggregation <topics/db/aggregation>` | :doc:`Search <topics/db/search>` | :doc:`Custom fields <howto/custom-model-fields>` | :doc:`Multiple databases <topics/db/multi-db>` | :doc:`Custom lookups <howto/custom-lookups>` | :doc:`Query Expressions <ref/models/expressions>` | :doc:`Conditional Expressions <ref/models/conditional-expressions>` | :doc:`Database Functions <ref/models/database-functions>`
el: **Για προχωρημένους:** :doc:`Managers <topics/db/managers>` | :doc:`Raw SQL <topics/db/sql>` | :doc:`Transactions <topics/db/transactions>` | :doc:`Aggregation <topics/db/aggregation>` | :doc:`Εύρεση <topics/db/search>` | :doc:`Προσαρμοσμένα πεδία (fields) μοντέλων <howto/custom-model-fields>` | :doc:`Πολλαπλές βάσεις δεδομένων <topics/db/multi-db>` | :doc:`Προσαρμοσμένα lookups <howto/custom-lookups>` | :doc:`Query Expressions <ref/models/expressions>` | :doc:`Conditional Expressions <ref/models/conditional-expressions>` | :doc:`Συναρτήσεις βάσης δεδομένων <ref/models/database-functions>`

source: **Community:** :doc:`How to get involved <internals/contributing/index>` | :doc:`The release process <internals/release-process>` | :doc:`Team organization <internals/organization>` | :doc:`The Django source code repository <internals/git>` | :doc:`Security policies <internals/security>` | :doc:`Mailing lists <internals/mailing-lists>`
el: **Κοινότητα:** :doc:`Πώς να συμμετάσχετε <internals/contributing/index>` | :doc:`Η διαδικασία της κυκλοφορίας εκδόσεων <internals/release-process>` | :doc:`Οργάνωση ομάδων <internals/organization>` | :doc:`Το repository του πηγαίου κώδικα του Django <internals/git>` | :doc:`Πολιτικές ασφαλείας <internals/security>` | :doc:`Mailing lists <internals/mailing-lists>`
