Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/index.po
Languages: el, es, id, ja, pt_br

source: Django documentation
el: Εγχειρίδιο Django
es: Documentación de Django
id: Dokumentasi Django
ja: Django ドキュメント
pt_br: Documentação do Django

source: Everything you need to know about Django.
el: Όλα όσα χρειάζεται να ξέρετε για το Django.
es: Todo lo que necesitas saber sobre Django.
id: Apapun yang perlu anda tahu mengenai Django.
ja: Django を使いこなすための全てがここにあります。
pt_br: Tudo o que você precisa saber sobre Django.

source: Getting help
el: Μέρη για βοήθεια
es: Obteniendo ayuda
id: Mendapatkan bantuan
ja: 助けを求める
pt_br: Obtendo ajuda

source: Having trouble? We'd like to help!
el: Έχετε κάποιο πρόβλημα; Θα χαρούμε να σας βοηθήσουμε!
es: ¿Tienes algún problema? ¡Nos gustaría ayudar!
id: Mengalami masalah? Kami senang membantu!
ja: 困り事ですか？手を貸しましょう！
pt_br: Está com problemas? Nós gostaríamos de ajudar!

source: Try the :doc:`FAQ <faq/index>` -- it's got answers to many common questions.
el: Δοκιμάστε το άρθρο :doc:`Συχνές ερωτήσεις (FAQ) <faq/index>` -- έχει τις απαντήσεις στις πιο συνηθισμένες ερωτήσεις.
es: Prueba con las :doc:`Preguntas Frecuentes <faq/index>` -- contienen las respuestas a muchas preguntas comunes.
id: Coba :doc:`FAQ <faq/index>` -- dia mempunyai jawaban ke banyak pertanyaan umum.
ja: * :doc:`FAQ <faq/index>` を探しましょう。よくある質問への答えなら、ここで見つかります。
pt_br: Tente o :doc:`FAQ <faq/index>` -- para obter respostas para muitas perguntas comuns.

source: Looking for specific information? Try the :ref:`genindex`, :ref:`modindex` or the :doc:`detailed table of contents <contents>`.
el: Μήπως ψάχνετε κάτι συγκεκριμένο; Δείτε στα :ref:`Περιεχόμενα <genindex>`, στο :ref:`modindex` ή στον :doc:`αναλυτικό πίνακα περιεχομένων <contents>`.
es: ¿Buscas información específica? Intenta con :ref:`genindex`, :ref:`modindex` o la :doc:`tabla de contenidos detallada <contents>`.
id: Mencari informasi spesifik? Coba:ref:`genindex`, :ref:`modindex` atau the :doc:`detailed table of contents <contents>`.
ja: * 特定のトピックについて情報を探しているなら、 :doc:`genindex` や :doc:`modindex` 、 :doc:`内容の詳細な表 <contents>` を見てください。
pt_br: Procurando por alguma informação específica? Tente o :ref:`genindex`, :ref:`modindex` ou the :doc:`tabela detalhada de conteúdos <contents>`.

source: Search for information in the archives of the |django-users| mailing list, or `post a question`_.
el: Μπορείτε να ψάξετε για πληροφορίες στα αρχεία του mailing list των |django-users| ή να `ρωτήσετε εκεί`_.
es: Buscar información en los archivos de la lista de correos |django-users|, o `publica una pregunta`_.
id: Mencari untuk informasi di arsip dari daftar penyuratan |django-users|, atau `post a question`_.
ja: |django-users| メーリングリストで検索して調べるか､ `質問を投稿してください`_.
pt_br: Busque informações nos arquivos da lista de e-mails |usuários-django| ou `publique uma pergunta`_.

source: Ask a question in the `#django IRC channel`_, or search the `IRC logs`_ to see if it's been asked before.
el: Εναλλακτικά, μπορείτε να ρωτήσετε στο κανάλι `#django του IRC`_ ή να ψάξετε τα `IRC logs`_ για να δείτε αν ερώτηση σας έχει απαντηθεί στο παρελθόν.
es: Haz una pregunta en el `canal IRC #django`_, o busca en los `registros del IRC`_ para ver si ya la han hecho antes.
id: Tanya pertanyaan di `#django IRC channel`_, atau cari `IRC logs`_ untuk melihat jika itu sudah ditanyakan sebelumnya.
ja: * `IRC の #django チャネル`_ で質問したり、質問する前に `IRC のログ`_ を探したりしてみましょう。
pt_br: Faça uma pergunta no `canal de IRC #django`_, ou procure nos `logs do IRC`_ para ver se esta pergunta já não foi respondida anteriormente.

source: Report bugs with Django in our `ticket tracker`_.
el: Αναφέρετε τυχόν bugs του Django στον `ticket tracker`_.
es: Reporta errores de Django en nuestro `sistema de seguimiento de fallos`_.
id: Laporkan kesalahan dengan Django di `ticket tracker`_ kami.
ja: * Django のバグを見つけたら、 `チケットトラッカ`_ で報告してください。
pt_br: Relate bugs do Django no nosso `ticket tracker`_.

source: How the documentation is organized
el: Πως είναι δομημένο το documentation
id: Bagaimana dokumentasi diatur
ja: ドキュメントの構成
pt_br: Como a documentação é organizada

source: Django has a lot of documentation. A high-level overview of how it's organized will help you know where to look for certain things:
el: Το Django έχει πολύ documentation. Μια επισκόπηση της οργάνωσης του θα σας βοηθήσει να γνωρίζετε πού να ψάξετε για κάτι συγκεκριμένο:
id: Django mempunyai banyak dokumentasi. Ikhstisar tingkat-tinggi dari bagaimana dia disusun akan membantu anda mengetahui dimana mencari untuk hal-hal tertentu:
ja: Django にはたくさんのドキュメントがあります。高い視点から見て、ドキュメントがどのように構成されているかを知っておけば、特定の事柄を見つけやすくなるでしょう。
pt_br: Django tem uma grande quantidade de documentação. Uma visão geral de como ele é organizado vai te ajudar a saber aonde procurar para certas coisas:

source: :doc:`Tutorials </intro/index>` take you by the hand through a series of steps to create a Web application. Start here if you're new to Django or Web application development. Also look at the ":ref:`index-first-steps`" below.
el: Οι :doc:`οδηγοί (tutorials) </intro/index>` μας θα σας οδηγήσουν βήμα-βήμα στη δημιουργία μιας Web εφαρμογής (Web application). Ξεκινήστε από εκεί εάν είστε καινούργιοι στο Django ή στο Web application development. Επίσης ρίξτε μια ματιά στα ":ref:`πρώτα βήματα <index-first-steps>`" πιο κάτω.
id: :doc:`Tutorials </intro/index>` membawa anda dengan tangan melalui rangkaian langkah untuk membuat sebuah aplikasi Jaringan. Mulai disini jika anda baru pada Django atau pengembangan aplikasi Jaringan. Juga lihat pada the ":ref:`index-first-steps`" dibawah ini.
ja: :doc:`チュートリアル </intro/index>` では、一連のステップを通して、実際に手を動かしながら Web アプリケーションを作ります。もし Django や Web アプリケーションの開発が初めてなら、ここから始めてください。また、下の ":ref:`index-first-steps`" のページも読んでみてください。
pt_br: :doc:`Tutoriais</intro/index>` lhe acompanha, através de uma série de passos para criar uma aplicação Web. Comece aqui se você é novo no Django ou no desenvolvimento de aplicações Web. Veja também o ":ref:`index-first-steps`" abaixo.

source: :doc:`Topic guides </topics/index>` discuss key topics and concepts at a fairly high level and provide useful background information and explanation.
el: Το άρθρο :doc:`χρησιμοποιώντας το Django </topics/index>` συζητά επιγραμματικά για βασικά θέματα και έννοιες και παρέχει χρήσιμες πληροφορίες και τεκμηριώσεις.
id: :doc:`Topic guides </topics/index>` mengobrolkan kunci topik dan konsep pada tingkat tinggi dan menyediakan informasi latar belakang berguna dan penjelasan.
ja: :doc:`トピックガイド </topics/index>` では、鍵となるトピックや概念についてかなり高い視点から解説し、役に立つ情報や説明を提供します。
pt_br: :doc:`Guia de tópicos </topics/index>` discute temas-chave e conceitos em um nível relativamente alto, fornece explicaçõesde modo de funcionamento e informações úteis.

source: :doc:`Reference guides </ref/index>` contain technical reference for APIs and other aspects of Django's machinery. They describe how it works and how to use it but assume that you have a basic understanding of key concepts.
el: Οι :doc:`οδηγοί αναφορών </ref/index>` περιέχουν τεχνικές αναφορές για τα API και άλλες πτυχές του μηχανισμού του Django. Περιγράφουν πώς λειτουργεί και πώς να το χρησιμοποιήσετε αλλά προϋποθέτει ότι έχετε γνώση βασικών θεμάτων σχετικά με το Django.
id: :doc:`Reference guides </ref/index>` mengandung acuan teknis untuk API dan aspek lain dari perlengkapan Django. Mereka menggambarkan bagaimana itu bekerja dan bagaimana menggunakannya bahwa anda mempunyai pemahaman dasar dari kunci konsep.
ja: :doc:`リファレンスガイド </ref/index>` には、API や 他の側面から見た Django のしくみに関する技術的なリファレンスがあります。ここでは、Django のしくみとその使い方について説明していますが、鍵となる基本的な概念については理解しているものとして書かれています。
pt_br: :doc:`Guiaa de referências </ref/index>` contém referência técnica para APIs e outros aspectos do maquinário do Django. Eles descrevem como isso funciona e como usá-los, mas assume que você tem um entendimento básico dos conceitos chaves.

source: :doc:`How-to guides </howto/index>` are recipes. They guide you through the steps involved in addressing key problems and use-cases. They are more advanced than tutorials and assume some knowledge of how Django works.
el: Οι :doc:`οδηγοί how-to </howto/index>` είναι συνταγές. Σας καθοδηγούν μέσα από βήματα για την επίλυση κοινών προβλημάτων. Είναι πιο προχωρημένα από τα tutorials και προϋποθέτουν ότι έχετε γνώση του τρόπου λειτουργίας του Django.
id: :doc:`How-to guides </howto/index>` adalah resep-resep. Mereka memandu anda melalui langkah-langkah dalam mengalamatkan kunci masalah dan kasus-penggunaan. Mereka lebih ahli dari pada tutorial dan menganggap beberapa pengetahuan dari bagaimana Django bekerja.
ja: :doc:`How-to ガイド </howto/index>` はレシピ集です。よくある問題やユースケースに対して、どんなステップを踏んで解決すればよいかを説明しています。チュートリアルより発展的な内容で、Django のしくみをある程度は知っているものとして書かれています。
pt_br: :doc:`Guias 'How-to' </howto/index>` são receitas. Eles guiam você através de passos baseados na abordagem de problemas chave e casos de uso. Eles são mais avançados que os tutoriais e assumem que você já tem algum conhecimento de como o Django trabalha.

source: First steps
el: Πρώτα βήματα
es: Primeros pasos
id: Langkah pertama
ja: 最初のステップ
pt_br: Primeiros passos

source: Are you new to Django or to programming? This is the place to start!
el: Είστε καινούργιος στο Django ή στον προγραμματισμό; Αυτό είναι το κατάλληλο μέρος για να αρχίσετε!
es: ¿Eres nuevo con Django o con la programación? ¡Este es el lugar para comenzar!
id: Apakah anda baru ke Django atau ke pemrograman? Ini adalah tempat untuk memulai!
ja: Djangoやプログラミングは初めてですか？ここから始めましょう！
pt_br: Você é novo no Django ou na programação? Este é o lugar para começar!

source: **From scratch:** :doc:`Overview <intro/overview>` | :doc:`Installation <intro/install>`
el: **Από την αρχή:** :doc:`Επισκόπηση <intro/overview>` | :doc:`Εγκατάσταση <intro/install>`
es: **Desde cero:** :doc:`Visión general <intro/overview>` | :doc:`Instalación <intro/install>`
id: **Dari goresan:** :doc:`Overview <intro/overview>` | :doc:`Installation <intro/install>`
ja: **何もないところから始めるなら:** :doc:`概要 <intro/overview>` | :doc:`インストール <intro/install>`
pt_br: **Do início:** :doc:`Visão geral <intro/overview>` | :doc:`Instalação <intro/install>`

source: **Tutorial:** :doc:`Part 1: Requests and responses <intro/tutorial01>` | :doc:`Part 2: Models and the admin site <intro/tutorial02>` | :doc:`Part 3: Views and templates <intro/tutorial03>` | :doc:`Part 4: Forms and generic views <intro/tutorial04>` | :doc:`Part 5: Testing <intro/tutorial05>` | :doc:`Part 6: Static files <intro/tutorial06>` | :doc:`Part 7: Customizing the admin site <intro/tutorial07>`
el: **Οδηγοί:** :doc:`Μέρος 1: Requests και responses <intro/tutorial01>` | :doc:`Μέρος 2: Μοντέλα και το site διαχείρισης <intro/tutorial02>` | :doc:`Μέρος 3: Τα views και τα templates <intro/tutorial03>` | :doc:`Μέρος 4: Φόρμες και τα generic views <intro/tutorial04>` | :doc:`Μέρος 5: Τεστ <intro/tutorial05>` | :doc:`Μέρος 6: Στατικά αρχεία <intro/tutorial06>` | :doc:`Μέρος 7: Παραμετροποιώντας το site διαχείρισης <intro/tutorial07>`
es: ** Tutorial: **: doc: `Parte 1: Peticiones y respuestas <intro/tutorial01>` | : doc: `Parte 2: Modelos y el sitio administrativo <intro/tutorial02>` | : doc: `Parte 3: Vistas y plantillas <intro/tutorial03> `| : doc: `Parte 4: Formularios y vistas genéricas <intro/tutorial04>` | : doc: `Parte 5: Pruebas <intro/tutorial05>` | : doc: `Parte 6: Archivos estáticos <intro/tutorial06>` | : doc: `Parte 7: Personalizando del sitio administrativo <intro/tutorial07>`
ja: **チュートリアルはこちら:** :doc:`その 1: リクエストとレスポンス <intro/tutorial01>` | :doc:`その 2: モデルと管理サイト <intro/tutorial02>` | :doc:`その 3: ビューとテンプレート <intro/tutorial03>` | :doc:`その 4: フォームと汎用ビュー <intro/tutorial04>` | :doc:`その 5: テスト <intro/tutorial05>` | :doc:`その 6: 静的ファイル <intro/tutorial06>` | :doc:`その 7: 管理サイトのカスタマイズ <intro/tutorial07>`
pt_br: **Tutorial:** :doc:`Parte 1: Requisições e respostas <intro/tutorial01>` | :doc:`Parte 2: Modelos e o site Admin <intro/tutorial02>` | :doc:`Parte 3: Views e templates <intro/tutorial03>` | :doc:`Parte 4: Forms e views genéricas <intro/tutorial04>` | :doc:`Parte 5: Testando <intro/tutorial05>` | :doc:`Part e 6: Arquivos estáticos <intro/tutorial06>` | :doc:`Parte 7: Personalizando o site admin <intro/tutorial07>`

source: **Advanced Tutorials:** :doc:`How to write reusable apps <intro/reusable-apps>` | :doc:`Writing your first patch for Django <intro/contributing>`
el: **Οδηγοί για προχωρημένους:** :doc:`Πως να γράψετε επαναχρησιμοποιήσιμα apps <intro/reusable-apps>` | :doc:`Γράφοντας το πρώτο σας patch για το Django <intro/contributing>`
es: **Tutoriales avanzados:** :doc:`¿Cómo escribir aplicaciones reusables <intro/reusable-apps>` | :doc:`Creando tu primer parche para Django <intro/contributing>`
id: **Tutorial lanjut:** :doc:`How to write reusable apps <intro/reusable-apps>` | :doc:`Writing your first patch for Django <intro/contributing>`
ja: **高度なチュートリアル:** :doc:`再利用可能なアプリケーションな書き方 <intra/reusable-apps>' | :doc:`Django へのパッチを初めて書くには <intro/contributing>`
pt_br: **Tutoriais avançados:** :doc:`Como escrever aplicações reutilizáveis <intro/reusable-apps>` | :doc:`Escrevendo seu primeiro patch para o Django <intro/contributing>`

source: The model layer
el: Το επίπεδο του μοντέλου (model layer)
es: La capa del modelo
id: Lapisan model
ja: モデル層
pt_br: A camada de modelo

source: Django provides an abstraction layer (the "models") for structuring and manipulating the data of your Web application. Learn more about it below:
el: Το Django παρέχει ένα αφηρημένο layer (τα μοντέλα -- "models") για τη δόμηση και το χειρισμό των δεδομένων της Web εφαρμογής σας. Μάθετε περισσότερα παρακάτω:
es: Django provee una capa de abstracción (los "modelos") para estructurar y manipular los datos de tu aplicación Web. Aprende más sobre esta a continuación:
id: Django menyediakan lapisan abstraksi ("model") untuk membentuk dan merubah data dari aplikasi Jaringan anda. Pelajari lebih tentang itu dibawah ini:
ja: Django は Web アプリケーションのデータ構造を定義、操作するための抽象レイヤ ("モデル") を提供しています。詳細は以下になります:
pt_br: Django fornece uma camada de abstração (os "modelos") para estruturação e manipulação de dados para a sua aplicação Web. Aprenda mais sobre isso abaixo:

source: **Models:** :doc:`Introduction to models <topics/db/models>` | :doc:`Field types <ref/models/fields>` | :doc:`Meta options <ref/models/options>` | :doc:`Model class <ref/models/class>`
es: ** Modelos:**: doc: `Introducción a los modelos <topics/db/models>` | : doc: `tipos de campo <ref/models/fields> `| : doc: `opciones meta <ref/models/options>` | : doc: `clase de modelos <ref/models/class>`
id: **Model:** :doc:`Introduction to models <topics/db/models>` | :doc:`Field types <ref/models/fields>` | :doc:`Meta options <ref/models/options>` | :doc:`Model class <ref/models/class>`
ja: **モデルとは:** :doc:`モデル の定義方法 <topics/db/models>` | :doc:`フィールド型 <ref/models/fields>` | :doc:`Meta オプション <ref/models/options>` | :doc:`モデルクラス <ref/models/class>`
pt_br: **Modelos:** :doc:`Introdução à modelos <topics/db/models>` | :doc:`Tipos de campos <ref/models/fields>` | :doc:`Opções de Meta <ref/models/options>` | :doc:` Classes de Modelo <ref/models/class>`

source: **QuerySets:** :doc:`Executing queries <topics/db/queries>` | :doc:`QuerySet method reference <ref/models/querysets>` | :doc:`Lookup expressions <ref/models/lookups>`
es: **QuerySets:**: doc: `Ejecutando consultas <topics/db/queries>` | : doc: `referencia de método QuerySet <ref/models/querysets>` | : doc: `expresiones de búsqueda <ref/models/lookups>`
ja: **クエリセットとは:** :doc:`クエリの実行 <topics/db/queries>` | :doc:`QuerySet メソッドリファレンス <ref/models/querysets>` | `doc:` 条件式 <ref/models/lookups>`
pt_br: **QuerySets:** :doc:`Executando consultas <topics/db/queries>` | :doc:`Referência dos métodos de QuerySet <ref/models/querysets>` | :doc:`Expressões de pesquisa <ref/models/lookups>`

source: **Model instances:** :doc:`Instance methods <ref/models/instances>` | :doc:`Accessing related objects <ref/models/relations>`
el: **Model instances:** :doc:`Μέθοδοι του instance <ref/models/instances>` | :doc:`Τρόποι πρόσβασης σε συσχετισμένα objects <ref/models/relations>`
es: **Instancias de modelos:** :doc:`Métodos de las instancias <ref/models/instances>` | :doc:`Accediendo a objetos relacionados <ref/models/relations>`
id: **Contoh Model:** :doc:`Instance methods <ref/models/instances>` | :doc:`Accessing related objects <ref/models/relations>`
ja: **モデルインスタンス詳説:** :doc:`インスタンスメソッド解説 <ref/models/instances>` | :doc:`リレーション先オブジェクトへのアクセス <ref/models/relations>`
pt_br: **Instâncias de modelo:** :doc:`Métodos de instâncias <ref/models/instances>` | :doc:`Acessando objetos relacionados <ref/models/relations>`

source: **Migrations:** :doc:`Introduction to Migrations<topics/migrations>` | :doc:`Operations reference <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc:`Writing migrations <howto/writing-migrations>`
el: **Migrations:** :doc:`Εισαγωγή στα migrations <topics/migrations>` | :doc:`Λειτουργίες των migrations <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc:`Γράφοντας migrations <howto/writing-migrations>`
es: ** Migraciones:**: doc: `Introducción a las migraciones <topics/migrations>` | : doc: `Referencia de operaciones <ref/migration-operations>` | : doc: `El editor de esquemas <ref/schema-editor>` | : doc: `Escribiendo migraciones <howto/writing-migrations> `
id: **Perpindahan:** :doc:`Introduction to Migrations<topics/migrations>` | :doc:`Operations reference <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc:`Writing migrations <howto/writing-migrations>`
ja: **マイグレーションとは:** :doc:`マイグレーションの解説 <topics/migrations>` | :doc:`操作方法リファレンス <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc: `マイグレーションを書くには <howto/writing-migrations>`
pt_br: **Migração:** :doc:`Introdução a Migrações <topics/migrations>` | :doc:`Referência de operação <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc:`Escrevendo migrações <howto/writing-migrations>`

source: **Advanced:** :doc:`Managers <topics/db/managers>` | :doc:`Raw SQL <topics/db/sql>` | :doc:`Transactions <topics/db/transactions>` | :doc:`Aggregation <topics/db/aggregation>` | :doc:`Custom fields <howto/custom-model-fields>` | :doc:`Multiple databases <topics/db/multi-db>` | :doc:`Custom lookups <howto/custom-lookups>` | :doc:`Query Expressions <ref/models/expressions>` | :doc:`Conditional Expressions <ref/models/conditional-expressions>` | :doc:`Database Functions <ref/models/database-functions>`
es: ** Avanzado: **: doc: `Administradores <topics/db/managers> `| : doc: `SQL plano <topics/db/sql> `| : doc: `Transacciones <topics/db/transactions> `| : doc: `Agregación <topics/db/aggregation> `| : doc: `Campos personalizados <howto/custom-model-fields> `| : doc: ` Bases de datos múltiples <topics/db/multi-db> `| : doc: `Búsquedas personalizadas <howto/custom-lookups> `| : doc: `Expresiones de consulta <ref/models/expressions> `| : doc: `Expresiones condicionales <ref/models/conditional-expressions> `| : doc: `Funciones de base de datos <ref/models/database-functions>`
id: **Lanjut:**:doc:`Managers <topics/db/managers>` | :doc:`Raw SQL <topics/db/sql>` | :doc:`Transactions <topics/db/transactions>` | :doc:`Aggregation <topics/db/aggregation>` | :doc:`Custom fields <howto/custom-model-fields>` | :doc:`Multiple databases <topics/db/multi-db>` | :doc:`Custom lookups <howto/custom-lookups>` | :doc:`Query Expressions <ref/models/expressions>` | :doc:`Conditional Expressions <ref/models/conditional-expressions>` | :doc:`Database Functions <ref/models/database-functions>`
ja: **モデルの高度な話題:** :doc:`マネジャ (Manager) <topics/db/managers>` | :doc:`素の SQL を扱うには <topics/db/sql>` | :doc:`トランザクション <topics/db/transactions>` | :doc:`アグリゲーション <topics/db/aggregation>` | :doc:`フィールド型を自作するには <howto/custom-model-fields>` | :doc:`複数データベースを扱うには <topics/db/multi-db>` | :doc:`lookupフィルタを自作するには <howto/custom-lookups>` | :doc: `クエリを書くには <ref/models/expressions>` | :doc:`条件分岐をするには <ref/models/conditional-expressions>` | :doc:`データベースの機能 <ref/models/database-functions>`
pt_br: **Avançado:** :doc:`Managers <topics/db/managers>` | :doc:`Raw SQL <topics/db/sql>` | :doc:`Transações de dados <topics/db/transactions>` | :doc:`Agregação de dados <topics/db/aggregation>` | :doc:`Campos personalizados de modelo <howto/custom-model-fields>` | :doc:`Multiple os bancos de dados <topics/db/multi-db>` | :doc:`Pesquisa customizada <howto/custom-lookups>` | :doc:`Expressões de consulta <ref/models/expressions>` | :doc:`Expressões condicionais <ref/models/conditional-expressions>` | :doc:`Funções de base de dados <ref/models/database-functions>`

source: **Other:** :doc:`Supported databases <ref/databases>` | :doc:`Legacy databases <howto/legacy-databases>` | :doc:`Providing initial data <howto/initial-data>` | :doc:`Optimize database access <topics/db/optimization>` | :doc:`PostgreSQL specific features <ref/contrib/postgres/index>`
el: **Διάφορα:** :doc:`Υποστηριζόμενες βάσεις δεδομένων <ref/databases>` | :doc:`Απαρχαιωμένες βάσεις δεδομένων <howto/legacy-databases>` | :doc:`Παρέχοντας αρχικές τιμές στα μοντέλα σας <howto/initial-data>` | :doc:`Βελτιστοποίηση πρόσβασης στη βάση δεδομένων <topics/db/optimization>` | :doc:`Συγκεκριμένα features για την PostgreSQL <ref/contrib/postgres/index>`
es: ** Otros: **: doc: `bases de datos compatibles <ref/databases> `| : doc: `bases de datos heredadas <howto/legacy-databases> `| : doc: `Proporcionando los datos iniciales <howto/initial-data> `| : doc: `Optimizar el acceso a la base de datos <topics/db/optimization>` | : doc: `características específicas de PostgreSQL <ref/contrib/postgres/index> `
id: **Lainnya:** :doc:`Supported databases <ref/databases>` | :doc:`Legacy databases <howto/legacy-databases>` | :doc:`Providing initial data <howto/initial-data>` | :doc:`Optimize database access <topics/db/optimization>` | :doc:`PostgreSQL specific features <ref/contrib/postgres/index>`
ja: **その他:** :doc:`データベースのサポート状況 <ref/databases>` | :doc:`レガシーなデータベースを扱う <howto/legacy-databases>` | :doc:`初期データを投入するには <howto/initial-data>` | :doc:`データベースアクセスの最適化 <topics/db/optimization>` | :doc:`PostgreSQLの特有の機能を扱うには <ref/contrib/postgres/index>`
pt_br: **Outros:** :doc:`Banco de dados suportados <ref/databases>` | :doc:`Bancos de dados legados <howto/legacy-databases>` | :doc:Provendo dados iniciais <howto/initial-data>` | :doc:`Otimizando acesso ao banco de dados <topics/db/optimization>` | :doc:`Características específicas do PostgreSQL <ref/contrib/postgres/index>`

source: The view layer
el: Το επίπεδο του view
es: La capa de vista
id: Lapisan tampilan
ja: ビュー層
pt_br: A camada de visão

source: Django has the concept of "views" to encapsulate the logic responsible for processing a user's request and for returning the response. Find all you need to know about views via the links below:
el: Το Django έχει την έννοια των "views" για να αναπαραστήσει τη λογική η οποία είναι υπεύθυνη για την επεξεργασία του request του χρήστη και της επιστροφής ενός response. Βρείτε όλα όσα θα θέλατε να μάθετε για τα views παρακάτω:
es: Django tiene el concepto de "vistas" para encapsular la lógica responsable de procesar una petición del usuario y devolver la respuesta. Encuentra todo lo que necesitas saber sobre las vistas a través de los enlaces que siguen:
id: Django mempunyai konsep "tampilan" untuk merangkum tanggung jawab logis untuk mengolah permintaan pengguna dan mengembalikan tanggapan. Temukan semua anda butuhkan untuk mengetahui tentang tampilan melalui tautan dibawah ini:
ja: Django には "ビュー" という概念があります。ビューはユーザーリクエストを処理し、レスポンスを返すロジックをカプセル化したものです。ビューについて知るべきことは、全て以下のリンクにあります:
pt_br: Django tem o conceito de "views" para encapsular a lógica responsável pelo processamento de um request de um usuário e para retornar o response. Encontre tudo que você precisa saber sobre views através dos links abaixo:
