Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: This marks up the following header as the "canonical" target for the setting ``ADMINS``. This means any time I talk about ``ADMINS``, I can reference it using ``:setting:`ADMINS```.
id: Markah ini mengikuti kepala sebagai sasaran "resmi" untuk mengatur ``ADMINS``. Ini berarti tiap waktu Saya berkata tentang ``ADMINS``, Saya dapat menunjukkannya menggunakan ``:setting:`ADMINS```.
pt_br: Isso marca o próximo cabeçalho como o alvo "canônico" para o setting ``ADMINS``. Isto significa que sempre que eu falar sobre ``ADMINS``, eu posso redirecionar para ele usando ``:setting:`ADMINS```.

source: That's basically how everything fits together.
id: Itu adalah secara dasar bagaimana semuanya cocok bersama-sama.
pt_br: Isso é basicamente como tudo se encaixa.

source: Spelling check
id: Pemeriksaan ejaan
pt_br: Verificador ortográfico

source: Before you commit your docs, it's a good idea to run the spelling checker. You'll need to install a couple packages first:
id: Sebelum anda memperbaiki dokumen anda, adalah ide bagus untuk menjalankan pemeriksa ejaan. Anda akan butuh memasang sepasang paket terlebih dahulu:
pt_br: Antes de fazer o commit das suas documentações, é uma boa ideia rodar o verificador ortográfico. Você terá que instalar alguns pacotes primeiro:

source: Then from the ``docs`` directory, run ``make spelling``. Wrong words (if any) along with the file and line number where they occur will be saved to ``_build/spelling/output.txt``.
id: Kemudian dari pelipat ``docs``, jalankan ``make spelling``. Kata-kata salah (jika ada) bersama dengan berkas dan nomor baris dimana mereka muncul akan disimpan ke ``_build/spelling/output.txt``.
pt_br: Depois de instalá-los e de dentro do diretório ``docs``, rode o comando ``make spelling``. Palavras erradas (se existirem) além do arquivo e o número da linha onde eles ocorream serão salvos em ``_build/spelling/output.txt``.

source: If you encounter false-positives (error output that actually is correct), do one of the following:
id: Jika anda menghadapi false-positives (kesalahan keluaran yang sebenarnya benar), lakukan satu dari berikut:
pt_br: Se você encontrar falso-positivos (erros que na verdade estão corretos), faça uma das coisas a seguir:

source: Surround inline code or brand/technology names with grave accents (`).
id: Kelilingi kode berjejer atau nama merek/teknologi dengan aksen kuburan (`).
pt_br: Coloque em volta o código ou nomes de marcas/tecnologias acentos graves (`).

source: Find synonyms that the spell checker recognizes.
id: Temukan kesamaan pengenalan pemeriksa ejaan.
pt_br: Encontre um sinônimo que o verificador ortográfico reconheça.

source: If, and only if, you are sure the word you are using is correct - add it to ``docs/spelling_wordlist`` (please keep the list in alphabetical order).
id: Jika, dan hanya jika, anda yakin kata anda gunakan adalah benar -- tambahkan ke ``docs/spelling_wordlist`` (silahkan simpan daftar dalam urutan alfabet).
pt_br: Se, e somente se, você tiver certeza que a palavra que você está usando está correta - adicione ela em ``docs/spelling_wordlist`` (por favor mantenha a lista em ordem alfabética).

source: Translating documentation
id: menterjemahkan dokumentasi
pt_br: Traduzindo a documentação

source: See :ref:`Localizing the Django documentation <translating-documentation>` if you'd like to help translate the documentation into another language.
id: Lihat :ref:`Localizing the Django documentation <translating-documentation>` jika anda suka membantu menterjemahkan dokumentasi kedalam bahasa lain.
pt_br: Veja :ref:`Localizing the Django documentation <translating-documentation>` Se você quer ajudar a traduzir a documentação para outras linguagens.

source: ``django-admin`` man page
id: Halaman panduan ``django-admin``
pt_br: Página man do ``django-admin``

source: Sphinx can generate a manual page for the :doc:`django-admin </ref/django-admin>` command. This is configured in ``docs/conf.py``. Unlike other documentation output, this man page should be included in the Django repository and the releases as ``docs/man/django-admin.1``. There isn't a need to update this file when updating the documentation, as it's updated once as part of the release process.
id: Sphinx dapat membangkitkan sebuah halaman panduan untuk perintah :doc:`django-admin </ref/django-admin>`. Ini dikonfigurasikan dalam ``docs/conf.py``. Tidak seperti keluaran dokumentasi lainnya, halaman bantuan ini harus disertakan dalam gudang Django dan terbitan sebagai ``docs/man/django-admin.1``. Tidak perlu memperbaharui berkas ini ketika memperbaharui dokumentasi, seperti dia diperbaharui sekali sebagai bagian dari pengolahan terbitan.
pt_br: O Sphinx pode gerar uma página de manual para o comando :doc:`django-admin </ref/django-admin>`. Isso é configurado em ``docs/conf.py``. Diferentemente de outras documentações geradas, essa página man deve ser incluída no repositório do Django e de suas releases em ``docs/man/django-admin.1``. Não existe a necessidade de atualizar esse arquivo quando estiver atualizando a documentação, já que ele é atualizado durante o processo de release.

source: To generate an updated version of the man page, run ``make man`` in the ``docs`` directory. The new man page will be written in ``docs/_build/man/django-admin.1``.
id: Untuk membangkitkan versi terperbaharui dari halaman bantuan, jalankan ``make man`` di pelipat ``docs``. Halaman bantuan baru akan ditulis dalam ``docs/_build/man/django-admin.1``.
pt_br: Para gerar uma versão atualizada da página man, roda o comando ``make man`` dentro do diretório ``docs``. A nova página man será escrita em ``docs/_build/man/django-admin.1``.

source: Django Deprecation Timeline
id: Linimasa Pengusangan Django
pt_br: Linha do tempo de depreciações no Django

source: This document outlines when various pieces of Django will be removed or altered in a backward incompatible way, following their deprecation, as per the :ref:`deprecation policy <internal-release-deprecation-policy>`. More details about each item can often be found in the release notes of two versions prior.
id: Ringkasan dokumen ini ketika beragam potongan Django akan dipindahkan atau diubah dalam cara kesesuaian kebelakang, mengikuti pengusangan mereka, sebagai per :ref:`deprecation policy <internal-release-deprecation-policy>`. Lebih rinci tentang setiap barang dapat sering ditemukan dalam catatan terbitan dari dua versi sebelumnya.
pt_br: Este documento lista quando várias peças do Django serão removidas ou alteradas de modo incompatível com versões anteriores, culminando com a sua depreciação, conforme :ref:`política de depreciação <internal-release-deprecation-policy>`. Mais detalhes sobre cada item geralmente podem ser encontrados nas notas da release de duas versões anteriores.

source: See the :ref:`Django 1.9 release notes<deprecated-features-1.9>` for more details on these changes.
id: Lihat :ref:`Django 1.9 release notes<deprecated-features-1.9>` untuk lebih rinci pada perubahan ini.
pt_br: Veja as :ref:`notas da release do Django 1.9<deprecated-features-1.9>` para mais detalhes sobre essas mudanças.

source: The ``weak`` argument to ``django.dispatch.signals.Signal.disconnect()`` will be removed.
id: Argumen ``weak`` pada ``django.dispatch.signals.Signal.disconnect()`` akan dipindahkan.
pt_br: O argumento ``weak`` de ``django.dispatch.signals.Signal.disconnect()`` será removido.

source: ``django.db.backends.base.BaseDatabaseOperations.check_aggregate_support()`` will be removed.
id: ``django.db.backends.base.BaseDatabaseOperations.check_aggregate_support()`` akan dipindahkan.

source: The ``django.forms.extras`` package will be removed.
id: Paket ``django.forms.extras`` akan dipindahkan.
pt_br: O pacote ``django.forms.extras`` será removido.

source: The ``assignment_tag`` helper will be removed.
id: Pembantu ``assignment_tag`` akan dipindahkan.
pt_br: O helper ``assignment_tag`` será removido.

source: The ``host`` argument to ``assertsRedirects`` will be removed. The compatibility layer which allows absolute URLs to be considered equal to relative ones when the path is identical will also be removed.
id: Argumen ``host`` pada ``assertsRedirects`` akan dipindahkan. Lapisan kesesuaian yang mengizinkan URL mutlak untuk di pertimbangkan sama pada yang relatif ketika jalur sama akan juga dipindahkan.
pt_br: O argumento ``host`` em ``assertsRedirects`` será removido. A camada de compatibilidade que permite que URLs absolutas sejam consideradas iguais as URLs relativas quando o caminho é idêntico também será removido.

source: ``Field.rel`` will be removed.
id: ``Field.rel`` akan dipindahkan.
pt_br: ``Field.rel`` será removido.

source: ``Field.remote_field.to`` attribute will be removed.
id: Atribut ``Field.remote_field.to`` akan dipindahkan.
pt_br: O atributo ``Field.remote_field.to`` será removido.

source: The ``on_delete`` argument for ``ForeignKey`` and ``OneToOneField`` will be required.
id: Argumen ``on_delete`` untuk ``ForeignKey`` dan ``OneToOneField`` akan dibutuhkan.
pt_br: O argumento ``on_delete`` para ``ForeignKey`` e ``OneToOneField`` será requerido.

source: ``django.db.models.fields.add_lazy_relation()`` will be removed.
id: ``django.db.models.fields.add_lazy_relation()`` akan dipindahkan.
pt_br: ``django.db.models.fields.add_lazy_relation()`` será removido.

source: When time zone support is enabled, database backends that don't support time zones won't convert aware datetimes to naive values in UTC anymore when such values are passed as parameters to SQL queries executed outside of the ORM, e.g. with ``cursor.execute()``.
id: Ketika dukungan zona waktu diadakan, backend basisdata yang tidak mendukung zona waktu tidak akan merubah tanggal waktu ke nilai naif dalam UTC lagi ketika nilai-nilai tersebut dilewatkan sebagai parameter pada permintaan SQl dijalankan diluar dari ORM, yaitu dengan ``cursor.execute()``.
pt_br: Quando o suporte a time zone estiver habilitado, backends de banco de dados que não suportam time zones não converterão mais datetimes aware para valores naive em UTC quando esses valores são passados como parâmetros para consultas SQL executadas fora do ORM, ex. com ``cursor.execute()``.

source: The ``django.contrib.auth.tests.utils.skipIfCustomUser()`` decorator will be removed.
id: Penghias ``django.contrib.auth.tests.utils.skipIfCustomUser()`` akan dipindahkan.
pt_br: O decorator ``django.contrib.auth.tests.utils.skipIfCustomUser()`` será removido.

source: The ``GeoManager`` and ``GeoQuerySet`` classes will be removed.
id: Kelas ``GeoManager`` dan ``GeoQuerySet`` akan dipindahkan.
pt_br: As classes ``GeoManager`` e ``GeoQuerySet`` serão removidas.

source: The ``django.contrib.gis.geoip`` module will be removed.
id: Modul ``django.contrib.gis.geoip`` akan dipindahkan.
pt_br: O módulo ``django.contrib.gis.geoip`` será removido.

source: The ``supports_recursion`` check for template loaders will be removed from:
id: Pemeriksaan ``supports_recursion`` untuk pemuat cetakan akan dipindahkan dari:
pt_br: A verificação de ``supports_recursion`` para template loaders será removido de:

source: The ``load_template()`` and ``load_template_sources()`` template loader methods will be removed.
id: Cara pemuat cetakan ``load_template()`` dan ``load_template_sources()`` akan dipindahkan.
pt_br: Os métodos de template loaders ``load_template()`` e ``load_template_sources()`` serão removidos.

source: The ``template_dirs`` argument for template loaders will be removed:
id: Argumen ``template_dirs`` untuk pemuat cetakan akan dipindahkan:
pt_br: O argumento ``template_dirs`` para template loaders será removido.

source: The ``django.template.loaders.base.Loader.__call__()`` method will be removed.
id: Cara `django.template.loaders.base.Loader.__call__()`` akan dipindahkan.
pt_br: O método ``django.template.loaders.base.Loader.__call__()`` será removido.

source: Support for custom error views with a single positional parameter will be dropped.
id: Dukungan untuk tampilan penyesuaian kesalahan dengan parameter penempatan tunggal akan dihilangkan.
pt_br: Suporte para views com erros customizados com um parâmetro posicional será removido.

source: The ``mime_type`` attribute of ``django.utils.feedgenerator.Atom1Feed`` and ``django.utils.feedgenerator.RssFeed`` will be removed in favor of ``content_type``.
id: Atribut ``mime_type`` dari ``django.utils.feedgenerator.Atom1Feed`` dan ``django.utils.feedgenerator.RssFeed`` akan dipindahkan mendukung dari ``content_type``.
pt_br: o atributo ``mime_type`` de ``django.utils.feedgenerator.Atom1Feed`` e ``django.utils.feedgenerator.RssFeed`` será removido para promover ``content_type``.

source: The ``app_name`` argument to :func:`~django.conf.urls.include()` will be removed.
id: Artumen ``app_name`` pada :func:`~django.conf.urls.include()` akan dipindahkan.
pt_br: O argumento ``app_name`` em :func:`~django.conf.urls.include()` será removido.

source: Support for passing a 3-tuple as the first argument to ``include()`` will be removed.
id: Dukungan untuk melewatkan 3-tuple sebagai argumen eprtama untuk ``include()`` akan dipindahkan.
pt_br: Suporte a passagem de tuplas de 3 elementos como primeiro argumento no ``include()`` será removido.

source: Support for setting a URL instance namespace without an application namespace will be removed.
id: Dukungan untuk pengaturan namespace instance URL tanpa sebuah aplikasi namescpae akan dipindahkan.
pt_br: Suporte para setar o namespace de uma instância de URL sem um namespace de aplicação será removido.

source: ``Field._get_val_from_obj()`` will be removed in favor of ``Field.value_from_object()``.
id: ``Field._get_val_from_obj()`` akan dipindahkan mendukung ``Field.value_from_object()``.
pt_br: ``Field._get_val_from_obj()`` será removido para promover ``Field.value_from_object()``.

source: ``django.template.loaders.eggs.Loader`` will be removed.
id: ``django.template.loaders.eggs.Loader`` akan dipindahkan.
pt_br: ``django.template.loaders.eggs.Loader`` será removido.

source: The ``current_app`` parameter to the ``contrib.auth`` views will be removed.
id: Parameter ``current_app`` ke tampilan ``contrib.auth`` akan dipindahkan.
pt_br: O parâmetro ``current_app`` para views ``contrib.auth`` será removido.

source: The ``callable_obj`` keyword argument to ``SimpleTestCase.assertRaisesMessage()`` will be removed.
id: Argumen katakunci ``callable_obj`` pada ``SimpleTestCase.assertRaisesMessage()`` akan dipindahkan.
pt_br: O argumento chave ``callable_obj`` para ``SimpleTestCase.assertRaisesMessage()`` será removido.

source: Support for the ``allow_tags`` attribute on ``ModelAdmin`` methods will be removed.
id: Dukungan untuk atribut ``allow_tags`` pada cara ``ModelAdmin`` akan dipindahkan.
pt_br: Suporte para o atributo ``allow_tags`` em métodos de ``ModelAdmin`` serão removidos.

source: The ``enclosure`` keyword argument to ``SyndicationFeed.add_item()`` will be removed.
id: Argumen katakunci ``enclosure`` pada ``SyndicationFeed.add_item()`` akan dipindahkan.
pt_br: O argumento chave ``enclosure`` em ``SyndicationFeed.add_item()`` será removido.

source: The ``django.template.loader.LoaderOrigin`` and ``django.template.base.StringOrigin`` aliases for ``django.template.base.Origin`` will be removed.
id: Nama lain ``django.template.loader.LoaderOrigin`` dan ``django.template.base.StringOrigin`` untuk ``django.template.base.Origin`` akan dipindahkan.
pt_br: Os aliases de ``django.template.loader.LoaderOrigin`` e ``django.template.base.StringOrigin`` para ``django.template.base.Origin`` serão removidos.

source: See the :ref:`Django 1.10 release notes <deprecated-features-1.10>` for more details on these changes.
id: Lihat :ref:`Django 1.10 release notes <deprecated-features-1.10>` untuk rincian lebih pada perubahan ini.

source: The ``makemigrations --exit`` option will be removed.
id: Pilihan ``makemigrations --exit`` akan dipindahkan.

source: Support for direct assignment to a reverse foreign key or many-to-many relation will be removed.
id: Dukungan untuk penugasan langsung untuk membalikkan foreign key atau hubungan many-to-many akan dipindahkan.

source: The ``get_srid()`` and ``set_srid()`` methods of ``django.contrib.gis.geos.GEOSGeometry`` will be removed.
id: Cara ``get_srid()`` dan ``set_srid()`` dari ``django.contrib.gis.geos.GEOSGeometry`` akan dipindahkan.

source: The ``get_x()``, ``set_x()``, ``get_y()``, ``set_y()``, ``get_z()``, and ``set_z()`` methods of ``django.contrib.gis.geos.Point`` will be removed.
id: Cara ``get_x()``, ``set_x()``, ``get_y()``, ``set_y()``, ``get_z()``, dan ``set_z()`` dari ``django.contrib.gis.geos.Point`` akan dipindahkan.

source: The ``get_coords()`` and ``set_coords()`` methods of ``django.contrib.gis.geos.Point`` will be removed.
id: Cara ``get_coords()`` dan ``set_coords()`` dari ``django.contrib.gis.geos.Point`` akan dipindahkan.

source: The ``cascaded_union`` property of ``django.contrib.gis.geos.MultiPolygon`` will be removed.
id: ``cascaded_union`` milik dari ``django.contrib.gis.geos.MultiPolygon`` akan dipindahkan.

source: ``django.utils.functional.allow_lazy()`` will be removed.
id: ``django.utils.functional.allow_lazy()`` akan dipindahkan.

source: The ``shell --plain`` option will be removed.
id: Pilihan ``shell --plain`` akan dipindahkan.

source: The ``django.core.urlresolvers`` module will be removed.
id: Modul ``django.core.urlresolvers`` akan dipindahkan.

source: The model ``CommaSeparatedIntegerField`` will be removed. A stub field will remain for compatibility with historical migrations.
id: Model ``CommaSeparatedIntegerField`` akan dipindahkan. Potongan bidang akan tetap untuk kesesuaian dengan riwayat perpindahan.

source: Support for the template ``Context.has_key()`` method will be removed.
id: Dukungan untuk cetakan cara ``Context.has_key()`` akan dipindahkan.

source: Support for the ``django.core.files.storage.Storage.accessed_time()``, ``created_time()``, and ``modified_time()`` methods will be removed.
id: Dukungan untuk cara ``django.core.files.storage.Storage.accessed_time()``, ``created_time()``, dan ``modified_time()`` akan dipindahkan.

source: Support for query lookups using the model name when ``Meta.default_related_name`` is set will be removed.
id: Dukungan untuk pencarian permintaan menggunakan nama model ketika ``Meta.default_related_name`` disetel akan dipindahkan.

source: The ``__search`` query lookup and the ``DatabaseOperations.fulltext_search_sql()`` method will be removed.
id: Permintaan pencarian ``__search`` dan cara ``DatabaseOperations.fulltext_search_sql()`` akan dipindahkan.

source: The shim for supporting custom related manager classes without a ``_apply_rel_filters()`` method will be removed.
id: Shim untuk mendukung penyesuaian kelas-kelas pengelola terkait tanpa metode ``_apply_rel_filters()`` akan dipindahkan.

source: Using ``User.is_authenticated()`` and ``User.is_anonymous()`` as methods will no longer be supported.
id: Menggunakan ``User.is_authenticated()`` dan ``User.is_anonymous()`` sebagai cara tidak akan lagi didukung.

source: The private attribute ``virtual_fields`` of ``Model._meta`` will be removed.
id: Atribut pribadi ``virtual_fields`` dari ``Model._meta`` akan dipindahkan.

source: The private keyword arguments ``virtual_only`` in ``Field.contribute_to_class()`` and ``virtual`` in ``Model._meta.add_field()`` will be removed.
id: Argumen katakunci pribadi ``virtual_only`` dalam ``Field.contribute_to_class()`` dan ``virtual`` dalam ``Model._meta.add_field()`` akan dipindahkan.

source: The ``javascript_catalog()`` and ``json_catalog()`` views will be removed.
id: Tampilan ``javascript_catalog()`` dan ``json_catalog()`` akan dipindahkan.

source: The ``django.contrib.gis.utils.precision_wkt()`` function will be removed.
id: Fungsi ``django.contrib.gis.utils.precision_wkt()`` akan dipindahkan.

source: In multi-table inheritance, implicit promotion of a ``OneToOneField`` to a ``parent_link`` will be removed.
id: Dalam warisan banyak-tabel, promosi tersirat dari ``OneToOneField`` ke a ``parent_link`` akan dipindahkan.

source: Support for ``Widget._format_value()`` will be removed.
id: Dukungan untuk ``Widget._format_value()`` akan dipindahkan.

source: ``FileField`` methods ``get_directory_name()`` and ``get_filename()`` will be removed.
id: Cara ``FileField`` ``get_directory_name()`` dan ``get_filename()`` akan dipindahkan.

source: The ``mark_for_escaping()`` function and the classes it uses: ``EscapeData``, ``EscapeBytes``, ``EscapeText``, ``EscapeString``, and ``EscapeUnicode`` will be removed.
id: Fungsi ``mark_for_escaping()`` dan kelas-kelas dia gunakan: ``EscapeData``, ``EscapeBytes``, ``EscapeText``, ``EscapeString``, dan ``EscapeUnicode`` akan dipindahkan.

source: The ``escape`` filter will change to use ``django.utils.html.conditional_escape()``.
id: Penyaring ``escape`` akan berubah untuk menggunakan ``django.utils.html.conditional_escape()``.

source: ``Manager.use_for_related_fields`` will be removed.
id: ``Manager.use_for_related_fields`` akan dipindahkan.

source: Model ``Manager`` inheritance will follow MRO inheritance rules and the ``Meta.manager_inheritance_from_future`` to opt-in to this behavior will be removed.
id: Warisan model ``manager`` akan mengikuti aturan warisan MRO dan ``Meta.manager_inheritance_from_future`` untuk di daftarkan pada kebiasaan ini akan dipindahkan.

source: Support for old-style middleware using ``settings.MIDDLEWARE_CLASSES`` will be removed.
id: Dukungan untuk middleware gaya-lama menggunakan ``settings.MIDDLEWARE_CLASSES`` akan dipindahkan.

source: See the :ref:`Django 1.8 release notes<deprecated-features-1.8>` for more details on these changes.
id: Lihat :ref:`Django 1.8 release notes<deprecated-features-1.8>` untuk lebih rinci pada perubahan ini.
pt_br: Veja as :ref:`notas da release do Django 1.8<deprecated-features-1.8>` para mais detalhes sobre essas mudanças.

source: Support for calling a ``SQLCompiler`` directly as an alias for calling its ``quote_name_unless_alias`` method will be removed.
id: Dukungan untuk memanggil ``SQLCompiler`` secara langsung sebagai nama lain untuk memanggil cara ``quote_name_unless_alias`` nya akan dipindahkan.
pt_br: Suporte para a possibilidade de chamar o ``SQLCompiler`` diretamente como um alias para o seu método ``quote_name_unless_alias`` será removido.

source: ``cycle`` and ``firstof`` template tags will be removed from the ``future`` template tag library (used during the 1.6/1.7 deprecation period).
id: Etiket cetakan ``cycle`` dan ``firstof`` akan dipindahkan dari pustaka etiket cetakan ``future`` (digunakan selama masa pengusangan 1.6/1.7).
pt_br: As tags de template ``cycle`` and ``firstof`` serão removidas da biblioteca de tags de template ``future``.

source: ``django.conf.urls.patterns()`` will be removed.
id: `django.conf.urls.patterns()`` akan dipindahkan.
pt_br: ``django.conf.urls.patterns()`` será removido.

source: Support for the ``prefix`` argument to ``django.conf.urls.i18n.i18n_patterns()`` will be removed.
id: Dukungan untuk argumen ``prefix`` pada ``django.conf.urls.i18n.i18n_patterns()`` akan dipindahkan.
pt_br: Suporte para o argumento ``prefix`` do ``django.conf.urls.i18n.i18n_patterns()`` será removido.

source: ``SimpleTestCase.urls`` will be removed.
id: ``SimpleTestCase.urls`` akan dipindahkan.
pt_br: ``SimpleTestCase.urls`` será removido.

source: Using an incorrect count of unpacked values in the ``for`` template tag will raise an exception rather than fail silently.
id: Menggunakan jumlah tidak benar dari nilai-nilai dibongkar etiket cetakan ``for`` akan memunculkan pengecualian dari pada gagal diam-diam.
pt_br: Usar uma contagem incorreta de valores despacotados em uma tag de template ``for`` irá lançar uma exceção ao invés de falhar silenciosamente.
