Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: The ability to reverse URLs using a dotted Python path will be removed.
id: Kemampuan untuk membalikkan URL menggunakan jalur Python bertitik akan dipindahkan.

source: The ability to use a dotted Python path for the ``LOGIN_URL`` and ``LOGIN_REDIRECT_URL`` settings will be removed.
id: Kemampuan menggunakan jalur Python bertitik untuk pengaturan ``LOGIN_URL`` dan ``LOGIN_REDIRECT_URL`` akan dipindahkan.
pt_br: A habilidade de usar um caminho Python contendo pontos para os settings ``LOGIN_URL`` and ``LOGIN_REDIRECT_URL`` será removida.

source: Support for :py:mod:`optparse` will be dropped for custom management commands (replaced by :py:mod:`argparse`).
id: Dukungan untuk :py:mod:`optparse` akan dihilangkan untuk perintah pengelolaan penyesuaian (diganti oleh :py:mod:`argparse`).
pt_br: Suporte para o módulo :py:mod:`optparse` será descartado para custom management commands (trocado pleo módulo :py:mod:`argparse`).

source: The class ``django.core.management.NoArgsCommand`` will be removed. Use :class:`~django.core.management.BaseCommand` instead, which takes no arguments by default.
id: Kelas ``django.core.management.NoArgsCommand`` akan dipindahkan. Gunakan :class:`~django.core.management.BaseCommand` sebagai gantinya, yang tidak mengambil argumen secara permulaan.

source: ``django.core.context_processors`` module will be removed.
id: Modul ``django.core.context_processors`` akan dipindahkan.
pt_br: O módulo ``django.core.context_processors`` será removido.

source: ``django.db.models.sql.aggregates`` module will be removed.
id: Modul ``django.db.models.sql.aggregates`` akan dipindahkan.
pt_br: O módulo ``django.db.models.sql.aggregates`` será removido.

source: ``django.contrib.gis.db.models.sql.aggregates`` module will be removed.
id: Modul ``django.contrib.gis.db.models.sql.aggregates`` akan dipindahkan.
pt_br: O módulo ``django.contrib.gis.db.models.sql.aggregates`` será removido.

source: The following methods and properties of ``django.db.sql.query.Query`` will be removed:
id: Cara dan properti berikut dari ``django.db.sql.query.Query`` akan dipindahkan:
pt_br: Os métodos e propriedades de ``django.db.sql.query.Query`` a seguir serão removidas:

source: Properties: ``aggregates`` and ``aggregate_select``
id: Properti: ``aggregates`` dan ``aggregate_select``
pt_br: Propriedades: ``aggregates`` e ``aggregate_select``

source: Methods: ``add_aggregate``, ``set_aggregate_mask``, and ``append_aggregate_mask``.
id: Cara: ``add_aggregate``, ``set_aggregate_mask``, dan ``append_aggregate_mask``.
pt_br: Métodos: ``add_aggregate``, ``set_aggregate_mask``, e ``append_aggregate_mask``.

source: ``django.template.resolve_variable`` will be removed.
id: ``django.template.resolve_variable`` akan dipindahkan.
pt_br: ``django.template.resolve_variable`` será removido.

source: The following private APIs will be removed from :class:`django.db.models.options.Options` (``Model._meta``):
id: API pribadi berikut akan dipindahkan dari :class:`django.db.models.options.Options` (``Model._meta``):
pt_br: As APIs privadas abaixo serão removidas de :class:`django.db.models.options.Options` (``Model._meta``):

source: The ``error_message`` argument of ``django.forms.RegexField`` will be removed.
id: Argumen ``error_message`` dari ``django.forms.RegexField`` akan dipindahkan.
pt_br: O argumento ``error_message`` de ``django.forms.RegexField`` será removido.

source: The ``unordered_list`` filter will no longer support old style lists.
id: Penyaring ``unordered_list`` tidak akan mendukung lagi daftar gaya lama.
pt_br: O filtro ``unordered_list`` não irá mais suportar listas do estilo antigo.

source: Support for string ``view`` arguments to ``url()`` will be removed.
id: Dukungan untuk deretan karakter argumen ``view`` pada ``url()`` akan dipindahkan.
pt_br: Suporte a argumentos ``view`` no formato string para ``url()`` será removido.

source: The backward compatible shim to rename ``django.forms.Form._has_changed()`` to ``has_changed()`` will be removed.
id: Shim kesesuaian kebelakang untuk dinamai kembali ``django.forms.Form._has_changed()`` menjadi ``has_changed()`` telah dipindahkan.
pt_br: O calço de compatibilidade com versões anteriores para renomear ``django.forms.Form._has_changed()`` para ``has_changed()`` foi removido.

source: The ``removetags`` template filter will be removed.
id: Penyaring cetakan ``removetags`` akan dipindahkan.
pt_br: O filter de template ``removetags`` será removido.

source: The ``remove_tags()`` and ``strip_entities()`` functions in ``django.utils.html`` will be removed.
id: Fungsi ``remove_tags()`` dan ``strip_entities()`` di ``django.utils.html`` akan dipindahkan.
pt_br: As funções ``remove_tags()`` e ``strip_entities()`` em ``django.utils.html`` serão removidas.

source: The ``is_admin_site`` argument to ``django.contrib.auth.views.password_reset()`` will be removed.
id: Argumen ``is_admin_site`` pada ``django.contrib.auth.views.password_reset()`` akan dipindahkan.
pt_br: O argumento ``is_admin_site`` para ``django.contrib.auth.views.password_reset()`` será removido.

source: ``django.db.models.field.subclassing.SubfieldBase`` will be removed.
id: ``django.db.models.field.subclassing.SubfieldBase`` akan dipindahkan.
pt_br: ``django.db.models.field.subclassing.SubfieldBase`` será removido.

source: ``django.utils.checksums`` will be removed; its functionality is included in ``django-localflavor`` 1.1+.
id: ``django.utils.checksums`` akan dipindahkan; kegunaannya disertakan di ``django-localflavor`` 1.1+

source: The ``original_content_type_id`` attribute on ``django.contrib.admin.helpers.InlineAdminForm`` will be removed.
id: Atribut ``original_content_type_id`` pada ``django.contrib.admin.helpers.InlineAdminForm`` akan dipindahkan.
pt_br: O atributo ``original_content_type_id`` em ``django.contrib.admin.helpers.InlineAdminForm`` será removido.

source: The backwards compatibility shim to allow ``FormMixin.get_form()`` to be defined with no default value for its ``form_class`` argument will be removed.
id: Shim kesesuaian kebelakang mengizinkan ``FormMixin.get_form()`` untuk ditentukan dengan tidak ada nilai awalan untuk argumen ``form_class`` nya akan dipindahkan.
pt_br: O calço de compatibilidade com versões anteriores para permitir ``FormMixin.get_form()`` ser definido sem valor padrão para o seu argumento ``form_class`` foi removido.

source: The following settings will be removed:
id: Pengaturan berikut akan dipindahkan:
pt_br: As configurações abaixo serão removidas:

source: The backwards compatibility alias ``django.template.loader.BaseLoader`` will be removed.
id: Nama lain kesesuaian kebelakang ``django.template.loader.BaseLoader`` akan dipindahkan.
pt_br: O alias de compatibilidade com versões anteriores ``django.template.loader.BaseLoader`` será removido.

source: Django template objects returned by :func:`~django.template.loader.get_template` and :func:`~django.template.loader.select_template` won't accept a :class:`~django.template.Context` in their :meth:`~django.template.backends.base.Template.render()` method anymore.
id: Obyek cetakan Django dikembalikan oleh func:`~django.template.loader.get_template` dan :func:`~django.template.loader.select_template` tidak akan menerima :class:`~django.template.Context` dalam cara :meth:`~django.template.backends.base.Template.render()` mereka lagi.
pt_br: Objetos de template do Django retornados por :func:`~django.template.loader.get_template` e :func:`~django.template.loader.select_template` não irão mais aceitar um :class:`~django.template.Context` em seu método :meth:`~django.template.backends.base.Template.render()`.

source: :doc:`Template response APIs </ref/template-response>` will enforce the use of :class:`dict` and backend-dependent template objects instead of :class:`~django.template.Context` and :class:`~django.template.Template` respectively.
id: :doc:`Template response APIs </ref/template-response>` akan melaksanakan penggunaan dari obyek cetakan :class:`dict` dan backend-dependent daripada :class:`~django.template.Context` dan :class:`~django.template.Template` masing-masing.
pt_br: :doc:`APIs de resposta de templates </ref/template-response>` irão reforçar o uso de :class:`dict` e objetos de template dependentes de backend ao invés de :class:`~django.template.Context` e :class:`~django.template.Template` respectivamente.

source: The ``current_app`` parameter for the following function and classes will be removed:
id: Parameter ``current_app`` untuk fungsi dan kelas berikut akan dipindahkan:
pt_br: O ``current_app`` parâmetro para as funções e classes abaixo será removido:

source: The ``dictionary`` and ``context_instance`` parameters for the following functions will be removed:
id: Parameter ``dictionary`` dan ``context_instance`` untuk fungsi berikut akan dipindakan:
pt_br: Os parâmetros ``dictionary`` e ``context_instance`` para as funções abaixo serão removidos

source: The ``dirs`` parameter for the following functions will be removed:
id: Parameter ``dirs`` untuk fungsi berikut akan dipindahkan:
pt_br: O parâmetro ``dirs`` para as funções abaixo será removido:

source: Session verification will be enabled regardless of whether or not ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'`` is in ``MIDDLEWARE_CLASSES``.
id: Pembuktian sesi akan diadakan tanpa memerhatikan dari apakah atau tidak ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'`` di ``MIDDLEWARE_CLASSES``.
pt_br: Verificação de sessão será habilitado independentemente de ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'`` estar ou não dentro de ``MIDDLEWARE_CLASSES``.

source: Private attribute ``django.db.models.Field.related`` will be removed.
id: Atribut pribadi ``django.db.models.Field.related`` akan dipindahkan.
pt_br: O atributo privado ``django.db.models.Field.related`` será removido.

source: The ``--list`` option of the ``migrate`` management command will be removed.
id: Pilihan ``--list`` dari perintah pengelolaan ``migrate`` akan dipindahkan.
pt_br: A opção ``--list`` do comando ``migrate`` será removido.

source: The ``ssi`` template tag will be removed.
id: Etiket cetakan ``ssi`` akan dipindahkan.
pt_br: A tag template ``ssi`` será removida.

source: Support for the ``=`` comparison operator in the ``if`` template tag will be removed.
id: Dukungan untuk ``=`` penghubung perbandingan di etiket cetakan ``if`` akan dipindahkan.
pt_br: Suporte para o operador de comparação ``=`` na tag de template ``if`` será removido.

source: The backwards compatibility shims to allow ``Storage.get_available_name()`` and ``Storage.save()`` to be defined without a ``max_length`` argument will be removed.
id: Shim kesesuaian kebelakang mengizinkan ``Storage.get_available_name()`` dan ``Storage.save()`` untuk ditentukan tanpa sebuah argumen ``max_length`` akan dipindahkan.
pt_br: O calço de compatibilidade com versões anteriores para permitir ``Storage.get_available_name()`` e ``Storage.save()`` ser definido sem um argumento ``max_length`` será removido.

source: Support for the legacy ``%(<foo>)s`` syntax in ``ModelFormMixin.success_url`` will be removed.
id: Dukungan untuk warisan sintaksis ``%(<foo>)s`` di ``ModelFormMixin.success_url`` akan dipindahkan.
pt_br: Suporte para a sintaxe legada ``%(<foo>)s`` no ``ModelFormMixin.success_url`` será removido.

source: ``GeoQuerySet`` aggregate methods ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, and ``unionagg()`` will be removed.
id: ``GeoQuerySet`` kumpulan cara ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, dan ``unionagg()`` akan dipindahkan.
pt_br: Os métodos do ``GeoQuerySet`` de agregação ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, e ``unionagg()`` serão removidos.

source: Ability to specify ``ContentType.name`` when creating a content type instance will be removed.
id: Kemampuan untuk menentukan ``ContentType.name`` ketika membuat instance jenis isi akan dipindahkan.
pt_br: A abilidade para especificar ``ContentType.name`` ao criar uma instância será removido.

source: Support for the old signature of ``allow_migrate`` will be removed. It changed from ``allow_migrate(self, db, model)`` to ``allow_migrate(self, db, app_label, model_name=None, **hints)``.
id: Dukungan untuk tanda tangan lama dari ``allow_migrate`` akan dipindahkan. Dia dirubah dari ``allow_migrate(self, db, model)`` menjadi ``allow_migrate(self, db, app_label, model_name=None, **hints)``.
pt_br: Suporte para a assinatura antiga de ``allow_migrate`` será removido. Ele mudou de ``allow_migrate(self, db, model)`` para ``allow_migrate(self, db, app_label, model_name=None, **hints)``.

source: Support for the syntax of ``{% cycle %}`` that uses comma-separated arguments will be removed.
id: Dukungan untuk sintaksis ``{% cycle %}`` yang menggunakan argumen dipisah-koma akan dipindahkan.
pt_br: Suporte para a sintaxe de ``{% cycle %}`` que utiliza argumentos separados por vírgulas será removido.

source: The warning that :class:`~django.core.signing.Signer` issues when given an invalid separator will become an exception.
id: Peringatan yang :class:`~django.core.signing.Signer` muncul ketika pemisah tidak sah yang diberikan akan menjadi sebuah pengecualian.
pt_br: O aviso que :class:`~django.core.signing.Signer` emite quando é fornecido um separador inválido irá se tornar uma exceção.

source: See the :ref:`Django 1.7 release notes<deprecated-features-1.7>` for more details on these changes.
id: Lihat :ref:`Django 1.7 release notes<deprecated-features-1.7>` untuk rincian lebih pada perubahan ini.
pt_br: Veja as :ref:`notas da release do Django 1.7<deprecated-features-1.7>` para mais detalhes nessas mudanças.

source: ``django.utils.dictconfig`` will be removed.
id: ``django.utils.dictconfig`` akan dipindahkan.
pt_br: ``django.utils.dictconfig`` será removido.

source: ``django.utils.importlib`` will be removed.
id: ``django.utils.importlib`` akan dipindahkan.
pt_br: ``django.utils.importlib`` será removido.

source: ``django.utils.tzinfo`` will be removed.
id: ``django.utils.tzinfo`` akan dipindahkan.
pt_br: ``django.utils.tzinfo`` será removido.

source: ``django.utils.unittest`` will be removed.
id: ``django.utils.unittest`` akan dipindahkan.
pt_br: ``django.utils.unittest`` será removido.

source: The ``syncdb`` command will be removed.
id: Perintah ``syncdb`` akan dipindahkan.
pt_br: O comando ``syncdb`` será removido.

source: ``django.db.models.signals.pre_syncdb`` and ``django.db.models.signals.post_syncdb`` will be removed.
id: ``django.db.models.signals.pre_syncdb`` dan ``django.db.models.signals.post_syncdb`` akan dipindahkan.
pt_br: ``django.db.models.signals.pre_syncdb`` e ``django.db.models.signals.post_syncdb`` serão removidos.

source: ``allow_syncdb`` on database routers will no longer automatically become ``allow_migrate``.
id: ``allow_syncdb`` pada router basisdata tidak lagi otomatis menjadi ``allow_migrate``.
pt_br: ``allow_syncdb`` em roteadores de bancos de dados não irão mais ficar automaticamente ``allow_migrate``.

source: Automatic syncing of apps without migrations will be removed. Migrations will become compulsory for all apps unless you pass the ``--run-syncdb`` option to ``migrate``.
id: Sinkronisasi otomatis dari aplikasi tanpa perpindahan akan dipindahkan. Perpindahan akan menjadi wajib untuk semua aplikasi meskipun anda melewati pilihan ``--run-syncdb`` untuk ``migrate``.
pt_br: A sincronização automática de apps sem migrações será removida. Migrations se tornará compulsória para todos os apps a não ser que você passe a opção ``--run-syncdb`` para o comando ``migrate``.

source: The SQL management commands for apps without migrations, ``sql``, ``sqlall``, ``sqlclear``, ``sqldropindexes``, and ``sqlindexes``, will be removed.
id: Perintah pengelolaan SQL untuk aplikasi tanpa perpindahan, ``sql``, ``sqlall``, ``sqlclear``, ``sqldropindexes``, dan ``sqlindexes``, akan dipindahkan.
pt_br: Os SQL management commands para apps sem migrações, `sql``, ``sqlall``, ``sqlclear``, ``sqldropindexes``, and ``sqlindexes``, será removido.

source: Support for automatic loading of ``initial_data`` fixtures and initial SQL data will be removed.
id: Dukungan untuk memuat otomatis dari perlengkapan ``initial_data`` dan data SQL awal akan dipindahkan.
pt_br: Suporte para carregamento automático de fixtures ``initial_data`` e dados SQL iniciais serão removidos.

source: All models will need to be defined inside an installed application or declare an explicit :attr:`~django.db.models.Options.app_label`. Furthermore, it won't be possible to import them before their application is loaded. In particular, it won't be possible to import models inside the root package of their application.
id: Semua model akan butuh ditentukan didalam aplikasi terpasang atau menyatakan eksplisit :attr:`~django.db.models.Options.app_label`. Lebih jauh, dia tidak akan memungkinkan untuk mengimpor didalam paket akar dari apliaksi mereka.
pt_br: Todos os modelos precisarão ser definidos dentro de aplicações instaladas ou declarados explicitamente :attr:`~django.db.models.Options.app_label`. Além disso, não será possível importá-los antes de suas aplicações serem carregadas. Em particular, não será possível importar modelos dentro do pacote root de suas aplicações.

source: The model and form ``IPAddressField`` will be removed. A stub field will remain for compatibility with historical migrations.
id: Model dan formulir ``IPAddressField`` akan dipindahkan. Bidang potongan akan tetap untuk kesesuaian dengan riwayat perpindahan.
pt_br: O model e form ``IPAddressField`` serão removidos. Um campo stub irá permanecer para compatibilidade com migrations passadas.

source: ``AppCommand.handle_app()`` will no longer be supported.
id: ``AppCommand.handle_app()`` tidak lama lagi didukung.
pt_br: ``AppCommand.handle_app()`` não será mais suportado.

source: ``RequestSite`` and ``get_current_site()`` will no longer be importable from ``django.contrib.sites.models``.
id: ``RequestSite`` dan ``get_current_site()`` tidak akan lagi dapat diimpor dari ``django.contrib.sites.models``.
pt_br: ``RequestSite`` e ``get_current_site()`` não irão mais ser importáveis de ``django.contrib.sites.models``.

source: FastCGI support via the ``runfcgi`` management command will be removed. Please deploy your project using WSGI.
id: Dukungan FastCGI melalui perintah pengelolaan ``runfcgi`` akan dipindahkan. Harap sebarkan proyek anda menggunakan WSGI.
pt_br: Suporte a FastCGI pelo comando de administração ``runfcgi`` será removido. Por favor faça deploy do seu projeto usando WSGI.

source: ``django.utils.datastructures.SortedDict`` will be removed. Use :class:`collections.OrderedDict` from the Python standard library instead.
id: ``django.utils.datastructures.SortedDict`` akan dipindahkan. Gunakan :class:`collections.OrderedDict` dari pustaka standar Python.
pt_br: ``django.utils.datastructures.SortedDict`` será removido. Utilize :class:`collections.OrderedDict` da biblioteca padrão do Python.

source: ``ModelAdmin.declared_fieldsets`` will be removed.
id: ``ModelAdmin.declared_fieldsets`` akan dipindahkan.
pt_br: ``ModelAdmin.declared_fieldsets`` será removido.

source: Instances of ``util.py`` in the Django codebase have been renamed to ``utils.py`` in an effort to unify all util and utils references. The modules that provided backwards compatibility will be removed:
id: Instance dari ``util.py`` di kode basis Django telah dinamai kembali ke `utils.py`` dalam sebuah usaha untuk menyatukan semua acuan alat dan alat-alat. Modul-modul yang menyediakan kesesuaian kebelakang akan dipindahkan:
pt_br: Instâncias de ``util.py`` no código base do Django foram renomeadas para ``utils.py`` em um esforço para unificar todos as referências a util e utils. Os módulos que fornecem compatibilidade com versões anteriores serão removidos.

source: ``ModelAdmin.get_formsets`` will be removed.
id: ``ModelAdmin.get_formsets`` akan dipindahkan.
pt_br: ``ModelAdmin.get_formsets`` será removido.

source: The backward compatibility shim introduced to rename the ``BaseMemcachedCache._get_memcache_timeout()`` method to ``get_backend_timeout()`` will be removed.
id: Shim kesesuaian kebelakang diperkenalkan untuk menamai kembali metode ``BaseMemcachedCache._get_memcache_timeout()`` pada ``get_backend_timeout()`` akan dipindahkan.
pt_br: O calço de compatibilidade com versões anteriores introduzido para renomear o método ``BaseMemcachedCache._get_memcache_timeout()`` para ``get_backend_timeout()`` foi removido.

source: The ``--natural`` and ``-n`` options for :djadmin:`dumpdata` will be removed.
id: Pilihan ``--natural`` dan ``-n`` untuk :djadmin:`dumpdata` akan dipindahkan.
pt_br: As opções``--natural`` e ``-n`` para :djadmin:`dumpdata` serão removidas.

source: The ``use_natural_keys`` argument for ``serializers.serialize()`` will be removed.
id: Argumen ``use_natural_keys`` untuk ``serializers.serialize()`` akan dipindahkan.
pt_br: O argumento ``use_natural_keys`` para ``serializers.serialize()`` será removido.

source: Private API ``django.forms.forms.get_declared_fields()`` will be removed.
id: API pribadi ``django.forms.forms.get_declared_fields()`` akan dipindahkan.
pt_br: A API privada ``django.forms.forms.get_declared_fields()`` será removida.

source: The ability to use a ``SplitDateTimeWidget`` with ``DateTimeField`` will be removed.
id: Kemampuan untuk menggunakan ``SplitDateTimeWidget`` dengan ``DateTimeField`` akan dipindahkan.
pt_br: A abilidade de utilizar o ``SplitDateTimeWidget`` com ``DateTimeField`` será removido.

source: The ``WSGIRequest.REQUEST`` property will be removed.
id: Properti ``WSGIRequest.REQUEST`` akan dipindahkan.
pt_br: A propriedade ``WSGIRequest.REQUEST`` será removida.

source: The class ``django.utils.datastructures.MergeDict`` will be removed.
id: Kelas ``django.utils.datastructures.MergeDict`` akan dipindahkan.
pt_br: A classe ``django.utils.datastructures.MergeDict`` será removida.

source: The ``zh-cn`` and ``zh-tw`` language codes will be removed and have been replaced by the ``zh-hans`` and ``zh-hant`` language code respectively.
id: Kode bahasa ``zh-cn`` dan ``zh-tw`` akan dipindahkan dan telah digantikan oleh kode bahasa ``zh-hans`` and ``zh-hant`` masing-masing.
pt_br: Os códigos de linguagens ``zh-cn`` e ``zh-tw`` serão removidos e trocados pelos códigos de linguagem ``zh-hans`` e ``zh-hant``respectivamente.

source: The internal ``django.utils.functional.memoize`` will be removed.
id: Internal ``django.utils.functional.memoize`` akan dipindahkan.
pt_br: O "internal" ``django.utils.functional.memoize`` será removido.

source: ``django.core.cache.get_cache`` will be removed. Add suitable entries to :setting:`CACHES` and use :data:`django.core.cache.caches` instead.
id: ``django.core.cache.get_cache`` akan dipindahkan. Tambah masukan yang cocok untuk :setting:`CACHES` dan gunakan :data:`django.core.cache.caches`.
pt_br: ``django.core.cache.get_cache`` será removido. Ao invés dele, adicione as entradas convenientes a :setting:`CACHES` e use :data:`django.core.cache.caches`.

source: ``django.db.models.loading`` will be removed.
id: ``django.db.models.loading`` akan dipindahkan.
pt_br: ``django.db.models.loading`` será removido.

source: Passing callable arguments to querysets will no longer be possible.
id: Melewatkan argumen callable ke queryset tidak akan lagi memungkinkan.
pt_br: Passar argumentos que possam ser invocados para querysets não será mais possível.
