Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Update the ``VERSION`` tuple in ``django/__init__.py`` again, incrementing to whatever the next expected release will be. For example, after releasing 1.5.1, update ``VERSION`` to ``VERSION = (1, 5, 2, 'alpha', 0)``.
id: Perbaharui tuple ``VERSION`` di ``django/__init__.py`` lagi, naikkan ke apapun terbitan selanjutnya yang akan diharapkan. Sebagai contoh, setelah menerbitkan 1.5.1, perbaharui ``VERSION`` ke ``VERSION = (1, 5, 2, 'alpha', 0)``.
pt_br: Atualizar a tupla ``VERSION`` em ``django/__init__.py`` novamente, incrementando ela para qualquer que seja a próxima release. Por exemplo, depois de soltar a release 1.5.1, atualize ``VERSION`` para ``VERSION = (1, 5, 2, 'alpha', 0)``.

source: Add the release in `Trac's versions list`_ if necessary (and make it the default if it's a final release). Not all versions are declared; take example on previous releases.
id: Tambah terbitan dalam `Trac's versions list`_ jika dibutuhkan (dan buat kan awalnya jika itu adalah terbitan akhir). Tidak semua versi dinyatakan; ambil contoh pada terbitan sebelumnya.
pt_br: Adicione a release na `lista de versões do Trac`_ se necessário (e faça com que ela seja a padrão se ela for uma fina release). Nem todas as versões são declaradas; pegue como exemplo as releases passadas.

source: If this was a security release, update :doc:`/releases/security` with details of the issues addressed.
id: Jika ini adalah terbitan keamanan, perbaharui :doc:`/releases/security` dengan rincian dari masalah-masalah yang dialamatkan.
pt_br: Se essa for uma release de segurança, atualize :doc:`/releases/security` com detalhes dos problemas endereçados.

source: New stable branch tasks
id: Tugas cabang stabil baru
pt_br: Tarefas para novas branches estáveis

source: There are several items to do in the time following the creation of a new stable branch (often following an alpha release). Some of these tasks don't need to be done by the releaser.
id: Ada beberapa barang untuk dilakukan di waktu mengikuti pembuatan cabang stabil baru (sering mengikuti terbitan alpha). Beberapa dari pekerjaan ini tidak butuh diselesaikan oleh penerbit.

source: Create a new ``DocumentRelease`` object in the ``docs.djangoproject.com`` database for the new version's docs, and update the ``docs/fixtures/doc_releases.json`` JSON fixture, so people without access to the production DB can still run an up-to-date copy of the docs site.
id: Buat sebuah obyek ``DocumentRelease`` baru di basisdata ``docs.djangoproject.com`` untuk dokumen versi baru, dan perbaharui ``docs/fixtures/doc_releases.json`` perlengkapan lengkap JSON, jadi orang tanpa akses ke BD produksi dapat masih menjalankan salinan terbaru dari situs dokumentasi.
pt_br: Crie um novo objeto ``DocumentRelease`` no banco de dados de ``docs.djangoproject.com`` para a nova versão da documentação, e atualize o JSON fixture ``docs/fixtures/doc_releases.json``, para que pessoas sem acesso ao DB de produção possam ainda rodar uma cópia atualizada do site da documentação.

source: Create a stub release note for the new feature version. Use the stub from the previous feature release version or copy the contents from the previous feature version and delete most of the contents leaving only the headings.
id: Buat sebuah catatan terbitan rintisan untuk versi fitur baru. Gunakan rintisan dari terbitan fitur sebelumnya atau salin isi dari versi fitur sebelumnya dan hapus kebanyakan isi meninggalkan hanya kepala.
pt_br: Criar um esboço de uma nota de release para a nova versão. Use o esboço de versões de releases anteriores ou copie os conteúdos de versões prévias e exclua a maior parte do conteúdo deixando apenas os cabeçalhos.

source: Increase the default PBKDF2 iterations in ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` by about 20% (pick a round number). Run the tests, and update the 3 failing hasher tests with the new values. Make sure this gets noted in the release notes (see the 1.8 release notes for an example).
id: Tingkatkan perulangan PBKDF2 awal di ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` sekitar 20% (ambil angka bulat). Jalankan percobaan, dan perbaharui 3 kegagalan percobaan hash dengan nilai baru. Pastikan ini mendapatkan catatan di catatan terbitan (lihat catatan terbitan 1.8 untuk sebuah contoh).
pt_br: Aumente as iterações PBKDF2 padrão em ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` por cerca de 20% (escolha um número redondo). Rode os testes, e atualize os 3 testes falhos de hashers com os novos valores. Certifique-se de que isso seja registrado nas notas de release (veja as notas da release 1.8 para um exemplo).

source: Remove features that have reached the end of their deprecation cycle. Each removal should be done in a separate commit for clarity. In the commit message, add a "refs #XXXX" to the original ticket where the deprecation began if possible.
id: Pindahkan fitur yang telah mencapai akhir dari siklus pengusangannya. Setiap perpindahan harus selesai di perbaikan terpisah untuk kejelasan. Dalam pesan perbaikan, tambah "refs #XXXX" pada tiket asli dimana pengusangan dimulai jika memungkinkan.
pt_br: Remova as funcionalidades que chegaram ao fim de seu clico de depreciação. Cada remoção deve ser feita em um commit separado para claridade. Na mensagem de commit, adiciona um "refs #XXXX" para o ticket original onde a depreciação começou se possível.

source: Remove ``.. versionadded::``, ``.. versionadded::``, and ``.. deprecated::`` annotations in the documentation from two releases ago. For example, in Django 1.9, notes for 1.7 will be removed.
id: Pindahkan keterangan ``.. versionadded::``, ``.. versionadded::``, dan ``.. deprecated::`` di dokumentasi dari dua terbitan lampau. Sebagai contoh, di Django 1.9, catatan untuk 1.7 akan dipindahkan.
pt_br: Remova as anotações ``.. versionadded::``, ``.. versionadded::``, e ``.. deprecated::`` na documentação das duas releases anteriores. Por exemplo, no Django 1.9, notas para a 1.7 serão removidas.

source: Add the new branch to `Read the Docs <https://readthedocs.org/projects/django/>`_. Since the automatically generated version names ("stable-A.B.x") differ from the version numbers we've used historically in Read the Docs ("A.B.x"), we currently ask Eric Holscher to add the version for us. Someday the alias functionality may be built-in to the Read the Docs UI.
id: Tambah cabang baru ke `Read the Docs <https://readthedocs.org/projects/django/>`_. Sejak nama versi dibangkitkan otomatis ("stable-A.B.x") berbeda dari angka versi kami telah gunakan menurut sejarah di Read the Docs ("A.B.x"), kami saat ini meminta Eric Holscher menambahkan versi untuk kami. Suatu waktu nama lain fungsionalitas mungkin dipasang tetap ke Read the Docs UI.
pt_br: Adicione a nova branch para `Read the Docs <https://readthedocs.org/projects/django/>`_. Como os nomes das versões ("stable-A.B.x") gerados automaticamente diferem dos números de versão que nós utilizamos historicamente no Read the Docs ("A.B.x"), nós atualmente pedimos que Eric Hoscher adicione a versão para nós. Algum dia a funcionalidade de alias pode ser construída na UI do Read the Docs.

source: Notes on setting the VERSION tuple
id: Catatan pada pengaturan tuple VERSION
pt_br: Considerações quanto a configuração da tupla VERSION

source: Django's version reporting is controlled by the ``VERSION`` tuple in ``django/__init__.py``. This is a five-element tuple, whose elements are:
id: Pelaporan versi Django dikendalikan oleh tuple ``VERSION`` di ``django/__init__.py``. Ini adalah lima-unsur tuple, yang unsurnya adalah:
pt_br: O reporte de versões do Django é controlado por uma tupla ``VERSION`` em ``django/__init__.py``. Essa é uma tupla de cinco elementos, cujos elementos são:

source: Major version.
id: Versi utama.
pt_br: Versão principal.

source: Minor version.
id: Versi kecil.
pt_br: Versão secundária.

source: Micro version.
id: Versi mikro.
pt_br: Micro versão.

source: Status -- can be one of "alpha", "beta", "rc" or "final".
id: Keadaan -- dapat menjadi satu dari "alpha", "beta", "rc" atau "final".
pt_br: Status -- pode ser "alpha", "beta", "rc" ou "final".

source: Series number, for alpha/beta/RC packages which run in sequence (allowing, for example, "beta 1", "beta 2", etc.).
id: Rangkaian angka, untuk paket alpha/beta/RC yang berjalan dalam urutan (mengizinkan, sebagai contoh, "beta 1", "beta 2", etc.).
pt_br: Número das séries, para alpha/beta/RC packages que rodam em sequência (permitindo, por exemplo, "beta 1", "beta 2", etc.).

source: For a final release, the status is always "final" and the series number is always 0. A series number of 0 with an "alpha" status will be reported as "pre-alpha".
id: Untuk terbitan akhir, keadaan selalu "final" dan rangkaian angka selalu 0. Rangkaian angka dari 0 dengan keadaan "alpha" akan dilaporkan sebagai "pre-alpha".
pt_br: Para uma release final, o status é sempre "final" e o número das séries é sempre 0. Um número de séries 0 com um status "alpha" será reportado como "pre-alpha".

source: Some examples:
id: Beberapa contoh:
pt_br: Alguns exemplos:

source: ``(1, 3, 0, 'alpha', 0)`` → "1.3 pre-alpha"
id: `(1, 3, 0, 'alpha', 0)`` → "1.3 pra-alpha"

source: Django internals
id: Dalam Django
pt_br: Funcionamento interno do Projeto Django

source: Documentation for people hacking on Django itself. This is the place to go if you'd like to help improve Django or learn about how Django is managed.
id: Dokumentasi untuk orang meretas pada Django itu sendiri. Ini adalah tempat pergi jika anda suka membantu perbaikan Django atau belajar bagaimana Django dikelola.
pt_br: Documentação para pessoas hackeando dentro do Django. Este é o lugar para ir se você quer ajudar a melhorar o Django ou aprender como o Django é gerenciado.

source: Mailing lists
id: Daftar penyuratan
pt_br: Listas de email

source: Django has several official mailing lists on Google Groups that are open to anyone.
id: Django mempunyai beberapa daftar penyuratan resmi di Google Groups yang terbuka untuk siapapun.
pt_br: Django tem várias listas de email oficiais no Google Groups que são abertas para todos.

source: This is the right place if you are looking to ask any question regarding the installation, usage, or debugging of Django.
id: Ini adalah tempat tepat jika anda mencari menanyakan pertanyaan apapun mengenai pemasangan, penggunaan, atau pengecek kesalahan dari Django.
pt_br: Esse é o lugar correto se você está querendo perguntar qualquer questão a respeito de instalação, uso ou depuração do Django.

source: If it's the first time you send an email to this list, your email must be accepted first so don't worry if :ref:`your message does not appear <message-does-not-appear-on-django-users>` instantly.
id: Jika ini pertama kali anda mengirim surel ke daftar ini, surel anda harus diterima terlebih dahulu jadi jangan khawatir jika :ref:`your message does not appear <message-does-not-appear-on-django-users>` sekarang juga.
pt_br: Se for a primeira vez que você envia um email para esta lista, o seu email deve ser aceito primeiro portanto não se preocupe caso :ref:`sua mensagem não apareça <message-does-not-appear-on-django-users>` instantaneamente.

source: `django-users mailing archive`_
id: `arsip penyuratan pengguna-django`_

source: `django-users subscription email address`_
id: `alamat email langganan pengguna-django`_

source: The Django Core Mentorship list is intended to provide a welcoming introductory environment for community members interested in contributing to the Django Project.
id: Daftar Django Core Mentorship diharapkan menyediakan lignkungan perkenalan sambutan untuk anggota komunitas tertarik dalam menyumbang ke Django Project.
pt_br: A lista Django Core Mentorship é usada para fornecer um ambiente introdutório de boas vindas para membros da comunidade interessados em contribuir com o Projeto Django.

source: The discussion about the development of Django itself takes place here.
id: Obrolan mengenai pengembangan Django iru sendiri mengambil tempat disini.
pt_br: A discussão sobre o desenvolvimento do Django em si acontece aqui.

source: Please make use of :ref:`django-users mailing list <django-users-mailing-list>` if you want to ask for tech support, doing so in this list is inappropriate.
id: Silahkan menggunakan :ref:`django-users mailing list <django-users-mailing-list>` jika anda ingin meminta dukungan teknis, melakukan itu dalam daftar ini adalah tidak sesuai.
pt_br: Por favor faça uso da :ref:`lista de email django-users <django-users-mailing-list>` se você quiser suporte técnico, fazer isso nesta lista é inapropriado.

source: `django-developers mailing archive`_
id: `django-i18n subscription email address`_

source: This is the place to discuss the internationalization and localization of Django's components.
id: Ini adalah tempat mengobrol internasionalisasi dan lokalisasi dari komponen Django.
pt_br: Este é o lugar para discutir a internacionalização e a localização de componentes do Django.

source: `django-i18n mailing archive`_
id: `django-i18n posting email`_

source: A (very) low-traffic list for announcing :ref:`upcoming security releases <security-disclosure>`, new releases of Django, and security advisories.
id: Daftar lalu lintas-rendah (sangat) untuk menumumkan :ref:`upcoming security releases <security-disclosure>`, terbitan bau dari Django dan saran keamanan.

source: All the ticket updates are mailed automatically to this list, which is tracked by developers and interested community members.
id: Semua perbaharuan tiket disurati otomatis ke daftar ini, yaitu dilacak oleh pengembang dan anggota komunitas yang tertarik.
pt_br: Todas as atualizações de tickets são enviadas automaticamente para esta lista, que é monitorada pelos desenvolvedores e membros da comunidade interessados.

source: `django-updates posting email`_
id: `django-updates subscription email address`_

source: Organization of the Django Project
id: Organisasi dari Proyek Django
pt_br: Organizaçaõ do Projeto Django

source: Principles
id: Asas-asas
pt_br: Princípios

source: The Django Project is managed by a team of volunteers pursuing three goals:
id: Proyek Django dikelola oleh tim dari sukarelawan mengejar tiga sasaran:
pt_br: O Projeto Django é gerenciado por um time de voluntários perseguindo três objetivos:

source: Driving the development of the Django Web Framework,
id: Menggerakkan pengembangan dari Kerangka Kerja Jaringan Django,
pt_br: Dirigir o desenvolvimento do Framework Web Django.

source: Fostering the ecosystem of Django-related software,
id: Membina ekosistem software Django terkait,
pt_br: Fomentar o ecossistema de softwares relacionados ao Django.

source: Leading the Django community in accordance with the values described in the `Django Code of Conduct`_.
id: Memimpin komunitas Django sesuai dengan nilai-nilai digambarkan dalam `Django Code of Conduct`_.
pt_br: Liderar a comunidade Django seguindo os princípios descritos no `Código de Conduta Django`_.

source: The Django Project isn't a legal entity. The `Django Software Foundation`_, a non-profit organization, handles financial and legal matters related to the Django Project. Other than that, the Django Software Foundation lets the Django Project manage the development of the Django framework, its ecosystem and its community.
id: Django Project bukan sebuah badan hukum. `Django Software Foundation`_, sebuah organisasi nirlaba, menangani keuangan dan masalah-masalah hukum terkait dengan Django Project. Selain daripada itu, Django Software Foundation membiarkan Django Project mengelola pengembangan dari Django framework, ekosistemnya dan komunitasnya.
pt_br: O Projeto Django não é uma entidade jurídica. A `Django Software Foundation`_, uma organização sem fins lucrativos, lida com questões financeiras e legais relacionadas ao Projeto Django. Além disso, a Django Software Foundation permite que o Projeto Django gerencie o desenvolvimento do framework Django, seu ecossistema e sua comunidade.

source: The Django core team makes the decisions, nominates its new members, and elects its technical board. While it holds decision power in theory, it aims at using it as rarely as possible in practice. Rough consensus should be the norm and formal voting an exception.
id: Tim inti Django membuat keputusan, mencalonkan anggota barunya, dan memilih bdan teknisnya. Selagi dia menahan kekuasaan keputusan dalam teori, dia membidik menggunakannya sebagai kemungkinan jarang dalam praktik. Pemufakatan kasar harus menjadi norma dan pengambilan suara resmi sebuah pengecualian.
pt_br: O core team do Django toma as decisões, nomeia seus novos membros, e elege seu corpo técnico. Embora ele tenha poder de decisão em teoria, na prática ele busca usar esse poder o mínimo possível. Consenso custoso deve ser a norma e voto formal uma exceção.

source: Core team
id: Tim inti

source: Role
id: Peran
pt_br: Perfil

source: The core team is the group of trusted volunteers who manage the Django Project. They assume many roles required to achieve the project's goals, especially those that require a high level of trust. They make the decisions that shape the future of the project.
id: Tim inti adalah kelompok dari sukarelawan yang dipercaya yang mengelola Django Project. Mereka beranggapan banyak peran diperlukan untuk mencapai sasaran proyek, khususnya itu yang membutuhkan tingkat tinggi dari kepercayaan. Mereka membuat keputusan yang membentuk masa depan dari proyek.
pt_br: O core team é um grupo de voluntários confiáveis que gerenciam o Projeto Django. Eles assumem mutis perfis requeridos para atingir os objetivos do projeto, especialmente os que necessitam de um alto nível de confiança. Eles tomam as decisões que moldam o futuro do projeto.

source: Core team members are expected to act as role models for the community and custodians of the project, on behalf of the community and all those who rely on Django.
id: Anggota tim inti diharapkan bertindak sebagai model peran untuk komunitas dan petugas proyek, atas nama dari komunitas dan smua yang bergantung pada Django.
pt_br: Espera-se dos membros do core team agir como modelos para a comunidade e guardiões de um projeto, em nome da comunidade e de todos aqueles que confiam no Django.

source: They will intervene, where necessary, in online discussions or at official Django events on the rare occasions that a situation arises that requires intervention.
id: Merekan akan campur tangan, ketika dibutuhkan, dalam obrolan daring atau pada acara Django resmi pada kesempatan langka yang situasi muncul yang membutuhkan campur tangan.
pt_br: Eles irão intervir, quando necessário, em discussões online ou em eventos oficiais do Django nas raras ocasiões que uma situação que requeira intervenção ocorrer.

source: They have authority over the Django Project infrastructure, including the Django Project website itself, the Django GitHub organization and repositories, the Trac bug tracker, the mailing lists, IRC channels, etc.
id: Mereka punya kekuasaan terhadap infrastruktur Django Project, termasuk situs jaringan Django Project itu sendiri, organisasi dan gudang Django GitHub, pelacak kesalahan Trac, daftar penyuratan, saluran IRC, dll.
pt_br: Eles têm autoridade sobre a infraestrutura do Projeto Django, incluindo o website do Projeto Django em si, o GitHub do Django e repositórios, o rastreador de bugs Trac, as listas de email, os canais IRC, etc.

source: Prerogatives
id: Hak istimewa
pt_br: Prerrogativas

source: Core team members may participate in formal votes, typically to nominate new team members and to elect the technical board.
id: Anggota tim dapat ikut serta dalam pilihan resmi, khususnya untuk menunjuk anggota tim baru dan memilih badan teknis.
pt_br: Os membros do core team podem participar de votos formais, tipicamente para nomear novos membros e para eleger o corpo técnico.

source: Some contributions don't require commit access. Depending on the reasons why a contributor joins the team, they may or may not have commit permissions to the Django code repository.
id: Beberapa sumbangan tidak membutuhkan akses penyerahan. Tergantung pada alasan mengapa penyumbang bergabung dengan tim, mereka mungkin atau mungkin tidak mempunyai izin penyerahan pada gudang kode Django.
pt_br: Algumas contribuições não precisam de permissão de commit. Dependendo das razões pelas quais um voluntário se une ao time, eles podem ou não ter permissões de commit ao repositório do Django.

source: However, should the need arise, any team member may ask for commit access by writing to the core team's mailing list. Access will be granted unless the person withdraws their request or the technical board vetoes the proposal.
id: Bagaimanapun, harus perlu timbul, setiap anggota tim mungkin meminta untuk akses perbaikan dengan menulis daftar penyuratan team inti. Akses akan diberikan meskipun orang menarik permintaan mereka atau badan teknis melarang pengajuan.
pt_br: Entretanto, caso a necessidade surja, qualquer membro do time pode solicitar permissão de commit escrevendo para a lista de email do core team. O acesso será dado a não ser que a pessoa retire a sua solicitação ou que o corpo técnico vete a proposta.

source: Core team members who have commit access are referred to as "committers" or "core developers".
id: Anggota tim inti yang mempunyai perbaikan akses disebut sebagai "committers" atau "pengembang inti".
pt_br: Membros do core team que tenham permissão de commit são chamados de "committers" ou "core developers".

source: Other permissions, such as access to the servers, are granted to those who need them through the same process.
id: Perizinan lain, seperti akses ke peladen, diberikan ke siapa yang butuh mereka melalui pengolahan yang sama.
pt_br: Outras permissões, tais como acesso aos servidores, são dadas para aqueles que precisarem delas pelo mesmo processo.

source: Membership
id: Keanggotaan
pt_br: Membros

source: The core team finds its origins with the :ref:`four people <original-team-list>` who created Django. It has grown to :ref:`a few dozen people <core-team-list>` by co-opting volunteers who demonstrate:
id: Tim inti menemukan aslinya dengan :ref:`four people <original-team-list>` yang membuat Django. Dia telah tumbuh ke :ref:`a few dozen people <core-team-list>` dengan memilih menjadi sesama anggota kelompok sukarelawan yang menunjukkan:
pt_br: O core team iniciou com as :ref:`quatro pessoas <original-team-list>` que criaram o Django. Ele cresceu para :ref:`menos de uma dúzia de pessoas <core-team-list>` através da cooptação de voluntários que demonstraram:

source: a good grasp of the philosophy of the Django Project
id: pemahaman yang baik dari filosofi Django Project
pt_br: uma boa compreensão da filosofia do Projeto Django

source: a solid track record of being constructive and helpful
id: rekam jejak yang padu menjadi konstruktif dan bermanfaat
pt_br: um histórico sólido de ser construtivo e prestativo

source: significant contributions to the project's goals, in any form
id: Sumbangan penting pada tujuan proyek, dalam bentuk apapun
pt_br: contribuições significativas para os objetivos do projeto, de qualquer forma

source: willingness to dedicate some time to improving Django
id: Kemauan untuk mengabdikan beberapa waktu untuk meningkatkan Django
pt_br: vontade de dedicar algum tempo para melhorar o Django
