Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: When committing a pull request, make sure each individual commit matches the commit guidelines described below. Contributors are expected to provide the best pull requests possible. In practice however, committers - who will likely be more familiar with the commit guidelines - may decide to bring a commit up to standard themselves.
id: Ketika memperbaiki pull request, pastikan setiap perbaikan perorangan cocok dengan panduan perbaikan digambarkan dibawah. Penyumbang diharapkan untuk menyediakan kemungkinan pull request terbaik. Dalam praktiknya bagaimanapun, pembuat perbaikan - yang akan lebih akrab dengan panduan perbaikan - mungkin memutuskan membawa perbaikan ke standar mereka sendiri.
pt_br: Ao fazer um pull request, certifique-se de que cada commit individualmente satisfaça as regras descritas abaixo. Espera-se de quem contribui os melhores pull requests possíveis de se fornecer. Na prática, entretanto, os committers, - quem provavelmente estará mais familiarizado com as regras do projeto - podem decidir melhorar a qualidade de um commit por conta própria.

source: Before merging, but after reviewing, have Jenkins test the pull request by commenting "buildbot, test this please" on the PR. See our `Jenkins wiki page`_ for more details.
id: Sebelum menggabungkan, tetapi setelah meninjau, lakukan percobaan Jenkins pull request dengan mengkomentarkan "buildbot, test this please" pada PR. Lihat `Jenkins wiki page`_ kami untuk lebih rinci.
pt_br: Antes de fazer um merge, mas depois de revisar, faça com que o Jenkins teste o pull request comentando "buildbot, test this please" no PR. Veja nossa página wiki do 'Jenkins'_ para mais detalhes.

source: An easy way to checkout a pull request locally is to add an alias to your ``~/.gitconfig`` (``upstream`` is assumed to be ``django/django``)::
id: Sebuah cara mudah untuk memeriksa pull request secara lokal adalah sebuah nama lain pada ``~/.gitconfig`` anda (``upstream`` dianggap menjadi ``django/django``)::
pt_br: Um jeito fácil de fazer checkout de um pull request localmente é adicionando um alias no seu ``~/.gitconfig`` (estamos assumindo que ``django/django`` é o nosso ``upstream``)::

source: Now you can simply run ``git pr ####`` to checkout the corresponding pull request.
id: Sekarang anda dapat dengan mudah menjalankan ``git pr ####`` untuk memeriksa permintaan pull request.
pt_br: Agora você pode simplesmente executar ``git pr ####`` para realizar o checkout do pull request correspondente.

source: At this point, you can work on the code. Use ``git rebase -i`` and ``git commit --amend`` to make sure the commits have the expected level of quality. Once you're ready:
id: Pada titik ini, anda dapat bekerja pada kode. Gunakan ``git rebase -i`` dan ``git commit --amend`` untuk memastikan perbaikan mempunyai tingkatan yang diharapkan dari kualitas. Sekali anda sedang siap:
pt_br: A partir deste momento, você pode trabalhar no código. Utilize ``git rebase -i`` e ``git commit --amend`` para garantir que os commits tenham o nível de qualidade desejado. Quando você estiver pronto:

source: For changes on your own branches, force push to your fork after rebasing on master but before merging and pushing to upstream. This allows the commit hashes on master and your branch to match which automatically closes the pull request. Since you can't push to other contributors' branches, comment on the pull request "Merged in XXXXXXX" (replacing with the commit hash) after you merge it. Trac checks for this message format to indicate on the ticket page whether or not a pull request is merged.
id: Untuk perubahan pada cabang anda sendiri, paksa dorong ke cabang anda setelah rebase pada master tetapi sebelum menggabungkan dan mendorong ke upstream. Ini mengizinkan potongan-potongan perbaikan pada master dan cabang anda untuk cocok yang otomatis menutup pull request. Sejak anda tidak dapat mendorong ke cabang-cabang penyumbang lain, komentar pada pull request "Merged in XXXXXXX" (mengganti dengan potongan perbaikan) setelah anda menggabungkannya. Trac memeriksa untuk bentuk pesan ini untuk menunjukkan pada halaman halaman tiket apakah atau tidak pull request digabungkan.
pt_br: Para mudanças em suas próprias branches, force o push no seu fork depois de fazer o rebase na master mas antes de fazer merge e push para o upstream. Isso permite que os hashes dos commits na master e na sua branch coincidam o que fecha o pull request automaticamente. Como você não pode fazer push na branch de outros contribuidores, comente no pull request "Merged in XXXXXXX" (trocando pelo hash do commit) depois que você fizer o merge. Trac procura esse formato de mensagem para indicar na página do ticket se foi feito um merge de um pull request ou não.

source: Avoid using GitHub's "Merge pull request" button on the website as it creates an ugly "merge commit" and makes navigating history more difficult.
id: Hindari menggunakan tombol "Merge pull request" GitHub pada website karena akan membuat "merge commit" yang tidak baik dan membuat navigasi riwayat lebih susah.
pt_br: Evite usar o botão "Merge pull request" no site do GitHub já que isso cria um "merge commit" tosco fazendo a navegação no histórico ficar mais difícil.

source: When rewriting the commit history of a pull request, the goal is to make Django's commit history as usable as possible:
id: Ketika menulis kembali riwayat perbaikan dari pull request, tujuannya adalah membuat riwayat perbaikan django sebaik mungkin:
pt_br: Quando estiver reescrevendo o histórico de commits de um pull request, o objetivo é fazer com que o histórico de commits do Django seja o mais útil possível:

source: If a patch contains back-and-forth commits, then rewrite those into one. For example, if a commit adds some code and a second commit fixes stylistic issues introduced in the first commit, those commits should be squashed before merging.
id: Jika tambalan mengandung perbaikan bolak balik, lalu tulis kembali itu menjadi satu. Sebagai contoh, jika sebuah perbaikan menambahkan beberapa kode dan perbaikan kedua memperbaiki masalah gaya yang diperkenalkan di perbaikan pertama, perbaikan tersebut harus dilumat sebelum digabungkan.
pt_br: Se um patch possui retornos e avanços nos commits, então reescreva esses em um só. Por exemplo, se um commit adiciona mais código e um segundo commit faz ajustes em problemas de estilo introduzidos pelo primeiro commit, esses commits devem ser unificados antes de se fazer um merge.

source: Separate changes to different commits by logical grouping: if you do a stylistic cleanup at the same time as you do other changes to a file, separating the changes into two different commits will make reviewing history easier.
id: Perubahan terpisah pada perbaikan berbeda berdasarkan pengelompokan logika: jika anda melakukan pembersihan gaya pada saat bersamaan seperti anda melakukan perubahan lain pada berkas, memisahkan perubahan kedalam dua perbaikan berbeda akan membuat meninjauan riwayat lebih mudah.
pt_br: Separe as mudanças em diferentes commits por grupos lógicos: se você faz uma limpeza de estilo ao mesmo tempo em que você faz outras mudanças em um arquivo, a separação dessas mudanças em dois commits diferentes fará a revisão do histórico de alterações mais simples.

source: Beware of merges of upstream branches in the pull requests.
id: Waspada dari menggabungkan cabang upstream dalam pull request.
pt_br: Cuidado com merges de branches do upstream dentro de pull requests.

source: Tests should pass and docs should build after each commit. Neither the tests nor the docs should emit warnings.
id: Percobaan harus dilewati dan dokumen harus dibangun setelah setiap perbaikan. Juga tidak percobaan maupun dokumen harus mengeluarkan peringatan.
pt_br: Testes devem passar e a documentação deve ser gerada depois de cada commit. Testes e documentação não devem emitir quaisquer warnings.

source: Trivial and small patches usually are best done in one commit. Medium to large work may be split into multiple commits if it makes sense.
id: Tambalan sepele dan kecil biasanya baik diselesaikan dalam satu perbaikan. Pekerjaan menengah sampai besar mungkin dipisah menjadi banyak perbaikan jika itu masuk akal.
pt_br: Patchs triviais e pequenos costumam ser melhor realizados em um único commit. Já trabalhos médios ou maiores podem ser quebrados em múltiplos commits se isso fizer sentido.

source: Practicality beats purity, so it is up to each committer to decide how much history mangling to do for a pull request. The main points are engaging the community, getting work done, and having a usable commit history.
id: Secara praktis mengalahkan kemurnian, jadi itu terserah pada setiap pembuat perbaikan untuk memutuskan berapa banyak riwayat mengoyak dilakukan untuk pull request. Titik utama adalah menarik komunitas, menyelesaikan pekerjaan, dan memiliki riwayat perbaikan yang berguna.
pt_br: Praticidade vence pureza, então vai de cada committer decidir o quanto refinar o histórico antes de um pull request. Os principais objetivos devem ser engajar a comunidade, terminar o trabalho, e ter um histórico de commits utilizável.

source: Committing guidelines
id: Panduan perbaikan
pt_br: Regras de commit

source: In addition, please follow the following guidelines when committing code to Django's Git repository:
id: Sebagai tambahan, silahkan ikuti panduan berikut ketika memperbaiki kode pada gudang Git Django:
pt_br: Adicionalmente, por favor siga as regras a seguir quando estiver commitando código para o repositório do Django no git:

source: Never change the published history of ``django/django`` branches by force pushing. If you absolutely must (for security reasons for example), first discuss the situation with the team.
id: Jangan pernah merubah riwayat telah diterbitkan dari cabang ``django/django`` dengan mendorong paksa. Jika anda mutlak harus (untuk alasan keamanan sebagai contoh), pertama obrolkan keadaan dengan tim.

source: For any medium-to-big changes, where "medium-to-big" is according to your judgment, please bring things up on the |django-developers| mailing list before making the change.
id: Untuk tiap perubahan sedang-ke-besar, dimana "sedang-ke-besar" adalah menurut penilaian anda, harap bawa hal-hal di daftar penyuratan |django-developers| sebelum membuat perubahan.
pt_br: Para qualquer mudança de média para grande, onde "média para grande" é de acordo com o seu próprio julgamento, por favor traga o problema para a lista de e-mail django-developers antes de fazer a mudança.

source: If you bring something up on |django-developers| and nobody responds, please don't take that to mean your idea is great and should be implemented immediately because nobody contested it. Django's core developers don't have a lot of time to read mailing-list discussions immediately, so you may have to wait a couple of days before getting a response.
id: Jika anda membawa sesuatu pada |django-developers| dan tidak seorangpun menanggapi, harap jangan ambil itu berarti ide anda hebat dan harus diterapkan segera mungkin karena tidak seorangpun menentangnya. Pengembang inti Django tidak mempunyai banyak waktu untuk membaca obrolan daftar-penyuratan dengan segera, jadi anda mungkin harus menunggu beberapa hari sebelum mendapatkan tanggapan.
pt_br: Se você trouxer algo novo para a lista django-developers e ninguém te respondeu por favor não entenda isso como sendo um sinal de que a sua ideia é excelente e deve ser implementada imediatamente já ninguém a contestou. Os desenvolvedores do Django não tem muito tempo disponível para ler as discussões na lista de e-mail imediatamente. Então você pode precisar esperar alguns dias antes de conseguir uma resposta.

source: Write detailed commit messages in the past tense, not present tense.
id: Tulis rincian pesan perbaikan di waktu lampau, bukan waktu ini.
pt_br: Escreva os commits com mensagens detalhadas e utilizando o passado como tempo verbal, não o presente.

source: Good: "Fixed Unicode bug in RSS API."
id: Bagus: "Memperbaiki kesalahan Unicode dalam API RSS."
pt_br: Bom: "Corrigido bug de Unicode na API de RSS."

source: Bad: "Fixes Unicode bug in RSS API."
id: Buruk: "Memperbaiki kesalahan Unicode dalam API RSS."
pt_br: Ruim: "Corrige bug de Unicode na API de RSS."

source: Bad: "Fixing Unicode bug in RSS API."
id: Buruk: "Memperbaiki kesalahan Unicode dalam API RSS."
pt_br: Ruim: "Corrigindo bug de Unicode na API de RSS."

source: The commit message should be in lines of 72 chars maximum. There should be a subject line, separated by a blank line and then paragraphs of 72 char lines. The limits are soft. For the subject line, shorter is better. In the body of the commit message more detail is better than less::
id: Pesan perbaikan harus berada di baris dari maksimum 72 karakter. Harus ada baris subjek, dipisah oleh baris kosong dan kemudian paragraf dari 72 baris karakter. Batasannya lembut. Untuk baris subjek, lebih pendek lebih baik. Di badan dari pesan perbaikan lebih rinci adalah lebih baik dari pada sedikit::
pt_br: As mensagens de commit devem ser em linhas de no máximo 72 caracteres. Deve existir uma linha de assunto, separada por uma linha em branco e então parágrafos de linhas de 72 caracteres. Os limites são boas práticas. Para a linha de assunto, quanto mais curta melhor. Em um corpo de uma mensagem de commit mais detalhes é melhor que menos::

source: If the patch wasn't a pull request, you should credit the contributors in the commit message: "Thanks A for report, B for the patch and C for the review."
id: Jika tambalan bukan pull request, anda harus menghormati penyumbang dalam pesan perbaian: "Terima kasih A untuk laporan, B untuk tambalan dan C untuk tinjauan."
pt_br: Se o patch não foi um pull request, você deverá dar crédito as pessoas que contribuiram na mensagem de commit: "Obrigado A por avisar, B pelo patch e C por revisar."

source: For commits to a branch, prefix the commit message with the branch name. For example: "[1.4.x] Fixed #xxxxx -- Added support for mind reading."
id: Untuk perbaikan pada cabang, awalai pesan perbaikan dengan nama cabang. Sebagai contoh: "[1.4.x] Fixed #xxxxx -- Ditambahkan dukungan untuk pembacaan pikiran."
pt_br: Para commits em uma branch, coloque antes da mensagem de commit o nome da branch. Por exemplo: "[1.4.x] Corrigido #xxxxx -- Adicionado suporte para leitura de mentes."

source: Limit commits to the most granular change that makes sense. This means, use frequent small commits rather than infrequent large commits. For example, if implementing feature X requires a small change to library Y, first commit the change to library Y, then commit feature X in a separate commit. This goes a *long way* in helping all Django core developers follow your changes.
id: Batasi perbaikan ke perubahan paling kecil sangat masuk akal. Ini berarti, gunakan sering perbaikan kecil daripada perbaikan besar yang jarang. Sebagai contoh, jika menerapkan fitur X membutuhkan perubahan kecil pada pustaka Y, pertama perbaiki perubahan pada pustaka Y, kemudian perbaiki fitur X di perbaikan berbeda. Ini berjalan *jauh* dalam membantu semua pengembang inti Django mengikuti perubahan anda.
pt_br: Limite os commits para a mudança mais granular que fizer sentido. Isso significa, fazer uso de commits pequenos e frequentes ao invés de commits grandes e pouco frequentes. Por exemplo, se implementar a funcionalidade X requer uma pequena mudança na biblioteca Y, primeiro faça um commit da mudança na biblioteca Y, depois faça commit da funcionalidade X em um outro commit separado. Isso já *facilita muito* no processo de ajudar todos os desenvolvedores do Django a seguir as suas alterações.

source: Separate bug fixes from feature changes. Bugfixes may need to be backported to the stable branch, according to the :ref:`backwards-compatibility policy <backwards-compatibility-policy>`.
id: Pisahkan perbaikan kesalahan dari perubahan fitur. Perbaikan kesalahan mungkin butuh disambungkan ke cabang stabil, menurut :ref:`kebijakan kecocokan-sebelumnya <backwards-compatibility-policy>`.
pt_br: Separe as correções de bug das mudanças nas funcionalidades. Correções de bug podem ter que ser portadas para a branch stable, de acordo com a :ref:`backwards-compatibility política de compatibilidade <backwards-compatibility-policy>`.

source: If your commit closes a ticket in the Django `ticket tracker`_, begin your commit message with the text "Fixed #xxxxx", where "xxxxx" is the number of the ticket your commit fixes. Example: "Fixed #123 -- Added whizbang feature.". We've rigged Trac so that any commit message in that format will automatically close the referenced ticket and post a comment to it with the full commit message.
id: Jika perbaikan anda menutup sebuah tiket di `ticket tracker`_ Django, mulai pesan perbaikan anda dengan teks "Fixed #xxxxx", dimana "xxxxx" adalah jumlah dari tiket perbaikan pembetulan. Contoh: "Fixed #123 -- Ditambahkan fitur ulung.". kami telah memperlengkapi Trac sehingga pesan perbaikan apapun di bentuk tersebut akan otomatis menutup acuan tiket dan penempatan komentar kepadanya dengan pesan perbaikan penuh.
pt_br: Se o seu commit fecha um ticket no rastreador de tickets do Django, comece a sua mensagem de commit com o texto "Fixed #xxxxx", onde "xxxxx" é o número do ticket que o seu commit corrige. Exemplo: "Corrigido #123 -- Adicionada a funcionalidade whizbang.". Nós configuramos o Trac de modo que qualquer mensagem de commit nesse formato irá automaticamente fechar o ticket referenciado e colocar um comentário nele com a mensagem completa do commit.

source: If your commit closes a ticket and is in a branch, use the branch name first, then the "Fixed #xxxxx." For example: "[1.4.x] Fixed #123 -- Added whizbang feature."
id: Jika perbaikan anda menutup tiket dan berada di cabang, gunakan namac abang terlebih dahulu, kemudian "Fixed #xxxxx." Sebagai contoh: "[1.4.x] Fixed #123 -- Ditambahkan fitur ulung."
pt_br: Se o seu commit fecha um ticket e está dentro de uma branch, utilize o nome da branch primeiro, depois o "Corrigido #xxxxx." Por exemplo: "[1.4.x] Corrigido #123 -- Adicionada a funcionalidade whizbang."

source: For the curious, we're using a `Trac plugin`_ for this.
id: Untuk ingin tahu, kami menggunakan `Tambahan Trac `_ untuk ini.
pt_br: Para os curiosos, nós estamos utilizando um plugin do Track para isso.

source: Note that the Trac integration doesn't know anything about pull requests. So if you try to close a pull request with the phrase "closes #400" in your commit message, GitHub will close the pull request, but the Trac plugin will also close the same numbered ticket in Trac.
id: Catat bahwa perpaduan Trac tidak mengetahui apapun tentang pull request. Jadi jika anda mencoba menutup pull request dengan frase "closes #400" dalam pesan perbaikan anda, GitHub akan menutup pull request, tetapi tambahan Trac akan juga menutup nomor tiket sama di Trac.
pt_br: Repare que a integração com o Trac não sabe nada sobre os pull requests. Portanto, se você tentar fechar um pull request com a frase "encerra #400 na sua mensagem de commit, o GitHub irá fechar o pull request, mas o plugin do Trac irá fechar também o respectivo ticket dentro do Trac.

source: If your commit references a ticket in the Django `ticket tracker`_ but does *not* close the ticket, include the phrase "Refs #xxxxx", where "xxxxx" is the number of the ticket your commit references. This will automatically post a comment to the appropriate ticket.
id: Jika acuan perbaikan anda sebuah tiket di `ticket tracker`_ Django tetapi *tidak* menutup tiket, termasuk frase "Refs #xxxxx", dimana "xxxxx" adalah nomor dari tiket acuan perbaikan anda. Ini akan otomatis menempatkan komentar pada tiket yang sesuai.
pt_br: Se o seu commit faz referência a um ticket no rastreador de tickets do Django mas *não* fecha o ticket, inclua a frase "Refs #xxxxx", onde "xxxxx" é o número do ticket que o seu commit faz menção. Isso irá automaticamente postar um comentário na página do respectivo ticket.

source: Write commit messages for backports using this pattern::
id: Tulis pesan perbaikan untuk backport menggunakan pola berikut:
pt_br: Escreva mensagens de commit para backports usando este formato::

source: For example::
id: Sebagai contoh::
pt_br: Por exemplo::

source: There's a `script on the wiki <https://code.djangoproject.com/wiki/CommitterTips#AutomatingBackports>`_ to automate this.
id: Terdapat tulisan pada wiki <https://code.djangoproject.com/wiki/CommitterTips#AutomatingBackports>`_ untuk mengotomatisasi ini.
pt_br: Existe um `script na wiki <https://code.djangoproject.com/wiki/CommitterTips#AutomatingBackports>`_ para automatizar isso.

source: Reverting commits
id: Mengembalikan perbaikan
pt_br: Revertendo commits

source: Nobody's perfect; mistakes will be committed.
id: Tidak seorangpun sempurna; kesalahan akan diperbaiki.
pt_br: Ninguém é perfeito; erros serão comitados.

source: But try very hard to ensure that mistakes don't happen. Just because we have a reversion policy doesn't relax your responsibility to aim for the highest quality possible. Really: double-check your work, or have it checked by another committer, **before** you commit it in the first place!
id: Tetapi coba dengan keras untuk memastikan bahwa kesalahan tidak terjadi. Hanya karena kami mempunyai kebijakan pengembalian tidak mengendurkan tanggung jawab anda untuk mengarahkan kemungkinan kualitas tertinggi. Benar: periksa dua kali pekerjaan anda, atau biarkan itu diperiksa oleh pembuat perbaikan lain, **sebelum** anda memperbaiki itu di tempat pertama!
pt_br: Mas esforce-se de verdade para garantir que erros não aconteçam. O fato de termos uma política de reversão não reduz a sua responsabilidade em buscar o maior padrão de qualidade possível. De verdade: revise o seu trabalho duas vezes, ou deixe ele ser revisado por outro committer, **antes** de você já ter feito o commit dele!

source: When a mistaken commit is discovered, please follow these guidelines:
id: Ketika kesalahan perbaikan ditemukan, silahkan ikuti panduan ini:
pt_br: Quando um commit indevido é descoberto, por favor siga as instruções abaixo:

source: If possible, have the original author revert their own commit.
id: Jika memungkinkan, penulis asli mengembalikan perbaikan mereka sendiri.
pt_br: Se possível, deixe que o autor original reverta o seu próprio commit.

source: Don't revert another author's changes without permission from the original author.
id: Jangan mengembalikan perubahan penulis lain tanpa perizinan dari penulis asli.
pt_br: Não faça o revert das mudanças de outro autor sem a permissão do autor original.

source: Use git revert -- this will make a reverse commit, but the original commit will still be part of the commit history.
id: Gunakan git revert -- ini akan membuat membalikkan perbaikan, tetapi perbaikan asli akan masih menjadi bagian dari riwayat perbaikan.
pt_br: Utilize o git revert -- isso irá fazer um commit reverso, mas o commit original ainda será parte do histórico de commits.
