Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Once you've submitted an issue via email, you should receive an acknowledgment from a member of the security team within 48 hours, and depending on the action to be taken, you may receive further followup emails.
id: Sekali anda telah mengajukan sebuah masalah via surel, anda harusnya menerima sebuah pengakuan dari anggota tim keamanan dalam 48 jam, dan tergantung pada tindakan untuk diambil, anda mungkin menerima surel tindak lanjut lebih jauh.
pt_br: Uma vez que você tenha submetido via email, você deve receber um recebido de um membro do time de segurança dentro de 48 horas, e dependendo da ação a ser tomada, você poderá receber mais emails de retorno.

source: Sending encrypted reports
id: Mengirim laporan dienkripsi

source: If you want to send an encrypted email (*optional*), the public key ID for ``security@djangoproject.com`` is ``0xfcb84b8d1d17f80b``, and this public key is available from most commonly-used keyservers.
id: Jika anda ingin mengirim sebuah surel terenkripsi (*pilihan*), ID kunci umum untuk ``security@djangoproject.com`` adalah ``0xfcb84b8d1d17f80b``, dan kunci umum ini tersedia dari kebanyakan peladen kunci umum digunakan.
pt_br: Se você quiser enviar um email criptografado (*optional*), o ID da chave pública para ``security@djangoproject.com`` é ``0xfcb84b8d1d17f80b``, e essa chave pública está disponível nos keyservers mais comuns.

source: At any given time, the Django team provides official security support for several versions of Django:
id: Pada waktu tertentu, tim Django menyediakan dukungan keamanan resmi untuk beberapa versi dari Django:
pt_br: A qualquer momento, o time Django fornece suporte de segurança oficial para várias versões do Django:

source: The `master development branch`_, hosted on GitHub, which will become the next major release of Django, receives security support. Security issues that only affect the master development branch and not any stable released versions are fixed in public without going through the :ref:`disclosure process <security-disclosure>`.
id: `master development branch`_, disimpan pada GitHub, yang akan menjadi terbitan utama selanjutnya dari Django, menerima dukungan keamanan. Masalah keamanan yang hanya mempengaruhi cabang pengembangan master dan tidak setiap versi terbitan stabil diperbaiki di umum tanpa melewati :ref:`disclosure process <security-disclosure>`.

source: The two most recent Django release series receive security support. For example, during the development cycle leading to the release of Django 1.5, support will be provided for Django 1.4 and Django 1.3. Upon the release of Django 1.5, Django 1.3's security support will end.
id: Dua paling terakhir rangkaian terbitan Django menerima dukungan keamanan. Sebagai contoh, selama siklus pengembangan membawa ke terbitan Django 1.5, dukungan akan disediakan untuk Django 1.4 dan Django 1.3. Atas terbitan Django 1.5, dukungan keamanan Django 1.3 akan berakhir.
pt_br: As duas séries de releases mais recentes do Django recebem suporte de segurança. Por exemplo, durante o ciclo de desenvolvimento que culminou com a release do Django 1.5, suporte será provido para o Django 1.4 en Django 1.3. Com a release do Django 1.5, o suporte de segurança do Django 1.3 será encerrado.

source: :term:`Long-term support release`\s will receive security updates for a specified period.
id: :term:`Long-term support release` akan menerima pembaharuan keamanan untuk masa ditentukan.
pt_br: :term:`Long-term support release`\s irão receber atualizações de segurança por um período de tempo especificado.

source: When new releases are issued for security reasons, the accompanying notice will include a list of affected versions. This list is comprised solely of *supported* versions of Django: older versions may also be affected, but we do not investigate to determine that, and will not issue patches or new releases for those versions.
id: Ketika terbitan baru dikeluarkan untuk alasan keamanan, pemberitahuan yang mendampingi akan menyertakan daftar dari versi terpengaruh. Daftar ini terdiri hanya versi *didukung* Django: versi terlama mungkin juga terpengaruh, tetapi kami tidak menyelidiki untuk menentukan itu, dan tidak mengeluarkan tambalan atau terbitan baru untuk versi itu.
pt_br: Quando novas releases são lançadas por questões de segurança, a notícia que a acompanha irá incluir uma lista de versões afetadas. Essa lista é composta somente de versões *suportadas* pelo Django: versões antigas também podem ser afetadas, mas nós não investigamos para determinar isso, e nós não lançamos patches ou novas releases para essas versões.

source: How Django discloses security issues
id: Bagaimana Django menyingkap masalah keamanan
pt_br: Como o Django divulga problemas de segurança

source: Our process for taking a security issue from private discussion to public disclosure involves multiple steps.
id: SemVer membuatnya mudah untuk melihat sekilas bagaimana terbitan sesuai dengan satu sama lain. Itu juga membantu mengantisipasi ketika kesesuaian shim akan dipindahkan. Itu tidak murni bentuk dari SemVer dimana setiap terbitan fitur akan berlanjut untuk memiliki sedikit ketidaksesuaian kebelakang terdokumentasi dimana jalur pengusangan tidak mungkin atau tidak sebanding dengan biaya. Juga, pengusangan dimulai dalam terbitan LTS (X.2) akan dijatuhkan di terbitan non-dot-zero (Y.1) untuk mengakomodasi kebijakan kami dari menjaga pengusangan shim untuk setidaknya dua terbitan fitur. Baca di bagian selanjutnya untuk contoh.
pt_br: Nosso processo para levar um problema de segurança de discussões privadas para divulgação pública envolve alguns passos.

source: Approximately one week before public disclosure, we send two notifications:
id: Lebih kurang satu minggu sebelum penutupan umum, kami mengirim dua pemberitahuan:

source: First, we notify |django-announce| of the date and approximate time of the upcoming security release, as well as the severity of the issues. This is to aid organizations that need to ensure they have staff available to handle triaging our announcement and upgrade Django as needed. Severity levels are:
id: Pertama, kami memberitahu |django-announce| dari tanggal dan lebih kurang waktu dari terbitan keamanan akan datang, sama halnya sukarnya masalah. Ini untuk membantu organisasi yang butuh memastikan mereka mempunyai staf tersedia untuk menangani mendahulukan pengumuman kami dan meingkatkan Django sesuai kebutuhan. Tingkat kesukaran adalah:

source: **High**:
id: **Tinggi**:

source: Remote code execution
id: Penjalanan kdoe terpencil

source: SQL injection
id: Suntikan SQL

source: **Moderate**:
id: **Sedang**:

source: Broken authentication
id: Otentifikasi rusak

source: **Low**:
id: **Rendah**:

source: Sensitive data exposure
id: Pembongkaran data sensitif

source: Broken session management
id: Pengelolaan sesi rusak

source: Unvalidated redirects/forwards
id: Tidak sah pengalihan/penerusan

source: Issues requiring an uncommon configuration option
id: Masalah-masalah membutuhkan pilihan konfigurasi tidak umum

source: Second, we notify a list of :ref:`people and organizations <security-notifications>`, primarily composed of operating-system vendors and other distributors of Django. This email is signed with the PGP key of someone from :ref:`Django's release team <releasers-list>` and consists of:
id: Kedua, kami memberitahu sebuah daftar dari :ref:`people and organizations <security-notifications>`, utamanya disusun dari penjaja sistem-operasi dan penyalur lain dari Django. Surel ini ditandatangi dengan kunci PGP dari seseorang dari :ref:`Django's release team <releasers-list>` dan terdiri dari:

source: A full description of the issue and the affected versions of Django.
id: Gambaran lengkap dari masalah dan versi terpengaruh dari Django.
pt_br: Uma descrição completa do problema e das versões afetadas do Django.

source: The steps we will be taking to remedy the issue.
id: Langkah-langkah yang akan kami ambil untuk memperbaiki masalah.
pt_br: Os passos que serão tomados para remediar o problema.

source: The patch(es), if any, that will be applied to Django.
id: Tambalan, jika ada, yang akan diterapkan ke Django.
pt_br: O patch (ou os patches), se existirem, que irá ser aplicado no Django.

source: The date on which the Django team will apply these patches, issue new releases and publicly disclose the issue.
id: Tanggal dimana tim Django akan memberlakukan tambalan ini, masalah terbitan baru dan menyingkap secara terbuka masalah.
pt_br: A data em que o time Django irá aplicar essas patches, lançando novas releases e publicamente divulgando o problema.

source: On the day of disclosure, we will take the following steps:
id: Pada hari penyingkapan, kami akan mengambil langkah-langkah berikut:
pt_br: No dia da divulgação, nós tomaremos as seguintes providências:

source: Apply the relevant patch(es) to Django's codebase.
id: Berlakukan tambalan sesuai pada kode dasar Django

source: Issue the relevant release(s), by placing new packages on `the Python Package Index`_ and on the Django website, and tagging the new release(s) in Django's git repository.
id: Masalah terbitan bersangkut paut, dengan menempatkan paket baru pada `the Python Package Index`_ dan pada situs jaringan Django, dan menandai terbitan baru di gudang git Django.
pt_br: Lançar as releases (ou a release) relevantes, colocando novos pacotes no `Python Package Index`_ e no website do Django, criando tags das novas releases (ou da release) no repositório git do Django.

source: Post a public entry on `the official Django development blog`_, describing the issue and its resolution in detail, pointing to the relevant patches and new releases, and crediting the reporter of the issue (if the reporter wishes to be publicly identified).
id: Tempatkan sebuah masukan umum pada `the official Django development blog`_, menggambarkan masalah dan pemecahan secara rinci, menunjuk pada tambalan terkait dan terbitan baru, dan mempercayakan melaporkan masalah (jika pelapor berharap untuk dikenali di depan umum).
pt_br: Postar uma entrada pública no `blog oficial de desenvolvimento do Django`_, descrevendo o problema e a sua resolução em detalhe, apontando para os patches relevantes e novas releases, e creditando a pessoa que reportou o problema (se essa pessoa que o reportou quiser ser identificada publicamente).

source: Post a notice to the |django-announce| and oss-security@lists.openwall.com mailing lists that links to the blog post.
id: Tempatkan sebuah pemberitahuan ke |django-announce| dan daftar penyuratan oss-security@lists.openwall.com yang menaut ke tempatan blog.
pt_br: Poste uma notícia nas listas de email |django-announce| e oss-security@lists.openwall.com que tenha links para o post no blog.

source: If a reported issue is believed to be particularly time-sensitive -- due to a known exploit in the wild, for example -- the time between advance notification and public disclosure may be shortened considerably.
id: Jika masalah yang dilaporkan dipercaya menjadi khususnya sesitif waktu -- disebabkan oleh pemanfaatan di alam liar, sebagai contoh -- waktu diantara pemberitahuan lanjutan dan penyingkapan umum mungkin dianggap mempersingkat.
pt_br: Se acredita-se que o problema reportado é particularmente sensível ao tempo -- devido a uma conhecida vulnerabilidade de segurança em aberto, por exemplo -- o tempo entre a notificação prévia e a divulgação pública pode ser encurtada consideravelmente.

source: Additionally, if we have reason to believe that an issue reported to us affects other frameworks or tools in the Python/web ecosystem, we may privately contact and discuss those issues with the appropriate maintainers, and coordinate our own disclosure and resolution with theirs.
id: Tambahannya, jika kami mempunyai alasan untuk dipercaya bahwa sebuah masalah dilaporkan ke kami mempengaruhi kerangka kerja lain atau alat-alat di ekosistem Python/jaringan, kami mungkin secara pribadi menghubungi dan mengobrol masalah itu dengan perawat yang sesuai, dan mengkoordinasikan penyingkapan kami sendiri dan pemecahan dengan mereka.
pt_br: Adicionalmente, se nós tivermos razões para acreditar que o problema reportado para nós afeta outras frameworks e ferramentas no ecossistema Python/web, nós podemos contatar privadamente e discutir esses problemas com os mantenedores apropriados, e coordenar nossa própria divulgação e resolução com eles.

source: The Django team also maintains an :doc:`archive of security issues disclosed in Django</releases/security>`.
id: Tim Django juga merawat :doc:`archive of security issues disclosed in Django</releases/security>`.
pt_br: O time Django também mantém um :doc:`arquivo de problemas de segurança divulgados no Django</releases/security>`.

source: Who receives advance notification
id: Siapa menerima pemberitahuan lanjut
pt_br: Quem recebe notificação prévia

source: The full list of people and organizations who receive advance notification of security issues is not and will not be made public.
id: Daftar penuh dari orang dan organisasi yang menerima pemberitahuan lanjutan dari masalah keamanan adalah tidak dan tidak akan dibuat umum.
pt_br: A lista completa de pessoas e organizações que recebem uma notificação prévia de problemas de segurança não é e não será tornada pública.

source: We also aim to keep this list as small as effectively possible, in order to better manage the flow of confidential information prior to disclosure. As such, our notification list is *not* simply a list of users of Django, and merely being a user of Django is not sufficient reason to be placed on the notification list.
id: Kami juga bertujuan untuk menjaga daftar ini sekecil efektif mungkin, agar pengelolaan lebih baik aliran dari informasi rahasia sebelum penyingkapan. Dengan demikian, daftar pemberitahuan kami *tidak* cukup daftar pengguna Django, dan hanya menjadi pengguna Django bukan alasan cukup ditempatkan pada daftar pemberitahuan.
pt_br: Nós também focamos em manter essa lista o quão pequena quanto for efetivamente possível, para gerenciar melhor o fluxo de informação confidencial que precede a divulgação. Como tal, nossa lista de notificação *não* é simplesmente uma lista de usuários do Django, e meramente ser um usário do Django não é razão suficiente para ser colocado na lista de notificação.

source: In broad terms, recipients of security notifications fall into three groups:
id: Dalam istilah luas, penerima dari pemberitahuan keamanan jatih kedalam tiga kelompok:
pt_br: Em linhas gerais, recipientes de notificações de segurança caem dentro de três grupos:

source: Operating-system vendors and other distributors of Django who provide a suitably-generic (i.e., *not* an individual's personal email address) contact address for reporting issues with their Django package, or for general security reporting. In either case, such addresses **must not** forward to public mailing lists or bug trackers. Addresses which forward to the private email of an individual maintainer or security-response contact are acceptable, although private security trackers or security-response groups are strongly preferred.
id: Penjaja sistem-operasi dan penyalur lainnya Django yang menyediakan umum-pantas (yaitu, *bukan* alamat surel pribadi sendiri) alamat kontak untuk melaporkan masalah dengan paket Django mereka, atau untuk pelaporan keamanan umum. Dalam kasus lain, seperti alamat **harus tidak** meneruskan ke daftar penyuratan umum atau pelacak kesalahan. Alamat yang meneruskan ke surel pribadi dari sebuah perawat sendiri atau kontak tanggapan-keamanan dapat diterima, meskipun pelacak keamanan pribadi atau kelompok tanggapan-keamanan sangat kuat dipilih.
pt_br: Fornecedores de sistemas operacionais e outras distribuições do Django que fornecem um endereço de email genérico para reportar problemas (ex. *não* são emails pessoais de indivíduos) para reportar problemas com o Django, ou para reportar problemas gerais de segurança. Em qualquer caso, tais endereços **não devem** redirecionar para listas de email públicas ou rastreadores de bugs. Endereços que encaminham para o email individual de um mantenedor ou contato para respostas de segurança são aceitas, embora rastreadores de segurança privados ou grupos de resposta a segurança são fortemente preferidos.

source: On a case-by-case basis, individual package maintainers who have demonstrated a commitment to responding to and responsibly acting on these notifications.
id: Pada dasar kasus-per-kasus, perawat paket perorangan yang telah menunjukkan tanggung jawab pada menanggapi dan bertanggungjawab bertindak pada pemberitahuan ini.
pt_br: De tempos em tempos, mantenedores de pacotes individuais que tenham demonstrado um compromisso em atender e agido de forma responsável nessas notificações.

source: On a case-by-case basis, other entities who, in the judgment of the Django development team, need to be made aware of a pending security issue. Typically, membership in this group will consist of some of the largest and/or most likely to be severely impacted known users or distributors of Django, and will require a demonstrated ability to responsibly receive, keep confidential and act on these notifications.
id: Pada berdasarkan kasus-per-kasus, di penilaian tim pengembangan Django, butuh dibuat waspada dari masalah keamanan tertunda. Khususnya, keanggotaan di kelompok ini akan terdiri dari beberapa terbesar dan/atau kebanyakan terkenda dampaknya pengguna diketahui atau penyalur Django, dan akan membutuhkan kemampuan pertunjukan untuk menerima tanggung jawab, tetap percaya diri dan bertindak pada pemberitahuan ini.
pt_br: De tempos em tempos, outras entidades que, no julgamento do time de desenvolvimento do Django, precisem estar cientes do problema de segurança pendente. Tipicamente, membros do grupo irão consistir de alguns dos maiores usuários e distribuidores do Django e dos mais provavelmente impactados severamente com o problema, e irão requerer uma abilidade demonstrada para responder prontamente, manter confidencial e agir nessas notificações.

source: Requesting notifications
id: Meminta pemberitahuan
pt_br: Requisitando notificações

source: If you believe that you, or an organization you are authorized to represent, fall into one of the groups listed above, you can ask to be added to Django's notification list by emailing ``security@djangoproject.com``. Please use the subject line "Security notification request".
id: Jika anda percaya bahwa anda, atau organisasi anda berwenang untuk mewakili, jatuh kedalam satu dari kelompok terdaftar diatas, anda dapat meminta ditambahkan ke daftar pemberitahuan Django dengan mensurelkan ``security@djangoproject.com``. Silahkan gunakan subjek baris "Security notification request".
pt_br: Se você acredita que você, ou a organização que você está autorizado a representar, cai em um dos grupos listados acima, você pode pedir para ser adicionado a lista de notificações do Django enviando um email para ``security@djangoproject.com``. Por favor use "Security notification request" no assunto.

source: Your request **must** include the following information:
id: Permintaan anda **harus** menyertakan informasi berikut:
pt_br: O seu pedido **deve** incluir a informação a seguir:

source: Your full, real name and the name of the organization you represent, if applicable, as well as your role within that organization.
id: Nama panjang anda, nama asli dan nama organisasi anda wakili, jika berlaku, sama halnya peran anda dalam organisasi itu.
pt_br: O seu nome completo, real e o nome da organização que você representa. Se aplicável, assim como o seu perfil dentro da organização.

source: A detailed explanation of how you or your organization fit at least one set of criteria listed above.
id: Penjelasan rinci dari bagaimana anda atau organisasi anda cocok setidaknya satu kumpulan dari kriteria terdaftar diatas.
pt_br: Uma explicação detalhada de como você ou sua organização se encaixam pelo menos em um dos grupos listados acima.

source: A detailed explanation of why you are requesting security notifications. Again, please keep in mind that this is *not* simply a list for users of Django, and the overwhelming majority of users should subscribe to |django-announce| to receive advanced notice of when a security release will happen, without the details of the issues, rather than request detailed notifications.
id: Penjelasan rinci dari mengapa anda sedang meminta pemberitahuan keamanan. Kembali, harap mengingat bahwa ini *bukan* daftar sederhana dari Django, dan kebanyakan pengguna harus berlangganan pada |django-announce| untuk menerima pemberitahuan lebih lanjut ketika terbitan keamanan akan terjadi, tanpa rincian dari masalah, daripada rincian pemberitahuan.

source: The email address you would like to have added to our notification list.
id: Alamat surel anda ingin miliki ditambahkan ke daftar pemberitahuan kami.
pt_br: O endereço de email que você gostaria de fosse adicionado em nossa lista de notificação.

source: An explanation of who will be receiving/reviewing mail sent to that address, as well as information regarding any automated actions that will be taken (i.e., filing of a confidential issue in a bug tracker).
id: Sebuah penjelasan dari siapa yang akan menerima/meninjau surat terkirim ke alamat itu, sama halnya informasi mengenai tindakan otomatis yang akan diambil (yaitu, mengisi masalah rahasia di pelacak kesalahan).
pt_br: Uma explicação de quem irá estar recebendo/revisando os emails enviados para esse email, asim como as informações referentes a qualquer ação automatizada que será realizada (ex. preencher um registro de problema confidencial em um bug tracker).

source: For individuals, the ID of a public key associated with your address which can be used to verify email received from you and encrypt email sent to you, as needed.
id: Untuk perorangan, ID dari kunci umum terhubung dengan alamat anda yang dapat digunakan untuk memeriksa surel diterima dari anda dan surel enkripsi dikirim ke anda, seperti kebutuhan.
pt_br: Para indivíduos, o ID ou a chave pública associada com o seu endereço que pode ser usado para verificar o seu email recebido de você e email encriptado enviado para você, quando necessário.

source: Once submitted, your request will be considered by the Django development team; you will receive a reply notifying you of the result of your request within 30 days.
id: Sekali diajukan, permintaan anda akan dianggap oleh tim pengembang Django; anda akan menerima balasan memberitahu anda dari hasil dari permintaan anda dalam 30 hari.
pt_br: Uma vez submetido, a sua solicitação será considerada pelo time de desenvolvimento do Django; você irá receber uma resposta notificando você do resultado da sua solicitação dentro de 30 dias.

source: Please also bear in mind that for any individual or organization, receiving security notifications is a privilege granted at the sole discretion of the Django development team, and that this privilege can be revoked at any time, with or without explanation.
id: Silahkan juga ingat bahwa untuk setiap perseorangan atau oranisasi, menerima pemberitahuan keamanan adalah hak yang diberikan pada kebijakan dari tim pengembangan Django, dan bahwa hak ini dapat diambil kapanpun, dengan atau tanpa penjelasan.
pt_br: Por favor tambén tenha em mente que para qualquer indivíduo ou organização, receber notificações de segurança é um privilégio dado somente ao critério do time de desenvolvimento do Django, e que esse privilégio pode ser revogado a qualquer momento, com o sem explicação.

source: Django team
id: Tim Django
pt_br: Time Django

source: The original team
id: Tim asli
pt_br: A equipe original
