Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: There are several items to do in the time following a the creation of a new stable branch (often following an alpha release). Some of these tasks don't need to be done by the releaser.
pt_br: Existem vários itens a se fazer no momento posterior a criação de uma nova branch estável (geralmetne após uma alpha release). Algumas dessas tarefas não precisam ser feitas pelo releaser.

source: A (very) low-traffic list for announcing new releases of Django and important bugfixes.
pt_br: Uma lista de volume (muito) baixo para anunciar novas releases do Django e correções de bugs importantes.

source: Veto a grant of commit access or remove commit access. This happens on the django-core mailing-list.
pt_br: Vetar permissões de commit, seja de acesso ou a remoção dele. Isso acontece na lista de email django-core.

source: Django 4.2 will contain a backwards-compatible replica of the function which will raise a ``RemovedInDjango51Warning``. This warning is silent by default; you can turn on display of these warnings with the ``-Wd`` option of Python.
pt_br: O Django 4.2 irá conter uma réplica da função compatível com versões anteriores que irá gerar um ``RemovedInDjango51Warning``. Esse warning é silencioso por padrão; você pode habilitar a exibição desses warnings com a opção ``-Wd`` do Python.

source: Django 5.0 (the version that follows 4.2) will still contain the backwards-compatible replica. This warning becomes *loud* by default and will likely be quite annoying.
pt_br: Django 5.0 (a versão que segue a 4.2) ainda irá possuir a réplica da função compatível com versões anteriores. Esse warning se torna *loud* por padrão e irá provavelmente se tornar bem desagradável.

source: The technical board for the 1.9 release cycle is:
pt_br: O conselho técnico para o ciclo de release 1.9 é:

source: Instead, if you believe you've found something in Django which has security implications, please send a description of the issue via email to ``security@djangoproject.com``. Mail sent to that address reaches a :ref:`subset of the core team <security-team-list>`, who can forward security issues into the private committers' mailing list for broader discussion if needed.
pt_br: Ao invés disso, se você acredita que achou algo no Django que tem implicações de segurança, por favor envie a descrição do problema via email para ``security@djangoproject.com``. Email enviado para esse endereço chega a um:ref:`subconjunto do core team <security-team-list>`, que poderá reencaminhar problemas de segurança nas listas de email privadas dos committers para uma discussão mais profunda se necessário.

source: The `master development branch`_, hosted on GitHub, which will become the next release of Django, receives security support.
pt_br: A branch `master de desenvolvimento`_, hospedada no GitHub, que irá se tornar a próxima release do Django, recebe suporte de segurança.

source: Approximately one week before full public disclosure, we will send advance notification of the issue to a list of people and organizations, primarily composed of operating-system vendors and other distributors of Django. This notification will consist of an email message, signed with the Django release key, containing:
pt_br: Aproximadamente uma semana antes de total divulgação pública, nós enviamos notificações prévias do problema para a lista de pessoas e organizações, primariamente compostas de fornecedores de sistemas operacionais e outros distribuidores do Django. Essa notificação irá consistir de uma mensagem de email, assinada com a chave de release do Django, contendo:

source: Simultaneously, the reporter of the issue will receive notification of the date on which we plan to take the issue public.
pt_br: Simultaneamente, a pessoa que reportou o problema irá receber uma notificação da data na qual nós planejamos divulgar publicamente o problema.

source: Apply the relevant patch(es) to Django's codebase. The commit messages for these patches will indicate that they are for security issues, but will not describe the issue in any detail; instead, they will warn of upcoming disclosure.
pt_br: Aplicar o patch (ou os patches) relevantes a base de código do Django. As mensagens de commit desses patches irão indicar que eles são para problemas de segurança, mas nós não iremos descrever o problema em nenhum detalhe; ao invés disso. eles irão avisar sobre a divulgação futura.

source: A detailed explanation of why you are requesting security notifications. Again, please keep in mind that this is *not* simply a list for users of Django, and the overwhelming majority of users of Django should not request notifications and will not be added to our notification list if they do.
pt_br: Uma explicação detalhada de por qual razão você está solicitando notificações de segurança. Novamente, por favor mantenha em mente que esta *não* é uma lista simples de usuários do Django, e a maioria esmagadora dos usuários do Django não devem solicitar notificações e não serão adicionados em nossa lista de notificação.

source: If you are added to the notification list, security-related emails will be sent to you by Django's release team, and all notification emails will be signed with a key authorized to issue Django releases. The list of authorized keys is in `the Django releasers file`_.
pt_br: Se você for adicionado a lista de notificação, emails relacionados a segurança serão enviados para você pelo time de release do Django, e todas as notificações de emails serão assinadas com uma chave autorizada para lançar releases do Django. A lista de chaves autorizadas está no arquivo `de releases do Django`_.

source: James is one of Django's release managers, and also contributes to the documentation and provide the occasional bugfix.
pt_br: James é um dos gerentes de releases do Django, e também contribui com a documentação e fornecendo correções de bugs ocasionalmente.

source: James came to Web development from philosophy when he discovered that programmers get to argue just as much while collecting much better pay. He lives in Lawrence, Kansas and previously worked at World Online; currently, he's part of the Web development team at Mozilla.
pt_br: James veio para o desenvolvimento Web da filosofia onde ele descobriu que programadores discutem o mesmo tanto mesmo que sejam bem pagos. Ele vive em Lawrence, Kansas e trabalhou anteriormente na World Online. atualmente, ele é parte do time de desenvolvimento Web da Mozilla.

source: Chris has been submitting patches and suggesting crazy ideas for Django since early 2006. An advocate for community involvement and a long-term triager, he is still often found answering questions in the #django IRC channel.
pt_br: Chris envia patches e sugere ideias malucas para o Django desde o começo de 2006. Um defensor do envolvimento da comunidade e que atua na triagem de tickets há muito tempo, ele ainda é encontrado com frequência respondendo questões no canal IRC do #django.

source: Idan previously accepted freelance work under the Pixane_ imprint, but now splits his days between his startup, Skills_, and beautifying all things Django and Python.
pt_br: Idan previamente aceitou trabalho como freelancer sob a marca Pixane_. mas agora divide os seus dias entre sua startup, Skills_, e embelezar todas as coisas do Django e Python.

source: He's the CTO of Oscaro_, an e-commerce company based in Paris, France.
pt_br: Ele é o CTO da Oscaro_, uma companhia de e-commerce baseada em Paris, França.

source: Michael started running Django on Windows against a Microsoft SQL Server (MSSQL) database in 2008. He quickly became the maintainer of the django-mssql 3rd party database backend. Much of his involvement with Django relates to the ORM, the private 3rd party database API, and using Django on Windows.
pt_br: Michael começou a rodar Django no Windows usando um banco de dados Microsoft SQL Server (MSSQL) em 2008. Ele rapidamente se tornou o mantenedor do backend de banco de dados de 3terceiros django-mssql. A maior parte de seu envolvimento com o Django é relacionado ao ORM, a API privada de banco de dados de 3terceiros e utilização do Django no Windows.

source: He spends a lot of time helping people on the #django IRC channel, and has authored and released a number of `smaller django apps`_.
pt_br: Ele gasta um bom tempo ajudando pessoas no canal IRC #django, e tem criado e lançado alguns `apps django menores`_.

source: Markus is a Master of Science student in Computer Science at `Technical University of Berlin`_. He started working with Django in 2010 when he joined the `ubuntuusers.de`_ web team to work on *Inyoka*. Markus made his first contribution to the Django project during DjangoCon Europe 2013 in Warsaw. He was the web team leader for the `EuroPython 2014 website`_.
pt_br: Markus é um estudante de mestrado em Ciência da Computação na `Technical University of Berlin`_. Ele começou a trabalhar com Django em 2010 quando ele se juntou ao time web `ubuntuusers.de`_ para trabalhar no *Inyoka*. Markus fez sua primeira contribuição para o projeto Django durante a DjangoCon Europe 2013 em Varsóvia. Ele foi líder do time web para o `EuroPython 2014 website`_.
