Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: If an `unreviewed ticket`_ reports a bug, try and reproduce it. If you can reproduce it and it seems valid, make a note that you confirmed the bug and accept the ticket. Make sure the ticket is filed under the correct component area. Consider writing a patch that adds a test for the bug's behavior, even if you don't fix the bug itself. See more at :ref:`how-can-i-help-with-triaging`
id: Jika `unreviewed ticket`_ melaporkan kesalahan, coba untuk memproduksi ulang. Jika anda dapat memproduksi ulang dan terlihat sah, buat catatan bahwa anda menegaskan kesalahan dan menerima tiket. Pastikan tiket diisi dibawah kawasan komponen yang benar. Pertimbangkan menulis tambalan yang menambahkan percobaan untuk kebiasaan kesalahan, bahkan jika anda tidak memperbaiki kesalahan itu sendiri. Lihat lebih pada :ref:`how-can-i-help-with-triaging`
pt_br: Se um `ticket não revisado`_ reporta um novo bug, tente reproduzi-lo. Se você pode reproduzi-lo e ele parece válido, faça uma nota informando que você confirmou o bug e aceitou o ticket. Certifique-se de que o ticket foi criado na área correta. Considere escrever um patch adicionando um teste para o comportamento apontado no bug, mesmo que você não corrija o problema em si. Veja mais em :ref:`how-can-i-help-with-triaging`

source: **Look for tickets that are accepted and review patches to build familiarity with the codebase and the process**
id: **Mencari tiket yang menerima dan meninjau tambalan untuk membangun keakraban dengan basiskode dan pengolahan**
pt_br: **Procure por tickets que são aceitos e revise os patchs para criar familiaridade com o processo e a estrutura do código.**

source: Mark the appropriate flags if a patch needs docs or tests. Look through the changes a patch makes, and keep an eye out for syntax that is incompatible with older but still supported versions of Python. :doc:`Run the tests </internals/contributing/writing-code/unit-tests>` and make sure they pass. Where possible and relevant, try them out on a database other than SQLite. Leave comments and feedback!
id: Tandai bendera yang sesuai jika tambalan butuh dokumentasi atau percobaan. Liat melalui perubahan yang tambalan buat, dan awasi untuk sintaksis yang tidak sesuai dengan yang lama tetapi masih versi yang didukung Python. :doc:`Run the tests </internals/contributing/writing-code/unit-tests>` dan pastikan mereka lolos. Dimana memungkinkan dan relevan, coba mereka pada basisdata selain SQLite. Tinggalkan komentar dan umpan balik!
pt_br: Adicione as tags apropriadas caso um patch necessite de documentação ou testes. Analise as mudanças que o patch provoca, fique atento com síntaxe incompatível com versões antigas do Python e que ainda são suportadas. :doc:`Rode os testes </internals/contributing/writing-code/unit-tests>` e certifique-se de que eles passaram. Quando possível e relevante, tente rodá-los em uma base diferente do SQLite. Deixe comentários e feedback!

source: **Keep old patches up to date**
id: **Tetap tambalan lama diperbaharui**
pt_br: **Mantenha patches antigos atualizados**

source: Oftentimes the codebase will change between a patch being submitted and the time it gets reviewed. Make sure it still applies cleanly and functions as expected. Simply updating a patch is both useful and important! See more on :doc:`writing-code/submitting-patches`.
id: Seringkali basiskode akan berubah diantara tambalan sedang diajukan dan waktu dia mendapatkan tinjauan. Pastikan dia masih berlaku bersih dan berfungsi sesuai harapan. Cukup perbaharui tambalan adalah keduanya berguna dan penting! Lihat lebih pada :doc:`writing-code/submitting-patches`.
pt_br: A base de código costuma mudar entre o momento em que um patch é submetido e o momento em que ele é revisado. Certifique-se de que ele ainda seja aplicado de forma limpa e que ele funcione da maneira esperada. A simples atualização de um patch já é útil e importante! Saiba mais em :doc:`writing-code/submitting-patches`.

source: **Write some documentation**
id: **Tulis beberapa dokumentasi**
pt_br: **Escreve alguma documentação**

source: Django's documentation is great but it can always be improved. Did you find a typo? Do you think that something should be clarified? Go ahead and suggest a documentation patch! See also the guide on :doc:`writing-documentation`.
id: Dokumentasi Django sangat hebat tetapi itu dapat selalu diperbaiki. Dpakah anda menemukan kesalahan ketik apapun? Apakah anda pikir bahwa sesuatu harus dijelaskan? Pergilah dan sarankan tambalan dokumentasi! Lihat juga panduan pada :doc:`writing-documentation`.

source: The `reports page`_ contains links to many useful Trac queries, including several that are useful for triaging tickets and reviewing patches as suggested above.
id: `reports page`_ megnandung tautan ke banyak permintaan Trac berguna, termasuk beberapa yang berguna untuk mendhulukan tiket dan menilai tambalan seperti disarankan diatas.
pt_br: A `página de relatórios`_ contém links para muitas consultas úteis no Trac, incluindo muitas úteis na triagem de tickets e revisão de patches como sugerido acima.

source: Guidelines
id: Panduan
pt_br: Orientações

source: As a newcomer on a large project, it's easy to experience frustration. Here's some advice to make your work on Django more useful and rewarding.
id: Sbagai seorang pendatang baru pada proyek besar, sangat mudah mengalami frustasi. Ini adalah beberapa saran untuk membuat pekerjaan anda pada Django lebih berguna dan bermanfaat.
pt_br: Como um recém-chegado em um projeto gigantesco, É fácil acabar se frustrando. Aqui vão algumas dicas para fazer o seu trabalho no Django ser mais útil e recompensador.

source: **Pick a subject area that you care about, that you are familiar with, or that you want to learn about**
id: **Ambil kawasan subjek yang abda peduli, yang anda akbrab, atau yang anda ingin pelajari**
pt_br: **Escolha um assunto que você te interesse, com o qual você esteja familiarizado, ou que você queira aprender**

source: You don't already have to be an expert on the area you want to work on; you become an expert through your ongoing contributions to the code.
id: Anda tidak harus menjadi ahli pada kawasan anda ingin kerjakan; anda menjadi seorang ahli melalui sumbangan berjalan anda pada kode.
pt_br: Você não precisa já ser um expert na sua área de atuação para poder atuar nela; você se torna um expert à medida em que vai dando suas contribuições com o código.

source: **Analyze tickets' context and history**
id: **Analisa konteks & riwayat tiket-tiket**
pt_br: **Analise o contexto e histórico dos tickets**

source: Trac isn't an absolute; the context is just as important as the words. When reading Trac, you need to take into account who says things, and when they were said. Support for an idea two years ago doesn't necessarily mean that the idea will still have support. You also need to pay attention to who *hasn't* spoken -- for example, if a core team member hasn't been recently involved in a discussion, then a ticket may not have the support required to get into trunk.
id: Trac tidak mutlak; konteks hanya sama pentingnya dengan kata-kata. Ketika membaca Trac, anda perlu memperhitungkan siapa mengatakan hal-hal, dan kapan mereka katakan. Dukungan untuk sebuah ide dua tahun lalu tidak berarti bahwa ide akan masih mempunyai dukungan. Anda juga butuh perhatian ke siapa *belum* bicara -- sebagai contoh, jika anggota tim inti belum terlibat dalam obrolan, kemudian sebuah tiket mungkin tidak memiliki dukungan yang butuhkan untuk masuk ke dalam bagasi.
pt_br: Trac não é absoluto; o contexto é tão importante quanto as palavras. Ao ler o Trac, você deve levar em consideração quem está escrevendo coisas e quando essas coisas foram escritas. Suporte para uma ideia dois anos atrás não necessariamente significa que a ideia ainda terá suporte atualmente. Você também precisa prestar atenção em quem *não* participou da discussão -- por exemplo, se um membro do projeto Django não se envolveu recentemente em uma discussão, então o ticket pode não ter o suporte necessário para entrar no trunk.

source: **Start small**
id: **Mulai kecil**
pt_br: **Comece devagar**

source: It's easier to get feedback on a little issue than on a big one. See the `easy pickings`_.
id: Hal ini lebih mudah mendapatkan umpanbalik pada masalah kecil daripada yang besar. Lihat `easy pickings`_.
pt_br: É mais fácil obter retorno para um problema pequeno do que para um problema grande. Veja os `easy pickings`_.

source: **If you're going to engage in a big task, make sure that your idea has support first**
id: **Jika anda akan mengajak di tugas besar, apstikan bahwa ide andamempunyai dukungan terlebih dahulu**
pt_br: **Se você planeja se engajar em uma tarefa grande, certifique-se que a sua ideia possui apoio primeiro**

source: This means getting someone else to confirm that a bug is real before you fix the issue, and ensuring that the core team supports a proposed feature before you go implementing it.
id: Ini berarti mendapatkan seseorang lain untuk menegaskan bahwa kesalahan adalah nyata sebelum anda memperbaiki masalah, dan memastikan bahwa tim inti mendukung fitur yang diajukan sebelum anda pergi menerapkannya.
pt_br: Isso significa que outra pessoa deve confirmar que um bug é real antes de você corrigir o problema, e garantir que o time do projeto apoia a ideia proposta antes de você começar a implementá-la.

source: **Be bold! Leave feedback!**
id: **Berani! Tinggalkan umpanbalik!**
pt_br: **Seja corajoso! Deixe comentários!**

source: Sometimes it can be scary to put your opinion out to the world and say "this ticket is correct" or "this patch needs work", but it's the only way the project moves forward. The contributions of the broad Django community ultimately have a much greater impact than that of the core team. We can't do it without **you**!
id: Terkadang itu dapat menakutkan untuk menaruh pendapat anda ke dunia dan mengatakan "tiket ini benar" atau "tambalan ini butuh bekerja", tetapi itu hanya jalan proyek maju kedepan. Sumbangan dari komunitas luas Django akhirnya mempunyai dampak yang lebih hebat daripada tim inti. Kami tidak dapat melakukannya tanpa **anda**!
pt_br: Às vezes pode ser assustador deixar a sua opinião escancarada para o mundo e dizer "este ticket está correto" ou "este patch precisa ser melhorado", mas essa é a única maneira de fazer o projeto seguir em frente. As vastas contribuições da comunidade Django no final tem um impacto muito maior do que as próprias contribuições do time do projeto. Nós não somos capazes de fazer isso sem **vocês**!

source: **Err on the side of caution when marking things Ready For Check-in**
id: **Kesalahan pada sisi hati-hati ketika menandai hal-hal Ready For Check-in**
pt_br: **Peque por excesso de precaução ao marcar coisas como Ready For Check-in**

source: If you're really not certain if a ticket is ready, don't mark it as such. Leave a comment instead, letting others know your thoughts. If you're mostly certain, but not completely certain, you might also try asking on IRC to see if someone else can confirm your suspicions.
id: Jika anda tidak yakin jika sebuah tiket siap, jangan tandai begitu saja. Tinggalkan komentar sebagai gantinya, membiarkan orang lain mengetahui pikiran anda. Jika anda hampir yakin, tetapi tidak sepenuhnya yakin, anda mungkin juga mencoba menanyakan di IRL untuk melihat jika seseorang lain dapat menegaskan kecurigaan anda.
pt_br: Se você realmente não tem certeza se um ticket está pronto, não o marque como pronto. Ao invés disso deixe um comentário, deixe que outras pessoas saibam o que você acha. Se você tem praticamente certeza, mas não totalmente, você também pode tentar perguntar no IRC para ver se mais alguém confirma as suas suspeitas.

source: **Wait for feedback, and respond to feedback that you receive**
id: **Tunggu untuk umpanbalik, dan tanggapi untuk umpanbalik yang anda terima**
pt_br: **Aguarde por feedback, e responda ao feedback que você receber**

source: Focus on one or two tickets, see them through from start to finish, and repeat. The shotgun approach of taking on lots of tickets and letting some fall by the wayside ends up doing more harm than good.
id: Jika anda tidak yakin jika tiket sudah siap, jangan menandainya. Tinggalkan komentar sebagai gantinya, membiatkan lainnya mengetahui pikiran anda. Jika anda sangat yakin, tetapi tidak sepenuhnya yakin, anda mungkin juga coba menanyakan pada IRC untuk melihat jika lainnya dapat menegaskan kecurigaan anda.
pt_br: Foque-se em um ou dois tickets, veja eles inteiros do começo ao fim, e repita. A estratégia da escopeta de pegar vários tickets e deixar alguns falhar pelo lado acaba fazendo mais mal do que bem.

source: **Be rigorous**
id: **Menjadi keras**
pt_br: **Seja rigoroso**

source: When we say ":pep:`8`, and must have docs and tests", we mean it. If a patch doesn't have docs and tests, there had better be a good reason. Arguments like "I couldn't find any existing tests of this feature" don't carry much weight--while it may be true, that means you have the extra-important job of writing the very first tests for that feature, not that you get a pass from writing tests altogether.
id: Ketika kami katakan ":pep:`8`, dan harus mempunyai dokumen dan percobaan", kami bersungguh-sungguh. Jika tambalan tidak mempunyai dokumen dan percobaan, ada lebih baik untuk menjadi alasan baik. Argumen seperti "Saya tidak dapat menemukan percobaan yang ada dari fitur ini" jangan membawa terlalu berat--selagi itu mungkin benar, itu berarti anda mempunyai pekerjaan ekstra-penting dari menulis percobaan paling pertama untuk fitur itu, bukan yang anda dapatkan dari menulis percobaan semuanya.
pt_br: Quando nós dizemos ":pep:`8`, e que deve ter documentação e testes, é sério. Se um patch não tiver documentação e testes, ele deve possuir uma boa razão para isso. Argumentos como "Eu não consegui achar quaisquer testes existentes dessa funcionalidade" não tem grande peso--embora eles possam ser verdadeiros, isso significa que você tem o importantíssimo trabalho de escrever os primeiros testes para essa funcionalidade, e não que você está livre de ter que escrevê-los.

source: **This ticket I care about has been ignored for days/weeks/months! What can I do to get it committed?**
id: **Tiket ini yang Saya peduli telah diabaikan untuk harian/mingguan/bulanan! Apa yang dapat Saya lakukan untuk mendapatkannya diperbaiki?**
pt_br: **Este ticket que me interessa foi ignorado por dias/semanas/meses! O que eu posso fazer para que ele seja commitado?

source: First off, it's not personal. Django is entirely developed by volunteers (even the core team), and sometimes folks just don't have time. The best thing to do is to send a gentle reminder to the |django-developers| mailing list asking for review on the ticket, or to bring it up in the `#django-dev` IRC channel.
id: Pertama, itu bukan pribadi. Django seluruhnya dikembangkan oleh relawan (bahkan tim inti), dan terladang orang-orang hanya tidak mempunyai waktu. Hal terbaik dilakukan adalah mengirim pengingat ramah ke daftar penyuratan |django-developers| meminta untuk peninjauan pada tiket, atau membawanya di saluran IRC `#django-dev`.

source: **I'm sure my ticket is absolutely 100% perfect, can I mark it as RFC myself?**
id: **Saya yakin tiket saya sepenuhnya 100% sempurna, dapatkah Saya tandai itu sebagai RFC saya sendiri?
pt_br: **Eu tenho certeza que o meu ticket está absolutamente 100% perfeito, posso marcá-lo como RFC eu mesmo?**

source: Short answer: No. It's always better to get another set of eyes on a ticket. If you're having trouble getting that second set of eyes, see question 1, above.
id: Jawaban pendek: Tidak. Itu selalu lebih baik mendapatkan kumpulan mata lain pada tiket. Jika anda mempunyai masalah mendapatkan kumpulan mata kedua itu, lihat pertanyaan 1, diatas.
pt_br: Resposta curta: Não. É sempre melhor ter outros conjuntos de olhos em um ticket. Se você está tendo problemas para obter esse segundo conjunto de olhos, veja a questão 1, acima.

source: Triaging tickets
id: Mendahulukan tiket
pt_br: Triangulando tickets

source: Django uses Trac_ for managing the work on the code base. Trac is a community-tended garden of the bugs people have found and the features people would like to see added. As in any garden, sometimes there are weeds to be pulled and sometimes there are flowers and vegetables that need picking. We need your help to sort out one from the other, and in the end we all benefit together.
id: Django menggunakan Trac_ mengelola pekerjaan pada basis kode. Trac adalah taman cenderung-komunitas dari kesalahan orang telah menemukan dan fitur orang akan senang melihat ditambahkan. Seperti di taman manapun, terkadang ada gulma untuk ditarik dan terkada ada bunga dan sayuran yang butuh dipetik. Kami butuh bantuan anda untuk mengurutkan satu dari lainnya, dan pada akhirnya kami semua beruntung bersama-sama.
pt_br: Django utiliza Trac_ para o gerenciamento do trabalho no código base. Trac é um jardim comunitário de bugs que pessoas encontraram e de funcionalidades que pessoas gostariam de ver adicionadas. Como em qualquer jardim, algumas vezes existem ervas daninhas para serem retiradas e algumas vezes existem flores e vegetais para serem colhidos. Nós precisamos da sua ajuda para separar um do outro, e no final todos nós nos beneficiamos.

source: Like all gardens, we can aspire to perfection but in reality there's no such thing. Even in the most pristine garden there are still snails and insects. In a community garden there are also helpful people who -- with the best of intentions -- fertilize the weeds and poison the roses. It's the job of the community as a whole to self-manage, keep the problems to a minimum, and educate those coming into the community so that they can become valuable contributing members.
id: Seperti semua taman, kami dapat becita-cita untuk penyempurnaan tetapi kenyataannya tidak ada hal tersebut. Bahkan di taman paling asli masih ada keong dan serangga. Di taman komunitas ada juga membantu orang yang -- dengan niat terbaik -- menyuburkan gulma dan meracuni mawar. Itu tugas dari komunitas sebagai keseluruhan untuk pengelolaan-sendiri, jaga masalah sampai minimum, dan didik yang datang ke dalam komunitas sehingga mereka dapat menjadi anggota penyumbang berharga.
pt_br: Como em todos os jardins, nós podemos buscar a perfeição mas na realidade não existe algo assim. Até mesmo nos jardins mais puros existem lesmas e insetos. Em um jardim comunitário também existem pessoas que -- com a melhor das intenções -- fertilizam as ervas daninhas e envenenam as flores. É trabalho da comunidade como um todo se auto-gerenciar, reduzir problemas, e educar quem ingressa na comunidade de modo que eles possam contribuir e se tornar membros valiosos.

source: Similarly, while we aim for Trac to be a perfect representation of the state of Django's progress, we acknowledge that this simply will not happen. By distributing the load of Trac maintenance to the community, we accept that there will be mistakes. Trac is "mostly accurate", and we give allowances for the fact that sometimes it will be wrong. That's okay. We're perfectionists with deadlines.
id: Demikian pula, ketika kami membidik untuk Trac menjadi perwakilan sempurna dari keadaan kemajuan Django, kami mengakui bahwa ini secara sederhana tidak akan terjadi. Dengan menyebarkan muatan dari perawatan Trac ke komunitas, kami menerima bahwa akan ada kesalahan. Trac adalah "paling akurat", dan kami memberikan kelonggaran untuk fakta bahwa terkadang itu akan salah. Tidak mengapa. Kami sangat sempurna dengan tenggat waktu.
pt_br: De modo similar, embora nós busquemos fazer com que o Trac seja uma representação perfeita do estado de progresso do Django, nós reconhecemos que isso simplesmente não vai acontecer. Ao distribuir a carga de manutenção do Trac para a comunidade, nós aceitamos que erros irão acontecer. Trac é "quase perfeito" e nós damos consentimento para o fato de que às vezes ele estará errado. Isso é normal Nós somos perfeccionistas com prazos.

source: We rely on the community to keep participating, keep tickets as accurate as possible, and raise issues for discussion on our mailing lists when there is confusion or disagreement.
id: Kami bergantung pada komunitas untuk terus ikut serta, menjaga tiket seakurat mungkin, dan menimnulkan masalah-masalah untuk diobrolkan pada daftar penyuratan kami ketika ada kebingungan dan ketidaksetujuan.
pt_br: Nós confiamos na comunidade para continuar participando, manter os tickets tão atualizados e corretos quanto for possível, e levantar problemas para discussão em nossas listas de email quando existirem desentendimentos ou confusão.

source: Django is a community project, and every contribution helps. We can't do this without **you**!
id: Django adalah proyek komunitas, dan setiap bantuan membantu. Kami tidak dapat melakukan ini tanpa **anda**!
pt_br: Django é um projeto comunitário, e cada contribuição ajuda. Nós não podemos fazer isso sem **vocês**!

source: Triage workflow
id: Alur kerja Triage
pt_br: Fluxo de triagem

source: Unfortunately, not all bug reports and feature requests in the ticket tracker provide all the :doc:`required details<bugs-and-features>`. A number of tickets have patches, but those patches don't meet all the requirements of a :ref:`good patch<patch-style>`.
id: Sayangnya tidak semua laporan kesalahan dan permintaan fitur di pelacak tiket menyediakan semua :doc:`required details<bugs-and-features>`. Angka dari tiket mempunyai tambalan, tetapi tambalan tersebut tidak memenuhi semua persyaratan dari :ref:`good patch<patch-style>`.
pt_br: Infelizmente, nem todos os relatos de bugs e solicitações de novas funcionalidades no rastreador de tickets fornecem todos os :doc:`detalhes necessários<bugs-and-features>`. Um número de tickets possui patches, mas esses patches não atendem a todos os requisitos de um :ref:`bom patch<patch-style>`.

source: One way to help out is to *triage* tickets that have been created by other users. The core team and several community members work on this regularly, but more help is always appreciated.
id: Satu cara untuk membantu adalah *memberikan* tiket yang telah dibuat oleh pengguna lain. Tim inti dan beberapa anggota komunitas bekerja pada ini secara reguler, tetapi bantuan lebih selalu dihargai.
pt_br: Uma forma de ajudar é fazendo uma *triagem* dos tickets que foram criados por outros usuários. O time do projeto e vários membros da comunidade trabalham nisso regularmente, mas ajuda adicional é sempre bem vinda.

source: Most of the workflow is based around the concept of a ticket's :ref:`triage stages <triage-stages>`. Each stage describes where in its lifetime a given ticket is at any time. Along with a handful of flags, this attribute easily tells us what and who each ticket is waiting on.
id: Kebanyakan alurkerja berdasarkan seputar konsep dari :ref:`triage stages <triage-stages>` tiket. Setiap tahapan menggambarkan dimana didalam siklus hidupnya tiket yang diberikan adalah kapan saja. Bersama dengan bendera-bendera yang sangat membantu, atribut ini dengan mudah memberitahu kami bahwa apa dan siapa setiap tiket sedang menunggu.
pt_br: A maior parte do fluxo de trabalho é baseada em torno do conceito de tickets :ref:`estágios de triagem <triage-stages>`. Cada estágio descreve em que parte de seu clico de vida um ticket está em um dado momento. Além de várias tags, esse atributo nos diz claramente o que e quem o ticket está aguardando.

source: Since a picture is worth a thousand words, let's start there:
id: Sejak gambar berharga seribu kata, mari kita mulai disana:
pt_br: Já que uma imagem vale mais que mil palavras, vamos começar aqui:
