Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: If this is your first release, you'll need to coordinate with James and/or Jacob to get all these things lined up.
id: Jika ini adalah terbitan pertama anda, anda akan butuh berkoordinasi dengan James dan/atau Jacob untuk mendapatkan semua hal ini diantrikan.
pt_br: Se essa é a sua primeira release, você precisará se alinhar com James e/ou Jacob para fazer todas essas coisas de forma organizada.

source: Pre-release tasks
id: Tugas-tugas pra terbitan
pt_br: Tarefas de pré-release

source: A few items need to be taken care of before even beginning the release process. This stuff starts about a week before the release; most of it can be done any time leading up to the actual release:
id: Beberapa barang harus dijaga sebelum bahkan memulai pengolahan terbitan. Barang ini mulai sekitar seminggu sebelum terbitan; kebanyakan dari itu dapat dilakukan kapan saja membawa ke terbitan sebenarnya:
pt_br: Alguns itens precisam ser realizados antes mesmo de começar o processo de release. Isso começa por volta de uma semana antes da release; a maior parte dele pode ser feita a qualquer momento culminando na release em si:

source: If this is a security release, send out pre-notification **one week** before the release. We maintain a list of who gets these pre-notification emails in the private ``django-core`` repository. Send the mail to ``security@djangoproject.com`` and BCC the pre-notification recipients. This email should be signed by the key you'll use for the release, and should include patches for each issue being fixed.
id: Jika ini adalah sebuah terbitan keamanan, kirimkan pemberitahuan **satu minggu** sebelum terbitan. Kami merawat daftar dari siapa yang mendapatkan surel pemberitahuan dalam gudang ``django-core`` pribadi. Kirim surel ke ``security@djangoproject.com`` dan BCC penerima pemberitahuan. Surel ini harus ditandatangani oleh kunci anda akan gunakan untuk terbitan, dan harus menyertakan tambalan untuk setiap masalah sedang diperbaiki.
pt_br: Se isso é uma release de segurança, envie pre-notificações **uma semana** antes da release. Nós mantemos uma lista de quem recebe essas pre-notificações de email no repositório privado ``django-core``. Envie um email para ``security@djangoproject.com`` e coloque os recipientes em cópia oculta. Esse email deve ser assinado com a chave que você usar para a release, e deve incluir patches para cada problema sendo corrigido.

source: As the release approaches, watch Trac to make sure no release blockers are left for the upcoming release.
id: Ketika terbitan mendekat. lihat Trac untuk memastikan tidak ada pemblok terbitan tertinggal untuk terbitan akan datang.
pt_br: À medida em que a release se aproxima, acompanhe o Track para se certificar de que nenhum problema que possa bloquear a release prestes a ser lançada tenha restado sem solução.

source: Check with the other committers to make sure they don't have any uncommitted changes for the release.
id: Periksa dengan pembuat perbaikan untuk memastikan mereka tidak mempunyai perubahan belum diperbaiki apapun untuk terbitan.
pt_br: Converse com outros comiiters para se certificar que eles não tem quaisquer mudanças que ainda não tenham sido commitadas para a release.

source: Proofread the release notes, including looking at the online version to catch any broken links or reST errors, and make sure the release notes contain the correct date.
id: Proofread catatan terbitan, termasuk mencari versi daring untuk menangkap tiap tautan rusak atau kesalahan reST, dan pastikan catatan terbitan mengandung tanggal benar.
pt_br: Revise as notas de release, incluindo olhar a versão online para pegar quaisquer links quebrados ou erros de formação de reST, e certifique-se de que as notas da release contém a data correta.

source: Double-check that the release notes mention deprecation timelines for any APIs noted as deprecated, and that they mention any changes in Python version support.
id: Periksa kembali itu catatan terbitan menyebutkan linimasa pengusangan untuk setiap API dicatat sebagai diusangkan, dan mereka menyebut bahwa tiap perubahan di Python versi dukungan.
pt_br: Verifique duas vezes as menções de depreciação ao longo do tempo nas notas da release em busca de quaisquer APIs listadas como depreciadas, e que as notas mencionam quaisquer mudanças na versão suportada do Python.

source: Double-check that the release notes index has a link to the notes for the new release; this will be in ``docs/releases/index.txt``.
id: Periksa kembali itu catatan terbitan index mempunyai sebuah tautan ke catatan untuk terbitan baru; ini akan ada di ``docs/releases/index.txt``.
pt_br: Verifique duas vezes se o índice das notas de release possuem um link para as notas da nova release; isso estará em ``docs/releases/index.txt``.

source: If this is a feature release, ensure translations from Transifex have been integrated. This is typically done by a separate translation's manager rather than the releaser, but here are the steps. Provided you have an account on Transifex::
id: Jika ini adalah terbitan fitur, apstikan terjemahan dari Transifex telah dipadukan. Ini adalah khususnya dilakukan oleh pengelola terjemahan terpisah daripada penerbit, tetapi ini adalah langkah-langkah. Disediakan anda mempunyai sebuah akun di Transifex::
pt_br: Se essa é uma feature release, garanta que as traduções do Transifex foram integradas. Isso é tipicamente realizado por um gerente de tradução separado ao invés do releaser, mas aqui vão os passos. Supondo que você tenha uma conta no Transifex::

source: and then commit the changed/added files (both .po and .mo). Sometimes there are validation errors which need to be debugged, so avoid doing this task immediately before a release is needed.
id: dan kemudian perbaiki berkas dirubah/ditambahkan (kedua .po dan .mo). Terkadang ada pengecekan kesalahan yang butuh di cari kesalahan, jadi hindari melakukan tugas ini secepatnya sebelum terbitan dibutuhkan.
pt_br: e então faça commit da mudança/arquivos adicionados (.po e .mo). Algumas vezes existem validações de errros que precisam ser depurados, então evite fazer essa tarefa imediatamente antes de uma release ser necessária.

source: and then commit the changed man page.
id: dan kemudian perbaiki perubahan halaman panduan.
pt_br: e então faça commit da página man alterada.

source: Preparing for release
id: Bersiap untuk terbitan
pt_br: Preparando para a release

source: Write the announcement blog post for the release. You can enter it into the admin at any time and mark it as inactive. Here are a few examples: `example security release announcement`__, `example regular release announcement`__, `example pre-release announcement`__.
id: Tulis penempatan blog pengumuman untuk terbitan. Anda dapat memasukkannya kedalam admin kapan pun dan menandainya sebagai tidak aktif. Ini adalah beberapa contoh: `example security release announcement`__, `example regular release announcement`__, `example pre-release announcement`__.
pt_br: Escreva o post no blog para o anúncio da release. Você pode entrar dentro do admin a qualquer momento e marcar ele como inativo. Aqui vão alguns exemplos: `example security release announcement`__, `example regular release announcement`__, `example pre-release announcement`__.

source: Actually rolling the release
id: Sebenarnya menggulir terbitan
pt_br: Lançando a release

source: OK, this is the fun part, where we actually push out a release!
id: OKE, ini adalah bagian menyenangkan, dimana kami sebenarnya mendorong terbitan!
pt_br: OK, esta é a parte divertida, quando nós efetivamente fazemos o push da release!

source: Check `Jenkins`__ is green for the version(s) you're putting out. You probably shouldn't issue a release until it's green.
id: Periksa `Jenkins`__ adalah hijau untuk versi anda hasilkan. Anda mungkin tidak harus mengeluarkan terbitan sampai itu hijau.
pt_br: Veja se o status do `Jenkins`__ é verde para a versão (ou versões) que você está soltando. Você provavelmente não deve lançar uma release enquanto ele não estiver com o status verde.

source: A release always begins from a release branch, so you should make sure you're on a stable branch and up-to-date. For example::
id: Terbitan selalu dimulai dari cabang terbitan, jadi anda harus pastikan anda berada di cabang stabil dan terbaru. Sebagai contoh::
pt_br: Uma release sempre começa de uma branch de release, então você terá que se certificar que você está em uma branch estável e atualizada. Por exemplo::

source: If this is a security release, merge the appropriate patches from ``django-private``. Rebase these patches as necessary to make each one a simple commit on the release branch rather than a merge commit. To ensure this, merge them with the ``--ff-only`` flag; for example::
id: Jika ini adalah terbitan keamanan, gabung tambalan yang sesuai dari ``django-private``. Rebase tambalan ini seperlunya untuk membuat tiap satu perbaikan sederhana pada cabang terbitan daripada menggabungkan perbaikan. Untuk memastikan ini, gabungkan mereka dengan bendera ``--ff-only``; sebagai contoh::
pt_br: Se essa é uma release de segurança, faça o merga apropriado dos patches de ``django-private``. Faça rebase desses patches se necessário para fazer com que cada um deles seja um único commit na branch da release ao invés de um commit mesclado. Para garantir isso, faça o merge deles com a flag ``--ff-only``; por exemplo::

source: (This assumes ``security/1.5.x`` is a branch in the ``django-private`` repo containing the necessary security patches for the next release in the 1.5 series.)
id: (Ini menganggap ``security/1.5.x`` adalah cabang di gudang ``django-private`` megnandung tambalan keamanan yang dibutuhkan untuk terbitan selanjutnya di rangkaian 1.5.)
pt_br: (Isso assume que ``security/1.5.x`` é uma branch dentro do repositório ``django-private`` contendo os patches de segurança necessários para a próxima release na série 1.5)

source: If git refuses to merge with ``--ff-only``, switch to the security-patch branch and rebase it on the branch you are about to merge it into (``git checkout security/1.5.x; git rebase stable/1.5.x``) and then switch back and do the merge. Make sure the commit message for each security fix explains that the commit is a security fix and that an announcement will follow (`example security commit`__).
id: Jika git menolah menggabungkan dengan ``--ff-only``, pindah ke cabang tambalan-keamanan dan rebase dia di cabang anda akan gabungkan dia kedalam (``git checkout security/1.5.x; git rebase stable/1.5.x``) dan kemudain pindah kembali dan lakukan penggabungan. Pastikan pesan perbaikan untuk setiap perbaikan keamanan menjelasakan bahwa perbaikan adalah perbaikan keamanan dan bahwa sebuah pengumuman akan mengikuti (`example security commit`__).
pt_br: Se o git se recusar a fazer o merge com a flag ``--ff-only``, vá para a branch security-patch e faça o rebase dela na branch que você está prestes a fazer o seu merge (``git checkout security/1.5.x; git rebase stable/1.5.x``) e então volte e faça o merge. Certifique-se de que a mensagem de commit para cada correção de segurança explica que o commit é uma correção de segurança e que um anúncio será feito (`example security commit`__).

source: For a feature release, remove the ``UNDER DEVELOPMENT`` header at the top of the release notes and add the release date on the next line. For a patch release, replace ``*Under Development*`` with the release date. Make this change on all branches where the release notes for a particular version are located.
id: Untuk terbitan selanjutnya, pindahkan kepala ``UNDER DEVELOPMENT`` pada atas catatan terbitan dan tambahkan tanggal terbitan pada baris selanjutnya. Untuk terbitan tambalan, ganti ``*Under Development*`` dengan tanggal terbitan. Buat perubahan ini pada semua cabang-cabang dimana catatan terbitan untuk versi khusus ditempatkan.
pt_br: Para uma feature release, remova o cabeçalho ``UNDER DEVELOPMENT`` no topo das notas da release e adicione a data da release na próxima linha. Para uma patch release, troque ``*Under Development*``, com a data da release. Faça essa mudança em todas as branches em que as notas de release para uma versão em particular estiverem localizadas.

source: Update the version number in ``django/__init__.py`` for the release. Please see `notes on setting the VERSION tuple`_ below for details on ``VERSION``.
id: Perbaharui angka versi di ``django/__init__.py`` untuk terbitan. Silahkan lihat `notes on setting the VERSION tuple`_ dibawah ini untuk rincian pada ``VERSION``.
pt_br: Atualize o número da versão em ``django/__init__.py`` para a release. Por favor veja `as notas sobre configurando a tupla VERSION`_ abaixo para mais detalhes sobre ``VERSION``.

source: If this is a pre-release package, update the "Development Status" trove classifier in ``setup.py`` to reflect this. Otherwise, make sure the classifier is set to ``Development Status :: 5 - Production/Stable``.
id: Jika ini adalah paket pra terbitan, perbaharui penggolong koleksi "Keadaan Pengembangan" dalam ``setup.py`` untuk mencerminkan ini. Jika tidak, pastikan penggolong disetel ke ``Development Status :: 5 - Production/Stable``.
pt_br: Se isso é um pacote de pre-release, atualize o classificador trove "Development Status" em ``setup.py`` para refletir isso. Caso contrário, certifique-se de que o classificador está configurado como ``Development Status :: 5 - Production/Stable``.

source: Tag the release using ``git tag``. For example::
id: Etiket diterbitkan menggunakan ``etiket git``. Sebagai contoh::
pt_br: Faça uma tag da release usando ``git tag``. Por exemplo::

source: You can check your work by running ``git tag --verify <tag>``.
id: Anda dapat memeriksa pekerjaan anda dengan menjalankan ``git tag --verify <tag>``.
pt_br: Você pode checar o seu trabalho rodando o comando ``git tag --verify <tag>``.

source: Push your work, including the tag: ``git push --tags``.
id: Dorong pekerjaan anda, termasuk etiket: ``git push --tags``.
pt_br: Faça o push do seu trabalho, incluindo a tag: ``git push --tags``.

source: Make sure you have an absolutely clean tree by running ``git clean -dfx``.
id: Pastikan anda mempunyai pohon sepenuhnya bersih dengan menjalankan ``git clean -dfx``.
pt_br: Certifique-se de que você tem uma árvore absolutamente limpa rodando o comando `git clean -dfx``.

source: Run ``make -f extras/Makefile`` to generate the release packages. This will create the release packages in a ``dist/`` directory.
id: Jalankan ``make -f extras/Makefile`` untuk membangkitkan paket terbitan. Ini akan membuat paket terbitan di direktori ``dist/``.

source: Generate the hashes of the release packages::
id: Membangkitkan has dari paket terbitan::
pt_br: Gere os hashes dos pacotes da release::

source: Create a "checksums" file, ``Django-<<VERSION>>.checksum.txt`` containing the hashes and release information. Start with this template and insert the correct version, date, GPG key ID (from ``gpg --list-keys --keyid-format LONG``), release URL, and checksums:
id: Buat sebuah berkas "checksums", ``Django-<<VERSION>>.checksum.txt`` mengandung informasi has dan terbitan. Mulai dengan cetakan ini dan masukkan versi benar, tanggal, ID kunci GPG (dari ``gpg --list-keys --keyid-format LONG``), URL terbitan, dan checksum:
pt_br: Crie um arquivo "checksums", ``Django-<<VERSION>>.checksum.txt`` contendo os hashes e as informações da release. Comece com esse template e insira a versão correta, data, ID da chave GPG (de ``gpg --list-keys --keyid-format LONG``), URL da release, e checksums:

source: Sign the checksum file (``gpg --clearsign --digest-algo SHA256 Django-<version>.checksum.txt``). This generates a signed document, ``Django-<version>.checksum.txt.asc`` which you can then verify using ``gpg --verify Django-<version>.checksum.txt.asc``.
id: Tandatangi berkas checksum (``gpg --clearsign --digest-algo SHA256 Django-<version>.checksum.txt``). Ini membangkitkan dokumen ditandatangi, ``Django-<version>.checksum.txt.asc`` yang anda dapat kemudian memeriksa menggunakan ``gpg --verify Django-<version>.checksum.txt.asc``.
pt_br: Assine o arquivo de checksum (``gpg --clearsign --digest-algo SHA256 Django-<version>.checksum.txt``). Isso gera um documento assinado, ``Django-<version>.checksum.txt.asc`` que você pode então verificar usando ``gpg --verify Django-<version>.checksum.txt.asc``.

source: If you're issuing multiple releases, repeat these steps for each release.
id: Jika anda sedang menerbitkan banyak terbitan, ulangi langkah ini untuk setiap terbitan.
pt_br: Se você estiver lançando múltiplas releases, repita esses passos para cada release.

source: Making the release(s) available to the public
id: Membuat terbitan tesedia ke umum
pt_br: Fazendo a release (ou as releases) disponível ao público

source: Now you're ready to actually put the release out there. To do this:
id: Sekarang anda siap benar-benar menaruh terbitan diluar sana. Untuk melakukan ini:
pt_br: Agora você está pronto para lançar a release efetivamente. Para isso faça:

source: Upload the release package(s) to the djangoproject server, replacing A.B. with the appropriate version number, e.g. 1.5 for a 1.5.x release::
id: Unggah paket-paket terbitan ke peladen djangoproject, ganti A.B. dengan angka versi yang sesuai, sebagai contoh 1.5 untuk terbitan 1.5.x::
pt_br: Faça upload do pacote (ou pacotes) da release para o servidor do djangoproject, trocando A.B. com o número de versão apropriado, ex. 1.5 para a release 1.5.x::

source: Upload the checksum file(s)::
id: Unggah berkas checksum::
pt_br: Atualize o arquivo (ou arquivos) de checksum::

source: Test that the release packages install correctly using ``easy_install`` and ``pip``. Here's one method (which requires `virtualenvwrapper`__)::
id: Uji yang paket terbitan dipasang dengan benar menggunakan ``easy_install`` dan ``pip``. Ini adalah satu cara (yang membutuhkan `virtualenvwrapper`__)::
pt_br: Teste se os pacotes da release foram instalados corretamente usando ``easy_install`` e ``pip``. Aqui está um método (que requer `virtualenvwrapper`__)::

source: This just tests that the tarballs are available (i.e. redirects are up) and that they install correctly, but it'll catch silly mistakes.
id: Ini hanya percobaan dimana tarball tersedia (yaitu pengalihan hidup) dan dimana mereka memasang dengan benar, tetapi dia akan menangkap kesalahan-kesalahan bodoh.
pt_br: Isso só verifica se as tarballs estão disponíveis (ex. redirecionamentos estão funcionando) e que eles instalaram corretamente, mas eles irão pegar erros bobos.

source: Ask a few people on IRC to verify the checksums by visiting the checksums file (e.g. https://www.djangoproject.com/m/pgp/Django-1.5b1.checksum.txt) and following the instructions in it. For bonus points, they can also unpack the downloaded release tarball and verify that its contents appear to be correct (proper version numbers, no stray ``.pyc`` or other undesirable files).
id: Tanyakan sedikit orang di IRC untuk memeriksa checksum dengan mengunjungi berkas checksum (sebagai contoh https://www.djangoproject.com/m/pgp/Django-1.5b1.checksum.txt) dan mengikuti perintah di dalamnya. Untuk titik bonus, mereka dapat juga membuka tarball terbitan terunduh dan periksa bahwa isinya benar (angka versi tepat, tidak menyimpang ``.pyc`` atau berkas-berkas yang tidak diinginkan lainnya).
pt_br: Pergunte a algumas pessoas no IRC para verificar os checksums visitando os arquivos checksums (ex. https://www.djangoproject.com/m/pgp/Django-1.5b1.checksum.txt) e seguindo as instruções nele. Para pontos bônus, eles também poderiam extrair a tarball da release baixada e verificar se o seu conteúdo aparenta estar correto (números de versão corretos, arquivos ``.pyc`` perdidos ou outros arquivos não desejados).

source: Upload the release packages to PyPI (for pre-releases, only upload the wheel file)::
id: Unggah paket-paket terbitan ke PyPI (untuk pra-terbitan, hanya perbaharui berkas wheel)::
pt_br: Faça o upload dos pacotes da release para o PyPI (para pre-release, somente atualize o arquivo wheel)::

source: Go to the `Add release page in the admin`__, enter the new release number exactly as it appears in the name of the tarball (Django-<version>.tar.gz). So for example enter "1.5.1" or "1.4c2", etc. If the release is part of an LTS branch, mark it so.
id: Pergi ke `Add release page in the admin`__, masukkan angka terbitan baru tepat ketika itu muncul dalam nama dari tarball (Django-<version>.tar.gz). Jadi sebagai contoh "1.5.1" atau "1.4c2", dll. Jika terbitan adalah bagian dari cabang LTS, tandai dia.
pt_br: Vá para ` a página Add release no admin`__, entre com o número da nova release exatamente como ele aparece no nome da tarball (Django-<version>.tar.gz). Então entre com "1.5.1" ou "1.4c2", etc. Se a release é parte de uma branch LTS, marque ele como tal.

source: Make the blog post announcing the release live.
id: Buat blog menempatkan pengumuman terbitan langsung.
pt_br: Faça um post no blog anunciando que a release foi lançada.

source: For a new version release (e.g. 1.5, 1.6), update the default stable version of the docs by flipping the ``is_default`` flag to ``True`` on the appropriate ``DocumentRelease`` object in the ``docs.djangoproject.com`` database (this will automatically flip it to ``False`` for all others); you can do this using the site's admin.
id: Untuk terbitan versi baru (sebagai coontoh 1.5, 1.6), perbaharui versi stabil awal dari dokumen dengan membalikkan bendera ``is_default`` menjadi ``True`` pada obyek ``DocumentRelease`` yang sesuai di basisdata ``docs.djangoproject.com`` (ini akan otomatis menggantinya menjadi ``False`` untuk semua lainnya); anda dapat melakukan ini menggunakan admin situs.
pt_br: Para uma nova versão de release (ex. 1.5, 1.6), atualize a versão estável padrão da documentação alterando a flag ``is_default`` para ``True`` no objeto ``DocumentRelease`` apropriado no banco de dados de ``docs.djangoproject.com`` (isso irá alterar automaticamente ela para ``False`` para todos os outros); você pode fazer isso usando o site do admin.

source: Post the release announcement to the |django-announce|, |django-developers|, and |django-users| mailing lists. This should include a link to the announcement blog post. If this is a security release, also include oss-security@lists.openwall.com.
id: Tempatkan pengumuman terbitan ke daftar penyuratan |django-announce|, |django-developers|, dan |django-users|. Ini harus menyertakan sebuah tautan ke penempatan pengumuman blog. Jika ini adalah terbitan keamanan, juga sertakan oss-security@lists.openwall.com.
pt_br: Poste o anúncio de release nas listas de email |django-announce|, |django-developers|, and |django-users|. Isso deve incluir um link para o post de anúncio no blog. Se essa for uma release de segurança, inclua também oss-security@lists.openwall.com.

source: Add a link to the blog post in the topic of the `#django` IRC channel: ``/msg chanserv TOPIC #django new topic goes here``.
id: Tambah sebuah tautan pada penempatan blog di topik dari `#django` IRC channel: ``/msg chanserv TOPIC #django new topic goes here``.

source: Post-release
id: Pasca-terbitan
pt_br: Pós-release

source: You're almost done! All that's left to do now is:
id: Anda hampir selesai! Semua yang tersisa untuk dilakukan sekarang adalah:
pt_br: Você quase terminou! Tudo que resta a fazer agora é:
