Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: If the original author can't be reached (within a reasonable amount of time -- a day or so) and the problem is severe -- crashing bug, major test failures, etc. -- then ask for objections on the |django-developers| mailing list then revert if there are none.
id: Jika penulis asli tidak dapat meraih (dalam sejumlah waktu yang beralasan -- sehari atau lebih) dan masalah parah -- benar-benar kesalahan, kegagalan percobaan besar, dll. -- kemudian minta untuk keberatan pada daftar penyuratan |django-developers| kemudian pulihkan jika ada satu.
pt_br: Se o autor original não puder ser encontrado (dentro de um prazo razoável -- um dia ou algo assim) e o problema é severo -- bug quebrando a build, vários testes falhando, etc. -- então pergunte se existe alguma objeção na lista de e-mail django-developers e então reverta o código se elas não existirem.

source: If the problem is small (a feature commit after feature freeze, say), wait it out.
id: Jika masalah adalah kecil (perbaikan fitur setelah pembekuan fitur, katakan), tunggu saja.
pt_br: Se o problema é pequeno (uma funcionalidade congelada, por exemplo) aguarde.

source: If there's a disagreement between the committer and the reverter-to-be then try to work it out on the |django-developers| mailing list. If an agreement can't be reached then it should be put to a vote.
id: Jika ada ketidaksetujuan diantara pembuat perbaikan dan pembuat kebalikan menjadi kemudian coba bekerja dengannya pada daftar penyuratan |django-developers|. Jika sebuah persetujuan tidak dapat dicapai kemudian itu harus ditaruh ke pemilihan.
pt_br: Se existir um desacordo entre o committer e o autor do código a sofrer um revert então tente solucionar o problema na lista de e-mail django-developers. Se um acordo não puder ser encontrado então o problema deve ser submetido a uma votação.

source: If the commit introduced a confirmed, disclosed security vulnerability then the commit may be reverted immediately without permission from anyone.
id: Jika perbaikan diperkenalkan ditegaskan, ungkap kerentanan keamanan kemudian perbaikan mungkin dirubah sesegera mungkin tanpa perizinan dari siapapun.
pt_br: Se o commit introduziu uma vulnerabilidade de segurança confirmada, aberta então o commit deve ser revertido imediatamente sem permissão de ninguém.

source: The release branch maintainer may back out commits to the release branch without permission if the commit breaks the release branch.
id: Perawat cabang terbitan mungkin mengeluarkan perbaikan ke cabang terbitan tanpa perizinan jika perbaikan merusak cabang terbitan.
pt_br: O mantenedor da branch de releases pode voltar commits nessa branch sem permissão caso o commit tenha quebrado a branch de releases.

source: If you mistakenly push a topic branch to ``django/django``, just delete it. For instance, if you did: ``git push upstream feature_antigravity``, just do a reverse push: ``git push upstream :feature_antigravity``.
id: Jika anda salah mendorong topik cabang ke ``django/django``, cukup hapus itu. Sebagai contoh, jika anda melakukan: ``git push upstream feature_antigravity``, cukup lakukan membalikkan pendorongan: ``git push upstream :feature_antigravity``.

source: Contributing to Django
id: Membantu untuk Django
pt_br: Contribuindo com o Django

source: Django is a community that lives on its volunteers. As it keeps growing, we always need more people to help others. As soon as you learn Django, you can contribute in many ways:
id: Django adalah komunitas yang hidup pada sukarelawannya. Seperti dia terus tumbuh, kami seallu membutuhkan orang lebih untuk membantu lainnya. Seketika anda belajar Django, anda dapat membantu dalam banyak cara:
pt_br: Django é uma comunidade que vive através de seus voluntários. À medida em que continua crescendo, nós sempre vamos precisar de mais pessoas para ajudar outras pessoas. Assim que você aprender Django, você poderá contribuir de várias maneiras:

source: Join the |django-users| mailing list and answer questions. This mailing list has a huge audience, and we really want to maintain a friendly and helpful atmosphere. If you're new to the Django community, you should read the `posting guidelines`_.
id: Gabung daftar penyuratan |django-users| dan jawab pertanyaan. Daftar penyuratan ini mempunyai pemirsa yang besar, dan kami sangat ingin merawat suasana yang bersahabat dan membantu. Jika anda baru pada komunitas Django, anda harus membaca `posting guidelines`_.
pt_br: Entre na lista de email django-users e responda as dúvidas. Essa lista de email tem uma imensa audiência, e nós realmente gostaríamos de manter uma atmosfera amigável e solidária. Se você é novo na comunidade Django, você deve ler as 'regras de postagens'_

source: Join the `#django IRC channel`_ on Freenode and answer questions. By explaining Django to other users, you're going to learn a lot about the framework yourself.
id: Gabung `#django IRC channel`_ pada Freenode dan jawab pertanyaan. Dengan menjelaskan Django kepada pengguna lain, anda akan belajar banyak tentang kerangka anda sendiri.
pt_br: Entre no 'canal IRC #django' no Freenode e responda as perguntas. Explicando Django para outros usuários, você estará aprendendo muito sobre o framework em si.

source: Blog about Django. We syndicate all the Django blogs we know about on the `community page`_; if you'd like to see your blog on that page you can `register it here`_.
id: Blog tentang Django. Kami mengkongsikan semua blog Django kami ketahui pada `community page`_; jika anda suka melihat blog anda pada halaman itu anda dapat `register it here`_.
pt_br: Escreva um blog sobre o Django. Todos os blogs sobre Django que nós conhecemos estão relacionados na 'página da comunidade'_; Se você gostaria de ver o seu blog lá você pode 'registrá-lo aqui'_.

source: Contribute to open-source Django projects, write some documentation, or release your own code as an open-source pluggable application. The ecosystem of pluggable applications is a big strength of Django, help us build it!
id: Bantu ke proyek Django sumber-terbuka, tulis beberapa dokumentasi, atau bebaskan kode anda sendiri sebagai aplikasi dapat tertanam sumber-terbuka. Ekosistem dari aplikasi dapat tertanam adalah kekuatan besar dari Django, bantu kami membangunnya!
pt_br: Contribua com projetos open-source Django, escreva alguma documentação, ou disponibilize seu próprio código como uma aplicação open-source plugável. O ecosistema de aplicações plugáveis é uma grande força do Django, ajude nos a contrui-lo!

source: If you think working *with* Django is fun, wait until you start working *on* it. We're passionate about helping Django users make the jump to contributing members of the community, so there are several ways you can help Django's development:
id: Jika anda berpikir benerka *dengan* Django adalah menyenangkan, tunggu sampai anda mulai bekerja *diatasnya*. Kami bergairah tentang membantu pengguna Django membuat lompatan untuk memberikan anggota dari komunitas, sehingga terdapat beberapa cara anda dapat membantu pengembangan Django:
pt_br: Se você acha que trabalhar *com* Django é divertido, espere até você começar a trabalhar *nele*. Nós somos apaixonados em ajudar os usuários do Django a dar o pulo para membros voluntários da comunidade, portanto existem várias maneiras pelas quais você pode ajudar no desenvolvimento do Django.

source: :doc:`Report bugs <bugs-and-features>` in our `ticket tracker`_.
id: :doc:`Laporkan kesalahan <bugs-and-features>` di `pelacak tiket`_ kami.
pt_br: :doc:`Reporte bugs <bugs-and-features>` em nosso `ticket tracker`_.

source: Join the |django-developers| mailing list and share your ideas for how to improve Django. We're always open to suggestions.
id: Gabung daftar penyuratan |django-developers| dan berbagi ide anda untuk bagaimana memperbaiki Django. Kami selalu terbuka untuk saran.
pt_br: Entre na lista de email django-developers e compartilhe suas ideias sobre como melhorar o Django. Nós estamos sempre abertos a sugestões.

source: :doc:`Submit patches <writing-code/submitting-patches>` for new and/or fixed behavior. If you're looking for an easy way to start contributing to Django read the :doc:`/intro/contributing` tutorial and have a look at the `easy pickings`_ tickets. The :ref:`patch-review-checklist` will also be helpful.
id: :doc:`Submit patches <writing-code/submitting-patches>` untuk baru dan/atau kebiasaan tetap. Jika anda sedang mencari untuk jalan mudah memulai membantu Django baca tutorial :doc:`/intro/contributing` dan lihat tiket `easy pickings`_. :ref:`patch-review-checklist` juga akan sangat membantu.
pt_br: :doc:`Envie patches <writing-code/submitting-patches>` para adicionar e/ou corrigir um comportamento. Se você está procurando por uma maneira rápida e fácil de começar a contribuir com o Django leia o :doc:`/intro/contributing` tutorial e dê uma olhada nos tickets `easy pickings`_ . O :ref:`patch-review-checklist` também será útil.

source: :doc:`Improve the documentation <writing-documentation>` or :doc:`write unit tests <writing-code/unit-tests>`.
id: :doc:`Improve the documentation <writing-documentation>` atau :doc:`write unit tests <writing-code/unit-tests>`.
pt_br: :doc:`Melhore a documentação <writing-documentation>` ou :doc:`escreva testes unitários <writing-code/unit-tests>`.

source: :doc:`Triage tickets and review patches <triaging-tickets>` created by other users.
id: :doc:`Triage tickets and review patches <triaging-tickets>` dibuat oleh pengguna lain.
pt_br: :doc:`Faça a triagem de tickets e a revisão de patches <triaging-tickets>` criados por outros usuários.

source: Really, **ANYONE** can do something to help make Django better and greater!
id: Benarkah, **SIAPAPUN** dapat melakukan sesuatu untuk membantu Django lebih baik dan lebih hebat!
pt_br: De verdade, **TODOS** podem fazer alguma coisa para ajudar o Django a ser melhor e maior!

source: Browse the following sections to find out how:
id: Jelajahi bagian berikut untuk menemukan bagaimana:
pt_br: Navegue pelas próximas sessões para saber como:

source: Localizing Django
id: Lokalisasi Django
pt_br: Localizando Django

source: Various parts of Django, such as the admin site and validation error messages, are internationalized. This means they display differently depending on each user's language or country. For this, Django uses the same internationalization and localization infrastructure available to Django applications, described in the :doc:`i18n documentation </topics/i18n/index>`.
id: Beragam bagian dari Django, seperti situs admin dan pengecekan pesan kesalahan, adalah internasionalisasi. Ini berarti mereka menampilkan berbeda tergantung pada setiap bahasa pengguna atau negara. Untuk ini, Django menggunakan internasionalisasi dan lokalisasi sama tersedia pada aplikasi Django, digambarkan dalam :doc:`i18n documentation </topics/i18n/index>`.
pt_br: Várias partes do Django, tais como o site admin e a validação de mensagens de erro, são internacionalizadas. Isso significa que eles são exibidos de modo diferente dependendo da linguagem do usuário ou do país. Por isso, o Django utiliza a mesma infraestrutura de internacionalização e localização disponível para aplicações Django, descritas na :doc:`i18n documentação </topics/i18n/index>`.

source: Translations
id: Terjemahan
pt_br: Traduções

source: Translations are contributed by Django users worldwide. The translation work is coordinated at `Transifex`_.
id: Terjemahan dibantu oleh pengguna Django seluruh dunia. Pekerjaan terjemahan dikordinasikan di `Transifex`_.
pt_br: Traduções são disponibilizadas por usuários do Django em todo o mundo. A coordenação do trabalho de tradução é feita no `Transifex`_.

source: If you find an incorrect translation or want to discuss specific translations, go to the `Django project page`_. If you would like to help out with translating or add a language that isn't yet translated, here's what to do:
id: Jika anda menemukan terjemahan tidak benar atau ingin mengobrol terjemahan khusus, pergi ke `Django project page`_. Jika anda ingin membantu dengan terjemahan atau menambah bahasa yang belum diterjemahkan, ini yang harus dilakukan:
pt_br: Se você encontrar uma tradução incorreta ou quer discutir uma tradução em específico, vá para a `página do projeto Django`_. Se você gostaria de ajudar com a tradução ou adicionando uma linguagem que ainda não foi traduzida, eis o que fazer:

source: Join the :ref:`Django i18n mailing list <django-i18n-mailing-list>` and introduce yourself.
id: Gabung :ref:`Django i18n mailing list <django-i18n-mailing-list>` dan perkenalkan diri anda.
pt_br: Entre na :ref:`Django i18n lista de email <django-i18n-mailing-list>` e apresente-se.

source: Make sure you read the notes about :ref:`specialties-of-django-i18n`.
id: Pastikan anda membaca catatan tentang :ref:`specialties-of-django-i18n`.
pt_br: Certifique-se de que você leu as notas sobre :ref:`specialties-of-django-i18n`.

source: Sign up at `Transifex`_ and visit the `Django project page`_.
id: Daftar di `Transifex`_ dan kunjungi `Django project page`_.
pt_br: Cadastre-se no `Transifex`_ e visite a `página do projeto Django`_.

source: On the `Django project page`_, choose the language you want to work on, **or** -- in case the language doesn't exist yet -- request a new language team by clicking on the "Request language" link and selecting the appropriate language.
id: Pada `Halaman proyek Django`_, pilih bahasa anda inginkan untuk bekerja, **atau** -- di kasus bahasa tidak ada -- minta tim bahasa baru dengan mengklik pada tautan "Minta Bahasa" dan memilih bahasa yang sesuai.
pt_br: Na `página do projeto Django`_, escolha a linguagem na qual você deseja trabalhar, **ou** -- caso a linguagem não exista ainda -- solicite um novo time de linguagem clicando no link "Request language" e selecionando a linguagem apropriada.

source: Then, click the "Join this Team" button to become a member of this team. Every team has at least one coordinator who is responsible to review your membership request. You can of course also contact the team coordinator to clarify procedural problems and handle the actual translation process.
id: Kemudian, klik tombol "Gabung tim ini" untuk menjadi sebuah anggota dari tim ini. Setiap tim mempunyai setidaknya satu kordinator yang bertanggung jawab untuk meninjau permintaan keanggotaan. Anda dapat tentu saja juga menghubungi kordinator tim untuk menjelaskan masalah dan menangani pengolahan terjemahan sebenarnya.
pt_br: Clique no botão "Join this Team" para se tornar um membro. Todos os times tem pelo menos um coordenador responsável por revisar a sua solicitação de participação. Claro que você também pode contatar o coordenador do time para esclarecer problemas pontuais e gerenciar o processo atual de tradução.

source: Once you are a member of a team choose the translation resource you want to update on the team page. For example the "core" resource refers to the translation catalog that contains all non-contrib translations. Each of the contrib apps also have a resource (prefixed with "contrib").
id: Sekali anda adalah anggota dari tim memilih sumber daya terjemahan anda ingin perbaharui pada halaman tim. Sebagai contoh sumber daya "core" mengacu pada katalog terjemahan yang mengandung semua terjemahan bukan sumbangan. Setiap dari sumbangan aplikasi juga mempunyai sebuah sumber daya (diawali dengan "contrib").
pt_br: Uma vez membro de um time escolha o recurso de tradução que você deseja atualizar na página do time. Por exemplo "core" refere-se ao catálogo de traduções que contém todas as traduções não-voluntárias. Cada app de contribuição também possui uum recurso (prefixado com "contrib").

source: For more information about how to use Transifex, read the `Transifex User Guide`_.
id: Untuk informasi lebih tentang bagaimana menggunakan Transifex, baca `Transifex User Guide`_.
pt_br: Para mais informações sobre como usar o Transifex, leia o `Manual do Transifex`_.

source: Translations from Transifex are only integrated into the Django repository at the time of a new :term:`feature release`. We try to update them a second time during one of the following :term:`patch release`\s, but that depends on the translation manager's availability. So don't miss the string freeze period (between the release candidate and the feature release) to take the opportunity to complete and fix the translations for your language!
id: Terjemahan dari Transifex hanya dipadukan kedalam gudang Django pada saat dari :term:`feature release` baru. Kami mencoba memperbaharui mereka kedua kali selama satu dari :term:`patch release` berikut, tetapi itu tergantung pada ketersediaan pengelola terjemahan. Jadi jangan kehilangan masa string freeze (diantara calon terbitan dan terbitan akan datang) untuk mengambil kesempatan untuk melengkapi dan memperbaiki terjemahan untuk bahasa anda!
pt_br: Traduções do Transifex só são integradas no repositório do Django quando é lançada uma nova :term:`feature release`, Nós tentamos atualizar elas uma segunda vez durante uma das :term:`patch release` seguintes, mas isso depende dos coordenadores de tradução disponíveis. Então não perca o período de congelamento (entre a release candidate e a fetature release) para ter a oportunidade de completar e corrigir traduções para a sua linguagem!

source: Formats
id: Bentuk
pt_br: Formatos

source: You can also review ``conf/locale/<locale>/formats.py``. This file describes the date, time and numbers formatting particularities of your locale. See :doc:`/topics/i18n/formatting` for details.
id: Anda dapat juga meninjau ``conf/locale/<locale>/formats.py``. Berkas ini menggambarkan tanggal, waktu dan jumlah kekhasan bentuk untuk lokal anda. Lihat :doc:`/topics/i18n/formatting` untuk rincian.
pt_br: Você também pode revisar ``conf/locale/<locale>/formats.py``. Esse arquivo descreve a data, a hora e números formatando particularidades de um local. Veja :doc:`/topics/i18n/formatting` para mais detalhes.

source: The format files aren't managed by the use of Transifex. To change them, you must :doc:`create a patch<writing-code/submitting-patches>` against the Django source tree, as for any code change:
id: Bentuk berkas tidak dikelola oleh pengguna Transifex. Untuk merubah mereka, anda harus :doc:`create a patch<writing-code/submitting-patches>` terhadap pohon sumber Django, seperti untuk perubahan kode apapun:
pt_br: Os formatos dos arquivos não são gerenciados pelo uso do Transifex. Para alterá-los, você deve :doc:`criar um patch <writing-code/submitting-patches>` na árvore de código do Django, assim como qualquer outra alteração de código:

source: Create a diff against the current Git master branch.
id: Buat perbedaan terhadap cabang master Git sekarang.
pt_br: Criar um diff na atual branch master do Git.

source: Open a ticket in Django's ticket system, set its ``Component`` field to ``Translations``, and attach the patch to it.
id: Buka tiket dalam sistem tiket Django, setel bidang ``Component`` ke ``Translations``, dan lampirkan tambalan ke dia.
pt_br: Abra um ticket no sistema de rastreamento de tickets do Django, altere o campo ``Component`` para ``Translations``, e anexe o seu patch nele.

source: Documentation
id: Dokumentasi
pt_br: Documentação

source: There is also an opportunity to translate the documentation, though this is a huge undertaking to complete entirely (you have been warned!). We use the same `Transifex tool <https://www.transifex.com/django/django-docs/>`_. The translations will appear at ``https://docs.djangoproject.com/<language_code>/`` when at least the ``docs/intro/*`` files are fully translated in your language.
id: Ada juga kesempatan untuk menterjemahkan dokumentasi, meskipun ini usaha yang besar untuk melengkapi keseluruhan (anda telah diingatkan!). Kami menggunakan `Transifex tool <https://www.transifex.com/django/django-docs/>`_ sama. Terjemahan akan muncul pada ``https://docs.djangoproject.com/<language_code>/`` ketika setidaknya berkas-berkas ``docs/intro/*`` sepenuhnya diterjemahkan ke bahasa anda.
pt_br: Existe também a possibilidade de traduzir a documentação, embora isso seja um grande desafio para completar por completo (você foi avisado). Nós usamos a mesma `ferramenta Transifex <https://www.transifex.com/django/django-docs/>`_. As traduções irão aparecer em ``https://docs.djangoproject.com/<language_code>/`` quando ao menos os arquivos dentro de ``docs/intro/*`` forem totalmente traduzidos para a sua linguagem.

source: Advice for new contributors
id: Saran untuk penyumbang baru
pt_br: Ajuda aos novos voluntários

source: New contributor and not sure what to do? Want to help but just don't know how to get started? This is the section for you.
id: Peyumbang baru dan tidak yakin apa yang harus dilakukan? Ingin membantu tetapi tidak tahu bagaimana memulai? Ini adalah bagian untuk anda.
pt_br: Você é um novo voluntário e não sabe o que fazer? Quer ajudar mas não sabe por onde começar? Esta seção foi feita para você.

source: Basic tools and workflow
id: Alat dasar dan alurkerja
pt_br: Ferramentas básicas e fluxo de trabalho

source: If you are new to contributing to Django, the :doc:`/intro/contributing` tutorial will give you an introduction to the tools and the workflow.
id: Jika anda baru membantu Django, tutorial :doc:`/intro/contributing` akan memberikan anda sebuah perkenalan ke alat dan alurkerja.
pt_br: Se você é um novo voluntário no Django, esse :doc:`/intro/contributing` tutorial te dará uma introdução as ferramentas e ao fluxo de trabalho.

source: First steps
id: Langkah pertama
pt_br: Primeiros passos

source: Start with these easy tasks to discover Django's development process.
id: Mulai dengantugas-tugas mudah ini untuk menemukan pengolahan pengembangan Django.
pt_br: Comece com essas tarefas simples para descobrir como é o processo de desenvolvimento do Django.

source: **Sign the Contributor License Agreement**
id: **Tanda tangani Persetujuan Lisensi Penyumbang**
pt_br: **Assine o Acordo de Licença do Contribuidor**

source: The code that you write belongs to you or your employer. If your contribution is more than one or two lines of code, you need to sign the `CLA`_. See the `Contributor License Agreement FAQ`_ for a more thorough explanation.
id: Kode yang anda tulis milik anda atau majikan anda. Jika sumbangan anda lebih dari satu atau dua baris kode, anda butuh menandatangani `CLA`_. Lihat `Contributor License Agreement FAQ`_ untuk untuk penjelasan lebih tuntas.
pt_br: O código que você escreve pertence a você ou ao seu empregador. Se a sua contribuição é de uma ou duas linhas de código, você deve assinar o `CLA`_. Veja a FAQ do `Contributor License Agreement`_ para uma explicação mais detalhada.

source: **Triage tickets**
id: **Tiket Triage**
pt_br: **Triagem de tickets**
