Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Now we're ready for the fun part: using ``git bisect run`` to automate the rest of the process::
id: Sekarang kami siap untuk bagian menariknya: menggunakan ``git bisect run`` untuk mengotomatis sisa dari pengolahan::
pt_br: Agora nós estamos prontos para a parte divertida: usar o comando ``git bisect run`` para automatizar o resto do processo::

source: You should see ``git bisect`` use a binary search to automatically checkout revisions between the good and bad commits until it finds the first "bad" commit where the test fails.
id: Anda seharusnya melihat ``git bisect`` menggunakan pencarian biner untuk otomatis periksa perbaikan diantara perbaikan baik dan buruk sampai dia menemukan perbaikan "buruk" dimana percobaan gagal.
pt_br: Você deverá ver o ``git bisect`` usando uma busca binária para automaticamente fazer checkout de revisões entre os commits bons e os commits ruins até que ele encontre o primeiro commit "ruim" onde o teste falha.

source: Now, report your results on the Trac ticket, and please include the regression test as an attachment. When someone writes a fix for the bug, they'll already have your test as a starting point.
id: Sekarang, laporkan hasil anda di tiket Trac, dan silahkan sertakan percobaan pemulihan sebagai sebuah lampiran. Ketika seseorang menulis perbaikan untuk kesalahan, mereka sudah akan memiliki percobaan anda sebagai sebuah titik permulaan.
pt_br: Agora, mostre os seus resultados no ticket do Trac, e por favor inclua o teste de regressão como um anexo. Quando alguém escreve uma correção para o bug, eles já terão o seu teste como uma referência de por onde começar.

source: Coding style
id: Gaya pengkodean
pt_br: Estilo de código

source: Please follow these coding standards when writing code for inclusion in Django.
id: Silahkan ikuti standar pengkodean ini ketika menulis kode untuk penyertaan di Django.
pt_br: Por favor siga esses padrões quando estiver escrevendo código para inclusão no Django.

source: Python style
id: Gaya Phyton
pt_br: Estilo Python

source: Please conform to the indentation style dictated in the ``.editorconfig`` file. We recommend using a text editor with `EditorConfig`_ support to avoid indentation and whitespace issues. The Python files use 4 spaces for indentation and the HTML files use 2 spaces.
id: Silahkan sesuaikan pada gaya lekukan yang didikte dalam berkas ``.editorconfig``. Kami menganjurkan menggunakan pengubah teks dengan dukungan `EditorConfig`_ untuk menghindari masalah lekukan dan spasi putih. Berkas-berkas Python menggunakan 4 ruang kosong untuk lekukan dan berkas-berkas HTML menggunakan 2 ruang kosong .
pt_br: Por favor adapte-se ao estilo de identação ditado no arquivo ``.editorconfig``. Nós recomendamos usar o editor de textos com suporte a `EditorConfig`_ para evitar problemas com identação e espaços em branco. Os arquivos Python usam 4 espaços para identação e os arquivos HTML usam 2 espaços.

source: Unless otherwise specified, follow :pep:`8`.
id: Meskipun sebaliknya ditentukan, ikuti :pep:`8`.
pt_br: Exceto quando indicado explicitamente, sempre siga a :pep:`8`.

source: Use `flake8`_ to check for problems in this area. Note that our ``setup.cfg`` file contains some excluded files (deprecated modules we don't care about cleaning up and some third-party code that Django vendors) as well as some excluded errors that we don't consider as gross violations. Remember that :pep:`8` is only a guide, so respect the style of the surrounding code as a primary goal.
id: Gunakan `flake8`_ untuk memeriksa masalah-maslaah dalam kawasan ini. Catat bahwa berkas ``setup.cfg`` kami mengandung beberapa berkas tidak tersertakan (modul diusangkan kami tidak peduli tentang perapihan dan beberapa kode pihak-ketiga penjaja Django itu) sama halnya beberapa kesalahan yang tidak disertakan yang kami tidak pertimbangkan sebagai pelanggaran berat. Ingat bahwa :pep:`8` adalah hanya panduan, jadi hormati gaya dari kode sekelilingnya sebagai tujuan utama.
pt_br: Utilize o `flake8`_ para procurar por problemas nesta área. Note que o nosso arquivo de ``setup.cfg`` contém alguns arquivos excluídos (modulos depreciados que nós não nos importamos em limpar e algum código de terceiros que o Django oferece) assim como alguns erros excluídos que nós não consideramos como violações graves. Lembre-se de que a :pep:`8` é apenas um guia, então tenha como objetivo principal o respeito ao estilo do código ao seu redor.

source: An exception to :pep:`8` is our rules on line lengths. Don't limit lines of code to 79 characters if it means the code looks significantly uglier or is harder to read. We allow up to 119 characters as this is the width of GitHub code review; anything longer requires horizontal scrolling which makes review more difficult. This check is included when you run ``flake8``. Documentation, comments, and docstrings should be wrapped at 79 characters, even though :pep:`8` suggests 72.
id: Sebuah pengecualian pada :pep:`8` adalah aturan kami pada panjang baris. Jangan batasi baris kode sampai 79 karakter jika itu berarti kode terlihat sangat buruk atau sulit dibaca. Kami mengizinkan sampai 119 karakter karena ini adalah lebar dari tinjauan kode GitHub; apapun lebih panjang membutuhkan menggulung secara mendatar yang membuat tinjauan lebih sulit. Pemeriksaan ini disertakan ketika anda menjalankan ``flake8``. Dokumentasi, komentar, dan docstring harus dibungkus pada 79 karakter, meskipun :pep:`8` menyarankan 72.
pt_br: Uma exceção a :pep:`8` são nossas regras sobre o comprimento das linhas. Não limite linhas de código para 79 caracteres se isso significar deixar o código mais feio ou mais difícil de ler. Nós permitimos até 119 caracteres já que esse é o limite do revisor de código do GitHub; qualquer coisa mais longa que isso requer rolagem horizontal o que faz a revisão mais difícil. Essa verificação está incluída quando você roda o ``flake8``. Documentação, comentários, e docstrings devem estar envolvidas em até 79 caracteres, mesmo que a :pep:`8` sugira somente 72.

source: Use four spaces for indentation.
id: Gunakan empat ruang untuk lekukan.
pt_br: Utilize quatro espaços para identação.

source: Use underscores, not camelCase, for variable, function and method names (i.e. ``poll.get_unique_voters()``, not ``poll.getUniqueVoters``).
id: Gunakan garis bawah, bukan camelCase, untuk variabel, fungsi dan nama-nama cara (yaitu ``poll.get_unique_voters()``, bukan ``poll.getUniqueVoters``).
pt_br: Utilize underscores, não camelCase, para variáveis, nomes de funções e métodos (por exemplo, ``poll.get_unique_voters()``, e não ``poll.getUniqueVoters``).

source: Use ``InitialCaps`` for class names (or for factory functions that return classes).
id: Gunakan ``InitialCaps`` untuk nama-nama kelas (atau untuk fungsi pabrik yang mengembalikan kelas-kelas).
pt_br: Utilize ``IniciaisMaiúsculas`` para nomes de classes (ou para funções factory que retornem classes).

source: In docstrings, follow :pep:`257`. For example::
id: Dalam docstring, ikuti :pep:`257`. Sebagai contoh::
pt_br: Nas docstrings, siga a :pep:`257`. Por exmeplo::

source: In tests, use :meth:`~django.test.SimpleTestCase.assertRaisesMessage` instead of :meth:`~unittest.TestCase.assertRaises` so you can check the exception message. Use :meth:`~unittest.TestCase.assertRaisesRegex` (``six.assertRaisesRegex()`` as long as we support Python 2) only if you need to use regular expression matching.
id: Dalam percobaan, gunakan :meth:`~django.test.SimpleTestCase.assertRaisesMessage` sebagai gantinya dari :meth:`~unittest.TestCase.assertRaises` sehingga anda dapat memeriksa pesan pengecualian. Gunakan :meth:`~unittest.TestCase.assertRaisesRegex` (``six.assertRaisesRegex()`` selama kami mengukung Python 2) hanya jika anda butuh menggunakan pencocokan pernyataan regular.
pt_br: Nos testes, utilize :meth:`~django.test.SimpleTestCase.assertRaisesMessage` ao invés de :meth:`~unittest.TestCase.assertRaises` de modo que você possa verificar a mensagem de exceção. Utilize :meth:`~unittest.TestCase.assertRaisesRegex` (``six.assertRaisesRegex()`` enquanto existir suporte para a versão 2 do Python) somente se você precisar usar expressões regulares.

source: Imports
id: Impor

source: Use `isort <https://github.com/timothycrosley/isort#readme>`_ to automate import sorting using the guidelines below.
id: Gunakan `isort <https://github.com/timothycrosley/isort#readme>`_ untuk mengotomatisasi pengurutan impor menggunakan panduan dibawah.
pt_br: Utilize `isort <https://github.com/timothycrosley/isort#readme>`_ para automatizar a ordenação dos imports usando as regras abaixo.

source: Quick start:
id: Mulai cepat:
pt_br: Início Rápido:

source: This runs ``isort`` recursively from your current directory, modifying any files that don't conform to the guidelines. If you need to have imports out of order (to avoid a circular import, for example) use a comment like this::
id: Ini menjalankan ``isort`` secara berulang dari pelipat anda saat ini, merubah berkas apapun yang tidak sesuai pada baris panduan. Jika anda butuh mengimpor rusak (untuk menghidari impor memutar, sebagai contoh) gunakan komentar seperti ini::
pt_br: Isso roda o ``isort`` recursivamente do seu diretório atual, modificando quaisquer arquivos que não estejam de acordo com as orientações gerais. Se você precisa ter imports fora de ordem (para evitar um import circular, por exemplo) use um comentário como esse::

source: Put imports in these groups: future, standard library, third-party libraries, other Django components, local Django component, try/excepts. Sort lines in each group alphabetically by the full module name. Place all ``import module`` statements before ``from module import objects`` in each section. Use absolute imports for other Django components and relative imports for local components.
id: Taruh impor dalam kelompok ini: akan datang, pustaka standar, pustaka pihak-ketiga, komponen Django lainnya, komponen Django lokal, coba/pengecualian. Urutkan baris dalam setiap kelompok secara alfabet dengan nama modul penuh. Tempatkan semua pernyataan ``import module`` sebelum ``from module import objects`` di setiap bagian. Gunakan impor sepenuhnya untuk komponen Django lainnya dan impor berhubugan untuk komponen lokal.
pt_br: Coloque os imports nesses grupos: future, bibliotecas padrão, bibliotecas de terceiros, outros componentes Django, componentes Django locais, try/excepts. Ordene as linhas em cada grupo por ordem alfabética pelo nome completo do módulo. Coloque todos os comandos do tipo ``import module`` antes de comandos do tipo ``from module import objects`` em cada uma das seções. Utilize absolute imports para outros componentes Django e local imports para componentes locais.

source: On each line, alphabetize the items with the upper case items grouped before the lower case items.
id: Pada setiap baris, alfabetkan barang-barang dengan barang-barang huruf besar dikelompokkan sebelum barang-barang huruf kecil.
pt_br: Em cada linha, deixe os itens em ordem alfabética colocando itens nomeados com IniciaisMaiúsculas agrupados antes dos itens nomeados com somente com minúsculas.

source: Break long lines using parentheses and indent continuation lines by 4 spaces. Include a trailing comma after the last import and put the closing parenthesis on its own line.
id: Putuskan baris panjang menggunakan kurung dan lekukan garis kelanjutan dengan 4 ruang. Termasuk koma yang membuntuti setelah impor terakhir dan taruh kurung penutup pada baris itu sendiri.
pt_br: Quebre linhas longas usando parênteses e identando as linhas de continuação com 4 espaços. Inclua uma vírgula depois do último import e coloque o parênteses de fechamento em sua própria linha.

source: Use a single blank line between the last import and any module level code, and use two blank lines above the first function or class.
id: Gunakan baris kosong tunggal diantara impor terakhir dan tiap modul kode tingkatan, dan gunakan dua baris kosong diatas fungsi atau kelas pertama.
pt_br: Utilize uma única linha em branco entre o último import e qualquer código a nível de módulo, e utilize duas linhas em branco acima da primeira função ou classe.

source: For example (comments are for explanatory purposes only):
id: Sebagai contoh (komentar hanya untuk tujuan penjelasan):
pt_br: Por exemplo (os comentários existem somente para propósitos de explicação):

source: Use convenience imports whenever available. For example, do this::
id: Gunakan manfaat impor kapanpun tersedia. Sebagai contoh, lakukan ini::
pt_br: Utilize import de conveniência quando possível. Por exemplo, faça isso::

source: instead of::
id: dari pada::
pt_br: ao invés de::

source: Template style
id: Gaya cetakan
pt_br: Estilo dos templates

source: In Django template code, put one (and only one) space between the curly brackets and the tag contents.
id: Di kode cetakan Django, taruh satu (dan hanya satu) spasi diantara kurung keriting dan etiket isi.
pt_br: No código de templates Django, coloque um (e somente um) espaço entre as chaves e o conteúdo da tag.

source: Do this:
id: Lakukan ini:
pt_br: Faça isso:

source: Don't do this:
id: Jangan lakukan ini:
pt_br: Não faça isso:

source: View style
id: Gaya tampilan
pt_br: Estilo de uma View

source: In Django views, the first parameter in a view function should be called ``request``.
id: Dalam tampilan Django, parameter pertama dalam sebuah fungsi tampilan harus dipanggil ``request``.
pt_br: Nas views do Django, o primeiro parâmetro na função de uma view deve ser chamado ``request``.

source: Do this::
id: Lakukan ini::
pt_br: Faça isso::

source: Don't do this::
id: Jangan lakukan ini::
pt_br: Não faça isso::

source: Model style
id: Gaya model
pt_br: Estilo de um Model

source: Field names should be all lowercase, using underscores instead of camelCase.
id: Nama-nama bidang harus semuanya huruf kecil, menggunakan garis bawah daripada camelCase.
pt_br: Os nomes dos campos devem ser todos minúsculos, usando underscores ao invés de camelCase.

source: The ``class Meta`` should appear *after* the fields are defined, with a single blank line separating the fields and the class definition.
id: ``class Meta`` harus muncul *setelah* bidang ditentukan, dengan baris tunggal kosong memisahkan penentuan bidang-bidang dan kelas
pt_br: A ``classe Meta`` deve aparecer *depois* que os campos são declarados, com uma única linha em branco separando os campos da definição da classe.

source: Don't do this, either::
id: Jangan lakukan ini, salah satu::
pt_br: Não faça isso também::

source: If you define a ``__str__`` method (previously ``__unicode__`` before Python 3 was supported), decorate the model class with :func:`~django.utils.encoding.python_2_unicode_compatible`.
id: Jika anda menentukan sebuah cara ``__str__`` (sebelumnya ``__unicode__`` sebelum Python 3 disukung), hiasi kelas model dengan :func:`~django.utils.encoding.python_2_unicode_compatible`.
pt_br: Se você definir um método ``__str__`` (previamente ``__unicode__`` antes do Python 3 passar a ser suportado), utilize o decorator :func:`~django.utils.encoding.python_2_unicode_compatible` na classe.

source: The order of model inner classes and standard methods should be as follows (noting that these are not all required):
id: Urutan model kelas-kelas sebelah dalam dan cara standar harus sebagai berikut (catat bahwa ini tidak wajib):
pt_br: A ordem dos modelos internos das classes e dos métodos padrão devem ser como a seguir (tendo em mente que eles não são todos obrigatórios):

source: All database fields
id: Semua bidang basisdata
pt_br: Todos os campos do banco de dados

source: Custom manager attributes
id: Penyesuaian pengelolaan atribut
pt_br: Atributos customizados do manager

source: Any custom methods
id: Cara penyesuaian apapun
pt_br: Quaisquer métodos customizados.

source: If ``choices`` is defined for a given model field, define each choice as a tuple of tuples, with an all-uppercase name as a class attribute on the model. Example::
id: Jika ``choices`` ditentukan untuk bidang model diberikan, tentukan setiap pilihan sebagai tuple dari tuple-tuple, dengan nama semua huruf besar sebagai atribut kelas pada model. Contoh::
pt_br: Se ``choices`` está definido para um dado campo de um modelo, defina cada choice com uma tupla de tuplas, sendo que o nome da tupla deve ser escrito inteiramente em maiúsculas e a tupla deve ser um atributo de classe do modelo. Exemplo::

source: Use of ``django.conf.settings``
id: Penggunaan ``django.conf.settings``
pt_br: Utilização do ``django.conf.settings``

source: Modules should not in general use settings stored in ``django.conf.settings`` at the top level (i.e. evaluated when the module is imported). The explanation for this is as follows:
id: Modul-modul tidak harus dalam pengaturan penggunaan umum di ``django.conf.settings`` pada tingkatan atas (yaitu dinilai ketika modul diimpor). Penjelasan untuk ini adalah sebagai berikut:
pt_br: Em geral os módulos não devem utilizar em seu topo configurações armazenadas em ``django.conf.settings`` (quando queremos que alguma configuração só seja interpretada quando o módulo é importado, por exemplo). A motivação para isso é a seguinte:

source: Manual configuration of settings (i.e. not relying on the ``DJANGO_SETTINGS_MODULE`` environment variable) is allowed and possible as follows::
id: Konfigurasi manual dari pengaturan (yaitu bergantung pada variabel lingkungan `DJANGO_SETTINGS_MODULE``) diizinkan dan dimungkinkan sebagai berikut::
pt_br: A configuração manual dos settings (não confiar na variável de ambiente ``DJANGO_SETTINGS_MODULE``, por exemplo) é permitida e possível conforme segue::

source: However, if any setting is accessed before the ``settings.configure`` line, this will not work. (Internally, ``settings`` is a ``LazyObject`` which configures itself automatically when the settings are accessed if it has not already been configured).
id: Bagaimanapun, jika tiap pengaturan diakses sebelum baris ``settings.configure``, ini tidak akan bekerja (Secara internal, ``settings`` adalah ``LazyObject`` yang mengkonfigurasikan diri dia sendiri otomatis ketika pengaturan diakses jika dia belum dikonfigurasikan).
pt_br: Porém, se qualquer configuração é acessada antes da linha ``settings.configure``, isso não irá funcionar (internamente, ``settings`` é um ``LazyObject`` que, caso não tenha sido configurado antes, se configura sozinho e automaticamente quando o settings é acessado).

source: So, if there is a module containing some code as follows::
id: Jadi, jika terdapat modul mengandung beberapa kode sebagai berikut::
pt_br: Então, se existir um módulo conténdo código como o descrito a seguir:

source: ...then importing this module will cause the settings object to be configured. That means that the ability for third parties to import the module at the top level is incompatible with the ability to configure the settings object manually, or makes it very difficult in some circumstances.
id: ...kemudian mengimpor modul ini akan menyebabkan pengaturan obyek untuk dikonfigurasi. Itu berarti bahwa kemampuan untuk pihak ketiga mengimpor modul pada tingkat atas tidak sesuai dengan kemampuan mengkonfigurasi pengaturan obyek secara manual, atau membuatnya sulit di beberapa keadaan.
pt_br: A importação desse módulo fará com que o objeto settings seja configurado. Isso significa que a abilidade de importar módulos no topo por terceiros é incompatível com a abilidade de configurar o objeto settings manualmente, ou faz com que ela seja extremamente difícil em algumas circunstâncias.

source: Instead of the above code, a level of laziness or indirection must be used, such as ``django.utils.functional.LazyObject``, ``django.utils.functional.lazy()`` or ``lambda``.
id: Sebagai gantinya kode diatas, tingkatan kemalasan atau tipuan harus digunakan, seperti ``django.utils.functional.LazyObject``, ``django.utils.functional.lazy()`` atau ``lambda``.
pt_br: Ao invés do código acima, um nível de laziness ou indireção deve ser usado, tais como ``django.utils.functional.LazyObject``, ``django.utils.functional.lazy()`` ou ``lambda``.

source: Miscellaneous
id: Bermacam-macam
pt_br: Variados

source: Mark all strings for internationalization; see the :doc:`i18n documentation </topics/i18n/index>` for details.
id: Tandai semua deretan karakter untuk internasionalisasi; lihat :doc:`i18n documentation </topics/i18n/index>` untuk rincian.
pt_br: Marque todas as strings para internacionalização; veja a documentação :doc:`i18n </topics/i18n/index>` para mais detalhes.

source: Remove ``import`` statements that are no longer used when you change code. `flake8`_ will identify these imports for you. If an unused import needs to remain for backwards-compatibility, mark the end of with ``# NOQA`` to silence the flake8 warning.
id: Pindahkan pernyataan ``import`` yang tidak lagi digunakan ketika anda merubah kode. `flake8`_ akan mencirikan impor ini untuk anda. Jika impor tidak digunakan butuh tinggal untuk kesesuaian kebelakang, tandai akhir dengan ``# NOQA`` untuk membisukan peringatan flake8.
pt_br: Remova `comandos `import`` que não são mais usados quando você mudar o código. O `flake8`_ irá identificar esses imports para você. Se um import não utilizado precisa permanecer para compatibilidade com versões anteriores, marque o seu final com ``# NOQA`` para silenciar o warning do flake8.

source: Systematically remove all trailing whitespaces from your code as those add unnecessary bytes, add visual clutter to the patches and can also occasionally cause unnecessary merge conflicts. Some IDE's can be configured to automatically remove them and most VCS tools can be set to highlight them in diff outputs.
id: Secara teratur pindahkan semua ruang kosong dari kode anda dimana mereka menambahkan byte yang tidak dibutuhkan, tambah kekacauan penglihatan pada tambalan dan juga terkadang menyebabkan pertentangan penggabungan yang tidak diperlukan. Beberapa IDE dapat dikonfigurasikan otomatis memindahkan mereka dan kebanyakan alat-alat VCS dapat di setel untuk menyorot mereka di keluaran berbeda.
pt_br: Remova sistematicamente todos os espaços em branco no final do seu código já que eles adicionam bytes desnecessários, adicionanm poluição visual aos patches e também podem eventualmente ocasionar conflitos de merge. Algumas IDEs podem ser configuradas para automaticamente removê-los e a maioria das ferramentas de versionamento de código podem ser configuradas para exibi-los na geração dos diffs.

source: Please don't put your name in the code you contribute. Our policy is to keep contributors' names in the ``AUTHORS`` file distributed with Django -- not scattered throughout the codebase itself. Feel free to include a change to the ``AUTHORS`` file in your patch if you make more than a single trivial change.
id: Harap jangan menaruh nama anda di kode anda sumbangkan. Kebijakan kami adalah menjaga nama-nama penyumbang di berkas ``AUTHORS`` disalurkan dengan Django -- bukan goresan melalui basis kode itu sendiri. Merasa bebas untuk menyertakan perubahan pada berkas ``AUTHORS`` di tambalan anda jika anda membuat lebih dari perubahan sepele tunggal.
pt_br: Por favor não coloque o seu nome no código que você está contribuindo. Nossa política é de manter os nomes de quem contribui no arquivo ``AUTHORS`` distribuído com o Django -- e não espalhado por todo o código do projeto. Sinta-se à vontade para incluir uma mudança no arquivo ``AUTHORS`` no seu patch se você fez mais do que uma mudança trivial.

source: JavaScript style
id: Gaya JavaScript
pt_br: Estilo JavaScript
