Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: ``BaseCommand.requires_model_validation`` will be removed in favor of ``requires_system_checks``. Admin validators will be replaced by admin checks.
id: ``BaseCommand.requires_model_validation`` akan dipindahkan mendukung ``requires_system_checks``. Pengesah admin akan diganti dengan admin pemeriksa.
pt_br: ``BaseCommand.requires_model_validation``será removido em favor de ``requires_system_checks``. Admin validators serão trocados por admin checks.

source: The ``ModelAdmin.validator_class`` and ``default_validator_class`` attributes will be removed.
id: Atribut `ModelAdmin.validator_class`` dan ``default_validator_class`` akan dipindahkan.
pt_br: Os atributos ``ModelAdmin.validator_class`` e ``default_validator_class`` serão removidos.

source: ``ModelAdmin.validate()`` will be removed.
id: ``ModelAdmin.validate()`` akan dipindahkan.
pt_br: ``ModelAdmin.validate()`` será removido.

source: ``django.db.backends.DatabaseValidation.validate_field`` will be removed in favor of the ``check_field`` method.
id: ``django.db.backends.DatabaseValidation.validate_field`` akan dipindahkan mundukung cara ``check_field``.
pt_br: ``django.db.backends.DatabaseValidation.validate_field`` será removido em favor do método ``check_field``.

source: The ``validate`` management command will be removed.
id: Perintah pengelolaan ``validate`` akan dipindahkan.
pt_br: O comando de administração ``validate`` será removido.

source: ``django.utils.module_loading.import_by_path`` will be removed in favor of ``django.utils.module_loading.import_string``.
id: ``django.utils.module_loading.import_by_path`` akan dipindahkan mendukung `django.utils.module_loading.import_string``.
pt_br: ``django.utils.module_loading.import_by_path`` será removido em favor de``django.utils.module_loading.import_string``.

source: ``ssi`` and ``url`` template tags will be removed from the ``future`` template tag library (used during the 1.3/1.4 deprecation period).
id: Etiket cetakan ``ssi`` dan ``url`` akan dipindahkan dari pustaka etiket cetakan ``future`` (digunakan selama masa pengusangan 1.3/1.4).
pt_br: `As tags de template `ssi`` e ``url`` serão removidas da biblioteca de tags de template ``future`` (usado durante o período de depreciação 1.3/1.4).

source: ``django.utils.text.javascript_quote`` will be removed.
id: ``django.utils.text.javascript_quote`` akan dipindahkan.
pt_br: ``django.utils.text.javascript_quote`` será removido.

source: Database test settings as independent entries in the database settings, prefixed by ``TEST_``, will no longer be supported.
id: Pengaturan percobaan basisdata sebagai masukan berdiri sendiri dalam pengaturan basisdata, diawali dengan ``TEST_``, tidak lagi didukung.
pt_br: A configuração de bancos de dados de teste com entradas independentes nos settings dos bancos de dados, prefixado com ``TEST_``, não será mais suportado.

source: The `cache_choices` option to :class:`~django.forms.ModelChoiceField` and :class:`~django.forms.ModelMultipleChoiceField` will be removed.
id: `cache_choices` option to :class:`~django.forms.ModelChoiceField` dan :class:`~django.forms.ModelMultipleChoiceField` akan dipindahkan.
pt_br: A opção `cache_choices` para :class:`~django.forms.ModelChoiceField` e :class:`~django.forms.ModelMultipleChoiceField` será removido.

source: The default value of the :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` attribute will change from ``True`` to ``False``.
id: Nilai awal dari atribut :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` akan berubah dari ``True`` menjadi ``False``.
pt_br: O valor padrão do :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` atributo irá mudar de ``True`` para ``False``.

source: ``django.contrib.sitemaps.FlatPageSitemap`` will be removed in favor of ``django.contrib.flatpages.sitemaps.FlatPageSitemap``.
id: ``django.contrib.sitemaps.FlatPageSitemap`` akan dipindahkan mendukung ``django.contrib.flatpages.sitemaps.FlatPageSitemap``.
pt_br: ``django.contrib.sitemaps.FlatPageSitemap`` será removido em favor de ``django.contrib.flatpages.sitemaps.FlatPageSitemap``.

source: Private API ``django.test.utils.TestTemplateLoader`` will be removed.
id: API pribadi ``django.test.utils.TestTemplateLoader`` akan dipindahkan.
pt_br: A API privada ``django.test.utils.TestTemplateLoader`` será removida.

source: The ``django.contrib.contenttypes.generic`` module will be removed.
id: Modul ``django.contrib.contenttypes.generic`` akan dipindahkan.
pt_br: O módulo ``django.contrib.contenttypes.generic`` será removido.

source: Private APIs ``django.db.models.sql.where.WhereNode.make_atom()`` and ``django.db.models.sql.where.Constraint`` will be removed.
id: API Pribadi ``django.db.models.sql.where.WhereNode.make_atom()`` dan ``django.db.models.sql.where.Constraint`` akan dipindahkan.
pt_br: As APIs privadas ``django.db.models.sql.where.WhereNode.make_atom()`` e ``django.db.models.sql.where.Constraint`` serão removidos.

source: See the :ref:`Django 1.6 release notes<deprecated-features-1.6>` for more details on these changes.
id: Lihat :ref:`Django 1.6 release notes<deprecated-features-1.6>` untuk rincian lebih pada perubahan ini.
pt_br: Veja as :ref:`notas de release Django 1.6<deprecated-features-1.6>` para mais detalhes sobre essas mudanças.

source: ``django.contrib.comments`` will be removed.
id: ``django.contrib.comments`` akan dipindahkan.
pt_br: ``django.contrib.comments`` será removido.

source: The following transaction management APIs will be removed:
id: Transaksi pengelolaan API berikut akan dipindahkan:
pt_br: As APIs de gerenciamento de transações seguintes serão removidas:

source: the decorators and context managers ``autocommit``, ``commit_on_success``, and ``commit_manually``, defined in ``django.db.transaction``,
id: Penghias dan pengelola konteks ``autocommit``, ``commit_on_success``, dan ``commit_manually``, ditentukan dalam ``django.db.transaction``,
pt_br: Os decorators e context managers ``autocommit``, ``commit_on_success``, e ``commit_manually``, definidos em ``django.db.transaction``,

source: the functions ``commit_unless_managed`` and ``rollback_unless_managed``, also defined in ``django.db.transaction``,
id: Fungsi ``commit_unless_managed`` dan ``rollback_unless_managed``, juga ditentukan dalam ``django.db.transaction``,
pt_br: As funções ``commit_unless_managed`` e ``rollback_unless_managed``, também definidos em ``django.db.transaction``,

source: the ``TRANSACTIONS_MANAGED`` setting.
id: Pengaturan `TRANSACTIONS_MANAGED``.
pt_br: O setting ``TRANSACTIONS_MANAGED``.

source: The :ttag:`cycle` and :ttag:`firstof` template tags will auto-escape their arguments. In 1.6 and 1.7, this behavior is provided by the version of these tags in the ``future`` template tag library.
id: Etiket cetakan :ttag:`cycle` dan :ttag:`firstof` akan meloloskan-otomatis argumen mereka. Dalam 1.6 dan 1.7, kebiasaan ini disediakan oleh versi dari etiket ini di pustaka etiket cetakan ``future``.
pt_br: As tags de template :ttag:`cycle` e :ttag:`firstof` irão auto-escapar seus argumentos. Em 1.6 e 1.7, esse comportamento é providenciado pela versão dessas tags da biblioteca de tags de template ``future``.

source: The ``SEND_BROKEN_LINK_EMAILS`` setting will be removed. Add the :class:`django.middleware.common.BrokenLinkEmailsMiddleware` middleware to your :setting:`MIDDLEWARE_CLASSES` setting instead.
id: Pengaturan ``SEND_BROKEN_LINK_EMAILS`` akan dipindahkan. Tambah middleware :class:`django.middleware.common.BrokenLinkEmailsMiddleware` ke pengaturan :setting:`MIDDLEWARE_CLASSES` anda sebagai gantinya.
pt_br: O setting ``SEND_BROKEN_LINK_EMAILS`` será removido. Para substitui-lo, adicione o :class:`django.middleware.common.BrokenLinkEmailsMiddleware` middleware :setting:`MIDDLEWARE_CLASSES` no seu setting.

source: ``django.middleware.doc.XViewMiddleware`` will be removed. Use ``django.contrib.admindocs.middleware.XViewMiddleware`` instead.
id: ``django.middleware.doc.XViewMiddleware`` akan dipindahkan. Lebih baik gunakan ``django.contrib.admindocs.middleware.XViewMiddleware``.
pt_br: ``django.middleware.doc.XViewMiddleware`` será removido. Ao invés dele, use ``django.contrib.admindocs.middleware.XViewMiddleware``.

source: ``Model._meta.module_name`` was renamed to ``model_name``.
id: ``Model._meta.module_name`` telah dinamai kembali menjadi ``model_name``.
pt_br: ``Model._meta.module_name`` foi renomeado para ``model_name``.

source: Remove the backward compatible shims introduced to rename ``get_query_set`` and similar queryset methods. This affects the following classes: ``BaseModelAdmin``, ``ChangeList``, ``BaseCommentNode``, ``GenericForeignKey``, ``Manager``, ``SingleRelatedObjectDescriptor`` and ``ReverseSingleRelatedObjectDescriptor``.
id: Memindahkan shim kesesuaian kebelakang diperkenalkan untuk menamai kembali ``get_query_set`` dan metode queryset yang mirip dipindahkan. Ini mempengaruhi kelas-kelas berikut: ``BaseModelAdmin``, ``ChangeList``, ``BaseCommentNode``, ``GenericForeignKey``, ``Manager``, ``SingleRelatedObjectDescriptor`` dan ``ReverseSingleRelatedObjectDescriptor``.
pt_br: Removido o calço de compatibilidade com versões anteriores introduzido para renomear ``get_query_set`` e métodos do queryset similares. Isso afeta as seguintes classes: ``BaseModelAdmin``, ``ChangeList``, ``BaseCommentNode``, ``GenericForeignKey``, ``Manager``, ``SingleRelatedObjectDescriptor`` e ``ReverseSingleRelatedObjectDescriptor``.

source: Remove the backward compatible shims introduced to rename the attributes ``ChangeList.root_query_set`` and ``ChangeList.query_set``.
id: Memindahkan shim kesesuaian kebelakang diperkenalkan untuk menamai kembali atribut ``ChangeList.root_query_set`` dan ``ChangeList.query_set``.
pt_br: Remove o calço de compatibilidade com versões anteriores introduzido para renomear os atributos ``ChangeList.root_query_set`` e ``ChangeList.query_set``.

source: ``django.views.defaults.shortcut`` will be removed, as part of the goal of removing all ``django.contrib`` references from the core Django codebase. Instead use ``django.contrib.contenttypes.views.shortcut``. ``django.conf.urls.shortcut`` will also be removed.
id: ``django.views.defaults.shortcut`` akan dipindahkan, sebagai bagian dari tujuan memindahkan semua acuan ``django.contrib`` dari basiskode inti Django. Daripada menggunakan ``django.contrib.contenttypes.views.shortcut``. ``django.conf.urls.shortcut`` akan juga dipindahkan.
pt_br: ``django.views.defaults.shortcut`` será removido, como parte do objetivo de remover todas as referências a ``django.contrib`` do núcleo do banco de dados do Django. Ao invés dele use ``django.contrib.contenttypes.views.shortcut``. ``django.conf.urls.shortcut`` também será removido.

source: Support for the Python Imaging Library (PIL) module will be removed, as it no longer appears to be actively maintained & does not work on Python 3. You are advised to install `Pillow`_, which should be used instead.
id: Dukungan untuk modul Python Imaging Library (PIL) akan dipindahkan, karena dia tidak lagi kelihatan dirawat dan tidak bekerja pada Python 3. Anda disarankan memasang `Pillow`_, yang harus digunakan sebagai gantinya.
pt_br: Suporte ao módulo Python Imaging Library (PIL) será removido, já que ele não aparece estar ativo e mantido e não funciona no Python 3.

source: The following private APIs will be removed:
id: API pribadi berikut akan dipindahkan:
pt_br: As APIs privadas seguintes serão removidas:

source: ``django.forms.widgets.RadioInput`` will be removed in favor of ``django.forms.widgets.RadioChoiceInput``.
id: ``django.forms.widgets.RadioInput`` akan dipindahkan mendukung ``django.forms.widgets.RadioChoiceInput``.
pt_br: ``django.forms.widgets.RadioInput`` será removido em favor de ``django.forms.widgets.RadioChoiceInput``.

source: The module ``django.test.simple`` and the class ``django.test.simple.DjangoTestSuiteRunner`` will be removed. Instead use ``django.test.runner.DiscoverRunner``.
id: Modul ``django.test.simple`` dan kelas ``django.test.simple.DjangoTestSuiteRunner`` akan dipindahkan. Sebagai gantinya gunakan ``django.test.runner.DiscoverRunner``.
pt_br: O módulo ``django.test.simple`` e a classe ``django.test.simple.DjangoTestSuiteRunner`` será removida. Utilize no lugar dele ``django.test.runner.DiscoverRunner``.

source: The module ``django.test._doctest`` will be removed. Instead use the doctest module from the Python standard library.
id: Modul ``django.test._doctest`` akan dipindahkan. Sebagai gantinya gunakan modul doctest dari pustaka biasa Python.
pt_br: O módulo ``django.test._doctest`` será removido. Ao invés disso use o módulo doctest module da biblioteca padrão do Python.

source: The ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` setting will be removed.
id: Pengaturan ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` akan dipindahkan.
pt_br: O setting ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` será removido.

source: Usage of the hard-coded *Hold down "Control", or "Command" on a Mac, to select more than one.* string to override or append to user-provided ``help_text`` in forms for ManyToMany model fields will not be performed by Django anymore either at the model or forms layer.
id: Penggunaan dari kode keras *Menekan "Control", atau "Command" pada Mac, untuk memilih lebih dari satu.* deretan karakter untuk dikesampingkan atau ditambah ke ``help_text`` disediakan pengguna dalam formulir untuk model bidang ManyToMany tidak akan dilakukan oleh Django lagi pada model atau lapisan formulir.
pt_br: Utilização do *Hold down "Control", or "Command" em um Mac, para selecionar mais de um.* string para sobreescrever ou apensar para o ``help_text`` providenciado pelos usuários em forms para campos de um model ManyToMany não serão mais realizados pelo Django seja na camada do model ou na camada de forms.

source: The ``Model._meta.get_(add|change|delete)_permission`` methods will be removed.
id: Cara ``Model._meta.get_(add|change|delete)_permission`` akan dipindahkan.
pt_br: A permissão ``Model._meta.get_(add|change|delete)_permission`` será removida.

source: The session key ``django_language`` will no longer be read for backwards compatibility.
id: Kunci sesi ``django_language`` tidak lama lagi dapat dibaca untuk kesesuaian kebelakang.
pt_br: A chave de sessão ``django_language`` não será mais lida para compatibilidade com versões anteriores.

source: Geographic Sitemaps will be removed (``django.contrib.gis.sitemaps.views.index`` and ``django.contrib.gis.sitemaps.views.sitemap``).
id: Petasitus Geografis akan dipindahkan (``django.contrib.gis.sitemaps.views.index`` dan ``django.contrib.gis.sitemaps.views.sitemap``).
pt_br: Geographic Sitemaps será removido (``django.contrib.gis.sitemaps.views.index`` e ``django.contrib.gis.sitemaps.views.sitemap``).

source: ``django.utils.html.fix_ampersands``, the ``fix_ampersands`` template filter and ``django.utils.html.clean_html`` will be removed following an accelerated deprecation.
id: ``django.utils.html.fix_ampersands``, penyaring cetakan ``fix_ampersands`` dan ``django.utils.html.clean_html`` akan dipindahkan mengikuti pengusangan yang dipercepat.
pt_br: ``django.utils.html.fix_ampersands``, o filtro de template ``fix_ampersands`` e ``django.utils.html.clean_html`` serão removidos seguindo uma depreciação acelerada.

source: See the :ref:`Django 1.5 release notes<deprecated-features-1.5>` for more details on these changes.
id: Lihat :ref:`Django 1.5 release notes<deprecated-features-1.5>` untuk lebih rinci pada perubahan ini.
pt_br: Veja as :ref:`notas da release do Django 1.5<deprecated-features-1.5>` para mais detalhes sobre essas mudanças.

source: The module ``django.utils.simplejson`` will be removed. The standard library provides :mod:`json` which should be used instead.
id: Modul ``django.utils.simplejson`` akan dipindahkan. Pustaka standar menyediakan :mod:`json` yang harus digunakan sebagai gantinya.
pt_br: O módulo ``django.utils.simplejson`` será removido. A biblioteca padrão provê :mod:`json` que deve ser usado em seu lugar.

source: The function ``django.utils.itercompat.product`` will be removed. The Python builtin version should be used instead.
id: Fungsi ``django.utils.itercompat.product`` akan dipindahkan. Versi terpasang tetap Python harus digunakan sebagai gantinya.
pt_br: A função ``django.utils.itercompat.product`` será removida. A versão embutida no Python deve ser usada em seu lugar.

source: Auto-correction of INSTALLED_APPS and TEMPLATE_DIRS settings when they are specified as a plain string instead of a tuple will be removed and raise an exception.
id: Pembenaran-otomatis dari pengaturan INSTALLED_APPS dan TEMPLATE_DIRS ketika mereka ditentukan sebagai deretan karakter kosong daripada sebuah tuple akan dipindahkan dan menerbitkan pengecualian.
pt_br: Auto-correção dos settings INSTALLED_APPS e TEMPLATE_DIRS quando eles são especificados como uma string ao invés de uma tupla será removido e irá lançar uma exceção.

source: The ``mimetype`` argument to the ``__init__`` methods of :class:`~django.http.HttpResponse`, :class:`~django.template.response.SimpleTemplateResponse`, and :class:`~django.template.response.TemplateResponse`, will be removed. ``content_type`` should be used instead. This also applies to the ``render_to_response()`` shortcut and the sitemap views, :func:`~django.contrib.sitemaps.views.index` and :func:`~django.contrib.sitemaps.views.sitemap`.
id: Argumen ``mimetype`` pada cara ``__init__`` dari :class:`~django.http.HttpResponse`, :class:`~django.template.response.SimpleTemplateResponse`, dan :class:`~django.template.response.TemplateResponse`, akan dipindahkan. ``content_type`` harus digunakan sebagai gantinya. Ini juga berlaku pada jalan pintas ``render_to_response()`` dan tampilan peta situs, :func:`~django.contrib.sitemaps.views.index` dan :func:`~django.contrib.sitemaps.views.sitemap`.
pt_br: O argumento ``mimetype`` para métodos ``__init__`` de :class:`~django.http.HttpResponse`, :class:`~django.template.response.SimpleTemplateResponse`, e :class:`~django.template.response.TemplateResponse`, será removido. ``content_type`` deve ser usado em seu lugar. Isso também se aplica ao atalho ``render_to_response()`` e as views de sitemap, :func:`~django.contrib.sitemaps.views.index` e :func:`~django.contrib.sitemaps.views.sitemap`.

source: When :class:`~django.http.HttpResponse` is instantiated with an iterator, or when :attr:`~django.http.HttpResponse.content` is set to an iterator, that iterator will be immediately consumed.
id: Ketika :class:`~django.http.HttpResponse` dipakai dengan sebuah pengulang, atau ketika :attr:`~django.http.HttpResponse.content` disetel ke sebuah pengulang, yang pengulang akan segera dikonsumsi.
pt_br: Quando :class:`~django.http.HttpResponse` é instanciado com um iterator, ou quando :attr:`~django.http.HttpResponse.content` é setado para um iterator, esse iterator será imediatamente consumido.

source: The ``AUTH_PROFILE_MODULE`` setting, and the ``get_profile()`` method on the User model, will be removed.
id: Pengaturan ``AUTH_PROFILE_MODULE``, dan cara ``get_profile()`` pada model User akan dipindahkan.
pt_br: O setting ``AUTH_PROFILE_MODULE``, e o método ``get_profile()`` do model User serão removidos.

source: The ``cleanup`` management command will be removed. It's replaced by ``clearsessions``.
id: Perintah pengelolaan ``cleanup`` akan dipindahkan. Dia diganti oleh ``clearsessions``.
pt_br: O comando de gerenciamento ``cleanup`` será removido. Ele foi trocado por ``clearsessions``.

source: The ``daily_cleanup.py`` script will be removed.
id: Tulisan ``daily_cleanup.py`` akan dipindahkan.
pt_br: O script ``daily_cleanup.py`` será removido.

source: The ``depth`` keyword argument will be removed from :meth:`~django.db.models.query.QuerySet.select_related`.
id: Argumen katakunci ``depth`` akan dipindahkan dari :meth:`~django.db.models.query.QuerySet.select_related`.
pt_br: O argumento chave ``depth`` será removido de :meth:`~django.db.models.query.QuerySet.select_related`.

source: The undocumented ``get_warnings_state()``/``restore_warnings_state()`` functions from :mod:`django.test.utils` and the ``save_warnings_state()``/ ``restore_warnings_state()`` :ref:`django.test.*TestCase <django-testcase-subclasses>` methods are deprecated. Use the :class:`warnings.catch_warnings` context manager available starting with Python 2.6 instead.
id: Fungsi ``get_warnings_state()``/``restore_warnings_state()`` tidak terdokumentasikan dari cara :mod:`django.test.utils` dan ``save_warnings_state()``/ ``restore_warnings_state()`` :ref:`django.test.*TestCase <django-testcase-subclasses>` diusangkan. Gunakan pengelola konteks :class:`warnings.catch_warnings` tersedia dimulai dengan Python 2.6 sebagai gantinya.
pt_br: As funções não documentadas ``get_warnings_state()``/``restore_warnings_state()`` do :mod:`django.test.utils` e os métodos ``save_warnings_state()``/ ``restore_warnings_state()`` :ref:`django.test.*TestCase <django-testcase-subclasses>` foram depreciados. Use o :class:`warnings.catch_warnings` context manager disponível a partir do Python 2.6 em seu lugar.

source: The undocumented ``check_for_test_cookie`` method in :class:`~django.contrib.auth.forms.AuthenticationForm` will be removed following an accelerated deprecation. Users subclassing this form should remove calls to this method, and instead ensure that their auth related views are CSRF protected, which ensures that cookies are enabled.
id: Cara ``check_for_test_cookie`` tidak terdokumentasi di :class:`~django.contrib.auth.forms.AuthenticationForm` akan dipindahkan mengikuti pengusangan dipercepat. Pengguna mensubkelaskan formulir ini harus memindahkan panggilan pada cara ini, dan malahan memastikan bahwa otentifikasi terkait tampilan mereka dilindungi CSRF, yang memastikan bahwa kue diadakan.
pt_br: O método não documentado ``check_for_test_cookie`` na :class:`~django.contrib.auth.forms.AuthenticationForm` será removido seguindo uma depreciação acelerada. Usuários fazendo subclasses desse form devem remover as chamadas para esse método, e ao invés disso garantir que suas views relacionadas a autenticação são protegidas de CSRF, o que garante que os cookies estão habilitados.

source: The version of :func:`django.contrib.auth.views.password_reset_confirm` that supports base36 encoded user IDs (``django.contrib.auth.views.password_reset_confirm_uidb36``) will be removed. If your site has been running Django 1.6 for more than :setting:`PASSWORD_RESET_TIMEOUT_DAYS`, this change will have no effect. If not, then any password reset links generated before you upgrade to Django 1.7 won't work after the upgrade.
id: Versi dari :func:`django.contrib.auth.views.password_reset_confirm` yang mendukung base36 encoded ID pengguna (``django.contrib.auth.views.password_reset_confirm_uidb36``) akan dipindahkan. Jika situs anda telah menjalankan Django 1.6 untuk lebih dari :setting:`PASSWORD_RESET_TIMEOUT_DAYS`, perubahan ini akan tidak mempunyai pengaruh. Jika tidak, lalu tiap tautan setel kembali sandi dibangkitkan sebelum anda meningkatkan ke Django 1.7 tidak akan bekerja setela peningkatan.
pt_br: A versão de :func:`django.contrib.auth.views.password_reset_confirm` que suporta IDs de usuários codificado com base36 (``django.contrib.auth.views.password_reset_confirm_uidb36``) será removida. Se o seu site está rodando Django 1.6 por mais de :setting:`PASSWORD_RESET_TIMEOUT_DAYS`, essa mudança não terá efeito. Caso contrário, qualquer link de reset de senha gerado antes de você atualizar para o Django 1.7 não irão funcionar após a atualização.
