Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Collin found Django in November 2006. He was in awe of the admin and ORM and was amazed that the documentation was teaching him best web practices like redirecting after a successful POST request. Why had he never learned this before? No one knows to this day.
id: Collin menemukan Django di November 2006. Dia di perasaan kagum dari admin dan ORM dan takjub bahwa dokumentasi mengajarkan dia praktik jaringan terbaik seperti mengalihkan setelah berhasil meminta POST. Mengapa dia tidak pernah belajar ini sebelumnya? Tidak seorangpun mengetahui sampai hari ini.
pt_br: Collin encontrou o Django em Novembro de 2006. Ele ficou maravilhado com o admin e o ORM e impressionado com a documentação ensinando as melhores práticas web como redirecionar depois de um chamada POST bem sucedida. Por que ele nunca tinha aprendido isso antes? Ninguém sabe até hoje.

source: He enjoys helping people on the |django-users| mailing list and making Django simple and easy for newcomers.
id: Dia menikmati membantu orang di daftar penyuratan |django-users| dan membuat Django sederhana dan mudah untuk pendatang baru.
pt_br: Ele gosta de ajudar pessoas na lista de email |django-users| e fazer o Django simples e fácil para novatos.

source: Collin lives in South Bend, IN, USA where he uses Django to `increase unity`_.
id: Collin tinggal di South Bend, IN, USA ketika dia menggunakan Django untuk `increase unity`_.
pt_br: Collin vive em South Blend, IN, USA onde ele usa o Django para `increase unity`_.

source: Tom has background in speech recognition, networking, and web development. He has a particular interest in Web API design and is the original author of `Django REST framework`_.
id: Tom mempunyai latar belakang dalam pengenalan suara, jaringan, dan pengembangan kringan. Dia mempunyai minat khusus dalam perancangan API Jaringan dan penulis asli dari `Django REST framework`_.
pt_br: Tom tem background em reconhecimento de fala, redes, e desenvolvimento web. Ele tem um interesse particular em design de APIs Web e é o autor original do `Django REST framework`_.

source: Tom lives in the seaside city of Brighton, UK.
id: Tom tinggal di kota pantai Brighton, UK.
pt_br: Tom vive na cidade costeira de Brighton, UK.

source: Curtis is a self-taught programmer from Melbourne, Australia, who eschews specialization. Upon finding Django when it was first open sourced, he realized it was possible to enjoy web development.
id: Curtis adalah pemrogram otodidak dari Melbourne, Australia, yang menghindar kekhususan. Setelah menemukan Django ketika pertama di umber terbukakan, dia menyadari itu memungkinkan untuk menikmati pengembangan jaringan.
pt_br: Curtis é um programador auto-didata de Melbourne, Australia, que evita especialização. Ao encontrar o Django quando seu código foi aberto, ele percebeu que era possível gostar de desenvolvimento web.

source: He spends a lot of time helping people on the `#django` IRC channel, and has authored and released a number of `smaller Django apps`_.
id: Dia menghabiskan banyak waktu membantu orang di saluran IRC `#django`, dan telah menulis dan menerbitkan sejumlah `smaller django apps`_.

source: Markus is a senior backend developer at `LaterPay`_ in Munich. He studied Computer Science at the `Technical University of Berlin`_. He started working with Django in 2010 when he joined the `ubuntuusers.de`_ web team to work on *Inyoka*. Markus made his first contribution to the Django project during DjangoCon Europe 2013 in Warsaw. He was the web team leader for the `EuroPython 2014 website`_ and started regular contributions to Django after that.
id: Markus adalah senior pengembang backend pada `LaterPay`_ di Munich. Dia belajar Ilmu Komputer pada `Technical University of Berlin`_. Dia mulai bekerja dengan Django di 2010 ketika dia bergabung tim jaringan `ubuntuusers.de`_ untuk bekerja pada *Inyoka*. Markus membuat sumbangan pertama dua pada proyek Django selama DjangoCon Europe 2013 di Warsawa. Dia adalah pemimpin tim jaringan `EuroPython 2014 website`_ dan mulai sumbangan reguler pada Django setelahnya.

source: Markus lives in Berlin, Germany.
id: Markus tinggal di Berlin, Germany.
pt_br: Markus vive em Berlim, Alemanha.

source: Josh was given the opportunity to work on a new Django app around version 1.1 after working with a homegrown PHP reporting framework. The simplicity of the ORM and the power of the Admin were extremely liberating.
id: Josh diberikan kesempatan untuk bekerja pada aplikasi Django baru sekitar versi 1.1 setelah bekerja dengan kerangka kerja pelaporan PHP lokal. Keserhanaan dari ORM dan kekuatan dari Admin sangat membebaskan.
pt_br: Josh teve a oportunidade de trabalhar em um app Django pela versão 1.1 depois de trabalhar com um framework caseiro PHP de relatórios. A simplicidade do ORM e a força do Admin foram extremamente libertadores.

source: Still being involved with custom reporting applications, he decided to try his hand at improving the ORM support for analytics. His contributions focus on giving more power to users of the ORM.
id: Masih terlibat dengan aplikasi pelaporan penyesuaian, dia memutuskan untuk mencoba tangannya pada memperbaiki dukungan ORM untuk analisis. Sumbangan dia fokus pada memberikan lebih tenaga ke pengguna dari ORM.
pt_br: Ainda se envolvendo com aplicações de relatórios customizadas, ele decidiu tentar melhorar o suporte do ORM a analytics. Sua contribuição focou em dar mais poder aos usuários do ORM.

source: Josh lives in Melbourne, Australia where he heads up development for a SaaS telecommunications company.
id: Josh tinggal di Melbourne, Australia dimana dia mengepalai pengembangan untuk perusahaan telekomunikasi SaaS.
pt_br: Josh vive em Melbourne, Australia onde ele lidera o desenvolvimento de uma empresa de telecomunicações SaaS.

source: Preston is a software developer with a background in mathematics. He enjoys Django because it enables consistent, simple, and tested systems to be built that even new programmers can quickly dive into. Preston lives in Dallas, TX.
id: Preston adalah pengembang perangkat lunak dengan latar belakan di matematika. Dia menikmati Django karena itu tetap, sederhana, dan sistem teruji untuk dibangun yang bahkan pemrogram baru dapat dengan cepat menggali kedalam. Preston tinggal di Dallas, TX.
pt_br: Preston é um desenvolvedor de software com um background em matemática. Ele gosta de Django porque ele permite construir sistemas consistentes, simples e testados que até mesmo programadores novos podem mergulhar rapidamente. Preston vive em Dallas, TX.

source: Tomek started using Django in 2007 as a tool for quickly dealing with university projects. Since then, he worked with various technologies like Ruby on Rails, JavaScript and Android but always returned to Python and Django.
id: Tomek mulai menggunakan Django di 2007 sebagai alat untuk dengan cepat berhubungan dengan proyek universitas. Sejak itu, dia bekerja dengan beragam teknologi seperti Ruby on Rails, JavaScript dan Android tetapi selalu mengembalikan ke Python dan Django.
pt_br: Tomek começou a usar o Django em 2007 como uma ferramenta para lidar rapidamente com projetos da universidade. Desde então, ele trabalhou com várias tecnologias como Ruby on Rails, JavaScript e Android mas sempre retornando ao Python e Django.

source: Tomek loves the Django community. He organized multiple Django sprints, co-organized `DjangoCon Europe 2013`_ and has mentored at many `Django Girls`_ events.
id: Tomek mencintai komunitas Django. Dia mengorganisir banyak lari cepat Django, mengorganisir `DjangoCon Europe 2013`_ dan telah membimbing banyak acara `Django Girls`_.
pt_br: Tomek ama a comunidade Django. Ele organizou múltiplas sprints Django, co-organizou a `DjangoCon Europe 2013`_ e tem orientado em muitos eventos `Django Girls`_.

source: Originally from Poland, Tomek currently lives in London, where he works at Squirrel_.
id: Aslinya dari Polandia, Tomek saat ini tinggal di London, dimana dia bekerja di Squirrel_.
pt_br: Originalmente da Polônia, Tomek atualmente vive em Londres, onde ele trabalha na Squirrel_.

source: Ola started working with Django in 2009, when she discovered the power of the Django admin and quickly fell in love with the beauty of Python.
id: Ola mulai bekerja dengan Django di 2009, ketika dia menemukan kekuatan dari admin Django dan dengan cepat jatuh cinta dengan kecantikan Python.
pt_br: Ola começou a trabalhar com Django em 2009, quando ela descobriu o poder do Django admin e rapidamente se apaixonou com a beleza do Python.

source: She co-organized `DjangoCon Europe 2013`_ in Warsaw and co-authored the `Django Girls Tutorial`_, the most beginner friendly Django tutorial out there. Together with Ola Sendecka, she started `Django Girls`_, a community and series of Django workshops for women who've never programmed before.
id: Dia mengorganisasikan `DjangoCon Europe 2013`_ di Warsawa dan menulis `Django Girls Tutorial`_, tutorial pemula paling ramah diluar sana. Bersama dengan Ola Sendecka, dia memulai `Django Girls`_, komunitas dan rentetan dari bengkel Django untuk wanita yang belum diprogram sebelumnya.
pt_br: Ela co-organizou `DjangoCon Europe 2013`_ em Varsóvia e foi co-autora do `Django Girls Tutorial`_, o tutorial Django para iniciantes mais amigável disponível. Junto com Ola Sendecka, ela começou o `Django Girls`_, uma comunidade e série de workshops Django para mulheres que nunca programaram antes.

source: In 2015, she became a Django Software Foundation board member. Ola was also a part of the team responsible for shipping the djangoproject.com redesign.
id: Di 2015, dia menjadi anggota badan Django Software Foundation. Ola juga bagian dari tim bertanggungjawab untuk pengiriman djangoproject.com merancang kembali.
pt_br: Em 2015, ela se tornou uma membra do conselho da Django Software Foundation. Ola também fez parte do time responsável pelo redesign no djangoproject.com.

source: Originally from Poland, Ola currently lives in London, where she works with friends at `Potato`_.
id: Aslinya dari Polandia, Ola saat ini tinggal di London, dimana dia bekerja bersama teman di `Potato`_.
pt_br: Originalmente da Polônia, Ola atualmente vive em Londres, onde ela trabalha com amigos na `Potato`_.

source: Ola started her adventure with Django when writing a university project in 2009. After that she attended her first DjangoCon Europe which defined her future life as a Django professional.
id: Ola mulai petualangannya dengan Django ketika menulis proyek unversitas di 2009. Setelah itu dia menghadiri DjangoCon Europe pertama yang menentukan masa depan hidupnya sebagai profesional Django.

source: Since then she has been an active community member. Ola co-organized a number of Django sprints and conferences including: `DjangoCon Europe 2013`_, `Django Under the Hood 2015`_ and `DjangoCon Europe 2016`_. Together with Ola Sitarska she founded `Django Girls`_, co-authored the `Django Girls Tutorial`_ and is a member of the Django Girls Foundation. She is also an author of the `Coding is for Girls`_ YouTube series teaching programming and Django to beginners.
id: Sejak saat itu dia telah menjadi anggota komunitas aktif. Ola mengatur sejumlah sprint Django dan pertemuan termasuk: `DjangoCon Europe 2013`_, `Django Under the Hood 2015`_ dan `DjangoCon Europe 2016`_. Bersama-sama dengan Ola Sitarska dia menemukan `Django Girls`_, penulis bersama `Django Girls Tutorial`_ dan adalah anggota dari Django Girls Foundation. Dia juga penulis dari rangkaian Youtube `Coding is for Girls`_ mengajarkan pemrograman dan Django ke pemula.

source: Originally from Poland, Ola currently lives in London, where she works for `Potato`_.
id: Aslinya dari Polandia, Ola saat ini tinggal di London, dimana dia bekerja untuk `Potato`_.

source: Past team members
id: Anggota tim lampau
pt_br: Membros antigos do time

source: Georg created Django's internationalization system, managed i18n contributions and made a ton of excellent tweaks, feature additions and bug fixes.
id: Georg membuat sistem internasionalisasi Django, mengelola sumbangan i18n dan membuat ton-an dari peningkatan yang hebat, penambahan fitur dan perbaikan kesalahan.
pt_br: Georg criou o sistema de internacionalização do Django, gerenciou as contribuições de i18n e fez uma tonelada de excelentes ajustes, adições de funcionalidades e correções de bugs.

source: Robert was responsible for the *first* refactoring of Django's admin application to allow for easier reuse and has made a ton of excellent tweaks, feature additions and bug fixes.
id: Robert bertanggung jawab untuk refactor *pertama* dari aplikasi admin Django untuk mengizinkan agar lebih mudah digunakan kembali dan telah membuat ton-an dari perubahan istimewa, tambahan fitur dan perbaikan kesalahan.
pt_br: Robert foi responsável pela *primeira* refatoração da aplicação admin do Django para tornar o reuso mais fácil e fez uma tonelada de excelentes ajustes, adições de funcionalidades e correções de bugs.

source: Alex was involved in many parts of Django, he contributed to the ORM, forms, admin, amongst others; he is most known for his work on multiple-database support in Django.
id: Alex telah berkecimpung di banyak bagian dari Django, dia membantu pada ORM, formulir, admin, diantara yang lain; dia paling dikenal untuk kerjanya pada dukungan basisdata-banyak di Django.
pt_br: Alex estava envolvido em muitas partes do Django, ele contribuiu para o ORM, formulários, admin, entre outros; ele é mais conhecido pelo seu trabalho no suporte a múltiplos bancos de dados no Django.

source: Alex lives in Washington, DC, USA.
id: Alex tinggal di Washington, DC, USA.
pt_br: Alex vive em Washington, DC, USA.

source: Simon discovered Django 0.96 during his Computer Science PhD research and has been developing with it full-time ever since. His core code contributions are mostly in Django's admin application.
id: Simon menemukan Django 0.96 selama pencarian Computer Science PhD dan telah mengembangkan dengannya waktu-penuh. Bantuan kode inti dia kebanyakan di aplikasi admin Django.
pt_br: Simon descobriu o Django 0.96 durante a pesquisa do seu PhD em Ciência da Computação e tem desenvolvido com ele em tempo integral desde então. As suas principais contribuições são em grande maioria na aplicação admin do Django.

source: Simon works as a freelance developer based in Wollongong, Australia.
id: Simon bekerja sebagai pengembang lepas berbasis di Wollongong, Australia.
pt_br: Simon trabalha como desenvolvedor freelancer em Wollongong, Australia.

source: Gabriel has been working with Django since 2008, shortly after the 1.0 release. Convinced by his business partner that Python and Django were the right direction for the company, he couldn't have been more happy with the decision. His contributions range across many areas in Django, but years of copy-editing and an eye for detail lead him to be particularly at home while working on Django's documentation.
id: Gabriel telah bekerja dengan Django sejak 2008, tidak lama setelah terbitan 1.0. Diyakini oleh rekan bisnisnya dimana Python dan Django merupakan arahan tepat untuk perusahaan, dia tidak dapat lebih bahagia dengan keputusan. Sumbangan dia menjangkau banyak kawasan di Django, tetapi tahunan dari salinan-suntingan dan mata untuk rincian membawa dia menjadi di rumah selagi bekerja pada dokumentasi Django.
pt_br: Gabriel tem trabalhado com Django desde 2008, pouco tempo depois da release 1.0. Convencido pelo seu sócio que Python e Django eram a direção certa para a companhia, ele não podia estar mais feliz com a decisão. Suas contribuições variam entre muitas áreas do Django, mas anos de edição e um olho para o detalhe o levaram a estar particularmente em casa enquanto trabalhava na documentação do Django.

source: Gabriel works as a developer in the SF Bay Area, CA, USA.
id: Gabriel bekerja sebagai pengembang di SF Bay Area, CA, USA.
pt_br: Gabriel trabalha como desenvolvedor na Baía de São Francisco, CA, USA.

source: Malcolm originally wanted to be a mathematician and somehow ended up a software developer. He contributed to many Open Source projects, served on the board of the GNOME foundation, and was a great chess player.
id: Malcolm aslinya ingin menjadi matematikawan dan entah mengapa berakhir pengembang perangkat lunak. Dia menyumbang ke banyak proyek Sumber Terbuka, melayani di badan yayasan GNOME, dan pemain catur hebat.
pt_br: Malcolm originalmente queria ser um matemático e de alguma maneira acabou como desenvolvedor de software. Ele contribui com muitos projetos Open Source, serviu no conselho da fundação GNOME, e foi um grande jogador de xadrez.

source: Malcolm was deeply involved in many part of Django - most notably, the ORM, but many other internals bear his fingerprints. Django’s support for unicode and autoescaping in templates can both be almost entirely attributed to Malcolm.
id: Malcolm terlibat lebih dalam di banyak bagian dari Django - kebanyakan terutama, ORM, tetapi banyak internal lain dihasilkan dengan sidik jarinya. Dukungan Django untuk unicode dan pelolosan otomatis dapat keduanya hampir keseluruhan dihubungkan ke Malcolm.
pt_br: Malcolm esteve envolvido profundamente em muitas partes do Django - mais notoriamente, o ORM, mas muitas outras partes internas possuem suas impressões digitais. O suporte a unicode e autoescaping nos templates podem ambos quase que inteiramente ser atribuídos a ele.

source: He was an International Man of Mystery and lived in Sydney, Australia.
id: Dia adalah International Man of Mystery dan tinggal di Sydney, Australia.
pt_br: Ele foi um um Agente Nada Discreto e viveu em Sydney, Australia.

source: *Malcolm passed away on March 17, 2013.*
id: *Malcolm meninggal pada Maret 17, 2013.*
pt_br: *Malcolm* faleceu em 17 de Março de 2013.*

source: Preston is a recovering neuroscientist who originally discovered Django as part of a sweeping move to Python from a grab bag of half a dozen languages. He was drawn to Django's balance of practical batteries included philosophy, care and thought in code design, and strong open source community. Currently working in the rent-your-infra space (aka Cloud), he is always looking for opportunities to volunteer for community oriented education projects, such as for kids and scientists (e.g. Software Carpentry).
id: Preston adalah seorang pemulihan ahli syaraf yang aslinya menemukan Django sebagai bagian dari langkah menyapu ke Python dari kantong setengah lusin bahasa. Dia ditarik ke keseimbangan Django dari deretan praktis termasuk filosofi, kepedulian dan pemikiran dalam perancangan kode, dan komunitas sumber terbuka yang kuat. Saat ini bekerja di lahan sewa-infrastruktur-anda (alias Awan), dia selalu mencari kesempatan untuk relawan untuk komunitas proyek berorientasi pendidikan, seperti untuk anak-anak dan ilmuwan (sebagai contoh Software Carpentry).
pt_br: Preston é um neurocientista em recuperação que originalmente descobriu o Django em um movimento arrebatador para o Python depois de um saco de meia dúzia de linguagens. Ele foi atraído pelo balanço entre a filosofia prática de baterias inclusas, cuidado e pensamento no design do código, e uma forte comunidade open source. Atualmente trabalha na área do alugue-sua-infra (aka Cloud), ele está sempre procurando por oportunidades para se voluntariar em projetos de educação voltados a comunidade, tais como crianças e cientistas (ex. Software Carpentry).

source: Preston lives with his family and animal menagerie in Santa Barbara, CA, USA.
id: Preston tinggal dengan keluarganya dan kumpulan binatang liar dalam kandang di Santa Barbara, CA, USA.
pt_br: Preston vive com sua família e sua coleção de animais em Santa Barbara, CA, USA.

source: As a self-professed design geek, Idan was initially attracted to Django sometime between magic-removal and queryset-refactor. Formally trained as a software engineer, Idan straddles the worlds of design and code, jack of two trades and master of none. He is passionate about usability and finding novel ways to extract meaning from data, and is a longtime photographer_.
id: Sebagai seorang pencandu rancangan dikenal-sendiri, Idan awalnya tertatik pada Django kadang kala diantara magic-removal dan queryset-refactor. Secara resmi dilatih sebagai teknis perangkat lunak, Idan mengangkangi dunia dari rancangan dan kode, mendongkrak dari buruh dan master dari tidak siapapun. Dia bergairah tentang penggunaan dan menemukan cara yang belum diketahui untuk mengambil arti dari data, dan adalah seorang photographer_ lama.
pt_br: Como um auto-professo geek de design, Idan foi inicialmente atraído pelo Django em algum momento entre a magic-removal e o queryset-refactor. Formalmente treinado como um engenheiro de software, Idan transpos os mundos do design e do código, pau-pra-duas-obras e mestre de nenhuma. Ele é apaixonado por usabilidade e encontrar novas maneiras de extrair sentido dos dados, e é um fotógrafo de longa data.

source: Idan is currently hacking on all things data and visualization at Heroku_.
id: Idan saat ini meretas pada semua hal data dan penampakan di Heroku_.

source: Matt helped with Django's Oracle support.
id: Matt membantu dengan dukungan Oracle Django.
pt_br: Matt ajudou com o suporte ao Oracle no Django.

source: Ian also helped with Oracle support.
id: Ian juga membantu dengan dukungan Oracle.
pt_br: Ian também ajudou com o suporte ao Oracle.

source: Joseph was the director of lead development at EveryBlock and previously developed at the Lawrence Journal-World. He often disappears for several days into the woods, attempts to teach himself computational linguistics, and annoys his neighbors with his Charango_ playing.
id: Joseph adalah direktur dari pemimpin pengembang pada EveryBlock dan sebelumnya mengembangkan Lawrence Journal-World. Dia sering menghilang untuk beberapa hari kedalam hutan, berusaha mengajar diri dia sendiri perhitungan ilmu bahasa, dan mengganggu tetangganya dengan bermain Charango_.
pt_br: Joseph era o diretor de lead development na EveryBlock e antes foi desenvolvedor na Journal-World em Lawrence. Ele geralmente desaparece por vários dias na floresta, tenta ensinar a si mesmo linguística computacional, e incomoda seus vizinhos tocando o seu Charango_.

source: Joseph's first contribution to Django was a series of improvements to the authorization system leading up to support for pluggable authorization. Since then, he's worked on the new forms system, its use in the admin, and many other smaller improvements.
id: Bantuan pertama Joseph pada Django adalah rangkaian dari perbaikan pada sistem otorisasi membawa ke dukungan untuk otorisasi tersumbat. Sejak itu, dia bekerja pada sistem formulir baru, yang digunakan dalam admin, dan banyak perbaikan kecil lainnya.
pt_br: A primeira contribuição ao Django de Joseph foi uma sére de melhorias no sistema de autorização culminando com o suporte a sistemas de authorização plugáveis. Desde então, ele tem trabalhado no novo sistema de formulários, o seu uso no admin, e muitas outras melhorias pequenas.

source: Joseph lives in Chicago, USA.
id: Joseph tinggal di Chicago, USA.
pt_br: Joseph vive em Chicago, EUA.
