Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: The ``django.utils.encoding.StrAndUnicode`` mix-in will be removed. Define a ``__str__`` method and apply the :func:`~django.utils.encoding.python_2_unicode_compatible` decorator instead.
id: Campuran ``django.utils.encoding.StrAndUnicode`` akan dipindahkan. Tentukan cara ``__str__`` dan berlakukan penghias :func:`~django.utils.encoding.python_2_unicode_compatible` sebagai gantinya.
pt_br: O mix-in ``django.utils.encoding.StrAndUnicode` será removido. Em seu lugar defina um método ``__str__`` e aplique o decorator :func:`~django.utils.encoding.python_2_unicode_compatible`.

source: See the :ref:`Django 1.4 release notes<deprecated-features-1.4>` for more details on these changes.
id: Lihat :ref:`Django 1.4 release notes<deprecated-features-1.4>` untuk lebih rinci pada perubahan ini.
pt_br: Veja as :ref:`notas da release do Django 1.4<deprecated-features-1.4>` para mais detalhes sobre essas mudanças.

source: ``django.contrib.databrowse`` will be removed.
id: ``django.contrib.databrowse`` akan dipindahkan.
pt_br: ``django.contrib.databrowse`` será removido.

source: ``django.contrib.localflavor`` will be removed following an accelerated deprecation.
id: ``django.contrib.localflavor`` akan dipindahkan mengikuti pengusangan yang dipercepat.
pt_br: ``django.contrib.localflavor`` será removido seguindo uma depreciação acelerada.

source: ``django.contrib.markup`` will be removed following an accelerated deprecation.
id: ``django.contrib.markup`` akan dipindahkan mengikuti pengusangan yang dipercepat.
pt_br: ``django.contrib.markup`` será removido seguindo uma depreciação acelerada.

source: The compatibility modules ``django.utils.copycompat`` and ``django.utils.hashcompat`` as well as the functions ``django.utils.itercompat.all`` and ``django.utils.itercompat.any`` will be removed. The Python builtin versions should be used instead.
id: Modul kesesuaian ``django.utils.copycompat`` dan ``django.utils.hashcompat`` sama dan juga fungsi ``django.utils.itercompat.all`` dan ``django.utils.itercompat.any`` akan dipindahkan. Versi pasang tetap Python harus digunakan sebagai gantinya.
pt_br: Os módulos de compatibilidade ``django.utils.copycompat`` e ``django.utils.hashcompat`` assim como as funções ``django.utils.itercompat.all`` e ``django.utils.itercompat.any`` serão removidos. Em seu lugar utiize as versões embutidas no Python.

source: The ``csrf_response_exempt`` and ``csrf_view_exempt`` decorators will be removed. Since 1.4 ``csrf_response_exempt`` has been a no-op (it returns the same function), and ``csrf_view_exempt`` has been a synonym for ``django.views.decorators.csrf.csrf_exempt``, which should be used to replace it.
id: Penghias ``csrf_response_exempt`` and ``csrf_view_exempt`` akan dipindahkan. Sejak 1.4 ``csrf_response_exempt`` telah menjadi tidak beroperasi (dia mengembalikan fungsi sama), dan ``csrf_view_exempt`` telah menjadi sinonim untuk ``django.views.decorators.csrf.csrf_exempt``, yang harus digunakan untuk menggantinya.
pt_br: Os decorators ``csrf_response_exempt`` e ``csrf_view_exempt`` serão removidos. Desde a versão 1.4 ``csrf_response_exempt`` tem sido um no-op (ele retorna a mesma função), e ``csrf_view_exempt`` tem sido um sinônimo para ``django.views.decorators.csrf.csrf_exempt``, que deve ser usado para trocá-lo.

source: The ``django.core.cache.backends.memcached.CacheClass`` backend was split into two in Django 1.3 in order to introduce support for PyLibMC. The historical ``CacheClass`` will be removed in favor of ``django.core.cache.backends.memcached.MemcachedCache``.
id: Backend ``django.core.cache.backends.memcached.CacheClass`` telah dipisah menjadi dua di Django 1.3 agar memperkenalkan dukungan untuk PyLibMC. Riwayat ``CacheClass`` akan dipindahkan mendukung ``django.core.cache.backends.memcached.MemcachedCache``.
pt_br: O backend ``django.core.cache.backends.memcached.CacheClass`` foi dividido em dois no Django 1.3 para introduzir o suporte a PyLibMC. O histórico ``CacheClass`` será removido em favor de ``django.core.cache.backends.memcached.MemcachedCache``.

source: The UK-prefixed objects of ``django.contrib.localflavor.uk`` will only be accessible through their GB-prefixed names (GB is the correct ISO 3166 code for United Kingdom).
id: Obyek awalan UK dari ``django.contrib.localflavor.uk`` hanya akan diakses melalui nama-nama awalan GB mereka (GB adalah kode benar ISO 3166 untuk Inggris).
pt_br: Os objetos ``django.contrib.localflavor.uk`` prefixados com UK só serão acessíveis através de seus nomes prefixados com GB (GB é o código ISO 3166 corretp para o Reino Unido).

source: The ``IGNORABLE_404_STARTS`` and ``IGNORABLE_404_ENDS`` settings have been superseded by :setting:`IGNORABLE_404_URLS` in the 1.4 release. They will be removed.
id: Pengaturan ``IGNORABLE_404_STARTS`` dan ``IGNORABLE_404_ENDS`` telah digantikan oleh :setting:`IGNORABLE_404_URLS` di terbitan 1.4. Mereka akan dipindahkan.
pt_br: Os settings ``IGNORABLE_404_STARTS`` e ``IGNORABLE_404_ENDS`` foram substituídos por :setting:`IGNORABLE_404_URLS` na release 1.4. Eles serão removidos.

source: The form wizard has been refactored to use class-based views with pluggable backends in 1.4. The previous implementation will be removed.
id: Wizard formulir telah direfaktorisasi untuk menggunakan tampilan berdasar kelas dengan backend dapat tertanam di 1.4. Penerapan sebelumnya akan dipindahkan.
pt_br: O form wizard foi refatorado para usar views baseads em classes com backends plugáveis na 1.4. A implementação prévia será removida.

source: Legacy ways of calling :func:`~django.views.decorators.cache.cache_page` will be removed.
id: Cara warisan dari memanggil :func:`~django.views.decorators.cache.cache_page` akan dipindahkan.
pt_br: Formas legadas de chamar :func:`~django.views.decorators.cache.cache_page` será removida.

source: The backward-compatibility shim to automatically add a debug-false filter to the ``'mail_admins'`` logging handler will be removed. The :setting:`LOGGING` setting should include this filter explicitly if it is desired.
id: Shim kesesuaian-kebelakang untuk otomatis menambah penyaring slah-pencari kesalahan pada penangan pencatatan ``'mail_admins'`` akan dipindahkan. Pengaturan :setting:`LOGGING` harus menyertakan penyaring ini secara ekplisit jika itu diminta.
pt_br: O calço de compatibilidade para adicionar automaticamente um filtro de debug-false para o logging handler ``'mail_admins'`` será removido. O setting :setting:`LOGGING` deve incluir esse filtro explicitamente se ele for desejado.

source: The builtin truncation functions ``django.utils.text.truncate_words()`` and ``django.utils.text.truncate_html_words()`` will be removed in favor of the ``django.utils.text.Truncator`` class.
id: Fungsi pemotongan pasang tetap ``django.utils.text.truncate_words()`` dan ``django.utils.text.truncate_html_words()`` akan dipindahkan mendukung kelas ``django.utils.text.Truncator``.
pt_br: As funções embutidas de truncamento ``django.utils.text.truncate_words()`` e ``django.utils.text.truncate_html_words()`` serão removidas em favor da classe ``django.utils.text.Truncator``.

source: The ``django.contrib.gis.geoip.GeoIP`` class was moved to ``django.contrib.gis.geoip`` in 1.4 -- the shortcut in ``django.contrib.gis.utils`` will be removed.
id: Kelas ``django.contrib.gis.geoip.GeoIP`` telah dipindahkan ke ``django.contrib.gis.geoip`` di 1.4 -- jalan pintas di ``django.contrib.gis.utils`` akan dipindahkan.

source: ``django.conf.urls.defaults`` will be removed. The functions :func:`~django.conf.urls.include`, ``patterns()`` and :func:`~django.conf.urls.url` plus :data:`~django.conf.urls.handler404`, :data:`~django.conf.urls.handler500`, are now available through :mod:`django.conf.urls` .
id: ``django.conf.urls.defaults`` akan dipindahkan. Fungsu :func:`~django.conf.urls.include`, ``patterns()`` dan :func:`~django.conf.urls.url` plus :data:`~django.conf.urls.handler404`, :data:`~django.conf.urls.handler500`, sekarang tersedia melalui :mod:`django.conf.urls`.

source: The functions ``setup_environ()`` and ``execute_manager()`` will be removed from :mod:`django.core.management`. This also means that the old (pre-1.4) style of :file:`manage.py` file will no longer work.
id: Fungsi ``setup_environ()`` dan ``execute_manager()`` akan dipindahkan dari :mod:`django.core.management`. Ini juga berarti bahwa gaya lama (pra-1.4) dari berkas :file:`manage.py` tidak lama akan bekerja lagi.
pt_br: As funções ``setup_environ()`` e ``execute_manager()`` serão removidas do :mod:`django.core.management`. Isso também significa que o velho (pre-1.4) estilo do arquivo :file:`manage.py` não irá mais funcionar.

source: Setting the ``is_safe`` and ``needs_autoescape`` flags as attributes of template filter functions will no longer be supported.
id: Pengaturan bendera ``is_safe`` dan ``needs_autoescape`` sebagai atribut dari fungsi penyaring penyesuaian tidak lagi didukung.
pt_br: Ativar as flags ``is_safe`` e ``needs_autoescape`` como atributos de funções de filtro de template não será mais suportado.

source: The attribute ``HttpRequest.raw_post_data`` was renamed to ``HttpRequest.body`` in 1.4. The backward compatibility will be removed -- ``HttpRequest.raw_post_data`` will no longer work.
id: Atribut ``HttpRequest.raw_post_data`` telah dinamai kembali ke ``HttpRequest.body`` di 1.4. Kesesuaian kebelakang akan dipindahkan -- ``HttpRequest.raw_post_data`` tidak lagi bekerja.
pt_br: O atributo ``HttpRequest.raw_post_data`` foi renomeado para ``HttpRequest.body`` na 1.4. A compatibilidade com versões anteriores será removida -- ``HttpRequest.raw_post_data`` não irá mais funcionar.

source: The value for the ``post_url_continue`` parameter in ``ModelAdmin.response_add()`` will have to be either ``None`` (to redirect to the newly created object's edit page) or a pre-formatted url. String formats, such as the previous default ``'../%s/'``, will not be accepted any more.
id: Nilai untuk parameter ``post_url_continue`` dalam ``ModelAdmin.response_add()`` akan harus menjadi antara ``None`` (untuk mengalihkan ke halaman penyuntingan obyek baru dibuat) atau url pra dibentuk. Bentuk deretan karakter, seperti awal sebelumnya ``'../%s/'``, tidak akan diterima lagi.
pt_br: O valor para o parâmetro ``post_url_continue`` em ``ModelAdmin.response_add()`` terá que ser ``None`` (para redirecionar para novos objetos edit page criados) ou uma url pré-formatada. Formatos de strings, tais como o antigo padrão ``'../%s/'``, não serão mais aceitos.

source: See the :ref:`Django 1.3 release notes<deprecated-features-1.3>` for more details on these changes.
id: Lihat :ref:`Django 1.3 release notes<deprecated-features-1.3>` untuk lebih rinci pada perubahan ini.
pt_br: Veja as :ref:`notas de release do Django 1.3<deprecated-features-1.3>` para mais detalhes sobre essas mudanças.

source: Starting Django without a :setting:`SECRET_KEY` will result in an exception rather than a ``DeprecationWarning``. (This is accelerated from the usual deprecation path; see the :doc:`Django 1.4 release notes</releases/1.4>`.)
id: Memulai Django tanpa :setting:`SECRET_KEY` akan menghasilkan sebuah pengecualian daripada ``DeprecationWarning``. (Ini dipercepat dari jalur pengusangan biasa; lihat :doc:`Django 1.4 release notes</releases/1.4>`.)
pt_br: Começar o Django sem um :setting:`SECRET_KEY` irá resultar em uma exceção ao invés de ``DeprecationWarning``. (Isso foi acelerado do caminho usual de depreciação; veja as :doc:`notas de release do Django 1.4</releases/1.4>`.)

source: The ``mod_python`` request handler will be removed. The ``mod_wsgi`` handler should be used instead.
id: Penanganan permintaan ``mod_python`` akan dipindahkan. Penanganan ``mod_wsgi`` harus digunakan.
pt_br: O request handler ``mod_python`` será removido. O handler ``mod_wsgi`` deve ser usado em seu lugar.

source: The ``template`` attribute on ``django.test.client.Response`` objects returned by the :ref:`test client <test-client>` will be removed. The :attr:`~django.test.Response.templates` attribute should be used instead.
id: Atribut ``template`` pada obyek ``django.test.client.Response`` dikembalikan oleh :ref:`test client <test-client>` akan dipindahkan. Atribut :attr:`~django.test.Response.templates` harus digunakan sebagai gantinya.
pt_br: O atributo de ``template`` em objetos ``django.test.client.Response`` retornados por :ref:`test client <test-client>` será removido. O atributo :attr:`~django.test.Response.templates` deve ser usado em seu lugar.

source: The ``django.test.simple.DjangoTestRunner`` will be removed. Instead use a unittest-native class. The features of the ``django.test.simple.DjangoTestRunner`` (including fail-fast and Ctrl-C test termination) can currently be provided by the unittest-native :class:`~unittest.TextTestRunner`.
id: ``django.test.simple.DjangoTestRunner`` akan dipindahkan. Sebagai gantinya gunakan kelas unittest-native. Fitur-fitur dari ``django.test.simple.DjangoTestRunner`` (termasuk fail-fast dan pengehentian percobaan Ctrl-C) dapat sati ini disediakan oleh :class:`~unittest.TextTestRunner` unittest-native.
pt_br: O ``django.test.simple.DjangoTestRunner`` será removido. Ao invés dele use uma classe nativa de teste unitário. As funcionalidades de ``django.test.simple.DjangoTestRunner`` (incluindo fail-fast e terminação de test com Ctrl-C) podem ser fornecidas atualemente pela :class:`~unittest.TextTestRunner`.

source: The undocumented function ``django.contrib.formtools.utils.security_hash`` will be removed, instead use ``django.contrib.formtools.utils.form_hmac``
id: Fungsi tidak didokumentasi ``django.contrib.formtools.utils.security_hash`` akan dipindahkan, sebagai gantinya gunakan ``django.contrib.formtools.utils.form_hmac``
pt_br: A função não documentada ``django.contrib.formtools.utils.security_hash`` será removida. Ao invés dela use ``django.contrib.formtools.utils.form_hmac``.

source: The function-based generic view modules will be removed in favor of their class-based equivalents, outlined :doc:`here </topics/class-based-views/index>`.
id: Modul tampilan umum berbasis-fungsi akan dipindahkan mendukung setara berbasis-kelas mereka, diuraikan :doc:`here </topics/class-based-views/index>`.
pt_br: Os módulos baseados em funções de view genéricas serão removidos em favor de seus equivalentes baseados em classes, descritos :doc:`aqui </topics/class-based-views/index>`.

source: The ``django.core.servers.basehttp.AdminMediaHandler`` will be removed. In its place use ``django.contrib.staticfiles.handlers.StaticFilesHandler``.
id: ``django.core.servers.basehttp.AdminMediaHandler`` akan dipindahkan. Dalam tempatnya gunakan ``django.contrib.staticfiles.handlers.StaticFilesHandler``.
pt_br: O``django.core.servers.basehttp.AdminMediaHandler`` será removido. Em seu lugar use ``django.contrib.staticfiles.handlers.StaticFilesHandler``.

source: The template tags library ``adminmedia`` and the template tag ``{% admin_media_prefix %}`` will be removed in favor of the generic static files handling. (This is faster than the usual deprecation path; see the :doc:`Django 1.4 release notes</releases/1.4>`.)
id: Pustaka etiket cetakan ``adminmedia`` dan etiket cetakan ``{% admin_media_prefix %}`` akan dipindahkan mendukung penanganan berkas-berkas tetap umum. (Ini lebih cepat daripada jalur pengusangan biasa; lihat :doc:`Django 1.4 release notes</releases/1.4>`.)
pt_br: As bibliotecas de tags de template ``adminmedia`` e a tag de template ``{% admin_media_prefix %}`` serão removidas em favor da manipulação genérica de arquivos estáticos. (Isso é mais rápido do que o caminho de depreciação usual; veja as :doc:`notas de release do Django 1.4</releases/1.4>`.)

source: The ``url`` and ``ssi`` template tags will be modified so that the first argument to each tag is a template variable, not an implied string. In 1.4, this behavior is provided by a version of the tag in the ``future`` template tag library.
id: Etiket cetakan ``url`` dan ``ssi`` akan dirubah sehingga argumen eprtama pada setiap etiket adalah sebuah variabel cetakan, bukan sebuah deretan karakter sisipan.

source: The ``reset`` and ``sqlreset`` management commands will be removed.
id: Perintah pengelolaan ``reset`` dan ``sqlreset`` akan dipindahkan.
pt_br: Os comandos de administração ``reset`` e ``sqlreset`` serão removidos.

source: Authentication backends will need to support an inactive user being passed to all methods dealing with permissions. The ``supports_inactive_user`` attribute will no longer be checked and can be removed from custom backends.
id: Backend otentifikasi akan butuh mendukung pengguna tidak aktif sedang diloloskan ke semua cara berurusan dengan perizinan. Atribut ``supports_inactive_user`` akan tidak lagi dicentang dan dapat dipindahkan dari backend penyesuaian.
pt_br: Backends de autenticação terão que suportar um usuário inativo sendo passado para todos os métodos que lidem com permissões. O atributo ``supports_inactive_user`` não será mais verificado e pode ser removido de backends customizados.

source: :meth:`~django.contrib.gis.geos.GEOSGeometry.transform` will raise a :class:`~django.contrib.gis.geos.GEOSException` when called on a geometry with no SRID value.
id: :meth:`~django.contrib.gis.geos.GEOSGeometry.transform` akan menimbulkan :class:`~django.contrib.gis.geos.GEOSException` ketika dipanggil pada geometri dengan tidak ada nilai SRID.
pt_br: O :meth:`~django.contrib.gis.geos.GEOSGeometry.transform` irá lançar :class:`~django.contrib.gis.geos.GEOSException` quando chamado em uma geometria sem valor SRID.

source: ``django.http.CompatCookie`` will be removed in favor of ``django.http.SimpleCookie``.
id: ``django.http.CompatCookie`` akan dipindahkan mendukung ``django.http.SimpleCookie``.
pt_br: ``django.http.CompatCookie`` será removido em favor de ``django.http.SimpleCookie``.

source: ``django.core.context_processors.PermWrapper`` and ``django.core.context_processors.PermLookupDict`` will be removed in favor of the corresponding ``django.contrib.auth.context_processors.PermWrapper`` and ``django.contrib.auth.context_processors.PermLookupDict``, respectively.
id: `django.core.context_processors.PermWrapper`` dan ``django.core.context_processors.PermLookupDict`` akan dipindahkan mendukung terhubung ``django.contrib.auth.context_processors.PermWrapper`` dan ``django.contrib.auth.context_processors.PermLookupDict``, masing-masing.
pt_br: ``django.core.context_processors.PermWrapper`` e ``django.core.context_processors.PermLookupDict`` serão removidos em favor dos correspondentes ``django.contrib.auth.context_processors.PermWrapper`` e ``django.contrib.auth.context_processors.PermLookupDict``, respectivamente.

source: The :setting:`MEDIA_URL` or :setting:`STATIC_URL` settings will be required to end with a trailing slash to ensure there is a consistent way to combine paths in templates.
id: Pengaturan :setting:`MEDIA_URL` atau :setting:`STATIC_URL` akan diwajibkan untuk mengakhiri dengan garis miring untuk memastikan ada cara selaras untuk menggabungkan jalur-jalur di cetakan.
pt_br: Os settings :setting:`MEDIA_URL` ou :setting:`STATIC_URL` terão que terminar com um slash para garantir que existe uma forma consistente de combinar caminhos nos templates.

source: ``django.db.models.fields.URLField.verify_exists`` will be removed. The feature was deprecated in 1.3.1 due to intractable security and performance issues and will follow a slightly accelerated deprecation timeframe.
id: ``django.db.models.fields.URLField.verify_exists`` akan dipindahkan. Fitur telah diusangkan di 1.3.1 karena masalah keamanan dan penampilan dan akan mengikuti sedikit penyesuaian kerangka waktu pengusangan.
pt_br: ``django.db.models.fields.URLField.verify_exists`` será removido. A funcionalidade foi depreciada em 1.3.1 devido a problemas de segurança e performance intratáveis e seguirá um tempo de depreciação ligeiramente acelerado.

source: Translations located under the so-called *project path* will be ignored during the translation building process performed at runtime. The :setting:`LOCALE_PATHS` setting can be used for the same task by including the filesystem path to a ``locale`` directory containing non-app-specific translations in its value.
id: Terjemahan bertempat dibawah yang disebut *jalur proyek* akan diabaikan selama pengolahan membangun terjemahan dilakukan pada waktu lari. Pengaturan :setting:`LOCALE_PATHS` dapat digunakan untuk tugas sama dengan menyertakan jalur sistem berkas ke pelipat ``locale`` mengandung terjemahan bukan aplikasi tertensi di nilainya.
pt_br: Traduções localizadas sob o então chamado *project path* serão ignoradas durante o processo de construção da tradução executado em runtime. O setting :setting:`LOCALE_PATHS` pode ser usado para a mesma tarefa quando incluido o caminho do sistema de arquivos para um diretório de ``locale`` contendo traduções não específicas de apps em seu valor.

source: The Markup contrib app will no longer support versions of Python-Markdown library earlier than 2.1. An accelerated timeline was used as this was a security related deprecation.
id: Aplikasi bantuah markah tidak lagi mendukung versi pustaka Python-Markdown lebih awal dari 2.1. Sebuah linimasa dipercepat telah digunakan seperti ini adalah hubungan keamanan pengusangan.
pt_br: O app contrib Markup não irá mais suportar versões da biblioteca de Markdown do Python anteriores a 2.1. Uma linha de tempo acelerada será usada já que isso era uma depreciação relacionada a segurança.

source: The ``CACHE_BACKEND`` setting will be removed. The cache backend(s) should be specified in the :setting:`CACHES` setting.
id: Pengaturan ``CACHE_BACKEND`` akan dipindahkan. Tembolok backend harus ditentukan di pengaturan :setting:`CACHES`.
pt_br: O setting ``CACHE_BACKEND`` será removido. O backend (ou os backends) de cache deve ser especificado no setting :setting:`CACHES`.

source: See the :ref:`Django 1.2 release notes<deprecated-features-1.2>` for more details on these changes.
id: Lihat :ref:`Catatan terbitan Django 1.2 <deprecated-features-1.2>` untuk lebih rinci di perubahan ini.
pt_br: Veja as :ref:`notas de release do Django 1.2<deprecated-features-1.2>` para mais detalhes sobre essas mudanças.

source: ``CsrfResponseMiddleware`` and ``CsrfMiddleware`` will be removed. Use the ``{% csrf_token %}`` template tag inside forms to enable CSRF protection. ``CsrfViewMiddleware`` remains and is enabled by default.
id: ``CsrfResponseMiddleware`` dan ``CsrfMiddleware`` akan dipindahkan. Gunakan etiket cetakan ``{% csrf_token %}`` didalam formulir untuk mengadakan perlindungan CSRF. ``CsrfViewMiddleware`` tetap dan diadakan secara awal.
pt_br: ``CsrfResponseMiddleware`` e ``CsrfMiddleware`` serão removidos. Use a tag de template ``{% csrf_token %}``dentro dos forms para habilitar a proteção CSRF. ``CsrfViewMiddleware`` permanece e é habilitada por padrão.

source: The old imports for CSRF functionality (``django.contrib.csrf.*``), which moved to core in 1.2, will be removed.
id: Impor lama untuk fungsi CSRF (``django.contrib.csrf.*``), yang dipindahkan ke inti di 1.2, akan dipindahkan.
pt_br: Os imports antigos da funcionalidade CSRF (``django.contrib.csrf.*``), que foi movido para o core em 1.2, será removido.

source: The ``django.contrib.gis.db.backend`` module will be removed in favor of the specific backends.
id: Modul ``django.contrib.gis.db.backend`` akan dipindahkan mendukung backend khusus.
pt_br: O módulo ``django.contrib.gis.db.backend`` será removido em favor dos backends específicos.

source: ``SMTPConnection`` will be removed in favor of a generic Email backend API.
id: ``SMTPConnection`` akan dipindahkan mendukung API backend Email umum.
pt_br: ``SMTPConnection`` será removido em favor de uma API de backend genérica.
