Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: The many to many SQL generation functions on the database backends will be removed.
id: Fungsi pembangkitan SQL banyak ke banyak pada backend basisdata akan dipindahkan.
pt_br: As funções de geração SQL many to many nos backends de banco de dados serão removidos.

source: The ability to use the ``DATABASE_*`` family of top-level settings to define database connections will be removed.
id: Kemampuan menggunakan keluarga ``DATABASE_*`` dari pengaturan tingkat-atas untuk menentukan hubungan basisdata akan dipindahkan.
pt_br: A habilidade de usar a família de settings top-level ``DATABASE_*`` para definir conexões de banco de dados será removida.

source: The ability to use shorthand notation to specify a database backend (i.e., ``sqlite3`` instead of ``django.db.backends.sqlite3``) will be removed.
id: Kemampuan menggunakan catatan stenografi untuk menentukan backend basisdata (yaitu, ``sqlite3`` daripada ``django.db.backends.sqlite3``) akan dipindahkan.
pt_br: A habilidade para usar notações curtas para especificar o backend do banco de dados (ex ``sqlite3`` ao invés de ``django.db.backends.sqlite3``) será removido.

source: The ``get_db_prep_save``, ``get_db_prep_value`` and ``get_db_prep_lookup`` methods will have to support multiple databases.
id: Cara ``get_db_prep_save``, ``get_db_prep_value`` dan ``get_db_prep_lookup`` akan mempunyai dukungan banyak basisdata.
pt_br: Os métodos ``get_db_prep_save``, ``get_db_prep_value`` e ``get_db_prep_lookup`` terão que suportar múltiplos bancos de dados.

source: The ``Message`` model (in ``django.contrib.auth``), its related manager in the ``User`` model (``user.message_set``), and the associated methods (``user.message_set.create()`` and ``user.get_and_delete_messages()``), will be removed. The :doc:`messages framework </ref/contrib/messages>` should be used instead. The related ``messages`` variable returned by the auth context processor will also be removed. Note that this means that the admin application will depend on the messages context processor.
id: Model ``Message`` (di ``django.contrib.auth``), pengelola terhubungnya di model ``User`` (``user.message_set``), dan cara-cara terkait (``user.message_set.create()`` dan ``user.get_and_delete_messages()``), akan dipindahkan. :doc:`messages framework </ref/contrib/messages>` harus digunakan sebagai gantinya. Variabel ``messages`` terhubung dikembalikan oleh pengolah konteks asli akan juga dipindahkan. Catat bahwa ini berarti bahwa aplikasi admin akan bergantung pada pengolah konteks pesan.
pt_br: O model ``Message`` (em ``django.contrib.auth``), o seu manager no model ``User`` (``user.message_set``), e os métodos associados (``user.message_set.create()`` e ``user.get_and_delete_messages()``), serão removidos. O framework :doc:`messages </ref/contrib/messages>` deve ser usado em seu lugar. A variável ``messages`` relacionada e retornada pelo processador de contexto de autenticação também será removida. Note que isso significa que a aplicação admin irá depender do processador de contexto de mensagens.

source: Authentication backends will need to support the ``obj`` parameter for permission checking. The ``supports_object_permissions`` attribute will no longer be checked and can be removed from custom backends.
id: Backend otentifikasi akan butuh mendukung parameter ``obj`` untuk pemeriksaan perizinan. Atribut ``supports_object_permissions`` akan tidak lagi dicentang dan dapat dipindahkan dari backend penyesuaian.
pt_br: Backends de autenticação terão que suportar o parâmetro ``obj`` para verificação de permissões. O atributo ``supports_object_permissions`` não irá mais ser checado e pode ser removido dos backends customizados.

source: Authentication backends will need to support the ``AnonymousUser`` class being passed to all methods dealing with permissions. The ``supports_anonymous_user`` variable will no longer be checked and can be removed from custom backends.
id: Backend otentifikasi akan butuh mendukung kelas ``AnonymousUser`` dilewatkan ke semua cara berurusan dengan perizinan. Variabel ``supports_anonymous_user`` tidak lagi dicentang dan dapat dipindahkan dari backend penyesuaian.
pt_br: Backends de autenticação terá que suportar a classe ``AnonymousUser`` sendo passada para todos os métodos que lidam com permissão. A variável ``supports_anonymous_user`` não irá mais ser checada e pode ser removida dos backends customizados.

source: The ability to specify a callable template loader rather than a ``Loader`` class will be removed, as will the ``load_template_source`` functions that are included with the built in template loaders for backwards compatibility.
id: Kemampuan menentukan pemuat cetakan callable daripada kelas ``Loader`` akan dipindahkan, seperti yang akan fungsi ``load_template_source`` yang disertakan dengan pemuat cetakan pasang tetap untuk kesesuaian kebelakang.
pt_br: A habilidade para especificar um template loader invocável ao invés de uma classe ``Loader`` irá ser removido, assim como as funções ``load_template_source`` que estão incluídas com os template loaders embutidos para compatibilidade com versões anteriores.

source: ``django.utils.translation.get_date_formats()`` and ``django.utils.translation.get_partial_date_formats()``. These functions will be removed; use the locale-aware ``django.utils.formats.get_format()`` to get the appropriate formats.
id: ``django.utils.translation.get_date_formats()`` dan ``django.utils.translation.get_partial_date_formats()``. Fungsi ini telah dipindahkan; gunakan locale-aware ``django.utils.formats.get_format()`` untuk mendapatkan bentuk yang sesuai.
pt_br: ``django.utils.translation.get_date_formats()`` e ``django.utils.translation.get_partial_date_formats()``. Essas funções serão removidas; use o locale-aware ``django.utils.formats.get_format()`` para obter os formatos apropriados.

source: In ``django.forms.fields``, the constants: ``DEFAULT_DATE_INPUT_FORMATS``, ``DEFAULT_TIME_INPUT_FORMATS`` and ``DEFAULT_DATETIME_INPUT_FORMATS`` will be removed. Use ``django.utils.formats.get_format()`` to get the appropriate formats.
id: Dalam ``django.forms.fields``, ketetapan: ``DEFAULT_DATE_INPUT_FORMATS``, ``DEFAULT_TIME_INPUT_FORMATS`` dan ``DEFAULT_DATETIME_INPUT_FORMATS`` akan dipindahkan. Gunakan ``django.utils.formats.get_format()`` untuk mendapatkan bentuk yang sesuai.
pt_br: Em ``django.forms.fields``, as contantes: ``DEFAULT_DATE_INPUT_FORMATS``, ``DEFAULT_TIME_INPUT_FORMATS`` e ``DEFAULT_DATETIME_INPUT_FORMATS`` serão removidas. Utilize ``django.utils.formats.get_format()`` para obter os formatos apropriados.

source: The ability to use a function-based test runner will be removed, along with the ``django.test.simple.run_tests()`` test runner.
id: Kemampuan menggunakan percobaan berbasis-fungsi akan dipindahkan, bersama dengan penjalan percobaan ``django.test.simple.run_tests()``.
pt_br: A habilidade de usar um executor de testes baseado em função será removido, assim como o executor de teste ``django.test.simple.run_tests()``.

source: The ``views.feed()`` view and ``feeds.Feed`` class in ``django.contrib.syndication`` will be removed. The class-based view ``views.Feed`` should be used instead.
id: Tampilan ``views.feed()`` dan kelas ``feeds.Feed`` di ``django.contrib.syndication`` akan dipindahkan. Tampilan berbasis-kelas ``views.Feed`` harus digunakan sebagai gantinya.
pt_br: A view ``views.feed()`` e a classe ``feeds.Feed`` em ``django.contrib.syndication``serão removidos. A view baseada em classe ``views.Feed`` deve ser usada em seu lugar.

source: ``django.core.context_processors.auth``. This release will remove the old method in favor of the new method in ``django.contrib.auth.context_processors.auth``.
id: ``django.core.context_processors.auth``. Terbitan ini akan memindahkan cara lama dalam mendukung cara baru di ``django.contrib.auth.context_processors.auth``.
pt_br: ``django.core.context_processors.auth``. Essa release irá remover o método antigo em favor do novo método em ``django.contrib.auth.context_processors.auth``.

source: The ``postgresql`` database backend will be removed, use the ``postgresql_psycopg2`` backend instead.
id: Backend basisdata ``postgresql`` akan dipindahkan, gunakan backend ``postgresql_psycopg2`` sebagai gantinya.
pt_br: O backend do banco de dados ``postgresql`` será removido, utilize o backend ``postgresql_psycopg2`` em seu lugar.

source: The ``no`` language code will be removed and has been replaced by the ``nb`` language code.
id: kode bahasa ``no`` akan dipindahkan dan telah diganti oleh kode bahasa ``nb``.
pt_br: A linguagem de código ``no`` será removida e foi trocada pela linguagem de código ``nb``.

source: Authentication backends will need to define the boolean attribute ``supports_inactive_user`` until version 1.5 when it will be assumed that all backends will handle inactive users.
id: Backend otentifikasi akan butuh menentukan atrobut boolean ``supports_inactive_user`` sampai versi 1.5 ketika dia akan dianggap bahwa semua backend akan menangani pengguna tidak aktif.
pt_br: Backends de autenticação terão que definir o atributo booleano ``supports_inactive_user`` até a versão 1.5 onde se assumirá que todos os backends irão tratar usuários inativos.

source: ``django.db.models.fields.XMLField`` will be removed. This was deprecated as part of the 1.3 release. An accelerated deprecation schedule has been used because the field hasn't performed any role beyond that of a simple ``TextField`` since the removal of ``oldforms``. All uses of ``XMLField`` can be replaced with ``TextField``.
id: ``django.db.models.fields.XMLField`` akan dipindahkan. Ini telah diusangkan sebagai bagian dari terbitan 1.3. Jadwal pengusangan dipercepat telah digunakan karena bidang belum melakukan aturan apapun lebih dari itu dari ``TextField`` sederhana sejak perpindahan dari ``oldforms``. Semua penggunaan dari ``XMLField`` dapat diganti dengan ``TextField``.
pt_br: ``django.db.models.fields.XMLField`` será removido. Isso foi depreciado como parte da release 1.3. Um cronograma acelerado de depreciação foi usado porque o campo não preenche nenhum outro propósito além de um simples ``TextField`` desde a remoção de ``oldforms``. Todos os usos de ``XMLField`` podem ser substituídos com ``TextField``.

source: The undocumented ``mixin`` parameter to the ``open()`` method of ``django.core.files.storage.Storage`` (and subclasses) will be removed.
id: Parameter ``mixin`` tidak terdokumentasi pada cara ``open()`` dari ``django.core.files.storage.Storage`` (dan subkelas) akan dipindahkan.
pt_br: O parâmetro não documentado ``mixin`` para o método ``open()`` de ``django.core.files.storage.Storage`` (e subclasses) serão removidas.

source: See the :ref:`Django 1.1 release notes<deprecated-features-1.1>` for more details on these changes.
id: Lihat :ref:`Catatan terbitan Django 1.1 <deprecated-features-1.1>` untuk rincian lebih pada perubahan ini.
pt_br: Veja as :ref:`notas da release do Django 1.1<deprecated-features-1.1>` para mais detalhes sobre essas mudanças.

source: ``AdminSite.root()``. This method of hooking up the admin URLs will be removed in favor of including ``admin.site.urls``.
id: ``AdminSite.root()``. Cara ini dari mengaitkan URL admin akan dipindahkan mendukung termasuk ``admin.site.urls``.
pt_br: ``AdminSite.root()``. Esse método de ligação de URLs admin será removido em favor da inclusão de ``admin.site.urls``.

source: Authentication backends need to define the boolean attributes ``supports_object_permissions`` and ``supports_anonymous_user`` until version 1.4, at which point it will be assumed that all backends will support these options.
id: Backend otentifikasi butuh menentukan atribut boolean ``supports_object_permissions`` dan ``supports_anonymous_user`` sampai versi 1.4, dimana menunjuk itu akan dianggap bahwa semua backend akan mendukung pilihan ini.
pt_br: Backends de autenticação precisam definir os atributos booleanos ``supports_object_permissions`` e ``supports_anonymous_user`` até a versão 1.4, na qual será assumido que todos os backends suportam essas opções.

source: The Django source code repository
id: Gudang sumber kode Django
pt_br: O repositório de código-fonte do Django

source: When deploying a Django application into a real production environment, you will almost always want to use `an official packaged release of Django`_.
id: Ketika menyebarkan apliaksi Django kedalam lingkungan produksi sebenarnya, anda akan hampir selalu ingin menggunakan `an official packaged release of Django`_.
pt_br: Quando estiver fazendo deploy de uma aplicação Django em um ambiente de produção real, você quase sempre vai querer usar `uma release do Django oficial`_.

source: However, if you'd like to try out in-development code from an upcoming release or contribute to the development of Django, you'll need to obtain a clone of Django's source code repository.
id: Bagaimanapun, jika anda suka mencoba kode dalam-pengembangan dari terbitan akan datang atau menyumbang ke pengembangan Django, anda akan butuh mendapatkan salinan dari gudang kode sumber Django.
pt_br: Entretanto, se você quiser tentar o código em desenvolvimento de uma próxima release ou contribuir para o desenvolvimento do Django, você terá que obter um clone do repositório de código-fonte do Django.

source: This document covers the way the code repository is laid out and how to work with and find things in it.
id: Dokumen ini mencangkup cara gudang kode ditata dan bagaimana bekerja dengan dan menemukan hal-hal di dalamnya.
pt_br: Este documento cobre a maneira como o repositório de código é estruturado e como trabalhar e encontrar coisas dentro dele.

source: High-level overview
id: Ikhtisar tingkat-tinggi
pt_br: Visão de alto nível

source: The Django source code repository uses `Git`_ to track changes to the code over time, so you'll need a copy of the Git client (a program called ``git``) on your computer, and you'll want to familiarize yourself with the basics of how Git works.
id: Gudang kode sumber Django menggunakan `Git_` untuk melacak perubahan pada kode setiap waktu, jadi anda akan butuh salinan dari Git client (sebuah program dipanggil ``git``) di komputer anda, dan anda akan ingin mengakrabkan diri anda dengan dasar-dasar dari bagaimana Git bekerja.
pt_br: O repositório de código-fonte do Django usa `Git`_ para rastrear mudanças no código durante o tempo, então você vai precisar de uma cópia do client do Git (um programa chamado ``git``) no seu computador, e você quer familiarizar-se com o básico de como o Git trabalha.

source: Git's website offers downloads for various operating systems. The site also contains vast amounts of `documentation`_.
id: Jaringan situs Git menawarkan unduhan untuk beragam sistem operasi. Situs juga mengandung jumlah besar `documentation`_.
pt_br: O website do Git oferece download para vários sistemas operacionais. O site ainda contém vastas quantias de `documentation`_.

source: The Django Git repository is located online at `github.com/django/django <https://github.com/django/django>`_. It contains the full source code for all Django releases, which you can browse online.
id: Gudang Git Django bertempat daring di `github.com/django/django <https://github.com/django/django>`_. Itu mengandung kode sumber penuh untuk semua terbitan Django, dimana anda dapat melihat-lihat secara daring.
pt_br: O repositório do Django no GIt é localizado online em `github.com/django/django <https://github.com/django/django>`_. Ele contém todo o código-fonte para todas as releases do Django, que você pode navegar online.

source: The Git repository includes several `branches`_:
id: Gudang Git menyertakan beberapa `branches`_:
pt_br: O repositório Git inclui várias `branches`_:

source: ``master`` contains the main in-development code which will become the next packaged release of Django. This is where most development activity is focused.
id: ``master`` mengandung kode dalam-pengembangan utama yang akan menjadi terbitan paket selanjutnya dari Django. Ini dimana kebanyakan kegiatan pengembangan terfokus.
pt_br: ``master`` contém o principal código em desenvolvimento e que se tornará a próxima versão de release do Django. Esse é o lugar onde a maior parte do atividade de desenvolvimento é realizada.

source: ``stable/A.B.x`` are the branches where release preparation work happens. They are also used for bugfix and security releases which occur as necessary after the initial release of a feature version.
id: ``stable/A.B.x`` adalah cabang-cabang dimana persiapan terbitan kerja terjadi. Mereka juga digunakan untuk perbaikan kesalahan dan terbitan keamanan yang muncul seperlunya setlah terbitan awal dari versi fitur.
pt_br: ``stable/A.B.x`` são branches onde o trabalho de preparação de release acontece. Elas também são usadas para correção de bugs e releases de segurança que ocorrem a depender da necessidade depois que a versão final.

source: ``soc20XX/<project>`` branches were used by students who worked on Django during the 2009 and 2010 Google Summer of Code programs.
id: Cabang ``soc20XX/<project>`` telah digunakan oleh pelajar yang bekerja di Django selama 2009 dan 2010 program Google Summer of Code.
pt_br: As branches ``soc20XX/<project>`` são usadas por estudantes que trabalham no Django durante os programas Google Summer of Code de 2009 e 2010.

source: ``attic/<project>`` branches were used to develop major or experimental new features without affecting the rest of Django's code.
id: Cabang ``attic/<project>`` telah digunakan untuk mengembangkan fitur baru utama atau percobaan tanpa mempengaruhi sisa kode Django.
pt_br: As branches ``attic/<project>`` são usadas para desenvolver funcionalidades maiores ou experimentais sem afetar o restando do código Django.

source: The Git repository also contains `tags`_. These are the exact revisions from which packaged Django releases were produced, since version 1.0.
id: Gudang GIT juga mengandung `tags`_. Ini adalah perbaikan benar dari paket terbitan Django yang telah diproduksi, sejak versi 1.0.
pt_br: O repositório Git que contém as `tags`_. Essas são as revisões exatas das quais as releases do Django foram produzidas, desde a versão 1.0.

source: The source code for the `Djangoproject.com <https://www.djangoproject.com/>`_ website can be found at `github.com/django/djangoproject.com <https://github.com/django/djangoproject.com>`_.
id: Kode sumber untuk situs jaringan `Djangoproject.com <https://www.djangoproject.com/>`_ dapat ditemukan pada `github.com/django/djangoproject.com <https://github.com/django/djangoproject.com>`_.
pt_br: O código-fonte para o website `Djangoproject.com <https://www.djangoproject.com/>`_ pode ser encontrado em `github.com/django/djangoproject.com <https://github.com/django/djangoproject.com>`_.

source: The master branch
id: Cabang master
pt_br: A branch master

source: If you'd like to try out the in-development code for the next release of Django, or if you'd like to contribute to Django by fixing bugs or developing new features, you'll want to get the code from the master branch.
id: Jika anda suka mencoba kode dalam pengembangan untuk terbitan selanjutnya dari Django, atau jika anda suka menyumbang pada Django dengan memperbaiki kesalahan atau mengembangkan fitur baru, anda akan ingin mendapatkan kode dari cabang master.
pt_br: Se você gostaria de testar o código em desenvolvimento da próxima versão do Django, ou se você gostaria de contribuir para o Django corrigindo bugs ou desenvolvendo novas funcionalidades, você vai querer pegar o código da master branch.

source: Note that this will get *all* of Django: in addition to the top-level ``django`` module containing Python code, you'll also get a copy of Django's documentation, test suite, packaging scripts and other miscellaneous bits. Django's code will be present in your clone as a directory named ``django``.
id: Catat bahwa ini akan mengambil *semua* dari Django: sebagai tambahan paad tingkat-tinggi modul ``django`` mengandung kode Python, anda akan juga mendapatkan salinan dokumentasi Django, deretan percobaan, tulisan pemaketan dan bit bermacam-macam lainnya. Kode Django akan hadir di kloning anda sebagai pelipat dinamai ``django``.
pt_br: Note que isso irá pegar tudo do Django: além do módulo ``django`` contendo código Python, você irá também pegar uma cópia da documentação do Django, suíte de testes, scripts e outras coisas gerais. O código Django irá ser apresentado em seu clone como um diretório chamado ``django``.

source: To try out the in-development code with your own applications, simply place the directory containing your clone on your Python import path. Then ``import`` statements which look for Django will find the ``django`` module within your clone.
id: Untuk mencoba kode dalam pengembangan dengan aplikasi anda sendiri, cukup tempatkan pelipat mengandung kloningan anda pada jalur impor Python anda . lalu pernyataan ``import`` yang mencari Django akan menemukan modul ``django`` dalam kloningan anda.
pt_br: Para testar o código de desenvolvimento com suas próprias aplicações, simplesmente coloque o diretório contendo o seu clone no seu Python import path. Então os comandos ``import`` que procuram pelo Django irão encontrar o módulo ``django`` dentro do seu clone.

source: If you're going to be working on Django's code (say, to fix a bug or develop a new feature), you can probably stop reading here and move over to :doc:`the documentation for contributing to Django </internals/contributing/index>`, which covers things like the preferred coding style and how to generate and submit a patch.
id: Jika anda akan bekerja pada kode Django (katakan, memperbaiki kesalahan atau mengembangkan fitur baru), anda dapat mungkin berhenti membaca disini dan pindah ke :doc:`the documentation for contributing to Django </internals/contributing/index>`, yang melingkupi hal-hal seeprti gaya pengkodean yang dipilih dan bagaimana membangkitkan dan mengajukan sebuah tambalan.
pt_br: Se você estará trabalhando no código do Django (por exemplo, para corrigir bugs ou desenvolver uma nova funcionalidade), você pode provavelmente para de ler aqui e ir para :doc:`a documentação para contribuições no Django </internals/contributing/index>`, que cobre coisas como o estilo preferido de código e como gerar e submeter um patch.

source: Other branches
id: Cabang lainnya
pt_br: Outras branches

source: Django uses branches to prepare for releases of Django.
id: Django menggunakan carang untuk mempersiapkan terbitan Django.
pt_br: O Django utiliza branches para preparar as releases do Django.

source: In the past when Django was hosted on Subversion, branches were also used for feature development. Now Django is hosted on Git and feature development is done on contributor's forks, but the Subversion feature branches remain in Git for historical reference.
id: Di masa lampau Django disimpan di Subversion, cabang-cabang juga digunakan untuk pengembangan akan datang. Sekarang Django disimpan di Git dan pengembangan fitur selesai pada persimpangan penyumbang, tetapi cabang fitur Subversion di Git untuk riwayat acuan.
pt_br: No passado quando o Django era hospedado no Subversion, branches também eram usadas para o desenvolvimento de funcionalidades. Agora o Django é hospedado no Git e o desenvolvimento de novas funcionalidades é realizado em forks de voluntários, mas as branches de funcionalidade do Subversion continuam no GIt para referência histórica.

source: Stable branches
id: Cabang stabil
pt_br: Branches estáveis
