Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: In the case of small changes, such as typos in the documentation or small bugs that will only take a few minutes to fix, you don't need to jump through the hoops of claiming tickets. Just submit your patch and be done with it.
id: Di kasus perubahan kecil, seperti salah ketik di dokumentasi atau kesalahan kecil yang hanya akan memakan beberapa menit untuk memperbaikinya, anda tidak perlu lompat melalui lingkaran dari pengakuan tiket. Cukup ajukan tambalan dan dilakukan dengan hal itu.
pt_br: No caso de pequenas mudanças, como correções de ortografia na documentação ou pequenos bugs que levarão apenas alguns minutos para corrigir, você não precisa passar por todas as etapas do processo de reinvindicação de tickets. Apenas envie o seu patch e termine logo com isso.

source: Of course, it is *always* acceptable, regardless whether someone has claimed it or not, to submit patches to a ticket if you happen to have a patch ready.
id: Tentu saja, itu *selalu* diterima, tanpa memperhatikan apakah seseorang telah mengakuinya atau tidak, untuk mengajukan tambalan ke tiket jika anda terjadi mempunyai tambalan siap.
pt_br: Claro, é *sempre* permitido, independentemente de quem fez a reinvindicação do ticket ou não, enviar patches para um ticket se você já tem um pronto.

source: Patch style
id: Gaya tambalan
pt_br: Estilo de um patch

source: Make sure that any contribution you do fulfills at least the following requirements:
id: Pastikan bahwa tiap sumbangan anda lakukan memenuhi setidaknya persyaratan berikut:
pt_br: Certifique-se de que qualquer contribuição que você fizer preencha pelo menos os requisitos abaixo:

source: The code required to fix a problem or add a feature is an essential part of a patch, but it is not the only part. A good patch should also include a :doc:`regression test <unit-tests>` to validate the behavior that has been fixed and to prevent the problem from arising again. Also, if some tickets are relevant to the code that you've written, mention the ticket numbers in some comments in the test so that one can easily trace back the relevant discussions after your patch gets committed, and the tickets get closed.
id: Kode wajib untuk memperbaiki sebuah masalah atau menambah sebuah fitur adalah bagian terpenting dari sebuah tambalan, tetapi itu bukan satu-satunya bagian. Tambalan bagus harus juga menyertakan :doc:`regression test <unit-tests>` untuk memeriksa keabiasaan yang telah diperbaiki dan mencegah masalah dari muncul kembali. Juga, jika beberapa tiket terkait ke kode anda telah tulis, sebutkan angka tiket di beberapa komentar di percobaan sehingga satu dapat dengan mudah dilacak obrolan terkait setelah tambalan anda mendapatkan perbaikan, dan tiket ditutup.
pt_br: O código necessário para corrigir um problema ou adicionar uma funcionalidade é uma parte essencial de um patch, mas ele não é a única. Um bom patch também deve incluir um :doc:`teste de regressão <unit-tests>` para validar o comportamento que foi corrigido e para prevenir o problema de aparecer novamente. Além disso, se alguns tickets são relevantes para o código que você escreveu, mencione os números desses tickets em algum comentário do teste de modo que alguém possa facilmente encontrar as discussões relevantes depois do seu patch ser commitado, e o ticket for fechado.

source: If the code associated with a patch adds a new feature, or modifies behavior of an existing feature, the patch should also contain documentation.
id: Jika kode terhubung dengan tambalan menambahkan fitur baru, atau merubah kebiasaan dari fitur yang ada, tambalan harus juga mengandung dokumentasi.
pt_br: Se o código associado com o patch adiciona uma nova funcionalidade, ou modifica o comportamento de uma funcionalidade existente, o patch também deve conter documentação.

source: When you think your work is ready to be reviewed, send :doc:`a GitHub pull request <working-with-git>`. Please review the patch yourself using our :ref:`patch review checklist <patch-review-checklist>` first.
id: Ketika anda berpikir pekerjaan anda siap ditinjau, kirim :doc:`a GitHub pull request <working-with-git>`. Harap tinjau tambalan sendiri menggunakan :ref:`patch review checklist <patch-review-checklist>` terlebih dahulu.
pt_br: Quando você achar que o seu trabalho está pronto para ser revisado, envie :doc:`um pull request pelo GitHub <working-with-git>`. Por favor revise o ptch você mesmo usando nossa :ref:`checklist de revisão de patchs<patch-review-checklist>` primeiro.

source: If you can't send a pull request for some reason, you can also use patches in Trac. When using this style, follow these guidelines.
id: Jika anda tidak dapat pull request untuk beberapa alasan, anda dapat juga menggunakan tambalan-tambalan di Trac. Ketika menggunakan gaya ini, ikuti panduan berikut.
pt_br: Se você não pode enviar um pull request por alguma razão, você também pode usar patches dentro do Trac. Quando usar esse estilo, siga as orientações a seguir:

source: Submit patches in the format returned by the ``git diff`` command.
id: Ajukan tambalan-tambalan dalam bentuk dikembalikan oleh perintah ``git diff``.
pt_br: Envie os patches dentro do formato retornado por um comando ``git diff``.

source: Attach patches to a ticket in the `ticket tracker`_, using the "attach file" button. Please *don't* put the patch in the ticket description or comment unless it's a single line patch.
id: Lampirkan tambalan ke sebuah tiket dalam `ticket tracker`_, menggunakan tombol "attach file". Tolong *jangan* taruh tambalan dalam gambaran tiket atau komentar meskipun dia hanya sebuah tambalan baris tunggal.
pt_br: keAnexe os patches a um ticket dentro do `ticket tracker`_, usando o botão "attach file". Por favor *não* coloque o patch na descrição do ticket ou dentro de um comentário a não ser que seja um patch de uma linha.

source: Name the patch file with a ``.diff`` extension; this will let the ticket tracker apply correct syntax highlighting, which is quite helpful.
id: Nama berkas tambalan dengan perpanjangan ``.diff``; ini akan membuat pelacak tiket memberlakukan penyorotan sintaksis benar, yang tentunya sangat membantu.
pt_br: Nomeie o arquivo de patch com a extensão ``.diff``; isso permitirá que o rastreador de tickets aplique o estilo de formatação de sintaxe correto, o que ajuda muito.

source: Regardless of the way you submit your work, follow these steps.
id: Tanpa memperhatikan cara anda mengajukan pekerjaan anda, ikuti langkah-langkah ini.
pt_br: Independentemente da maneira pela qual você irá enviar o seu trabalho, siga os passos a seguir:

source: Make sure your code fulfills the requirements in our :ref:`patch review checklist <patch-review-checklist>`.
id: Pastikan anda memenuhi persyaratan di :ref:`daftar centang pratinjau tambalan <patch-review-checklist>` kami.
pt_br: Certifique-se de que o seu código preenche todos os requisitos em nosso :ref:`checklist de revisão de patchs <patch-review-checklist>`.

source: Check the "Has patch" box on the ticket and make sure the "Needs documentation", "Needs tests", and "Patch needs improvement" boxes aren't checked. This makes the ticket appear in the "Patches needing review" queue on the `Development dashboard`_.
id: Centang kotak "Has patch" pada tiket dan pastikan kotak-kotak "Butuh dokumentasi", "Butuh percobaan", and "Tambalan butuh perbaikan" tidak dicentang. Ini membuat tiket muncul di antrian "Tambahan butuh ditinjau" pada `Development dashboard`_.
pt_br: Marque a caixa "Has patch" no ticket e certifique-se de que as caixas "Needs documentation", "Needs tests", and "Patch needs improvement" não estão marcadas. Isso fará com que o ticket seja exibido na pilha "Patches needing review" na `Development dashboard`_.

source: Non-trivial patches
id: Tambalan bukan sepele
pt_br: Patches não triviais

source: A "non-trivial" patch is one that is more than a simple bug fix. It's a patch that introduces Django functionality and makes some sort of design decision.
id: Tambalan "bukan-sepele" adalah satu yang lebih dari sebuah perbaikan kesalahan sederhana. Itu adalah sebuah tambalan yang memperkenalkan fungsi Django dan membuat beberapa urutan keputusan rancangan.
pt_br: Patch "não trivial" é um patch maior que uma simples correção de um bug. É um patch que introduz funcionalidades ao Django e faz algum tipo de decisão de projeto.

source: If you provide a non-trivial patch, include evidence that alternatives have been discussed on |django-developers|.
id: Jika anda menyediakan tambalan bukan-sepele, sertakan saksi yang jalan lain telah diobrolkan di |django-developers|.
pt_br: Se você estiver enviando um patch não trivial, inclua evidências de que alternativas foram discutidas na lista |django-developers|.

source: If you're not sure whether your patch should be considered non-trivial, just ask.
id: Jika anda tidak yakin apakah tambalan anda harus dipertimbangkan bukan-sepele, tanya saja.
pt_br: Se você não tem certeza se o seu patch deveria ou não ser considerado como não trivial, pergunte.

source: Deprecating a feature
id: Mengusangkan fitur
pt_br: Depreciando uma funcionalidade

source: There are a couple reasons that code in Django might be deprecated:
id: Terdapat beberapa alasan bahwa kode di Django mungkin diusangkan:
pt_br: Existem algumas razões para que um código no Django posso estar depreciado:

source: If a feature has been improved or modified in a backwards-incompatible way, the old feature or behavior will be deprecated.
id: Jika sebuah fitur telah ditingkatkan atau dirubah di cara ketidaksesuaian-kebelakang, fitur atau kebiasaan lama akan diusangkan.
pt_br: Se a funcionalidade foi melhorada ou modificada de modo a não ser mais compatível com versões anteriores, a antiga funcionalidade ou comportamento pode ser depreciada.

source: Sometimes Django will include a backport of a Python library that's not included in a version of Python that Django currently supports. When Django no longer needs to support the older version of Python that doesn't include the library, the library will be deprecated in Django.
id: Terkadang Django akan menyertakan backport dari pustaka Python yang tidak disertakan dalam versi dari Python yang Django saat ini dukung. Ketika Django tidak lagi butuh mendukung versi lama dari Python yang tidak menyertakan pustaka, pustakan akan diusangkan di Django.
pt_br: Algumas vezes o Django inclui um backport de uma biblioteca Python que não está incluída na versão do Python suportada atualmente pelo Django. Quando o Django não precisa mais dar suporte a versão antiga do Python que não fornece a biblioteca, essa biblioteca será depreciada no Django.

source: As the :ref:`deprecation policy<internal-release-deprecation-policy>` describes, the first release of Django that deprecates a feature (``A.B``) should raise a ``RemovedInDjangoXXWarning`` (where XX is the Django version where the feature will be removed) when the deprecated feature is invoked. Assuming we have good test coverage, these warnings are converted to errors when :ref:`running the test suite <running-unit-tests>` with warnings enabled: ``python -Wall runtests.py``. Thus, when adding a ``RemovedInDjangoXXWarning`` you need to eliminate or silence any warnings generated when running the tests.
id: Seperti :ref:`deprecation policy<internal-release-deprecation-policy>` gambarkan, terbitan pertama dari Django yang mengusangkan sebuah fitur (``A.B``) harus memunculkan ``RemovedInDjangoXXWarning`` (dimana XX adalah versi Django dimana fitur akan dipindahkan ketika fitur diusangkan dipanggil. Menganggp kami mempunyai cakupan percobaan baik, peringatan ini dirubah ke kesalahan ketika :ref:`running the test suite <running-unit-tests>` dengan peringatan diadakan: ``python -Wall runtests.py``. Dengan demikian, ketika menambahkan ``RemovedInDjangoXXWarning`` anda butuh mengurangi atau mensenyapkan tiap peringatan yang dibangkitkan ketika menjalankan percobaan.
pt_br: Como a :ref:`política de depreciação<internal-release-deprecation-policy>` descreve, a primeira release do Django que deprecia a funcionalidade ("A.B") deve gerar um warning ``RemovedInDjangoXXWarning`` (onde XX é a versão do Django em que a funcionalidade será removida) quando a funcionalidade depreciada é invocada. Assumindo que nós temos uma boa cobertura de código, esses warnings são convertidos para erros quando :ref:`executamos a suíte de testes <running-unit-tests>` com warnings ativados: ``python -Wall runtests.py``.

source: The first step is to remove any use of the deprecated behavior by Django itself. Next you can silence warnings in tests that actually test the deprecated behavior by using the ``ignore_warnings`` decorator, either at the test or class level:
id: Langkah pertama adalah memindahkan tiap penggunaan dari kebiasaan diusangkan oleh Django itu sendiri. Selanjutnya anda dapat peringatan senyap di percobaan yang sebenarnya mencoba kebiasaan diusangkan dengan menggunakan penghias ``ignore_warnings``, antara pada tingkatan percobaan atau kelas:
pt_br: O primeiro passo é remover qualquer uso do comportamento depreciado no próprio Django. Depois você pode silenciar os warnings nos testes que testam o comportamento depreciado usando o decorator ``ignore_warnings``, na classe ou diretamente nos testes:

source: In a particular test::
id: Di percobaan khusus::
pt_br: Em um teste em particular::

source: For an entire test case::
id: Untuk kasus percobaan keseluruhan:
pt_br: Para um caso de teste inteiro::

source: You can also add a test for the deprecation warning. You'll have to disable the "warning as error" behavior in your test by doing::
id: Anda dapat juga menambahkan sebuah percobaan untuk peringatan pengusangan. Anda harus meniadakan kebiasaan "peringatan sebagai kesalahan" di percobaan anda dengan melakukan::
pt_br: Você também pode adicionar um teste para o warning de depreciação, Você terá que desabilitar o comportamento de tratar "warning como erro" nos seus testes fazendo o seguinte::

source: Finally, there are a couple of updates to Django's documentation to make:
id: Akhirnya, ada sepasang pembaharuan ke dokumentasi Django untuk dibuat:
pt_br: Finalmente, existem algumas atualizações na documentação do Django para fazer:

source: If the existing feature is documented, mark it deprecated in documentation using the ``.. deprecated:: A.B`` annotation. Include a short description and a note about the upgrade path if applicable.
id: Jika fitur yang ada didokumentasikan, tandai dia diusangkan di dokumentasi menggunakan keterangan ``.. deprecated:: A.B``. Termasuk gambaran pendek dan catatan tentang jalur peningkatan jika berlaku.
pt_br: Se a funcionalidade existente está documentada, marque ela como depreciada na documentação usando a anotação ``.. deprecated:: A.B``. Inclua uma curta descrição e uma nota sobre o caminho para atualizar se possível.

source: Add a description of the deprecated behavior, and the upgrade path if applicable, to the current release notes (``docs/releases/A.B.txt``) under the "Features deprecated in A.B" heading.
id: Tambah gambaran dari kebiasaan pengusangan, dan tingkatkan jalur jika dapat diterapkan, pada catatan terbitaan saat ini (``docs/releases/A.B.txt``) dibawah kepala "Fitur-fitur diusangkan dalam A.B".
pt_br: Adicione uma descrição de comportamento depreciado, e o caminho de atualização se possível, para as notas da release atual (``docs/releases/A.B.txt``) abaixo do header "Features deprecated in A.B".

source: Add an entry in the deprecation timeline (``docs/internals/deprecation.txt``) under the appropriate version describing what code will be removed.
id: Tambah sebuah masukan dalam linimasa pengusangan (``docs/internals/deprecation.txt``) dibawah versi yang sesuai menggambarkan kode apa akan dipindahkan.
pt_br: Adicione uma nova entrada na linha do tempo de depreciação (``docs/internals/deprecation.txt``) abaixo da versão apropriada descrevendo qual código será removido.

source: Once you have completed these steps, you are finished with the deprecation. In each :term:`feature release`, all ``RemovedInDjangoXXWarning``\s matching the new version are removed.
id: Sekali anda telah melengkapi langkah ini, anda selesai dengan pengusangan. Di setiap :term:`feature release`, semua ``RemovedInDjangoXXWarning`` yang cocok versi baru dipindahkan.
pt_br: Uma vez que você tenha completado esses passos, você já concluiu com a depreciação. Em cada :term:`feature release`, todos os ``RemovedInDjangoXXWarning`` que coincidam com a nova versão são removidos.

source: For information on JavaScript patches, see the :ref:`javascript-patches` documentation.
id: Untuk informasi pada tambalan JavaScript, lihat dokumentasi :ref:`javascript-patches`.
pt_br: para informação sobre patches em JavaScript, veja a documentação :ref:`javascript-patches` .

source: Patch review checklist
id: Daftar centang pratinjau tambalan
pt_br: Checklist de Revisão de Patches

source: Use this checklist to review a pull request. If you are reviewing a pull request that is not your own and it passes all the criteria below, please set the "Triage Stage" on the corresponding Trac ticket to "Ready for checkin". If you've left comments for improvement on the pull request, please tick the appropriate flags on the Trac ticket based on the results of your review: "Patch needs improvement", "Needs documentation", and/or "Needs tests". As time and interest permits, core developers do final reviews of "Ready for checkin" tickets and will either commit the patch or bump it back to "Accepted" if further works need to be done. If you're looking to become a core developer, doing thorough reviews of patches is a great way to earn trust.
id: Gunakan daftar centang ini untuk meninjau sebuah pull request. Jika anda sedang meninjau sebuah pull request yang bukan milik anda dan itu lolos semua kriteria dibawah, harap setel "Triage Stage" pada tiket Trac sesuai pada "Siap untuk diperiksa". Jika anda telah meninggalkan komentar untuk perbaikan pada pull request, silahkan tandai bendera sesuai pada Trac berbasis tiket pada hasil dari tinjauan anda: "Tambalan butuh perbaikan", "Butuh dokumentasi", and/or "Butuh percobaan". Sebagai perizinan waktu dan minat, pengembang inti melakukan tinjauan akhir dari tiket "Siap untuk diperiksa" dan akan antara memperbaiki tambalan atau membenturkannya kembali ke "Diterima" jika pekerjaan lanjutan butuh diselesaikan. Jika anda sedang mencari untuk menjadi pengembang inti, melakukan tinjauan seksama dari tambalan adalah jalan hebat untuk mendapatkan kepercayaan.
pt_br: Utilize esta checklist para revisar um pull request. Se você está revisando um pull request que não é seu e ele passar em todos os critérios abaixo, por favor altere o estágio de triagem do ticket no Trac correspondente para "Ready for Checkin". Se você deixou comentários no ticket para melhorias no pull request, por favor marque a flag apropriada no Trac baseado nos resultados da sua revisão: "Patch needs improvement", "Needs documentation", and/or "Needs tests". Se o tempo e interesse permitir, desenvolvedores do projeto fazem uma revisão final dos tickets marcados como "Ready for checkin" e ou realização o commit do patch ou movê-lo de volta para "Accepted" se mais trabalho tiver que ser feito. Se você está querendo se tornar um core developer, fazer revisões dos patches é uma grande maneira de ganhar confiança.

source: Looking for a patch to review? Check out the "Patches needing review" section of the `Django Development Dashboard <https://dashboard.djangoproject.com/>`_. Looking to get your patch reviewed? Ensure the Trac flags on the ticket are set so that the ticket appears in that queue.
id: Mencari tambalan untuk ditinjau? Periksa bagian "Patches needing review" dari `Django Development Dashboard <https://dashboard.djangoproject.com/>`_. Mencari untuk mendapatkan tambalan anda ditinjau? Pastikan bendera Trac pada tiket disetel sehingga tiket muncul di antrian itu.
pt_br: Procurando um patch para revisar? Veja a seção "Patches needing review" do `Django Development Dashboard <https://dashboard.djangoproject.com/>`_. Querendo que o patch que você desenvolveu seja revisado? Certifique-se de que as flags do ticket no Trac foram setadas corretamente de modo que ele apareça nessa fila.

source: Does the documentation build without any errors (``make html``, or ``make.bat html`` on Windows, from the ``docs`` directory)?
id: Apakah dokumentasi dibangun tanpa kesalahan apapun (``make html``, atau ``make.bat html`` pada Windows, dari direktori ``docs``)?
pt_br: A documentação é gerada sem erros (``make html``, ou ``make.bat html`` no Windows, do diretório ``docs``)?

source: Does the documentation follow the writing style guidelines in :doc:`/internals/contributing/writing-documentation`?
id: Apakah dokumentasi mengikuti panduan gaya penulisan dalam :doc:`/internals/contributing/writing-documentation`?
pt_br: A documentação segue as regras de estilo e escrita em :doc:`/internals/contributing/writing-documentation`?

source: Are there any :ref:`spelling errors <documentation-spelling-check>`?
id: Apakah ada :ref:`kesalahan pengejaan <documentation-spelling-check>`?
pt_br: Existem quaisquer :ref:`erros de ortografia <documentation-spelling-check>`?

source: Bugs
id: Kesalahan

source: Is there a proper regression test (the test should fail before the fix is applied)?
id: Apakah ada percobaan pemulihan yang sesuai (percobaan harus gagal sebelum perbaikan diberlakukan)?
pt_br: Existe um teste de regressão apropriado (o teste deve falhar antes da correção ser aplicada)?

source: New Features
id: Fitur Baru
pt_br: Novas funcionalidades

source: Are there tests to "exercise" all of the new code?
id: Apakah ada percobaan untuk "latihan" semua kode baru?
pt_br: Existem testes para "exercitar" todo o código recém-criado?

source: Is there a release note in ``docs/releases/A.B.txt``?
id: Apakah ada sebuah catatan terbitan di ``docs/releases/A.B.txt``?
pt_br: Existe uma nota de release em ``docs/releases/A.B.txt``?

source: Is there documentation for the feature and is it :ref:`annotated appropriately <documenting-new-features>` with ``.. versionadded:: A.B`` or ``.. versionchanged:: A.B``?
id: Apakah ada dokumentasi untuk fitur dan apakah dia :ref:`dijelaskan dengan tepat <documenting-new-features>` dengan ``.. versionadded:: A.B`` atau ``.. versionchanged:: A.B``?
pt_br: Existe documentação para a funcionalidade e ela está :ref:`anotada de modo apropriado <documenting-new-features>` com ``.. versionadded:: A.B`` ou ``.. versionchanged:: A.B``?

source: See the :ref:`deprecating-a-feature` guide.
id: Lihat panduan :ref:`deprecating-a-feature`.
pt_br: Veja o guia :ref:`depreciando uma funcionalidade`.

source: All code changes
id: Semua kode perubahan
pt_br: Todo código muda

source: Does the :doc:`coding style </internals/contributing/writing-code/coding-style>` conform to our guidelines? Are there any ``flake8`` errors?
id: Apakah :doc:`coding style </internals/contributing/writing-code/coding-style>` sesuai pada panduan kami? Apakah ada kesalahan ``flake8``?
pt_br: O :doc:`estilo de código </internals/contributing/writing-code/coding-style>` atende as nossas regras? Existem quaisquer erros gerados pelo ``flake8``?

source: If the change is backwards incompatible in any way, is there a note in the release notes (``docs/releases/A.B.txt``)?
id: Jika perubahan adalah kesesuaian kebelakang denganc ara apapun, apakah ada dalam catatan terbitan (``docs/releases/A.B.txt``)?
pt_br: Se a mudança não é compatível com versões anteriores de modo algum, existe um aviso nas notas de release (``docs/releases/A.B.txt``)?
