Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Is Django's test suite passing? Ask in ``#django-dev`` for a core dev to build the pull request against our continuous integration server.
id: Apakah deretan percobaan Django lolos? Tanya di ``#django-dev`` untuk pengembang inti untuk membangun pull request terhadap peladen perpaduan kelanjutan kami
pt_br: A suíte de testes do Django está passando? Peça em ``#django-dev`` para que um desenvolvedor do projeto construa o pull request no nosso servidor de integração contínua.

source: All tickets
id: Semua tiket
pt_br: Todos os tickets

source: Is the pull request a single squashed commit with a message that follows our :ref:`commit message format <committing-guidelines>`?
id: Apakah pull request perbaikan lumatan tunggal dengan pesan yang mengikuti :ref:`commit message format <committing-guidelines>` kami?
pt_br: O pull request é um commit único esmagado com uma mensagem que segue o nosso :ref:`formato de mensagens de commit <committing-guidelines>`?

source: Are you the patch author and a new contributor? Please add yourself to the ``AUTHORS`` file and submit a `Contributor License Agreement`_.
id: Apakah anda penulis tambalan dan penyumbang baru? Harap tambah diri anda ke berkas ``AUTHORS`` dan ajukan `Contributor License Agreement`_.
pt_br: Você é o autor e um novo voluntário? Por favor se adicione no arquivo ``AUTHORS`` e envie um `Contributor License Agreement`_.

source: Unit tests
id: Satuan percobaan
pt_br: Testes unitários

source: Django comes with a test suite of its own, in the ``tests`` directory of the code base. It's our policy to make sure all tests pass at all times.
id: Django datang dengan deretan percobaan dia sendiri, di pelipat ``tests`` dari kode dasar. Itu kebijakan kami untuk memastikan semua percobaan selalu lolos.
pt_br: O Django vem com uma suíte de testes própria, no diretório ``tests`` do código. É nossa política garantir que todos os testes passem em todos os momentos.

source: We appreciate any and all contributions to the test suite!
id: Kami menghargai apapun dan semua bantuan pada deretan percobaan!
pt_br: Nós agradecemos toda e qualquer contribuição para a suíte de testes.

source: The Django tests all use the testing infrastructure that ships with Django for testing applications. See :doc:`/topics/testing/overview` for an explanation of how to write new tests.
id: Percobaan Django semua menggunakan infrastruktur percobaan yang dikirim dengan Django untuk aplikasi percobaan. Lihat :doc:`/topics/testing/overview` untuk sebuah penjelasan bagaimana menulis percobaan baru.
pt_br: Todos os testes do Django usam a infraestrutura de testes que é distribuída com o Django para testar aplicações. Veja :doc:`/topics/testing/overview` para uma explicação de como escrever novos testes.

source: Running the unit tests
id: Menjalankan satuan percobaan
pt_br: Rodando os testes unitários

source: Quickstart
id: Mulai cepat
pt_br: Início Rápido

source: First, `fork Django on GitHub <https://github.com/django/django/fork>`__.
id: Pertama, `fork Django on GitHub <https://github.com/django/django/fork>`__.

source: Second, create and activate a virtual environment. If you're not familiar with how to do that, read our :doc:`contributing tutorial </intro/contributing>`.
id: Kedua, buat dan aktifkan lingkungan maya. Jika anda tidak akrab dengan bagaimana melakukan itu, baca :doc:`contributing tutorial </intro/contributing>` kami.

source: Next, clone your fork, install some requirements, and run the tests::
id: Selanjutnya, klon fork anda, pasang beberapa persyaratan, dan jalankan percobaan::

source: Installing the requirements will likely require some operating system packages that your computer doesn't have installed. You can usually figure out which package to install by doing a Web search for the last line or so of the error message. Try adding your operating system to the search query if needed.
id: Memasang membutuhkan akan sepertinya membutuhkan beberapa paket sistem operasi dimana komputer anda tidak dipasang. Anda dapat biasanya mencari tahu paket mana untuk dipasang dengan melakukan pencarian Jaringan untuk baris terakhir atau selanjutnya dari pesan kesalahan. Coba menambahkan sistem operasi anda pada permintaan pencarian jika dibutuhkan.

source: If you have trouble installing the requirements, you can skip that step, except on Python 2, where you must ``pip install mock``. See :ref:`running-unit-tests-dependencies` for details on installing the optional test dependencies. If you don't have an optional dependency installed, the tests that require it will be skipped.
id: Jika anda mempunyai masalah memasang persyaratan, anda dapat melewati langkah itu, kecuali pada Python 2, dimana anda harus ``pip install mock``. Lihat :ref:`running-unit-tests-dependencies` untuk rincian pada memasang ketergantungan pilihan percobaan. Jika anda tidak mempunyai ketergantungan pilihan terpasang, percobaan yang membutuhkannya akan dilewati.

source: Running the tests requires a Django settings module that defines the databases to use. To make it easy to get started, Django provides and uses a sample settings module that uses the SQLite database. See :ref:`running-unit-tests-settings` to learn how to use a different settings module to run the tests with a different database.
id: Menjalankan percobaan membutuhkan modul pengaturan Django yang menentukan basisdata untuk digunakan. Untuk membuatnya mudah dijalankan, Django menyediakan dan menggunakan contoh modul pengaturan yang menggunakan basisdata SQLite. Lihat :ref:`running-unit-tests-settings` untuk mempelajari bagaimana pebedaan modul pengaturan untuk menjalankan percobaan dengan basisdata berbeda.

source: Windows users
id: Pengguna Windows
pt_br: Usuários Windows

source: We recommend something like `Git Bash <https://msysgit.github.io/>`_ to run the tests using the above approach.
id: Kami menganjurkan sesuatu seperti `Git Bash <https://msysgit.github.io/>`_ untuk menjalankan percobaan menggunakan pendekatan diatas.
pt_br: Nós recomendamos algo como `Git Bash <https://msysgit.github.io/>`_ para rodar os testes usando a abordagem acima.

source: Having problems? See :ref:`troubleshooting-unit-tests` for some common issues.
id: Mempunyai masalah? Lihat :ref:`troubleshooting-unit-tests` untuk beberapa masalah umum.
pt_br: Está tendo problemas? Veja :ref:`troubleshooting-unit-tests` para alguns problemas comuns.

source: Using another ``settings`` module
id: Gunakan modul ``pengaturan`` lain
pt_br: Usando outro módulo ``settings``

source: The included settings module (``tests/test_sqlite.py``) allows you to run the test suite using SQLite. If you want to run the tests using a different database, you'll need to define your own settings file. Some tests, such as those for ``contrib.postgres``, are specific to a particular database backend and will be skipped if run with a different backend.
id: Modul pengaturan disertakan (``tests/test_sqlite.py``) mengizinkan anda menjalankan deretan percobaan menggunakan SQLite. Jika anda ingin menjalankan percobaan menggunakan basisdata berbeda, anda akan butuh menentukan berkas pengaturan anda. Beberapa percobaan, seperti itu untuk ``contrib.postgres``, adalah khusus untuk backend basisdata tertentu dan akan dilewati jika berjalan dengan backend berbeda.

source: To run the tests with different settings, ensure that the module is on your ``PYTHONPATH`` and pass the module with ``--settings``.
id: Untuk menjalankan percobaan dengan pengaturan berbeda, pastikan bahwa modul berada di ``PYTHONPATH`` anda dan lewati modul dengan ``--settings``.
pt_br: Para rodar os testes com um settings diferente, certifique-se de que o módulo está no seu ``PYTHONPATH`` e passe o módulo com ``--settings``.

source: The :setting:`DATABASES` setting in any test settings module needs to define two databases:
id: Pengaturan :setting:`DATABASES` dalam modul pengaturan percobaan apapun butuh menentukan dua basisdata:
pt_br: O setting :setting:`DATABASES` em qualquer settings de módulo de testes precisa definir dois bancos:

source: A ``default`` database. This database should use the backend that you want to use for primary testing.
id: Basisdata ``default``. Basisdata ini harus menggunakan backend yang anda ingin menggunakan untuk percobaan utama.
pt_br: O banco ``default``. Este banco deve usar o backend que você quer usar para testes primários.

source: A database with the alias ``other``. The ``other`` database is used to test that queries can be directed to different databases. This database should use the same backend as the ``default``, and it must have a different name.
id: Sebuah basisdata dengan nama lain ``other``. Basisdata ``other`` digunakan untuk mencoba permintaan itu dapat dialihkan ke basisdata berbeda. Basisdata ini harus menggunakan backend sama seperti ``default``, dan itu harus mempunyai nama berbeda.

source: If you're using a backend that isn't SQLite, you will need to provide other details for each database:
id: Jika anda menggunakan backend yang bukan SQLite, anda akan butuh menyediakan rincian lain untuk setiap basisdata:
pt_br: Se você está usando um backend que não é o SQLite, você irá precisar providenciar outros detalhes para cada banco de dados:

source: The :setting:`USER` option needs to specify an existing user account for the database. That user needs permission to execute ``CREATE DATABASE`` so that the test database can be created.
id: Pilihan :setting:`USER` butuh menentukan akun pengguna yang ada ntuk basisdata. Bahwa pengguna butuh perizinan untuk menjalankan ``CREATE DATABASE`` sehingga basisdata percobaan dapat dibuat.
pt_br: A opção :setting:`USER` deve especificar uma conta de usuário válida para o banco de dados. Esse usuário precisa ter permissão para executar ``CREATE DATABASE`` de modo que o banco de dados de teste possa ser criado.

source: The :setting:`PASSWORD` option needs to provide the password for the :setting:`USER` that has been specified.
id: Pilihan :setting:`PASSWORD` butuh disediakan sandi untuk the :setting:`USER` yang telah ditentukan.
pt_br: A opção :setting:`PASSWORD` precisa fornecer uma senha para o user :setting:`USER` que foi especificado.

source: Test databases get their names by prepending ``test_`` to the value of the :setting:`NAME` settings for the databases defined in :setting:`DATABASES`. These test databases are deleted when the tests are finished.
id: Basisdata percobaan mendapatkan nama-nama mereka dengan mengawali ``test_`` pada nilai dari pengaturan :setting:`NAME` untuk basisdata ditentukan di :setting:`DATABASES`. Basisdata percobaan ini dihapus ketika percobaan selesai.
pt_br: Os nomes dos bancos de dados de teste são gerados adicionando o prefixo ``test_`` ao valor do campo :setting:`NAME` das configurações dos bancos de dados definidos dentro de :setting:`DATABASES`. Esses bancos de testes são deletados quando os testes são concluídos.

source: You will also need to ensure that your database uses UTF-8 as the default character set. If your database server doesn't use UTF-8 as a default charset, you will need to include a value for :setting:`CHARSET <TEST_CHARSET>` in the test settings dictionary for the applicable database.
id: Anda akan juga butuh memastikan bahwa basisdata anda menggunakan UTF-8 sebagai kumpulan karakter awal. Jika peladen basisdata anda tidak menggunakan UTF-8 sebagai kumpulan karakter awal, anda akan butuh menyertakan sebuah nilai untuk :setting:`CHARSET <TEST_CHARSET>` di kamus pengaturan untuk basisdata yang berlaku.
pt_br: Você também terá que garantir que o seu banco de dados usa UTF-8 por padrão como charset. Se o servidor do seu banco de dados não usa UTF-8 como charset padrão, você terá que incluir um valor para :setting:`CHARSET <TEST_CHARSET>` no dicionário do settings de teste para o banco de dados correspondente.

source: Running only some of the tests
id: Menjalankan hanya beberapa untuk percobaan
pt_br: Rodando apenas alguns dos testes.

source: Django's entire test suite takes a while to run, and running every single test could be redundant if, say, you just added a test to Django that you want to run quickly without running everything else. You can run a subset of the unit tests by appending the names of the test modules to ``runtests.py`` on the command line.
id: Deretan percobaan keseluruhan Django perlu waktu untuk berjalan, dan menjalankan setiap percobaan tunggal yang dapat berulang jika, katakan, anda cukup menambahkan percobaan pada Django yang anda ingin jalankan secara cepat tanpa menjalankan yang lainnya. Anda dapat menjalankan subkumpulan dari satuan percobaan dengan menambahkan nama-nama dari modul percobaan pada ``runtests.py`` di baris perintah.
pt_br: A suíte completa de testes do Django leva um tempo para rodar, e rodar cada um dos testes pode ser redundantes se, por exemplo, você deseja adicionar um teste no Django que você quer rodar rapidamente sem ter que rodar todo o resto. Você pode rodar um subconjunto de testes unitários adicionando os nomes dos módulos de teste para o comando ``runtests.py`` na linha de comando.

source: For example, if you'd like to run tests only for generic relations and internationalization, type::
id: Sebagai contoh, jika anda ingin menjalankan percobaan hanya untuk hubungan umum dan internasionalisasi, ketik::
pt_br: Por exemplo, se você gostaria de rodar testes somente para internacionalização e relações genéricas, digite:

source: How do you find out the names of individual tests? Look in ``tests/`` — each directory name there is the name of a test.
id: Bagaimana anda menemukan nama-nama dari percobaan perorangan? Lihat di ``tests/`` — setiap nama pelipat ada nama dari percobaan.
pt_br: Como você pode saber os nomes de testes em específico? Procure em ``tests/`` — cada nome de diretório lá representa o nome de um teste.

source: If you just want to run a particular class of tests, you can specify a list of paths to individual test classes. For example, to run the ``TranslationTests`` of the ``i18n`` module, type::
id: Jika anda hanya ingin menjalankan kelas tertentu dari percobaan, anda dapat menentukan daftar jalur-jalur dari kelas-kelas percobaan perseorangan. Sebagai contoh, untuk menjalankan ``TranslationTests`` dari modul ``i18n``, ketik::
pt_br: Se você quiser rodar uma classe de testes em particular, você pode especificar uma lista de caminhos para cada uma das classes de testes. Por exemplo, para rodar a classe ``TranslationTests`` do módulo ``i18n``, digite:

source: Going beyond that, you can specify an individual test method like this::
id: Melampaui itu, anda dapat menentukan sebuah cara percobaan perorangan seperti ini::
pt_br: Indo além disso, você pode especificar um método de teste em específico da seguinte forma::

source: Running the Selenium tests
id: Menjalankan percobaan Selenium
pt_br: Rodando os testes do Selenium

source: Some tests require Selenium and a Web browser. To run these tests, you must install the selenium_ package and run the tests with the ``--selenium=<BROWSERS>`` option. For example, if you have Firefox and Google Chrome installed::
id: Beberapa percobaan membutuhkan Selenium dan perambah Jaringan. Untuk menjalankan percobaan ini, anda harus memasang paket selenium_ dan menjalankan percobaan dengan pilihan ``--selenium=<BROWSERS>``. Sebagai contoh, jika anda mempunyai Firefox dan Google Chrome terpasang::

source: See the `selenium.webdriver`_ package for the list of available browsers.
id: Lihat paket `selenium.webdriver`_ untuk daftar perambah tersedia.

source: Specifying ``--selenium`` automatically sets ``--tags=selenium`` to run only the tests that require selenium.
id: Menentukan ``--selenium`` otomatis menyetel ``--tags=selenium`` untuk berjalan hanya percobaan yang membutuhkan selenium.

source: Running all the tests
id: Menjalankan semua percobaan
pt_br: Rodando todos os testes

source: If you want to run the full suite of tests, you'll need to install a number of dependencies:
id: Jika anda ingin menjalankan deretan lengkap dari percobaan, anda akan butuh memasang sejumlah ketergantungan:
pt_br: Se você quiser rodar toda a suíte de testes, você precisará instalar algumas dependências:

source: enum34_ (Python 2 only)
id: enum34_ (hanya Python 2)

source: memcached_, plus a :ref:`supported Python binding <memcached>`
id: memcached_, ditambah :ref:`supported Python binding <memcached>`
pt_br: memcached_, e um :ref:`Python binding suportado<memcached>`

source: mock_ (for Python 2)
id: mock_ (untuk Python 2)

source: You can find these dependencies in `pip requirements files`_ inside the ``tests/requirements`` directory of the Django source tree and install them like so::
id: Anda dapat menemukan ketergantungan ini di `pip requirements files`_ dalam pelipat ``tests/requirements`` dari pohon sumber Django dan pasang mereka seperti itu::
pt_br: Você pode encontrar essas dependências no `arquivo de requirements do pip`_ no diretório ``tests/requirements`` dentro do local onde o código-fonte do Django foi baixado e instalá-las da seguinte forma::

source: If you encounter an error during the installation, your system might be missing a dependency for one or more of the Python packages. Consult the failing package's documentation or search the Web with the error message that you encounter.
id: Jika anda menjumpai sebuah kesalahan selama pemasangan, sistem anda mungkin kehilangan ketergantungan dari satu atau lebih paket-paket Python. Rundingkan dokumentasi paket-paket gagal atau cari Jaringan dengan pesan kesalahan yang anda jumpai.

source: You can also install the database adapter(s) of your choice using ``oracle.txt``, ``mysql.txt``, or ``postgres.txt``.
id: Anda dapat juga memasang pencocok basisdata dari pilihan anda menggunakan `oracle.txt``, ``mysql.txt``, atau ``postgres.txt``.
pt_br: Você também pode instalar o adaptador (ou adaptadores) de sua escolha usando ``oracle.txt``, ``mysql.txt``, ou ``postgres.txt``.

source: If you want to test the memcached cache backend, you'll also need to define a :setting:`CACHES` setting that points at your memcached instance.
id: Jika anda ingin mencoba backend penyimpanan memcache, anda akan juga butuh menentukan pengaturan :setting:`CACHES` yang menunjuk pada instance memcache anda.
pt_br: Se você quiser testar o backend memcached, você também terá que definir uma configuração :setting:`CACHES` que aponte para a sua instância do memcached.

source: To run the GeoDjango tests, you will need to :doc:`setup a spatial database and install the Geospatial libraries</ref/contrib/gis/install/index>`.
id: Untuk menjalankan percobaan GeoDjango, anda akan butuh untuk :doc:`setup a spatial database and install the Geospatial libraries</ref/contrib/gis/install/index>`.
pt_br: Para rodar os testes do GeoDjango, você precisará :doc:`instalar um banco de dados espacial e instalar as bibliotecas geoespaciais</ref/contrib/gis/install/index>`.

source: Each of these dependencies is optional. If you're missing any of them, the associated tests will be skipped.
id: Masing-masing ketergantungan ini adalah pilihan. Jika anda kehilangan salah satu dari mereka, percobaan terkait akan dilewati.
pt_br: Cada uma dessas dependências é opcional. Se você estiver esquecendo qualquer uma delas, os testes associados serão pulados.

source: Code coverage
id: Cakupan kode
pt_br: Cobertura de código

source: Contributors are encouraged to run coverage on the test suite to identify areas that need additional tests. The coverage tool installation and use is described in :ref:`testing code coverage<topics-testing-code-coverage>`.
id: Pembantu mendorong menjalankan cakupan pada deretan percobaan untuk mencirikan kawasan yang butuh percobaan tambahan. Pemasangan alat cakupan dan penggunaan digambarkan dalam :ref:`testing code coverage<topics-testing-code-coverage>`.
pt_br: Voluntários são encorajados a rodar a cobertura na suíte de testes para identificar áreas que precisam de mais testes. A instalação da ferramenta de cobertura e a sua utilização é descrita em :ref:`testando a cobertura de código<topics-testing-code-coverage>`.

source: Coverage should be run in a single process to obtain accurate statistics. To run coverage on the Django test suite using the standard test settings::
id: Cakupan harus berjalan di pengolahan tunggal untuk mendapatkan statistik yang tepat. Untuk menjalankan cakupan pada deretan percobaan Django menggunakan pengaturan percobaan biasa::
pt_br: A Cobertura deve ser executada em um único processo para obter estatísticas apuradas. Para rodar a cobertura na suíte de testes do Django usando configurações padrão de testes ::

source: After running coverage, generate the html report by running::
id: Setelah menjalankan cakupan, bangkitkan laporan html dengan menjalankan::
pt_br: Depois de rodar a cobertura, gere um relatório html através do comando::

source: When running coverage for the Django tests, the included ``.coveragerc`` settings file defines ``coverage_html`` as the output directory for the report and also excludes several directories not relevant to the results (test code or external code included in Django).
id: Ketika menjalankan cakupan untuk percobaan Django, pengaturan ``.coveragerc`` yang disertakan menentukan ``coverage_html`` sebagai pelipat keluaran untuk laporan dan juga mengecualikan beberapa pelipat tidak terkait pada hasil (kode percobaan atau kode dikecualikan disertakan di Django).
pt_br: Quando executar a cobertura para testes do Django, o arquivo de settings incluído ``.coveragerc`` define ``coverage_html`` como sendo o diretório de saída para o relatório e também exclui vários diretórios não relevantes para os resultados (código de testes ou código externo incluídos no Django).

source: Contrib apps
id: Aplikasi bantuan

source: Tests for contrib apps can be found in the ``tests/`` directory, typically under ``<app_name>_tests``. For example, tests for ``contrib.auth`` are located in ``tests/auth_tests``.
id: Percobaan untuk aplikasi bantuan dapat ditemukan dalam pelipat ``tests/``, khususnya dibawah ``<app_name>_tests``. Sebagai contoh, percobaan untuk ``contrib.auth`` ditempatkan dalam ``tests/auth_tests``.
pt_br: Testes para apps contrib pode ser encontrados no diretório ``tests/``, tipicamente em ``<nome_app>_tests``. Por exemplo, testes para o ``contrib.auth`` estão localizados em ``tests/auth_tests``.

source: Troubleshooting
id: Menyelesaikan masalah
pt_br: Solução de Problemas

source: Many test failures with ``UnicodeEncodeError``
id: Banyak percobaan gagal dengan ``UnicodeEncodeError``
pt_br: Vários testes falham com ``UnicodeEncodeError``

source: If the ``locales`` package is not installed, some tests will fail with a ``UnicodeEncodeError``.
id: Jika paket ``locales`` tidak terpasang, beberapa percobaan akan gagal dengan ``UnicodeEncodeError``.
pt_br: Se o pacote de ``locales`` não estiver instalado, alguns testes irão falhar com um ``UnicodeEncodeError``.

source: You can resolve this on Debian-based systems, for example, by running::
id: Anda dapat menyelesaikan pada sistem berbasis-Debian, sebagai contoh, dengan menjalankan::
pt_br: Você pode solucionar isso em sistemas baseados em Debian, por exemplo, rodando o comando::

source: You can resolve this for macOS systems by configuring your shell's locale::
id: Anda dapat menyelesaikan untuk sistem macOS dengan mengkonfigurasi lokal shell anda::

source: Run the ``locale`` command to confirm the change. Optionally, add those export commands to your shell's startup file (e.g. ``~/.bashrc`` for Bash) to avoid having to retype them.
id: Jalankan perintah ``locale`` untuk menegaskan perubahan. Pilihannya, tambah perintah ekpos tersebut pada berkas awalan shell anda (sebagai contoh ``~/.bashrc`` untuk Bash) untuk menghindari mengetik kembali mereka.
