Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: We've got two roles in this diagram:
id: Kami telah mendapat dua peran pada diagram ini:
pt_br: Nós temos dois perfis neste diagrama:

source: Committers (also called core developers): people with commit access who are responsible for making decisions and integrating the contributions of the community.
id: Pembuat perbaikan (juga disebut pengembang inti): orang dengan akses perbaikan yang bertanggung jawab membuat keputusan dan memadukan sumbangan dari komunitas.
pt_br: Committers (também chamados de desenvolvedores do projeto): pessoas com permissões para fazer commit que são responsáveis por tomar decisões e integrar as contribuições da comunidade.

source: Ticket triagers: anyone in the Django community who chooses to become involved in Django's development process. Our Trac installation is intentionally left open to the public, and anyone can triage tickets. Django is a community project, and we encourage :ref:`triage by the community<how-can-i-help-with-triaging>`.
id: Pemilih tiket: siapapun dalam komunitas Django yang memilih menjadi terlibat di pengolahan pengembangan Django. Pemasangan Trac kami sengaja dibiarkan terbuka ke umum, dan siapapun dapat memilih tiket. Django adalah proyek komunitas, dan kami mendorong :ref:`triage by the community<how-can-i-help-with-triaging>`.
pt_br: Agentes de triagem: qualquer pessoa na comunidade Django que escolher se envolver no processo de desenvolvimento do Django. Nossa instalação do Trac é intencionalmente deixada aberta para o público, e qualquer pessoa pode fazer a triagem dos tickets. Django é um projeto comunitário, e nós encorajamos :ref:`triagens feitas pela comunidade<how-can-i-help-with-triaging>`.

source: By way of example, here we see the lifecycle of an average ticket:
id: Sebagai contoh, disini kita melihat daur hidup dari sebuah tiket rata-rata:
pt_br: Como exemplo, aqui nós podemos ver o ciclo de vida de um ticket comum:

source: Alice creates a ticket, and uploads an incomplete patch (no tests, incorrect implementation).
id: Alice membuat sebuah tiket, dan mengunggah sebuah tambalan tidak lengkap (tidak ada pengujian, penerapan tidak benar).
pt_br: Alice cria um ticket, e atualiza um patch incompleto (sem testes, implementação incorreta).

source: Bob reviews the patch, marks it "Accepted", "needs tests", and "patch needs improvement", and leaves a comment telling Alice how the patch could be improved.
id: Bob meninjau tambalan, menandainya "Diterima", "butuh pengujian", dan "tambalan butuh perbaikan", dan meninggalkan komentar mengatakan ke Alice bagaimana tambalan dapat diperbaiki.
pt_br: Bob revisou o patch, marcou ele como "Aceito", "precisa de testes", e "patch precisa de melhorias", e deixou um comentário dizendo a Alice como ela poderia aprimorar o patch.

source: Alice updates the patch, adding tests (but not changing the implementation). She removes the two flags.
id: Alice memperbaharui tambalan, menambahkan percobaan (tetapi tidak merubah penerapan). Dia memindahkan dua bendera.
pt_br: Alice atualiza o patch, adicionando testes (mas mantendo a implementação). Ela remove as duas tags.

source: Charlie reviews the patch and resets the "patch needs improvement" flag with another comment about improving the implementation.
id: Charlie meninjau tambalan dan menyetel kembali bendera "tambalan membutuhkan perbaikan" dengan komentar lain tentang memperbaiki penerapan.
pt_br: Charlie revisa o patch e adiciona novamente a tag "patch precisa de melhorias" com outro comentário sobre como melhorar a implementação.

source: Alice updates the patch, fixing the implementation. She removes the "patch needs improvement" flag.
id: Alice memperbaharui tambalan, memperbaiki penerapan. Dia memindahkan bendera "tambalan butuh diperbaiki".
pt_br: Alice atualiza o patch, corrigindo a implementação. Ela remove a tag "patch precisa de melhorias".

source: Daisy reviews the patch, and marks it RFC.
id: Daisy meninjau tambalan, dan menandai RFC nya.
pt_br: Daisy revisa o patch, e marca ele como RFC

source: Jacob, a core developer, reviews the RFC patch, applies it to his checkout, and commits it.
id: Jacob, pengembang inti, meninjau tambalan RFC, memberlakukannya ke pemeriksaannya, dan memperbaikinya.
pt_br: Jacob, um desenvolvedor do projeto, revisa o patch RFC, aplica ele em seu checkout, e faz o commit dele.

source: Some tickets require much less feedback than this, but then again some tickets require much much more.
id: Beberapa tiket membutuhkan sedikit umpan balik daripada ini, tapi kembali lagi beberapa tiket membutuhkan lebih banyak.
pt_br: Alguns tickets precisam de bem menos feedback do que esse, mas então novamente outros tickets requerem muito, muito mais.

source: Triage stages
id: Tahapan-tahapan Triage
pt_br: Estágios de triagem

source: Below we describe in more detail the various stages that a ticket may flow through during its lifetime.
id: Dibawah ini kami menggambarkan dalam lebih rinci beragam tingkatan dimana sebuah tiket mungkin mengalir selama siklus hidupnya.
pt_br: Abaixo são descritos em mais detalhes os vários estágios que um ticket pode possuir durante o seu tempo de vida.

source: Unreviewed
id: Belum ditinjau
pt_br: Não revisado

source: The ticket has not been reviewed by anyone who felt qualified to make a judgment about whether the ticket contained a valid issue, a viable feature, or ought to be closed for any of the various reasons.
id: Tiket belum ditinjau oleh seorangpun yang merasa berkualitas untuk membuat keputusan tentang apakah tiket mengandung masalah sah, fitur yang berjalan terus, atau mungkin menutup untuk beragam alasan.
pt_br: O ticket não foi revisado por ninguém que tenha se sentido qualificado para decidir se o ticket contém um problema válido, uma funcionalidade viável, ou se deveria ser fechado por qualquer uma das várias razões possíveis.

source: Accepted
id: Diterima
pt_br: Aceito

source: The big gray area! The absolute meaning of "accepted" is that the issue described in the ticket is valid and is in some stage of being worked on. Beyond that there are several considerations:
id: Kawasan abu-abu besar! Arti mutlak dari "diterima" adalah bahwa masalah digambarkan dalam tiket adalah sah dan dalam beberapa tingkatan sedang dikerjakan. Diluar itu ada beberapa pertimbangan:
pt_br: A grande área cinzenta! O sentido absoluto de "aceito" é que o problema descrito no ticket é válido e está em algum estágio no processo de ser resolvido. Além disso existem vários considerações:

source: **Accepted + No Flags**
id: **Diterima + Tidak ada Bendera**
pt_br: **Aceito + Nenhuma Tag**

source: The ticket is valid, but no one has submitted a patch for it yet. Often this means you could safely start writing a patch for it. This is generally more true for the case of accepted bugs than accepted features. A ticket for a bug that has been accepted means that the issue has been verified by at least one triager as a legitimate bug - and should probably be fixed if possible. An accepted new feature may only mean that one triager thought the feature would be good to have, but this alone does not represent a consensus view or imply with any certainty that a patch will be accepted for that feature. Seek more feedback before writing an extensive patch if you are in doubt.
id: Tiket sah, tetapi tidak seorangpun mengajukan sebuah tambalan untuknya. Sering ini berarti anda dapat dengan aman memulai menulis tambalan untukn itu. Ini umumnya lebih benar untuk kasus dari kesalahan diterima daripada fitur diterima. Sebuah tiket untuk sebuah kesalahan yang telah diterima berarti bahwa masalah telah diperiksa oleh setidaknya satu penyortir sebagai kesalahan sah - dan harus diperbaiki jika memungkinkan. Sebuah fitur baru diterima hanya berarti bahwa satu penyortir berpikir akan bagus jika punya, tetapi ini sendiri tidak mewakili sebuah pandangan pemufakatan atau berarti dengan kepastian apapun yang sebuah tambalan akan diterima untuk fitur tersebut. Cari lebih umpan balik sebelum menulis tambalan tambahan jika anda ragu.
pt_br: O ticket é válido, mas ninguém enviou um patch ainda. Geralmente isso significa que você pode começar a escrever um para ele com segurança. Isso costuma ser mais válido para os casos de bugs aceitos do que para novas funcionalidades aceitas. Um ticket para um bug que foi aceito significa que o problema verificado no ticket foi constatado por pelo menos um agente de triagem - e provavelmente deve ser corrigido se possível. Uma funcionalidade aceita pode significar apenas que um agente de triagem considerou a nova funcionalidade como algo bom de se ter, mas isso sozinho não representa um consenso ou implica que um patch deva ser aceito para essa funcionalidade. Procure mais feedback antes de escrever patchs extensos se você estiver em dúvida.

source: **Accepted + Has Patch**
id: **Diterima + Ada Tambalan**
pt_br: **Aceito + Possui Patch**

source: The ticket is waiting for people to review the supplied patch. This means downloading the patch and trying it out, verifying that it contains tests and docs, running the test suite with the included patch, and leaving feedback on the ticket.
id: Tiket menunggu untuk orang untuk meninjau tambalan dipasok. Ini berarti mengunduh tambalan dan mencobanya, memeriksa bahwa itu mengandung percobaan dan dokumen, menjalankan deretan percobaan dengan tambalan disertakan, dan meninggalkan umpan balik pada tiket.
pt_br: O ticket está aguardando por pessoas para revisar o patch fornecido. Isso significa baixar o patch e usá-lo, verificando se ele contém testes e documentação, executando a suíte de testes incluídas com o patch, e deixando feedback no ticket.

source: **Accepted + Has Patch + Needs ...**
id: **Diterima + Ada Tambalan + Dibutuhkan ...**
pt_br: **Aceito + Possui Patch + Precisa ...**

source: This means the ticket has been reviewed, and has been found to need further work. "Needs tests" and "Needs documentation" are self-explanatory. "Patch needs improvement" will generally be accompanied by a comment on the ticket explaining what is needed to improve the code.
id: Ini berarti tiket telah ditinjau, dan telah ditemukan untuk pekerjaan lebih lanjut. "Butuh Percobaan" dan "Butuh dokumentasi" adalah penjelasan-sendiri. "Butuh perbaikan tambalan" akan umumnya ditemani oleh komentar pada tiket menjelaskan apa yang dibutuhkan untuk memperbaiki kode.
pt_br: Isso significa que o ticket foi revisado, e constatado que ele precisa de mais trabalho. "Precisa de testes" e "Precisa de documentação" são auto-explicativos. "Patch precisa de melhorias" geralmente estará acompanhado de um comentário no ticket explicando o que ele precisa para melhorar.

source: Ready For Checkin
id: Siap Untuk Mendaftar

source: The ticket was reviewed by any member of the community other than the person who supplied the patch and found to meet all the requirements for a commit-ready patch. A committer now needs to give the patch a final review prior to being committed. See the :ref:`New contributors' FAQ<new-contributors-faq>` for "My ticket has been in RFC forever! What should I do?"
id: Tiket telah ditinjau oleh anggota dari perkumpulan lain daripada orang yang memasok tambalan dan cocok semua persyaratan untuk tambalan siap-penyerahan. Seorang penyerah sekarang butuh untuk memberikan tambalan tinjauan akhir sebelum diperbaiki. Lihat :ref:`New contributors' FAQ<new-contributors-faq>` untuk "Tiket saya telah di dalam RFC selamanya! Apa yang harus saya lakukan?"
pt_br: O ticket foi revisado por um membro da comunidade diferente da pessoa que o forneceu e constatou-se que ele atende os requisitos para um patch pronto para o commit. Um committer agora precisará dar ao patch uma revisão final antes de ele ser commitado. Veja a :ref:`FAQ Novos voluntários' <new-contributors-faq>` para "Meu ticket está eternamente em RFC! O que eu devo fazer?"

source: Someday/Maybe
id: Suatu hari/Mungkin

source: This stage isn't shown on the diagram. It's only used by core developers to keep track of high-level ideas or long term feature requests.
id: Tahapan ini tidak ditampilkan pada diagram. Itu hanya digunakan oleh pengembang inti untuk tetap melacak dari ide tingkat-tinggi atau permintaan fitur jangka panjang.
pt_br: Esse estágio não é mostrado no diagrama. Ele só é usado pelos desenvolvedores do projeto para manter em mente ideias maiores de funcionalidades requisitadas há um bom tempo.

source: These tickets are uncommon and overall less useful since they don't describe concrete actionable issues. They are enhancement requests that we might consider adding someday to the framework if an excellent patch is submitted. They are not a high priority.
id: Tiket ini tidak umum dan keseluruhan kurang berguna sejak mereka tidak menggambarkan masalah nyata ditindaklanjuti. Mereka meningkatkan permintaan bahwa kami mungkin mempertimbangkan menambahkan suatu waktu ke kerangka jika sebuah tambalan sempurna diajukan. Mereka bukan prioritas tinggi.
pt_br: Esses tickes são incomuns e no fim das contas menos úteis já que eles não descrevem problemas concretos e acionáveis. Eles são pedidos de melhorias que nós podemos considerar adicionar algum dia ao framework se um excelente patch é submetido. Eles não são uma grande prioridade.

source: Other triage attributes
id: Atribut triage lainnya
pt_br: Outros atributos de triagem

source: A number of flags, appearing as checkboxes in Trac, can be set on a ticket:
id: Sejumlah bendera, muncul sebagai kotak centang di Trac, dapat di setel di tiket:
pt_br: Um número de tags, aparecendo como checkboxes no Trac, podem ser ativdadas no ticket:

source: Has patch
id: Memiliki Tambalan
pt_br: Possui patch

source: This means the ticket has an associated :doc:`patch<writing-code/submitting-patches>`. These will be reviewed to see if the patch is "good".
id: INi berarti tiket mempunyai sebuah :doc:`patch<writing-code/submitting-patches>` terhubung. Ini akan ditinjau kembali untuk melihat jika tambalan ini "baik".
pt_br: Isso significa que o ticket tem um :doc:`patch<writing-code/submitting-patches>` associado. Eles serão revisados para saber se o patch é "bom".

source: The following three fields (Needs documentation, Needs tests, Patch needs improvement) apply only if a patch has been supplied.
id: Tiga bidang berikut (Butuh dokumentasi, Butuh percobaan, Tambalan butuh perbaikan) berlaku jika sebuah tambalan telah dipasok.
pt_br: Os três campos seguintes (Precisa de documentação, Precisa de testes, Patch precisa de melhorias) se aplicam apenas se o patch foi submetido.

source: Needs documentation
id: Butuh dokumentasi
pt_br: Precisa de documentação

source: This flag is used for tickets with patches that need associated documentation. Complete documentation of features is a prerequisite before we can check them into the codebase.
id: Bendera ini digunakan untuk tiket dengan tambalan yang butuh dokumentasi terkait. Dokumentasi lengkap dari fitur adalah prasyarat sebelum kami dapat memerika mereka ke dalam basiskode.
pt_br: Essa tag é usada para tickets com patches sem documentação associada. Documentação completa de funcionalidades é um pré-requisito antes de nós adicionarmos elas no código base.

source: Needs tests
id: Butuh pengujian
pt_br: Precisa de testes

source: This flags the patch as needing associated unit tests. Again, this is a required part of a valid patch.
id: Ini menandai tambalan yang membutuhkan unit percobaan terkait. Kembali, ini adalah bagian diwajibkan dari tambalan sah.
pt_br: Essa tag indica que o patch precisa de testes unitários. Novamente, isso é um pré-requisito para um patch válido.

source: Patch needs improvement
id: Tambalan butuh perbaikan
pt_br: Patch precisa de melhorias

source: This flag means that although the ticket *has* a patch, it's not quite ready for checkin. This could mean the patch no longer applies cleanly, there is a flaw in the implementation, or that the code doesn't meet our standards.
id: Bendera ini berarti bahwa meskipun tiket *mempunyai* tambalan, itu tidak siap untuk pendaftaran. Ini daat berarti tambalan tidak lagi berlaku, ada sebuah cacat dalam penerapan, atau bahwa kode tidak memenuhi standar kami.
pt_br: Essa tag significa que embora o ticket *tenha* um patch, esse patch não está exatamente pronto para o checkin. Isso pode indicar que o patch não se aplica mais de forma clara, que existe uma falha na implementação, ou que o código não atende nossos padrões.

source: Easy pickings
id: Pengambilan mudah

source: Tickets that would require small, easy, patches.
id: Tiket yang akan membutuhkan kecil, mudah, tambalan.
pt_br: Tickets que podem precisar de patches pequenos e simples.

source: Type
id: Tipe
pt_br: Tipo

source: Tickets should be categorized by *type* between:
id: Tiket harus dikelompokkan berdasarkan *jenis* diantara:
pt_br: Os tickets devem ser categorizados por *tipo* entre:

source: New Feature
id: Fitur Baru
pt_br: Nova funcionalidade

source: For adding something new.
id: Untuk menambahkan sesuatu baru.
pt_br: Para adicionar algo novo.

source: Bug
id: Kesalahan

source: For when an existing thing is broken or not behaving as expected.
id: Untuk ketika hal yang ada rusak atau tidak berperilaku seperti yang diharapkan.
pt_br: Para quando algo que já existe está quebrado ou não se comporta como esperado.

source: Cleanup/optimization
id: Pembersihan/optimalisasi
pt_br: Limpeza/otimização

source: For when nothing is broken but something could be made cleaner, better, faster, stronger.
id: Untuk ketika tidak ada yang rusak tetapi sesuatu dapat dibuat lebih jelas, lebih baik, lebih cepat, lebih kuat.
pt_br: Para quando nada está quebrado mas algo poderia ser mais limpo, melhor, rápido, forte.

source: Component
id: Komponen
pt_br: Componente

source: Tickets should be classified into *components* indicating which area of the Django codebase they belong to. This makes tickets better organized and easier to find.
id: Tiket harus dikelompokkan kedalam *komponen* menandakan milik kawasan mana dari basiskode Django. Ini membuat tiket lebih baik tersusun dan lebih mudah ditemukan.
pt_br: Tickets devem ser classificados dentro de *componentes* indicando qual área do código base do Django eles pertencem. Isso faz com que os tickets fiquem melhor organizados e mais fáceis de encontrar.

source: Severity
id: Kesederhanaan
pt_br: Severidade

source: The *severity* attribute is used to identify blockers, that is, issues which should get fixed before releasing the next version of Django. Typically those issues are bugs causing regressions from earlier versions or potentially causing severe data losses. This attribute is quite rarely used and the vast majority of tickets have a severity of "Normal".
id: Atribut *keparahan* digunakan untuk mencirikan pemblok, yaitu, masalah-masalah yang harus segera diperbaiki sebelum menerbitkan versi selanjutnya dari Django. Khususnya masalah-masalah itu adalah kesalahan disebabkan pemulihan dari versi sebelumnya atau berpotensi menyebabkan kehilangan data parah. Atribut ini sangat jarang digunakan dan mayoritas jumlah besar tiket mempunyai keparahan "Normal".
pt_br: O atributo severidade é usado para identificar bloqueadores, isto é, problemas que devem ser corrigidos antes do lançamento da próxima versão do Django. Tipicamente esses problemas são bugs causando regressões de versões anteriores ou potencialmente causando perdas de dados severas. Este atributo é muito raramente usado e a grande maioria dos tickets tem um nível de severidade "Normal".

source: Version
id: Versi
pt_br: Versão

source: It is possible to use the *version* attribute to indicate in which version the reported bug was identified.
id: Itu dimungkinkan menggunakan atribut *versi* untuk menandakan versi mana kesalahan dilaporkan telah dicirikan.
pt_br: É possível usar o atributo "versão" para indicar em qual versão o bug relatado foi identificado.

source: This flag is used for tickets that relate to User Interface and User Experiences questions. For example, this flag would be appropriate for user-facing features in forms or the admin interface.
id: Bendera ini digunakan untuk tiket yang terkait ke Antarmuka Pengguna dan pertanyaan Pengalaman pengguna. Sebagai contoh, bendera ini akan sesuai untuk pengguna-menghadapi fitur dalam formulir atau antarmuka admin.
pt_br: Esta tag é utilizada para tickets que estão relacionados a questões de interface de usuário e de experiência de usuário. Por exemplo, essa tag seria apropriada para funcionalidades que os usuários podem ver nos formulários ou na interface do admin.

source: You may add your username or email address to this field to be notified when new contributions are made to the ticket.
id: Anda mungkin menambahkan nama pengguna atau alamt surel ke bidang ini untuk diberitahu ketika bantuan baru dibuat ke tiket.
pt_br: Você pode adicionar o seu username ou endereço de email neste campo para ser notificado quando novas contribuições forem feitas ao ticket.

source: Keywords
id: Kata kunci

source: With this field you may label a ticket with multiple keywords. This can be useful, for example, to group several tickets of a same theme. Keywords can either be comma or space separated. Keyword search finds the keyword string anywhere in the keywords. For example, clicking on a ticket with the keyword "form" will yield similar tickets tagged with keywords containing strings such as "formset", "modelformset", and "ManagementForm".
id: Dengan bidang ini anda memungkinkan menandakan sebuah tiket dengan banyak kata kunci. Ini dapat berguna, sebagai contoh, untuk mengelompokkan beberapa tiket dari tema sama. Kata kunci dapat juga dipisahkan dengan koma atau spasi. Kata kunci pencarian mencari deretan karakter dimanapun dalam kata kunci. Sebagai contoh, mengklik pada tiket dengan katakunci "form: akan menghasilkan tiket mirip ditandai dengan kata kunci mengandung deretan karakter seperti "formset", "modelformset", dan "ManagementForm".
pt_br: Com esse campo você poderá adicionar rótulos a um ticket com múltiplas palavras-chave. Isso pode ser útil, por exemplo, para agrupar vários tickets de uma mesmo tema. Palavras-chave podem ser separadas tanto por vírgulas quanto por espaços. Buscas por palavras-chave encontram suas respectivas strings independentemente do local. Por exemplo, clicando em um ticket com a palavra-chave "formulário" irá trazer tickets similares taggeados com palavras-chave contendo strings como "formset", "modelformset", e "ManagamentForm".

source: Closing Tickets
id: Menutup Tiket
pt_br: Fechando Tickets
