Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: These branches can be found in the repository as ``stable/A.B.x`` branches and will be created right after the first alpha is tagged.
id: Cabang-cabang ini dapat ditemukan dalam gudang sebagai cabang-cabang ``stable/A.B.x`` dan akan dibuat tepat setelah alpha pertama di labeli.
pt_br: Essas branches podem ser encontradas dentro das branches ``stable/A.B.x`` e serão criadas após realização de tag da primeira versão alpha.

source: For example, immediately after *Django 1.5 alpha 1* was tagged, the branch ``stable/1.5.x`` was created and all further work on preparing the code for the final 1.5 release was done there.
id: Sebagai contoh, segera setelah *Django 1.5 alpha 1* ditandai, cabang ``stable/1.5.x`` dibuat dan semua pekerjaan lebih jauh pada persiapan kode untuk terbitan 1.5 akhir selesai disana.
pt_br: Por exemplo, imediatamente após o tag da versão *Django 1.5 alpha 1*, a branch ``stable/1.5.x`` foi criada e todo o trabalho seguinte na preparação do código para a release final 1.5 foi feita nela.

source: These branches also provide limited bugfix support for the most recent released version of Django and security support for the two most recently-released versions of Django.
id: Cabang-cabang ini juga menyediakan dukungan perbaikan kesalahan terbatas untuk versi terbitan paling terbaru dari Django dan dukungan keamanan untuk dua versi terbitan paling terbaru dari Django.
pt_br: Essas branches também fornecem suporte limitado a correção de bugs para a mais recente versão disponível do Django e suporte a segurança para as duas versões mais recentes do Django.

source: For example, after the release of Django 1.5, the branch ``stable/1.5.x`` receives only fixes for security and critical stability bugs, which are eventually released as Django 1.5.1 and so on, ``stable/1.4.x`` receives only security fixes, and ``stable/1.3.x`` no longer receives any updates.
id: Sebagai contoh, setelah terbitan Django 1.5, cabang ``stable/1.5.x`` hanya menerima perbaikan untuk keamanan dan kesalahan kestabilan kritis, yang nantinya diterbitkan sebagai Django 1.5.1 dan selanjutnya, ``stable/1.4.x`` hanya menerima perbaikan keamanan, dan ``stable/1.3.x`` tidak lagi menerima perbaharuan apapun.
pt_br: Por exemplo, depois do release do Django 1.5, a branch ``stable/1.5.x`` recebe somente correções de segurança e bugs críticos de estabilidade, que são eventualmente lançados como Django 1.5.1 e assim em diante, ``stable/1.4.x`` recebe somente correções de segurança, e ``stable/1.3.x`` não recebe mais quaisquer atualizações.

source: Historical information
id: Riwayat informasi
pt_br: Informação Histórica

source: This policy for handling ``stable/A.B.x`` branches was adopted starting with the Django 1.5 release cycle.
id: Kebijakan ini untuk menangani cabang-cabang ``stable/A.B.x`` telah dipungut dimulai dengan siklus terbitan Django 1.5.
pt_br: Esta política para manipular branches ``stable/A.B.x`` foi adotada começando com o ciclo de release da versão Django 1.5.

source: Previously, these branches weren't created until right after the releases and the stabilization work occurred on the main repository branch. Thus, no new features development work for the next release of Django could be committed until the final release happened.
id: Sebelumnya, cabang-cabang ini tidak dibuat sampai tepat setelah terbitan dan stabilisasi pekerjaan muncul pada cabang gudang utama. Dengan demikian, fitur baru pengembangan bekerja untuk terbitan selanjutnya dari Django dapat di perbaiki sampai terbitan akhir terjadi.
pt_br: Previamente, essas branches não eram criadas até que as releases e o trabalho de estabilização ocorressem na principal branch do repositório. Portanto, trabalho em novas funcionalidades para as próximas versões do Django não eram commitadas enquanto a versão final não era concretizada.

source: For example, shortly after the release of Django 1.3 the branch ``stable/1.3.x`` was created. Official support for that release has expired, and so it no longer receives direct maintenance from the Django project. However, that and all other similarly named branches continue to exist and interested community members have occasionally used them to provide unofficial support for old Django releases.
id: Sebagai contoh, sesaat setelah terbitan Django 1.3 cabang ``stable/1.3.x`` dibuat. Dukungan resmi untuk terbitan itu telah kadaluarsa, dan sehingga itu tidak lagi menerima perawatan langsung dari proyek Django. Bagaimanapun, itu dan semua lainnya sama halnya cabang-cabang bernama melanjutkan ke anggota komunitas yang ada dan tertarik terkadang menggunakan mereka menyediakan dukungan tidak resmi untuk terbitan Django lama.
pt_br: Por exemplo, pouco tempo após a release do Django 1.3 a branch ``stable/1.3.x`` foi criada. O suporte oficial para essa release expirou, e por isso ele não recebe mais manutenção direta do projeto Django. Porém, essa e todas as outras branchs nomeadas de modo similar continuaram a existir e membros da comunidade interessados ocasionalmente as usaram para fornecer suporte não oficial para as releases do Django.

source: Feature-development branches
id: Cabang pengembangan akan datang
pt_br: Brances para o desenvolvimento de novas funcionalidades

source: Since Django moved to Git in 2012, anyone can clone the repository and create their own branches, alleviating the need for official branches in the source code repository.
id: Sejak Django pindah ke Git di 2012, siapapun dapat menggandakan gudang dan membuat cabang mereka sendiri, mengurangi kebutuhan cabang-cabang resmi di gudang kode sumber.
pt_br: Desde que o Django mudou para o Git em 2012, todos podem clocar o repositório e criar suas próprias branches. aliviando a necessidade de branches oficiais no repositório de código-fonte.

source: The following section is mostly useful if you're exploring the repository's history, for example if you're trying to understand how some features were designed.
id: Bagian berikut kebanyakan berguna jika anda menjelajah riwayat gudang, sebagai contoh jika anda sedang memahami bagaimana beberapa fitur telah dirancang.
pt_br: A seção seguinte é mais útil se você estiver explorando o histórico do repositório, por exemplo se você está tentando entender como alguma funcionalidade foi desenvolvida.

source: Feature-development branches tend by their nature to be temporary. Some produce successful features which are merged back into Django's master to become part of an official release, but others do not; in either case there comes a time when the branch is no longer being actively worked on by any developer. At this point the branch is considered closed.
id: Cabang-cabang pengembangan akan datang cenderung menurut sifatnya bersifat sementara. Beberapa menghasilkan fitur-fitur sukses yang digabung kembali ke dalam amster Django untuk menjadi bagian dari terbitan resmi, tetapi lainnya tidak; dalam kasus kedua ada saatnya ketika cabang tidak lagi menjadi aktif bekerja pada pengembang manapun. Pada titik ini cabang dipertimbangkan ditutup.
pt_br: Branches de funcionalidades de desenvolvimento tendem por natureza a serem temporárias. Algumas produzem funcionalidades de sucesso que são reaglutinadas de volta a branch master para se tornarem parte de uma release oficial do Django, mas outras não; em qualquer dos casos existe um momento em que a branch não é mais utilizada para trabalho por ninguém. Neste ponto a branch é considerada fechada.

source: Unfortunately, Django used to be maintained with the Subversion revision control system, that has no standard way of indicating this. As a workaround, branches of Django which are closed and no longer maintained were moved into ``attic``.
id: Sayangnya, Django biasanya dirawat dengan sistem kendali perubahan Subversion, yang tidak memiliki cara standar dari menandakan ini. Sebagai pemecahan masalah, cabang-cabang dari Django yang ditutup dan tidak lagi dirawat dipindahkan kedalam ``attic``.
pt_br: Infelizmente, O Django costumava ser mantido com o sistema de versionamento de código Subversion, que não tem uma forma padrão de indicar isso. Como paliativo, as branches do Django que são fechadas e que não são mais mantidas são movidas dentro de ``attic``.

source: For reference, the following are branches whose code eventually became part of Django itself, and so are no longer separately maintained:
id: Untuk acuan, ikuti cabang-cabang yang kodenya akhirnya menjadi bagian dari Django itu sendiri, dan dipelihara tidak lagi secara terpisah:
pt_br: Para referência, segue a seguir as branches das quais o código eventualmente se tornou parte do Django em si, e não são mais mantidas separadamente:

source: ``boulder-oracle-sprint``: Added support for Oracle databases to Django's object-relational mapper. This has been part of Django since the 1.0 release.
id: ``boulder-oracle-sprint``: Ditambahkan dukungan untuk basisdata Oracle pada pemeta keterhubungan-obyek Django. Ini telah menjadi bagian Django sejak terbitan 1.0.
pt_br: ``boulder-oracle-sprint``: Adicionou suporte para os bancos de dados Oracle no ORM do Django. Ela tem sido parte do Django desde a release 1.0.

source: ``gis``: Added support for geographic/spatial queries to Django's object-relational mapper. This has been part of Django since the 1.0 release, as the bundled application ``django.contrib.gis``.
id: ``gis``: Ditambahkan dukungan untuk permintaan geografis/spasial ke pemetaan hubungan-obyek Django. Ini telah menjadi bagian dari Django sejak terbitan 1.0, sebagai aplikasi digabung ``django.contrib.gis``.
pt_br: ``gis``: Adiciona suporte para consultas geográficas/espaciais no ORM do Django. Ela tem sido parte do Django desde a release 1.0, foi embutida na aplicação ``django.contrib.gis``.

source: ``i18n``: Added :doc:`internationalization support </topics/i18n/index>` to Django. This has been part of Django since the 0.90 release.
id: ``i18n``: Added :doc:`internationalization support </topics/i18n/index>` ke Django. Ini telah menajdi bagian dari Django sejak terbitan 0.90.
pt_br: ``i18n``: Adiciona suporte a :doc:`internacionalização </topics/i18n/index>` ao Django. Ela tem sido parte do Django desde a relase 0.90.

source: ``magic-removal``: A major refactoring of both the internals and public APIs of Django's object-relational mapper. This has been part of Django since the 0.95 release.
id: ``magic-removal``: Refactor utama dari kedua API internal dan umum dari pemetaan hubungan obyek Django. Ini telah menjadi bagian dari Django sejak terbitan 0.95.
pt_br: ``magic-removal``: Uma refatoração massiva tanto da API privada quanto da API pública do ORM do Django. Ela tem sido parte do Django desde a release 0.95.

source: ``multi-auth``: A refactoring of :doc:`Django's bundled authentication framework </topics/auth/index>` which added support for :ref:`authentication backends <authentication-backends>`. This has been part of Django since the 0.95 release.
id: ``multi-auth``: Refaktor dari :doc:`Django's bundled authentication framework </topics/auth/index>` yang menambahkan dukungan untuk :ref:`authentication backends <authentication-backends>`. Ini telah menjadi bagian dari Django sejak terbitan 0.95.
pt_br: ``multi-auth``: Uma refatoração do :doc:`framework de autenticação embutido no Django </topics/auth/index>` que adicionou suporte para :ref:`backends de autenticação <authentication-backends>`. Ela tem sido parte do Django desde a release 0.95.

source: ``new-admin``: A refactoring of :doc:`Django's bundled administrative application </ref/contrib/admin/index>`. This became part of Django as of the 0.91 release, but was superseded by another refactoring (see next listing) prior to the Django 1.0 release.
id: ``new-admin``: Refaktor dari :doc:`Django's bundled administrative application </ref/contrib/admin/index>`. Ini menjadi bagian dari Django mulai terbitan 0.91, tetapi telah digantikan oleh refaktor lainnya (lihat daftar selanjutnya) sebelum terbitan Django 1.0.
pt_br: ``new-admin``: Uma refatoração da :doc:`aplicação administrativa embutida no Django </ref/contrib/admin/index>`. Ela tem sido parte do Django desde a release 0.91, mas substituída foi por outra refatoração (veja a próxima listagem) antes da release do Django 1.0.

source: ``newforms-admin``: The second refactoring of Django's bundled administrative application. This became part of Django as of the 1.0 release, and is the basis of the current incarnation of ``django.contrib.admin``.
id: ``newforms-admin``: Refaktor kedua dari aplikasi administratif gabungan Django. Ini menjadi bagian dari Django mulai terbitan 1.0, dan adalah dasar dari jelmaan saat ini dari ``django.contrib.admin``.
pt_br: ``newforms-admin``: A segunda refatoração da aplicação administrativa embutida no Django. Ela se tornou parte do Django na release 1.0, e é a base da encarnação atual do ``django.contrib.admin``.

source: ``queryset-refactor``: A refactoring of the internals of Django's object-relational mapper. This became part of Django as of the 1.0 release.
id: ``queryset-refactor``: Refaktor dari pemetaan hubungan obyek Django internal. Ini menjadi bagian dari Django mulai terbitan 1.0.
pt_br: ``queryset-refactor``: Uma refatoração das entranhas do ORM do Django. Ela se tornou parte do Django na release 1.0.

source: ``unicode``: A refactoring of Django's internals to consistently use Unicode-based strings in most places within Django and Django applications. This became part of Django as of the 1.0 release.
id: ``unicode``: Refaktor dari internal Django pada ketetapan menggunakan deretan karakter berbasis Unicode di kebanyakan tempat dalam Django dan aplikasi Django. Ini menjadi bagian dari Django mulai terbitan 1.0.
pt_br: ``unicode``: Uma refatoração das entranhas do Django para uso consistente de strings baseadas em Unicode e mais locais dentro do Django e de aplicações Django. Ela se tornou parte do Django na release 1.0.

source: When Django moved from SVN to Git, the information about branch merges wasn't preserved in the source code repository. This means that the ``master`` branch of Django doesn't contain merge commits for the above branches.
id: Ketika Django pindah dari SVN ke Git, informasi tentang penggabungan cabang tidak dipertahankan dalam gudang kode sumber. Ini berarti bahwa cabang ``master`` dari Django tidak mengandung penggabungan perbaikan untuk cabang-cabang diatas.
pt_br: Quando o Django saiu do SVN para o Git, a informação sobre os merges de branches não foi preservada no repositório do código-fonte. Isto significa que a branch ``master`` do Django não contém os commits provenientes das branches abaixo.

source: However, this information is `available as a grafts file`_. You can restore it by putting the following lines in ``.git/info/grafts`` in your local clone::
id: Bagaimanapun, informasi ini `available as a grafts file`_. Anda dapat menyimpan kembali dengan menaruh baris berikut di ``.git/info/grafts`` dalam kloning lokal anda::
pt_br: Entretanto, a informação está `disponível como um arquivo grafts`_. Você pode restaurá-lo colocando as linhas seguintes no arquivo `.git/info/grafts`` de seu clone local::

source: Additionally, the following branches are closed, but their code was never merged into Django and the features they aimed to implement were never finished:
id: Tambahannya, cabang-cabang berikut ditutup, tetapi kode mereka tidak pernah digabung kedalam Django dan fitur-fitur mereka tuju untuk menerapkan tidak pernah selesai:
pt_br: Adicionalmente, as branches abaixo estão fechadas, mas os seus códigos nunca foram mesclados com o Django e as funcionalidades que elas buscavam implementar nunca foram concluídas:

source: All of the above-mentioned branches now reside in ``attic``.
id: Semua cabang-cabang yang disebutkan diatas sekarang berada di ``attic``.
pt_br: Todas as branches mencionadas acima agora residem em ``attic``.

source: Finally, the repository contains ``soc2009/xxx`` and ``soc2010/xxx`` feature branches, used for Google Summer of Code projects.
id: Akhirnya, gudang mengandung fitur cabang ``soc2009/xxx`` dan ``soc2010/xxx``, digunakan untuk proyek Google Summer of Code.
pt_br: Finalmente, o repositório contém as branches de funcionalidade ``soc2009/xxx`` e ``soc2010/xxx``, usadas para os projetos Google Summer of Code.

source: Tags
id: Tag

source: Each Django release is tagged and signed by a :ref:`releaser <releasers-list>`.
id: Setiap terbitan Django ditandai dan ditanda tangani oleh :ref:`releaser <releasers-list>`.
pt_br: Para cada release do Django é feita uma tag e assinada por um :ref:`releaser <releasers-list>`.

source: The tags can be found on GitHub's `tags`_ page.
id: Etiket dapat ditemukan pada halaman `tags`_ GitHub.
pt_br: As `tags`_ podem ser encontradas na página do GitHub,

source: How is Django Formed?
id: Bagaimana Django Dibentuk?
pt_br: Como o Django é formado?

source: This document explains how to release Django.
id: Dokumen ini menjelaskan bagaimana menerbitkan Django.
pt_br: Este documento explica como fazer uma release do Django.

source: **Please, keep these instructions up-to-date if you make changes!** The point here is to be descriptive, not prescriptive, so feel free to streamline or otherwise make changes, but **update this document accordingly!**
id: **Harap, jaga petunjuk-petunjuk ini terbaru jika anda membuat perubahan!** Titiknya disini adalah menjadi lebih menggambarkan, bukan memberi petunjuk, jadi silahkan untuk mempersingkat atau jika tidak buat perubahan, tetapi **perbaharui dokumen ini sesuai dengan itu!**
pt_br: **Por favor, mantenha essas instruções atualizadas se você fizer mudanças!** A ideia aqui é ser descritivo, não prescritivo, então sinta-se à vontade para agilizar ou por outro lado fazer mudanças, mas **atualize este documento de acordo**

source: Overview
id: Ikhtisar
pt_br: Visão Geral

source: There are three types of releases that you might need to make:
id: Terdapat tiga jenis terbitan yang anda mungkin butuh untuk dibuat:
pt_br: Existem três tipos de releases que você pode precisar fazer:

source: Security releases: disclosing and fixing a vulnerability. This'll generally involve two or three simultaneous releases -- e.g. 1.5.x, 1.6.x, and, depending on timing, perhaps a 1.7 alpha/beta/rc.
id: Terbitan keamanan: Membuka dan memperbaiki kerentanan. Ini akan secara umum melibatkan dua atau tiga terbitan berkelanjutan -- sebagai contoh 1.5.x, 1.6.x, dan, tergantung pada pewaktuan, mungkin 1.7 alpha/beta/rc.
pt_br: Releases de segurança: divulgação e correção de uma vulnerabilidade. Isto provavelmente irá envolver duas ou três release simultâneas -- ex. 1.5.x, 1.6.x, e, dependendo do momento, talvez 1.7 alpha/beta/rc.

source: Regular version releases: either a final release (e.g. 1.5) or a bugfix update (e.g. 1.5.1).
id: Terbitan versi reguler: salah satu terbitan akhir (sebagai contoh 1.5) atau pembaharuan perbaikan kesalahan (sebagai contoh 1.5.1).
pt_br: Releases de versões regulares: tanto uma release final (ex. 1.5) ou uma atualização de correção de bugs (ex. 1.5.1).

source: Pre-releases: e.g. 1.6 alpha, beta, or rc.
id: Pra-terbitan: sebagai contoh alpha, beta, atau rc.
pt_br: Pre-release: ex. 1.6 alpha, beta, ou rc.

source: The short version of the steps involved is:
id: Versi pendek dari langkah-langkah bersangkutan adalah:
pt_br: Uma curta versão dos passos envolvidos é a seguinte:

source: If this is a security release, pre-notify the security distribution list one week before the actual release.
id: Jika ini adalah terbitan keamanan, beritahu daftar penyebaran keamanan satu minggu sebelum terbitan sebenarnya.
pt_br: Se esta é uma release de segurança, pre-notificar a lista de distribuição de segurança uma semana antes da release atual.

source: Proofread the release notes, looking for organization and writing errors. Draft a blog post and email announcement.
id: Proofread catatan terbitan, menacri kesalahan organisasi dan penulisan. Konsep sebuah penempatan blog dan pengumuman surel.
pt_br: Revisar as notas de release, buscando por melhor organização e erros de escrita. Esboçar um post de blog e um e-mail de anúncio.

source: Update version numbers and create the release package(s).
id: Perbaharui angka versi dan buat paket terbitan.
pt_br: Atualizar os números de versão e criar um ou mais pacotes de release.

source: Upload the package(s) to the ``djangoproject.com`` server.
id: Unggah paket ke peladen ``djangoproject.com``.
pt_br: Fazer upload do pacote (ou dos pacotes) para o servidor ``djangoproject.com``.

source: Upload the new version(s) to PyPI.
id: Unggah versi terbaru ke PyPI.
pt_br: Fazer upload da nova versão (ou versões) para o PyPI.

source: Declare the new version in the admin on ``djangoproject.com``.
id: Nyatakan versi baru di admin pada ``djangoproject.com``.
pt_br: Declare a nova versão no adimn em ``djangoproject.com``.

source: Post the blog entry and send out the email announcements.
id: Tempatkan masukan blog dan kirim pengumuman surel.
pt_br: Postar a entrada no blog e enviar os anúcios de e-mail.

source: Update version numbers post-release.
id: Perbaharui angka versi pasca-terbitan.
pt_br: Atualizar os números de versão pós-release.

source: There are a lot of details, so please read on.
id: Ada banyak rincian, jadi silahkan lanjutkan membaca.
pt_br: Existem vários detalhes, então por favor continue lendo.

source: Prerequisites
id: Prasyarat
pt_br: Pré-requisitos

source: You'll need a few things before getting started:
id: Anda akan butuh beberapa hal sebelum memulai:
pt_br: Você vai precisar de algumas coisas antes de começar:

source: A GPG key. If the key you want to use is not your default signing key, you'll need to add ``-u you@example.com`` to every GPG signing command below, where ``you@example.com`` is the email address associated with the key you want to use.
id: Kunci GPG. Jika kunci anda ingin gunakan bukan kunci tandantangan awal anda, anda akan butuh menambahkan `-u you@example.com`` ke setiap perintah tandatangan GPG dibawah, dimana ``you@example.com`` adalah alamat surel terhubung dengan kunci anda ingin gunakan.
pt_br: Uma chage GPG. Se a chave que você quer usar não é sua chave de assinatura padrão, você vai precisar adicionar ``-u you@example.com`` para cada comando de assinatura GPG abaixo, onde ``you@example.com`` é um endereço de email associado com a chave que você quer usar.

source: An install of some required Python packages::
id: Sebuah pemasangan dari beberapa membutuhkan paket Python::
pt_br: A instalação de alguns pacotes requeridos pelo Python::

source: Access to Django's record on PyPI. Create a file with your credentials:
id: Akses ke rekaman Django pada PyPI. Buat sebuah berkas dengan mandat anda:
pt_br: Acesso ao registro do Django no PyPI. Criar um arquivo com suas credenciais:

source: Access to the ``djangoproject.com`` server to upload files.
id: Akses pada peladen ``djangoproject.com`` untuk mengunggah berkas.
pt_br: Acessar o servidor de ``djangoproject.com`` para atualizar os arquivos.

source: Access to the admin on ``djangoproject.com`` as a "Site maintainer".
id: Akses pada admin di ``djangoproject.com`` sebagai "Perawat situs".
pt_br: Acesso para o admin em ``djangoproject.com`` como um "Site maintainer".

source: Access to post to ``django-announce``.
id: Akses untuk menempatkan ke ``django-announce``.
pt_br: Acesso para postar em ``django-announce``.

source: If this is a security release, access to the pre-notification distribution list.
id: Jika ini adalah terbitan keamanan, akses ke pemberitahuan daftar penyebaran.
pt_br: Se isso é uma release de segurança, acesso para a lista de distribuição de segurança.
