Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Django originally started at World Online, the Web department of the `Lawrence Journal-World`_ of Lawrence, Kansas, USA.
id: Django aslinya dimulai pada World Online, departemen Jaringan dari `Lawrence Journal-World`_ dari Lawrence, Kansas, USA.
pt_br: Django começou originalmente na World Online, o departamento Web do `Lawrence Journal-World`_ de Lawrence, Kansas, EUA.

source: Adrian is a Web developer with a background in journalism. He's known in journalism circles as one of the pioneers of "journalism via computer programming", and in technical circles as "the guy who invented Django."
id: Adrian adalah pengembang Jaringan dengan latar belakang jurnalis. Dia dikenal di lingkaran jurnalis sebagai satu dari pelopor dari "jurnalisme melalui pemrograman komputer", dan di lingkaran teknis sebagai "orang yang membuat Django."
pt_br: Adrian é um desenvolvedor Web com um background no jornalismo. Ele é conhecido em círculos do jornalismo como um dos pioneiros do "jornalismo através de programação de computadores", e em círculos técnicos como "o cara que inventou o Django".

source: He was lead developer at World Online for 2.5 years, during which time Django was developed and implemented on World Online's sites. He was the leader and founder of EveryBlock_, a "news feed for your block." He now develops Soundslice_.
id: Dia mempimpin pengembang pada World Online untuk 2.5 tahun, selama waktu Django dikembangkan dan diterapkan di situs World Online. Dia pemimpin dan pendiri dari EveryBlock_, "umpan berita untuk blok anda." Dia sekarang mengembangkan Soundslice_.
pt_br: Ele foi o desenvolvedor líder na World Online por 2.5 anos, durante esse período o Django foi desenvolvido e implementado nos sites da World Online. Ele foi o líder e fundador do EveryBlock_, um "feed de notícias para o seu bloco." Ele agora desenvolve a Soundslice_.

source: Adrian lives in Chicago, USA.
id: Adrian tinggal di Chicago, USA.
pt_br: Adrian vive em Chicago, EUA.

source: Simon is a well-respected Web developer from England. He had a one-year internship at World Online, during which time he and Adrian developed Django from scratch. The most enthusiastic Brit you'll ever meet, he's passionate about best practices in Web development and maintains a well-read `web-development blog`_.
id: Simon adalah pengembang Jaringan sangat-dihargai dari Inggris. Dia mempunyai satu-tahun magang di World Online, selama waktu dia dan Adrian mengembangkan Django dari goresan. Orang inggris paling bersemangat anda pernah temui, dia bergairah tentang praktik terbaik di pengembangan Jaringan dan merawat bacaan-baik `web-development blog`_.
pt_br: Sion é um desenvolvedor web bem respeitado na Inglaterra. Ele tinha um ano de estágio na World Online, durante o período em que ele e Adrian desenvolveram o Django do zero. O britânico mais entusiasmado que você já conheceu, ele é apaixonado por melhores práticas em desenvolvimento Web e mantém um `blog sobre desenvolvimento web`_ bem frrequentado.

source: Simon lives in Brighton, England.
id: Simon tinggal di Brighton, England.
pt_br: Simon vive em Brighton, Inglaterra.

source: Jacob is Director of Platform Security at Heroku_. He worked at World Online for four years, where he helped open source Django and found the Django Software Foundation. Jacob lives on a hobby farm outside of Lawrence where he spends his weekends playing with dirt and power tools.
id: Jacob adalah Direktur dari Platform Security di Heroku_. Dia bekerja di World Online untuk empat tahun, dimana dia membantu Django sumber terbuka dan menemukan Django Software Foundation. Jacob tinggal di hobi bertani diluar Lawrence dimana dia menghabiskan akhir pekan bermain dengan alat kotor dan bertenaga.
pt_br: Jacob é o Diretor da Plataforma de Segurança no Heroku_. Ele trabalhou na World Online por quatro anos, onde ele ajudou a abrir o código fonte do Django e fundar a Django Software Foundation. Jacob vive em uma fazenda de passatempo fora de Lawrence onde ele gasta seus fins de semana brincando com ferramentas poderosas e sujas.

source: Wilson's design-fu is what makes Django look so nice. He created the design that was used for nearly the first ten years on the Django Project website, as well as the current design for Django's acclaimed admin interface. Wilson was the designer for EveryBlock and Rdio_. He now designs for Facebook.
id: Design-fu Wilson adalah apa yang membuat Django terlihat begitu menarik. Dia membuat rancangan yang digunakan untuk hampir 10 tahun pertama pada situs jaringan Django Project, sama baiknya rancangan saat ini untuk antarmuka admin diakui Django. Wilson adalah perancang untuk EveryBlock and Rdio_. Dia sekarang merancang untuk Facebook.
pt_br: O design-fu de Wilson é o que faz o Django parecer tão bonito. Ele criou o design que foi usado por praticamente todos os primeiros dez anos no website do Projeto Django, assim como o design atual da aclamada interface do admin do Django. Wilson era o designer para o EveryBlock e Rdio_. Ele agora trabalha para o Facebook.

source: Wilson lives in San Francisco, USA.
id: Wilson tinggal di San Francisco, USA.
pt_br: Wilson vive em São Fransisco, EUA.

source: The current team
id: Tim saat ini
pt_br: O time atual

source: These are the folks who have a long history of contributions, a solid track record of being helpful on the mailing lists, and a proven desire to dedicate serious time to Django. In return, they've been invited to join the :ref:`core team <core-team>`.
id: Ini adalah teman-teman yang mempunyai sejarah panjang dari sumbangan, jejak rekaman kuat dari menjadi sangat membantu pada daftar penyuratan, dan membuktikan keinginan untuk mengabdikan waktu serius ke Django. Di kembaliannya, mereka diundang untuk bergabung :ref:`core team <core-team>`.
pt_br: Essas são as pessoas que tem uma longa trajetória de contribuições, um histórico sólido de ser construtivo e prestativo nas listas de email, e um desejo provado em dedicar uma boa dose de tempo ao Django. Em retorno, eles foram convidados a entrar no :ref:`core team <core-team>`.

source: At University Luke studied physics and Materials Science and also met `Michael Meeks`_ who introduced him to Linux and Open Source, re-igniting an interest in programming. Since then he has contributed to a number of Open Source projects and worked professionally as a developer.
id: Di Universitas Luke belajar fisika dan Ilmu Material dan juga bertemu `Michael Meeks`_ yang memperkenalkan dia ke Linux dan Sumber Terbuka, memicu kembali ketertarikan dalam pemrograman. Sejak itu dia membantu pada sejumlah proyek Sumber Terbuka dan bekerja secara profesional sebagai pengembang.
pt_br: Na Universidade Luke estudou física e ciência dos materiais e também conheceu `Michael Meeks`_ que introduziu ele ao Linux e ao Open Source, re-conectando um interesse em programação. Desde então ele tem contribuído para um número de projetos Open Source e trabalhou profissionalmente como um desenvolvedor.

source: Luke has contributed many excellent improvements to Django, including database-level improvements, the CSRF middleware and many unit tests.
id: Luke mempunyai sumbangan banyak perbaikan yang hebat pada Django, termasuk perbaikan tingkatan-basisdata, middleware CSRF dan banyak deretan satuan.
pt_br: Luke contribuiu com muitas melhorias excelentes para o Django, incluindo melhorias no nível de banco de dados, o middleware CSRF e vários testes unitários.

source: Luke currently works for a church in Bradford, UK, and part-time as a freelance developer.
id: Luke saat ini bekerja untuk gereja di Bradford, UK, dan paruh-waktu sebagai pengembang bebas.
pt_br: Luke atualmente trabalha para uma igreja em Bradford, UK, e meio período como um desenvolvedor freelancer.

source: Russell studied physics as an undergraduate, and studied neural networks for his PhD. His first job was with a startup in the defense industry developing simulation frameworks. Over time, mostly through work with Django, he's become more involved in Web development.
id: Russell belajar fisika sebagai sarjana, dan belajar jaringan saraf untuk PhD dia. Pekerjaan pertama dia dengan memulai di industri pertahanan mengembangkan kerangka kerja simulasi. Berulang kali, kebanyakan melalui bekerja dengan Django, dia menjadi lebih terlibat dalam pengembangan Jaringan.
pt_br: Russel estudou física na graduação, e estudo redes neurais para o seu PhD. O seu primeiro trabalho foi com uma startup na indústria de defesa desenvolvendo frameworks de simulação. Com o passar do tempo, principalmente através de trabalho com o Django, ele se tornou mais involvido com desenvolvimento Web.

source: Russell has helped with several major aspects of Django, including a couple major internal refactorings, creation of the test system, and more.
id: Russel telah membantu dengan beberapa aspek utama dari Django, termasuk sepasang refactor internal utama, pembuatan dari sistem percobaan, dan lebih.
pt_br: Russel ajudou no Django em diversos aspectos, incluindo refatorações internas grandes, a criação do sistema de testes, e muito mais.

source: Russell lives in the most isolated capital city in the world — Perth, Australia.
id: Russell tinggal di ibu kota paling terpencil di dunia -- Pertah, Australia.
pt_br: Russell vive na cidade capital mais isolada do mundo — Perth, Australia.

source: James has been one of Django's release managers, and also contributes to the documentation and provide the occasional bugfix.
id: James telah menjadi salah satu dari pengelola terbitan Django, dan juga menyumbang pada dokumentasi dan kadang-kadang menyediakan perbaikan kesalahan.

source: James came to Web development from philosophy when he discovered that programmers get to argue just as much while collecting much better pay. He lives in San Mateo, California and previously worked at World Online and Mozilla; currently, he's part of the Web engineering team at `Clover`_.
id: James datang ke pengembangan Jaringan dari filosofi ketika dia menemukan bahwa pemrograman bisa berdebat hanya sebanyak selagi mengumpulkan gaji lebih baik. Dia tinggal di San Mateo, California dan sebelumnya bekerja di World Online dan Mozilla; saat ini dia bagian dari tim teknisi Jaringan di `Clover`_.

source: He `keeps a blog`_, and enjoys fine port and talking to his car.
id: Dia `keeps a blog`_, dan menikmati pelabuhan indah dan berbicara ke mobilnya.
pt_br: Ele `mantém um blog`_, e gosta de um bom vinho e de falar com o seu carro.

source: Justin Bronn is a computer scientist and attorney specializing in legal topics related to intellectual property and spatial law.
id: Justin Bronn adalah ilmuwan komputer dan pengacara mengkhususkan dalam topik sah terkait pada hak milik intelektual dan hukum ruang.
pt_br: Justin Bronn é um cientista da computação e advogado especializado em questões legais relacionadas a propriedade intelectual e direito espacial.

source: In 2007, Justin began developing ``django.contrib.gis`` in a branch, a.k.a. GeoDjango_, which was merged in time for Django 1.0. While implementing GeoDjango, Justin obtained a deep knowledge of Django's internals including the ORM, the admin, and Oracle support.
id: Di 2007, Justin mulai mengembangkan ``django.contrib.gis`` di cabang, alias GeoDjango_, yang telah digabungkan lambat laun untu Django 1.0. Selagi menerapkan GeoDjango, Justin mendapatkan pengetahuan mendalam dari internal Django termasuk ORM, admin, dan dukungan ORM.
pt_br: Em 2007, Justin começou a desenvolver o ``django.contrib.gis`` em uma branch, também conhecido como GeoDjango_, que foi incorporado durante o Django 1.0. Enquanto implementava o GeoDjango, Justin obteve um profundo conhecimento do funcionamento interno do Django incluindo o seu ORM, o admin, e o suporte ao Oracle.

source: Justin lives in Houston, TX.
id: Justin tinggal di Houston, TX.
pt_br: Justin vive em Houston, TX.

source: Karen has a background in distributed operating systems (graduate school), communications software (industry) and crossword puzzle construction (freelance). The last of these brought her to Django, in late 2006, when she set out to put a Web front-end on her crossword puzzle database. That done, she stuck around in the community answering questions, debugging problems, etc. -- because coding puzzles are as much fun as word puzzles.
id: Karen mempunyai latar belakang dalam menyalurkan sistem operasi (lulusan sekolah), komunikasi perangkat lunak (industri) dan konstruksi teka-teki silang (pekerja lepas). Terakhir dari ini membawa dia ke Django, di akhir 2006, ketika dia berangkat menaruh halaman-depan Jaringan pada basisdata teka-teki silangnya. Yang dilakukannya, dia terjebak disekitar komunitas menjawab pertanyaan, masalah-masalah pencarian kesalahan, dll. -- karena mengkodekan teka-teki menyenangkan seperti teka-teki
pt_br: Karen tem um background em sistemas operacionais distribuídos (graduação), softwares de comunicação (indústria) e construção de palavras cruzadas (freelancer). A última dessas coisas trouxe ela para o Django, no final de 2006, quando ela decidiu colocar um front-end Web em seu banco de dados de palavras cruzadas. Feito isso, ela ficou na comunidade respondendo dúvidas, depurando problemas, etc. -- porque quebra-cabeças envolvendo código são tão divertidos quanto quebra-cabeças envolvendo palavras.

source: Karen lives in Apex, NC, USA.
id: Karen tinggal di Apex, NC, USA.
pt_br: Karen vive em Apex, NC, USA.

source: Jannis graduated in media design from `Bauhaus-University Weimar`_, is the author of a number of pluggable Django apps and likes to contribute to Open Source projects like virtualenv_ and pip_.
id: Jannis lulus di media perancangan dari `Bauhaus-University Weimar`_, adalah penulis dari sejumlah aplikasi sumpalan Django dan suka membantu untuk proyek Sumber Terbuka seperti virtualenv_ dan pip_.
pt_br: Jannis se graduou em design de mídia na `Bauhaus-University Weimar`_, é o autor de muitos apps plugáveis do Django e gosta de contribuir com projetos Open Source como virtualenv_ e pip_.

source: He has worked on Django's auth, admin and staticfiles apps as well as the form, core, internationalization and test systems. He currently works at Mozilla_.
id: Dia telah bekerja di penulis Django, admin dan aplikasi berkas tetap sama halnya formulir, inti, internasionalisasi dan percobaan sistem. Dia saat ini bekerja di Mozilla_.
pt_br: Ele tem trabalhado nos apps auth do Django, admin e staticfiles assim como no form, core, internacionalização e sistema de testes. Ele trabalha atualmente na Mozilla_.

source: Jannis lives in Berlin, Germany.
id: Jannis tinggal di Berlin, Jerman.
pt_br: Jannis vivem em Berlin, Alemanha.

source: Andrew is a freelance Python developer and tinkerer, and has been developing against Django since 2007. He graduated from Oxford University with a degree in Computer Science, and has become most well known in the Django community for his work on South, the schema migrations library.
id: Andrew adalah pekerja lepas pengembang Python dan tukang pateri, dan telah mengembangkan terhadap Django sejak 2007. Dia lulus dari Universitas Oxford dengan tingkatan di Ilmu Komputer, dan telah menjadi paling dikenal baik di komunitas Django untuk pekerjaannya pada South, pustaka skema perpindahan.
pt_br: Andrew é um desenvolvedor Python freelancer e tinkerer, e tem desenvolvido para o Django desde 2007. Ele se graduou na Universidade de Oxford com um diploma em Ciência da Computação, e se tornou mais conhecido na comunidade Django pelo seu trabalho no South, a biblioteca de esquemas de migrações.

source: Andrew lives in San Francisco, CA, USA.
id: Andrew tinggal di San Francisco, CA, USA.
pt_br: Andrew vive em São Francisco, CA, USA.

source: Carl has been a Django user since 2007 (long enough to remember queryset-refactor, but not magic-removal), and builds web apps at OddBird_. He became a Django contributor by accident, because fixing bugs is more interesting than working around them.
id: Carl telah pengguna Django sejak 2007 (cukup panjang untuk mengingat queryset-refactor, tetapi bukan magic-removal), dan membangun aplikasi ajringan pada OddBird_. Dia menjadi penyumbang Django kebetulan, karena memperbaiki kesalahan lebih menarik daripada memecahkan mereka.
pt_br: Carl tem sido um usuário do Django desde 2007 (tempo o suficiente para lembrar da queryset-refactor, mas não da magic-removal), e constrói aplicações web na OddBird_. Ele se tornou um contribuidor do Django por acidente, porque corrigir bugs é mais interessante que trabalhar em volta deles.

source: Carl lives in Rapid City, SD, USA.
id: Carl tinggal di Rapid City, SD, USA.
pt_br: Carl vive na cidade de Rapid City, SD, USA.

source: Ramiro has been reading Django source code and submitting patches since mid-2006 after researching for a Python Web tool with matching awesomeness and being pointed to it by an old ninja.
id: Ramiro telah membaca kode sumber Django dan mengajukan tambalan sejak pertengahan 2006 setelah menacri untuk alat Python Web pencocokan mengagumkan dan yang menunjuk kepadanya oleh seorang ninja tua.
pt_br: Ramiro tem lido o código fonte do Django e submetido patches desde mid-2006 depois de pesquisar por ferramenta Web Python com correspondência formidável e ser apontado para ela por um velho ninja.

source: A software developer in the electronic transactions industry, he is a living proof of the fact that anyone with enough enthusiasm can contribute to Django, learning a lot and having fun in the process.
id: Seorang pengembang perangkat lunak di industri transaksi elektronik, dia bukti hidup dari fakta bahwa siapapun dengan antusias yang cukup dapat membantu Django, belajar banyak dan bersenang-senang dalam pengolahan.
pt_br: Um desenvolvedor de software na indústria de transações eletrônicas, ele é uma prova viva do fato que qualquer pessoa com entusiasmo o suficiente pode contribuir com o Django, aprendendo bastante e se divertindo no processo.

source: Ramiro lives in Córdoba, Argentina.
id: Ramiro tinggal di Córdoba, Argentina.
pt_br: Ramiro vive em Córdoba, Argentina.

source: Chris has been submitting patches and suggesting crazy ideas for Django since early 2006. An advocate for community involvement and a long-term triager, he is still often found answering questions in the `#django` IRC channel.
id: Chris telah mengajukan tambalan dan menyarankan ide gile untuk Django sejak awal 2006. Pengacara untuk keterlibatan komunitas dan penyortir jangka panjang, dia masih sering ditemukan menjawab pertanyaan di saluran IRC `#django`.

source: Chris lives in Napier, New Zealand (adding to the pool of Oceanic core developers). He works remotely as a developer for `Lincoln Loop`_.
id: Chris tinggal di Napier, Selandia Baru (menambahkan ke kolam pengembang inti Oceanic). Dia bekerja secara terpencil sebagai pengembang untuk `Lincoln Loop`_.
pt_br: Chris vive em Napier, Nova Zelândia (adicionando ao grupo de desenvolvedores da Oceânia). Ele trabalha remotamente como desenvolvedor para `Lincoln Loop`_.

source: Honza first discovered Django in 2006 and started using it right away, first for school and personal projects and later in his full-time job. He contributed various patches and fixes mostly to the newforms library, newforms admin and, through participation in the Google Summer of Code project, assisted in creating the :ref:`model validation <validating-objects>` functionality.
id: Honza pertama kali menemukan Django di 2006 dan mulai menggunakannya, pertama untuk sekolah dan proyek pribadi dan kemudian dalam pekerjaan waktu-penuhnya. Dia menyumbang beragam tambalan dan perbaikan kebanyakan pada pustaka newform, admin newform dan, melalui keikutsertaan di proyek Google Summer of Code, dibantu dalam membuat fungsionalitas :ref:`model validation <validating-objects>`.
pt_br: Honza descobriu o Django pela primeira vez em 2006 e começou a usá-lo imediatamente, primeiro para a escola e projetos pessoais e depois no seu trabalho de período integral. Ele contribuiu com vários patches e correções em sua grande maioria para as bibliotecas newforms, newforms admin e, através da participação no Google Summer of Code Project, ajudou a criar a funcionalidade :ref:`model validation <validating-objects>`.

source: He is currently working for `Whiskey Media`_ in San Francisco developing awesome sites running on pure Django.
id: Dia saat ini bekerja untuk `Whiskey Media`_ di San Francisco mengembangkan situs-situs mengagumkan berjalan pada Django murni.
pt_br: Ele está trabalhando atualmente para `Whiskey Media`_ em São Francisco desenvolvendo sites incríveis rodando em Django puro.

source: When exploring Web frameworks for an independent study project in the fall of 2008, Tim discovered Django and was lured to it by the documentation. He enjoys contributing to the docs because they're awesome.
id: Ketika menjelajah kerangka Django untuk proyek belajar berdiri sendiri di musim gugur 2008, Tim menemukan Django dan terpikat dengannya dengan dokumentasi. Dia menikmati membantu ke dokumen karena mereka mengagumkan.
pt_br: Ao explorar frameworks Web para um projeto de estudos independente no outono de 2008, Tim descobriu o Django e foi fisgado para ele pela documentação. Ele gosta de contribuir para a documentação porque elas são incríveis.

source: Tim works as a software engineer and lives in Philadelphia, PA, USA.
id: Tim bekerja sebagai software engineer dan tinggal di Philadelphia, PA, USA.
pt_br: Tim trabalha como um engenheiro de software e vive em Filadélfia, PA, USA.

source: Paul found Django in 2008 while looking for a more structured approach to web programming. He stuck around after figuring out that the developers of Django had already invented many of the wheels he needed. His passion for breaking (and then fixing) things led to his current role working to maintain and improve the security of Django.
id: Paul menemukan Django di 2008 selagi melihat untuk pendekatan terstruktur pada pemrograman jaringan. Dia terjebak setelah menyadari bahwa pengembang Django sudah membuat banyak dari wheel dia butuhkan. Semangat dia untuk memecahkan (dan kemudian memperbaiki) hal-hal membawa ke peran dia saat ini bekerja untuk merawat dan meningkatkan keamanan dari Django.
pt_br: Paul encontrou Django em 2008 enquanto procurava por uma forma estruturada de fazer programação web. Ele ficou depois de descobrir que os desenvolvedores do Django já tinham inventado muitas das rodas que ele precisava. Sua paixão por quebrar (e então consertar) coisas o levou ao seu papel atual de manter e melhorar a segurança do Django.
