Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Julien has a background in software engineering and human-computer interaction. As a Web developer, he enjoys tinkering with the backend as much as designing and coding user interfaces. Julien discovered Django in 2007 while doing his PhD in Computing Sciences. Since then he has contributed patches to various components of the framework, in particular the admin. Julien was a co-founder of the `Interaction Consortium`_. He now works at Odopod_, a digital agency based in San Francisco, CA, USA.
id: Julien mempunyai latar belakang dalam teknisi perangkat lunak dan interaksi komputer-manusia. Sebagai pengembang Jaringan, dia menikmati mengutak-atik dengan backend sebanyak merancang dan mengkode antarmuka pengguna. Julien menemukan Django di 2007 selagi melakukan PhD di Ilmu Komputer. Sejak itu dia telah menyumbang tambalan ke beragam komponen dari kerangka kerja, di khususnya admin. Julien adalah rekan pendiri dari `Interaction Consortium`_. Dia sekarang bekerja di Odopod_, agen digital berbasis di San Francisco, CA, USA.
pt_br: Julien tem um background em engenharia de software e interação humano-computador. Como um desenvolvedor Web, ele gosta de mexer com o backend tanto quanto projetar e programar interfaces de usuário. Julien descobriu o Django em 2007 quando fazia o seu PhD em Ciência da Computação. Desde então ele tem contribuído com patches em vários componentes do framework, em particular o admin. Julien foi um co-fundador do `Interaction Consortium`_. Ele agora trabalha na Odopod_, uma agência digital baseada em São Francisco, Ca, USA.

source: Aymeric is an engineer with a background in mathematics and computer science. He chose Django because he believes that software should be simple, explicit and tested. His perfectionist tendencies quickly led him to triage tickets and contribute patches.
id: Aymeric adalah teknisi dengan latar belakang di matematika dan ilmu komputer. Dia memilih Django karena dia percaya bahwa perangkat lunak harus sederhana, jelas dan teruji. Kecenderungan sempurnanya dengan cepat membawa dia memberikan tiket dan sumbangan tambalan.
pt_br: Aymeric é um engenheiro com um background em matemática e ciência da computação. Ele escolheu o Django porque ele acredita que o software deve ser simples, explícito e testado. As suas tendências perfeccionistas rapidamente o levaram a atuar na triagem de tickets e patches.

source: Aymeric has a pragmatic approach to software engineering, can't live without a continuous integration server, and likes proving that Django is a good choice for enterprise software.
id: Aymeric mempunyai pendekatan pragmatis pada teknisi perangkat lunak, tidak dapat hidup tanpa peladen penggabungan berkelanjutan, dan suka membuktikan bahwa Django adalah pilihan bagus untuk perangkat lunak perusahaan.
pt_br: Aymeric tem uma abordagem pragmática para a engenharia de software, não pode viver sem um servidor de integração contínua, e gosta de provar que o Django é uma boa escolha para software de empresarial.

source: Claude is a former teacher who fell in love with free software at the beginning of the 21st century. He's now working as freelancer in Web development in his native Switzerland. He has found in Django a perfect match for his needs of a stable, clean, documented and well-maintained Web framework.
id: Claude adalah mantan guru yang jatuh cinta dengan perangkat lunak bebas pada permulaan abad 21. Dia sekarang bekerja sebagai pekerja lepas di pengembangan Jaringan di Switzerland. Dia telah menemukan di Django kecocokan sempurna untuk kebutuhannya dari stabil, bersih, terdokumentasi dan baik-dirawat kerangka kerja Jaringan.
pt_br: Claude é um antigo professor que se apaixonou por software livre no começo do século 21. Ele agora trabalha como um freelancer no desenvolvimento Web em sua nativa Suiça. Ele encontrou no Django o par perfeito para as suas necessidades de um framework Web estável, limpo, documentado e bem mantido.

source: He's also helping the GNOME Translation Project as maintainer of the Django-based `l10n.gnome.org`_.
id: Dia juga membantu GNOME Translation Project sebagai perawat dari `l10n.gnome.org`_ berbasis Django.
pt_br: Ele também está ajudando o Projeto de Tradução do GNOME como mantenedor do site baseado em Django `l10n.gnome.org`_.

source: Anssi works as a developer at Finnish National Institute for Health and Welfare. He is also a computer science student at Aalto University. In his work he uses Django for developing internal business applications and sees Django as a great match for that use case.
id: Anssi bekerja sebagai pengembang di Lembaga Nasional Finlandia untuk Kesehatan dan Kesejahteraan. Dia juga mahasiswa ilmu komputer di Universitas Aalto. Di pekerjaannya dia menggunakan Django untuk mengembangkan aplikasi bisnis internal dan melihat Django sebagai kecocokan yang hebat untuk penggunaan kasus itu.
pt_br: Anssi trabalha como desenvolvedor no Instituto Nacional Finlandês para a Saúde e o Bem Estar. Ele também é um estudante de ciência da computação na Universidade de Aalto. Em seu trabalho ele usa o Django para desenvolver aplicações de negócios internas e vê o Django como uma ótima combinação para esse caso de uso.

source: Anssi is interested in developing the object relational mapper (ORM) and all related features. He's also a fan of benchmarking and he tries keep Django as fast as possible.
id: Anssi tertarik dalam mengembangkan object relational mapper (ORM) dan semua fitur terhubung. Dia juga penggemar dari pembandingan dan dia mencoba menjaga Django secepat mungkin.
pt_br: Anssi está interessado em desenvolver o Object Relational Mapper (ORM) e todas as funcionalidades relacionadas. Ele também é um fã de benchmarking e tenta deixar o Django o mais rápido possível.

source: Florian is currently studying Physics at the `Graz University of Technology`_. Soon after he started using Django he joined the `Ubuntuusers webteam`_ to work on *Inyoka*, the software powering the whole Ubuntuusers site.
id: Florian saat ini belajar Fisika di `Graz University of Technology`_. Segera setelah dia mulai menggunakan Django dia bergabung `Ubuntuusers webteam`_ untuk bekerja pada *Inyoka*, perangkat lunak yang memberikan tenaga situs Ubuntuusers.
pt_br: Florian está estudando atualmente Física na `Graz University of Technology`_. Logo depois de ele começar a usar o Django ele se uniu ao `Ubuntuusers webteam`_ para trabalhar no *Inyoka*, o software energizando todo o site do Ubuntuusers.

source: For the time being he lives in Graz, Austria (not Australia ;)).
id: Untuk saat ini dia tinggal di Graz, Austria (not Australia ;)).
pt_br: Por enquanto ele vive em Graz, Austria (não Autralia ;)).

source: Jeremy was rescued from corporate IT drudgery by Free Software and, in part, Django. Many of Jeremy's interests center around access to information.
id: Jeremy diselamatkan dari pekerjaan membosankan perusahaan IT oleh Free Software dan, dalam bagian, Django. Banyak dari pust minat Jeremy sekitar akses ke informasi.
pt_br: Jeremy foi resgatado das drogas da TI corporativa pelo Software Livre e, em parte, pelo Django. A maioria dos interesses de Jeremy são em torno do acesso à informação.

source: Jeremy was the lead developer of Pegasus News, one of the first uses of Django outside World Online, and has since joined Votizen, a startup intent on reducing the influence of money in politics.
id: Jeremy adalah pemimpin pengembang dari Pegasus News, satu dari penggunaan Django diluar World Online, dan sejak bergabung Votizen, niat memulai pada mengurangi keterlibatan dari uang dalam politik.
pt_br: Jeremy foi o desenvolvedor líder da Pegasus News, uma das primeiras utilizações do Django fora da World Online, e desde então entrou na Votizen, uma startup tentando reduzir a influência do dinheiro na política.

source: He serves as DSF Secretary, organizes and helps organize sprints, cares about the health and equity of the Django community. He has gone an embarrassingly long time without a working blog.
id: Dia melayani sebagai Sekretaris DSF, mengorganisasikan dan membantu mengatur sprint, peduli tentang kesehatan dan keaddilan dari komunitas Django. Dia telah pergi dengan mengagetkan dalam waktu lama tanpa mengerjakan blog.
pt_br: Ele atua como secretário da Django Software Foundation, e ajuda a organizar sprints, se preocupa com a saúde e equidade da comunidade Django. Ele passou um longo tempo embaraçoso sem um blog funcionando.

source: Jeremy lives in Mountain View, CA, USA.
id: Jeremy tinggal di Mountain View, CA, USA.
pt_br: Jeremy vive em Mountain View, CA, USA.

source: Bryan found Django 0.96 through a fellow designer who was evangelizing its use. It was his first foray outside of the land that was PHP-based templating. Although he has only ever used Django for personal projects, it is the very reason he considers himself a designer/developer hybrid and is working to further design within the Django community.
id: Bryan menemukan Django 0.96 melalui sesama perancang yang mengajak pindah penggunaannya. Itu adalah perampokan pertama diluar tanah cetakan berbasis-PHP. Meskipun dia hanya menggunakan Django untuk proyek pribadi, itu adalah alasan dia pertimbangkan diri dia perancang/pengembang berbeda-beda dan bekerja untuk perancangan lebih lanjut dalam komunitas Django.
pt_br: Bryan encontrou o Django 0.96 através de um colega designer que estava incentivando o seu uso. Esta foi sua primeira incursão fora da terra que era o template baseado em PHP. Embora ele só tenha usado o Django para projetos pessoais, ele é a principal razão pela qual ele se considera um designer/desenvolvedor híbrido e está trabalhando para promover o design dentro da comunidade Django.

source: Bryan works as a designer at GitHub by day, and masquerades as a `vlogger`_ and `shoutcaster`_ in the after-hours. Bryan lives in Los Angeles, CA, USA.
id: Bryan bekerja sebagai perancang pada GitHub disiang hari, dan menyamar sebagai `vlogger`_ dan `shoutcaster`_ setelah jam kerja. Bryan tinggal di Los Angeles, CA, USA.
pt_br: Bryan trabalha como designer no GitHub de dia, e se disfarça como um `vlogger`_ e `shoutcaster`_ nas horas livres. Bryan vive em Los Angeles, CA, USA.

source: Simon is a mathematics student who discovered Django while searching for a replacement framework to an in-house PHP entity. Since that faithful day Django has been a big part of his life. So far, he's been involved in some ORM and forms API fixes.
id: Simon adalah pelajar matematika yang menemukan Django selama pencarian untuk penggantian kerangka kerja pada wujud PHP di rumah. Sejak itu hari keyakinan Django telah menjadi bagian besar dari hidup dia. Sejauh ini, tidak telah terlibat di beberapa ORM dan perbaikan API formulir.
pt_br: Simon é um estudante de matemática que descobriu o Django enquanto buscava por um framework para substituir uma entidade PHP interna. Desde esse exato dia o Django tem sido uma grande parte de sua vida. Até agora, ele tem se envolvido em algumas correções no ORM e na API de forms.

source: Apart from contributing to multiple open source projects he spends most of his spare-time playing `Ultimate Frisbee`_ and working part-time at this awesome place called `Reptiletech`_.
id: Selain dari membantu banyak proyek sumber terbuka dia habiskan kebanyakan dari waktu-luang nya bermain `Ultimate Frisbee`_ dan bekerja paruh-waktu pada tempat yang mengagumkan disebut `Reptiletech`_.
pt_br: Além de contribuir para múltiplos projetos open source ele gastou a maior parte do seu tempo livre jogando `Ultimate Frisbee`_ e trabalhando meio período nesse lugar fascinante chamado `Reptiletech`_.

source: Simon lives in Montréal, Québec, Canada.
id: Simon tinggal di Montréal, Québec, Canada.
pt_br: Simon vive em Montréal, Québec, Canada.

source: Donald found Python and Django in 2007 while trying to find a language, and web framework that he really enjoyed using after many years of PHP. He fell in love with the beauty of Python and the way Django made tasks simple and easy. His contributions to Django focus primarily on ensuring that it is and remains a secure web framework.
id: Donald menemukan Python dan Django di 2007 selagi mencoba menemukan bahasa, dan kerangka kerja jaringan yang dia nikmati penggunaan setelah banyak tahun dari PHP. Dia jatuh cinta dengan keindahan Python dan cara Django membuat tugas sederhana dan mudah. Sumbangan dia pada Django fokus utamanya memastikan bahwa itu tetap kerangka kerja jaringan yang aman.
pt_br: Donald encontrou o Python e Django em 2007 enquanto tentava achar uma linguagem, e um framework web que ele realmente gostasse de usar depois de muitos anos de PHP. Ele se apaixonou com a beleza do Python e a maneira como o Django faz tarefas ficarem simples e fáceis. Suas contribuições para o Django focam principalmente garantir que ele seja e continue sendo um framework seguro.

source: Donald currently works at `Nebula Inc`_ as a Software Engineer for their security team and lives in the Greater Philadelphia Area.
id: Donald saat ini bekerja di `Nebula Inc`_ sebagai Software Engineer untuk tim keamanan mereka dan tinggal di Greater Philadelphia Area.
pt_br: Donald atualmente trabalha na `Nebula Inc`_ como um Engenheiro de Software para o seu time de segurança e vive na grande área da Filadélfia.

source: Marc started life on the web using Django 1.2 back in 2010, and has never looked back. He was involved with rewriting the class-based view documentation at DjangoCon EU 2012, and also helped to develop `CCBV`_, an additional class-based view reference tool.
id: Marc mulai hidup pada jaringan menggunakan Django 1.2 lalu di 2010, dan tidak pernah berpaling. Dia terlibat dengan menulis kembali dokumentasi tampilan berbasis-kelas pada DjangoCon EU 2012, dan juga membantu mengembangkan `CCBV`_, tambahan alat acuan tampilan berbasis-kelas.
pt_br: Marc começou sua vida na web usando Django 1.2 em 2010, e nunca mais olhou para trás. Ele se envolveu com a reescrita da documentação de views baseadas em classes na DjangoCon EU 2012, e também ajudou a desenvolver `CCBV`_, uma ferramenta de referência adicional para view baseada em classe.

source: Marc is currently a full-time parent, part-time developer, and lives in Oxford, UK.
id: Marc saat ini orang tua penuh-waktu, pengembang paruh-waktu, dan tinggal di Oxford, UK.
pt_br: Marc é atualmente um pai em tempo integral, desenvolvedor meio período, e vive em Oxford, UK.

source: Shai started working with Python back in 1998, and with Django just before 1.0. He is a Free Software enthusiast, but life happens, and he was driven by consulting gigs to contribute to the Oracle and SQL Server backends of South, and then the Oracle backend of Django itself. Finally, he joined core to help maintain the Oracle backend.
id: Shai mulai bekerja dengan Python kembali di 1998, dan dengan Django sebelum 1.0. Dia adalah penggemar Perangkat Lunak bebas, tetapi hidup terjadi, dan dia didorong oleh pekerjaan untuk menyumbang pada backend Oracle dan SQL Server dari South, dan kemudian backend Oracle dari Django itu sendiri. Akhirnya, dia bergabung ke inti untuk membantu merawat backend Oracle.
pt_br: Shai começou trabalhando com Python em 1998, e com Django pouco antes da 1.0. Ele é um entusiasta do Software Livre, mas a vida segue, e ele foi dirigido por trabalhos de consultoria a contribuir com os backends da Oracle e do SQL Server no South, e depois no backend Oracle do próprio Django, ele entrou no core para ajudar a manter o backend Oracle.

source: Shai works for `Platonix`_, a small consulting company he started with a few friends in 1996, and lives near Tel Aviv, Israel.
id: Shai bekerja untuk `Platonix`_, perusahaan konsultan kecil dia mulai dengan sedikit teman di 1996, dan tinggal dekat Tel Aviv, Israel.
pt_br: Shai trabalha para a `Platonix`_, uma pequena empresa de consultoria que ele começou com alguns amigos em 1996, e vive próximo a Tel Aviv, Israel.

source: Baptiste discovered Django around the 1.2 version and promptly switched away from his homegrown PHP framework. He started getting more involved in the project after attending DjangoCon EU 2012, mostly by triaging tickets and submitting small patches.
id: Baptiste menemukan Django sekitar versi 1.2 dan segera beralih dari kerangka PHP lokal. Dia mulai mendapatkan lebih keterlibatan di proyek setelah menghadiri DjangoCon EU 2012, kebanyakan oleh mendahulukan tiket dan mengajukan tambalan kecil.
pt_br: Baptiste descobriu o Django por volta da versão 1.2 e prontamente trocou o seu framework PHP caseiro. Ele começou a se envolver mais no projeto depois de ir a DjangoCon EU 2012, atua mais com a triagem de tickets e submissão de pequenos patches.

source: Baptiste currently lives in Budapest, Hungary and works for `M2BPO`_, a small French company providing services to architects.
id: Baptiste saat ini tinggal di Budapest, Hongaria dan bekerja untuk `M2BPO`_, perusahaan kecil Perancis menyediakan layanan pada arsitek.
pt_br: Baptiste vive atualmente em Budapeste, Hungria e trabalha para `M2BPO`_, uma pequena companhia francesa fornecendo serviços para arquitetos.

source: Daniele unexpectedly became a Django developer on 29th April 2009. Since then he has relied daily on Django's documentation, which has been a constant companion to him. More recently he has been able to contribute back to the project by helping improve the documentation itself.
id: Daniele tidak menduga menjadi pengembang Django sejak 29 April 2009. Sejak saat itu dia bergantung harian pada dokumentasi Django, yang telah menjadi teman setia kepadanya. Baru-baru ini dia dapat untuk menyumbang kembali ke proyek dengan membantu memperbaiki dokumentasi itu sendiri.
pt_br: Daniele inexperadamente se tornou um desenvolvedor Django no dia 29 de Abril de 2009. Desde então ele tem confiado diariamente na documentação Django, que tem sido uma compania constante para ele. Mais recentemente ele tem sido capaz de contribuir com o projeto ajudando a melhorar a própria documentação.

source: He is the author of `Arkestra`_ and `Don't be afraid to commit`_. He lives in Cardiff, Wales, and works for `Divio`_.
id: Dia adalah penulis dari `Arkestra`_ and `Don't be afraid to commit`_. Dia tinggal di Cardiff, Wales, dan bekerja untuk `Divio`_.
pt_br: Ele é o autor de `Arkestra`_ e `Don't be afraid to commit`_. Ele vive em Cardiff, Wales, e trabalha para `Divio`_.

source: Erik started using Django in the days of 1.2. His largest contribution to Django was ``GenericIPAddressField``, and he has worked on all sorts of patches since. While developing with Django, he always keeps a little list of even the slightest Django frustrations, to tackle them at a later time and prevent other developers from having to deal with the same issues.
id: Erik mulai menggunakan Django di hari dari 1.2. Sumbangan terbesarnya pada Django adalah ``GenericIPAddressField``, dan dia telah bekerja pada semua urutan dari tambalan. Selagi mengembangkan dengan Django, dia selalu menjaga daftar kecil daribahkan sedikit keputusasaan Django, untuk memecahkan mereka pada mendatang dan mencegah pengembang lain dari mendapatkan urusan dengan masalah-masalah yang sama.
pt_br: Erik começou a usar Django nos dias da 1.2. Sua maior contribuição para o Django foi o ``GenericIPAddressField``, e ele tem trabalhado em todos os tipos de patches desde então. Enquanto desenvolve com o Django, ele sempre mantém uma pequena lista contendo até as menores frustrações com o Django, para enfrentá-las em momento oportuno e prevenir outros desenvolvedores de ter que lidar com os mesmos problemas.

source: Erik is an independent app maker, mostly developing web and mobile apps, as `Solid Links`_. He also enjoys helping ordinary developers to build safer web apps, for which Django is already a great start, and developed `Erik's Pony Checkup`_ with that goal in mind. Erik lives in Amsterdam, The Netherlands.
id: Erik adalah pembuat aplikasi berdiri sendiri, kebanyakan mengembangkan jaringan dan aplikasi berjalan, seperti `Solid Links`_. Dia juga menikmati membantu pengembang biasa untuk membangun aplikasi jaringan aman, yang Django sudah mulai, dan mengembangkan `Erik's Pony Checkup`_ dengan tujuan tersebut dalam pikiran. Erik tinggal di Amsterdam, Belanda.
pt_br: Erik é um criador de apps independente, desenvolvendo em grande parte apps web e mobile, como o `Solid Links`_. Ele também gosta de ajudar outros desenvolvedores a construir apps web mais seguros, para os quais o Django já é um grande início, e desenvoveu `Erik's Pony Checkup`_ com esse objetivo em mente, Erik vive em Amsterdam, The Netherlands.

source: Loïc studied telecommunications engineering and works as an independent software developer and consultant.
id: Loïc belajar teknik telekomunikasi dan bekerja sebagai pengembang perangkat lunak berdiri sendiri dan konsultan.
pt_br: Loïc estudou engenharia em telecomunicações e trabalha como um desenvolvedor de software independente e consultor.

source: He discovered Django in 2008 shortly before the 1.0 release and has been hooked ever since. He contributes mostly to Django's ORM and Form components. His main contributions include advanced query prefetching, streamlining QuerySet and Manager to improve query reusability, and a significant refactor of forms error handling.
id: Dia menemukan Django di 2008 sesaat sebelum terbitan 1.0 dan telah ketagihan sejak itu. Dia menyumbang kebanyakan pada ORM Django dan komponen Formulir. Sumbangan utamanya termasuk permintaan lanjut pengambilan, pelurusan QuerySet dan Manager untuk memperbaiki permintaan kegunaan, dan refaktor penting dari penanganan kesalahan formulir.
pt_br: Ele descobriu Django em 2008 pouco antes da release 1.0 e tem estado viciado desde então. Ele contribui em grande parte com o ORM do Django e os componentes do Form. Suas principais contribuições incluem pré-busca avançada de consultas, agilizar o QuerySet e o Manager para melhorar a reusabilidade da query, e uma refatoração significativa dos formulários de manipulação de erros.

source: Loïc is originally from the South of France and currently lives in Bangkok, Thailand.
id: Loïc aslinya dari Perancis Selatan dan saat ini tinggal di Bangkok, Thailand.
pt_br: Loïc é originariamente do sul da França e vive atualmente em Bangkok, Tailândia.

source: Michael started running Django on Windows against a Microsoft SQL Server (MSSQL) database in 2008. He quickly became the maintainer of the ``django-mssql`` database backend. Much of his involvement with Django relates to the ORM, the private 3rd party database API, and using Django on Windows.
id: Michael mulai menjalankan Django pada Windoes terhadap basisdata Microsoft SQL Server (MSSQL) di 2008. Dia dengan cepat menjadi perawat dari backend basisdata pihak ke 3 ``django-mssql``. Kebanyakan dari keterlibatan dia dengan Django terkait pada ORM, API pribadi basisdata pihak ke 3, dan menggunakan Django pada Windows.

source: Michael lives in Cary, NC, USA.
id: Michael tinggal di Cary, NC, USA.
pt_br: Michael vive em Cary, NC, USA.
