Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: As the project matures, contributions go way beyond code. Here's an incomplete list of areas where contributions may be considered for joining the core team, in no particular order:
id: Ketika proyek jatuh tempo, sumbangan pergi jauh melampaui kode. Ini adakah sebuah daftar tidak lengkap dari kawasan dimana sumbangan mungkin dianggap untuk bergabung tim inti, tanpa urutan tertentu:
pt_br: À medida em que o projeto amadurece, contribuições vão além do código. Segue uma lista incompleta de áreas onde contribuições podem ser consideradas para entrar no core team, sem uma ordem em particular:

source: Working on community management and outreach
id: Bekerja pada pengelolaan komunitas dan diluar jangkauan
pt_br: Trabalhar no gerenciamento da comunidade e alcance

source: Providing support on the mailing-lists and on IRC
id: Menyediakan dukungan pada daftar-penyuratan dan pada IRC
pt_br: Fornecer suporte nas listas de email e no IRC

source: Writing patches (code, docs, or tests)
id: Menulis tambalan (kode, dokumen, atau percobaan)
pt_br: Escrever patches (código, documentação ou testes)

source: Reviewing patches (code, docs, or tests)
id: Meninjau kembali tambalan (kode, dokumen, atau percobaan)
pt_br: Revisão de patches (código, documentação ou testes)

source: Participating in design decisions
id: Ikut serta d keputusan rancangan
pt_br: Participação em decisões de projeto

source: Providing expertise in a particular domain (security, i18n, etc.)
id: Menyediakan keahlian dalam ranah tertentu (keamanan, i18n, dll.)
pt_br: Fornecer expertise em uma área de conhecimento em particular (segurança, i18n, etc)

source: Managing the continuous integration infrastructure
id: Mengelola perpaduan infrastruktur berkelanjutan
pt_br: Gerenciar a infraestrutura de integração contínua

source: Managing the servers (website, tracker, documentation, etc.)
id: Mengelola peladen (jaringan situs, pelacak, dokumentasi, dll.)
pt_br: Gerenciar os servidores (website, tracker, documentação, etc.)

source: Maintaining related projects (djangoproject.com site, ex-contrib apps, etc.)
id: Merawat proyek terkait (situs djangoproject.com, aplikasi ex-contrib, dll.)
pt_br: Manutenção de projetos relacionados (site djangoproject.com, ex-contrib apps, etc.)

source: Creating visual designs
id: Membuat rancangan penglihatan
pt_br: Criação de design visual

source: Very few areas are reserved to core team members:
id: Sangat sedikit kawasan disediakan untuk anggota tim inti:
pt_br: pouquíssimas áreas são reservadas para membros do core team:

source: Reviewing security reports
id: Meninjau kembali laporan keamanan
pt_br: Revisão de relatórios de segurança

source: Merging patches (code, docs, or tests)
id: Menggabungkan tambalan (kode, dikumen, atau percobaan)
pt_br: Mesclar patches (código, documentação, ou testes)

source: Packaging releases
id: Terbitan pemaketan
pt_br: Gerando as releases

source: Core team membership acknowledges sustained and valuable efforts that align well with the philosophy and the goals of the Django Project.
id: Keanggotaan tim inti mengakui usaha terus-menurs dan berharga yang menyelearsakan dengan baik dengan filosofi dan tujuan dari Proyek Django.
pt_br: A adesão ao core team pressupõe esforços contínuos e valorosos que se alinhem bem com a filosofia e os objetivos do Projeto Django.

source: It is granted by a four fifths majority of votes cast in a core team vote and no veto by the technical board.
id: Itu diberikan oleh empat per lima mayoritas suara di pemilihan tim inti dan tidak ada pelarangan oleh badan teknis.
pt_br: Ela é dada por uma maioria de quatro quintos dos votos expressos em uma votação do core team e nenhum veto pelo conselho técnico.

source: Core team members are always looking for promising contributors, teaching them how the project is managed, and submitting their names to the core team's vote when they're ready. If you would like to join the core team, you can contact a core team member privately or ask for guidance on the :ref:`Django Core Mentorship mailing-list <django-core-mentorship-mailing-list>`.
id: Anggota tim inti selalu mencari penyumbang yang menjanjikan, mengajarkan mereka bagaimana proyek dikelola, dan mengajukan nama-nama mereka ke pilihan tim inti ketika mereka siap. Jika anda suka bergabung tim inti, anda dapat menghubungi seorang anggota tim inti secara pribadi atau meminta panduan pada :ref:`Django Core Mentorship mailing-list <django-core-mentorship-mailing-list>`.
pt_br: Membros do core team estão sempre procurando por voluntários promissores, ensinando a eles como o projeto é gerenciado, e indicando os seus nomes a voto pelo core team quando eles estão prontos. Se você gostaria de se juntar ao core team, você pode contatar um membro privadamente ou pedir apoio na :ref:`lista de email Django Core Mentorship <django-core-mentorship-mailing-list>`.

source: There's no time limit on core team membership. However, in order to provide the general public with a reasonable idea of how many people maintain Django, core team members who have stopped contributing are encouraged to declare themselves as "past team members". Those who haven't made any non-trivial contribution in two years may be asked to move themselves to this category, and moved there if they don't respond. Past team members lose their privileges such as voting rights and commit access.
id: Tidak ada batasan waktu di keanggotaan tim inti. Bagaimanapun, agar menyediakan khalayak ramai dengan ide yang cukup beralasan dari bagaimana banyak orang merawat Django, anggota tim Django yang berhenti menyumbang dianjurkan untuk menyatakan diri mereka sendiri sebagai "anggota tim lampau". Mereka yang tidak membuat sumbangan bukan-sepele dalam dua tahun mungkin diminta untuk memindahkan mereka sendiri ke dalam kategori ini, dan dipindahkan jika mereka tidak menjawab. Anggota tim lampau kehilangan hak mereka seperti hak memilih dan akses perbaikan.
pt_br: Não existe prazo máximo para adesão ao core team. Entretanto, para conseguir dar ao público em geral uma ideia razoável de como tantas pessoas mantém o Django, membros do core team que tenham parado de contribuir são encorajados a se autodeclararem como "membros antigos do time". Aqueles que não tenham feito qualquer contribuição não trivial em até dois anos podem ser solicitados a mudar para esta categoria, e são movidos para lá caso eles não respondam. Membros antigos do time perdem os seus privilégios como direito a votar e permissão de commit.

source: Technical board
id: Badan teknis
pt_br: Conselho Técnico

source: The technical board is a group of experienced and active committers who steer technical choices. Their main concern is to maintain the quality and stability of the Django Web Framework.
id: Badan teknis adalah kelompok berpengalaman dan aktif pembuat perbaikan yang mengendalikan pilihan teknis. Perhatian utama mereka adalah merawat kualitas dan kestabilan dari Django Web Framework.
pt_br: O conselho técnico é um grupo de commiters experientes e ativos que guiam as escolhas técnicas. A sua principal preocupação é manter a qualidade e a estabilidade do Framework Web Django.

source: The technical board holds two prerogatives:
id: Badan teknis memegang dua hak istimewa:
pt_br: O conselho técnico possui duas prerrogativas:

source: Making major technical decisions when no consensus is found otherwise. This happens on the |django-developers| mailing-list.
id: Membuat keputusan teknis utama ketika tidak ada kemufakatan ditemukan. Ini terjadi pada daftar penyuratan |django-developers|.
pt_br: Fazer grandes escolhas técnicas quando nenhum consenso é encontrado de outra forma. Isso acontece na lista de email |django-developers|.

source: Veto a grant of commit access or remove commit access. This happens on the ``django-core`` mailing-list.
id: Melarang pemberian dari akses perbaikan atau akses pindahkan perbaikan. Ini terjadi pada daftar-penyuratan ``django-core``.

source: In both cases, the technical board is a last resort. In these matters, it fulfills a similar function to the former Benevolent Dictators For Life.
id: Dalam kedua kasus, badan teknis adalah usaha terakhir. Dalam masalah ini, itu memenuhi fungsi yang mirip pada bekas Benevolent Dictators For Life.
pt_br: Nos dois casos, o conselho técnico é o último recurso. Nessas questões, ele preenche uma função similar ao antigo Ditador Benevolente Vitalício.

source: When the board wants to exercise one of these prerogatives, it must hold a private, simple majority vote on the resolution. The quorum is the full committee — each member must cast a vote or abstain explicitly. Then the board communicates the result, and if possible the reasons, on the appropriate mailing-list. There's no appeal for such decisions.
id: Ketika badan ingin menggunakan satu dari hak istimewa, itu harus memegang pribadi, larangan mayoritas sederhana pada keputusan. Kuorum adalah panitia penuh -- setiap anggota harus memberikan pilihan atau abstain dengan jelas. Kemudian badan mengkomunikasikan hasilnya, dan jika memungkinkan alasan, pada daftar-penyuratan yang sesuai. Tidak ada naik banding untuk keputusan tersebut.
pt_br: Quando o conselho quer fazer uso de uma dessas prerrogativas, ele precisa manter uma maioridade simples e privada dos votos na resolução. O quorum é o full committee -- cada membro deve dar um voto ou se abster explicitamente. Depois o conselho comunica o resultado, e se possível as razões, na lista de email apropriada. Não existe recurso para essas decisões.

source: In addition, at its discretion, the technical board may act in an advisory capacity on non-technical decisions.
id: Selain itu, atas kebijakannya, badan teknis mungkin bertindak dalam kapasitas penasehat pada keputusan bukan teknis.
pt_br: Adicionalmente, a sua própria discrição, o conselho técnico podem atuar de forma consultiva em decisões não técnicas.

source: The technical board is an elected group of five committers. They're expected to be experienced but there's no formal seniority requirement. Its current composition is published :ref:`here <technical-board-list>`.
id: Badan teknis adalah kelompopk yang dipilih dari lima panitia. Mereka diharapkan menjadi berpengalaman tetapi tidak ada persyaratan senioritas. Posisi saat ini diumumkan :ref:`here <technical-board-list>`.
pt_br: o conselho técnico é um grupo eleito por cinco committers. Espera-se que eles sejam experientes mas não há requisitos formais para isso. Sua composição atual é publicada :ref:`aqui <technical-board-list>`.

source: A new board is elected after each feature release of Django. The election process is managed by a returns officer nominated by the outgoing technical board. The election process works as follows:
id: Badan baru terpilih setelah setiap terbitan fitur Django. Pengolahan pemilihan dikelola oleh petugas kembali diusulkan oleh badan teknis demisioner. Pengolahan pemilihan bekersa sebagai berikut:
pt_br: Um novo conselho é eleito após cada feature release do Django. O processo de eleição é gerenciado por um returns officer nomiado pelo conselho técnico de saída. O processo de eleição ocorre da seguinte maneira:

source: Candidates advertise their application for the technical board to the team.
id: Calon-calon mengiklankan aplikasi mereka untuk badan teknis ke tim.
pt_br: Candidatos divulgam suas candidaturas para conselho técnico

source: They must be committers already. There's no term limit for technical board members.
id: Mereka seharusnya sudah pembuat perbaikan. Tidak ada batasan ketentuan untuk anggota badan teknis.
pt_br: Eles já devem ser committers. Não existe prazo limite para membros do conselho técnico.

source: Each team member can vote for zero to five people among the candidates. Candidates are ranked by the total number of votes they received.
id: Setiap anggota tim dapat memilih untuk nol sampai 5 orang terhaadp calon-calon. Calon-calon dinilai berdasarkan jumlah angka dari pilihan mereka telah terima.
pt_br: Cada membro do time pode votar entre 0 e 5 pessoas entre os candidatos. Candidatos são rankeados pelo número total de votos que eles receberem.

source: In case of a tie, the person who joined the core team earlier wins.
id: Dalam kasus pertalian, orang yang bergabung tim inti lebih awal menang.
pt_br: No caso de um empate, a pessoa que entrou no core team primeiro vence.

source: Both the application and the voting period last between one and two weeks, at the outgoing board's discretion.
id: Kedua aplikasi dan periode pemilihan terakhir diantara satu dan dua minggu, pada kebijaksanaan badan demisioner.
pt_br: Tanto a candidatura quanto o período de votação duram entre uma e duas semanas, dependendo do critério do conselho técnico de saída.

source: Changing the organization
id: Merubah organisasi
pt_br: Mudando a organização

source: Changes to this document require a four fifths majority of votes cast in a core team vote and no veto by the technical board.
id: Perubahan pada dokumen ini membutuhkan empat per lima mayoritas dari pilihan dimasukkan di pilihan tim inti dan tidak memilih oleh badan teknis.
pt_br: Mudanças neste documento requerem uma maioria de quatro quintos dos votos expressos em uma votação do core team e nenhum veto pelo conselho técnico.

source: Django's release process
id: Pengolahan terbitan Django
pt_br: Processo de release do Django

source: Official releases
id: Terbitan resmi
pt_br: Releases oficiais

source: Since version 1.0, Django's release numbering works as follows:
id: Sejak versi 1.0, penomoran terbitan Django bekerja seperti berikut:
pt_br: Desde a versão 1.0, As releases do Django são numeradas da seguinte forma:

source: Versions are numbered in the form ``A.B`` or ``A.B.C``.
id: Versi di nomori dalam bentuk ``A.B`` or ``A.B.C``.
pt_br: Versões são numeradas na forma ``A.B`` ou ``A.B.C``.

source: ``A.B`` is the *feature release* version number. Each version will be mostly backwards compatible with the previous release. Exceptions to this rule will be listed in the release notes.
id: ``A.B`` adalah angka versi *terbitan fitur*. Setiap versi akan kebanyakan sesuai kebelakang dengan terbitan sebelumnya. Pengecualian ke aturan ini akan didaftarkan di catatan terbitan.
pt_br: ``A.B`` é o número de versão da *feature release*. Cada versão será em grande parte compatível com as releases anteriores . Exceções a essa regra são listadas nas notas da release.

source: ``C`` is the *patch release* version number, which is incremented for bugfix and security releases. These releases will be 100% backwards-compatible with the previous patch release. The only exception is when a security or data loss issue can't be fixed without breaking backwards-compatibility. If this happens, the release notes will provide detailed upgrade instructions.
id: ``C`` adalah angka versi *terbitan tanggalan*, yang menaik untuk perbaikan kesalahan dan terbitan keamanan. Terbitan ini akan 100% sesuai kebelakang dengan terbitan tambalan sebelumnya. Hanya pengecualian ketika keamanan atau masalah kehilangan data tidak dapat diperbaiki tanpa merusak kesesuaian lebelakang. Jika ini terjadi, catatan terbitan akan menyediakan petunjuk peningkatan rincian.
pt_br: ``C`` é o número de versão da *patch release*, que é incrementada por correções de bug e releases de segurança. Essas releases serão 100% compatíveis com a patch release anterior. A única exceção é quando problemas de segurança ou de perda de dados não podem ser corrigidos sem quebrar a compatibilidade com versões anteriores. Se isso acontecer, as notas da release irão fornecer instruções detalhadas de upgrade.

source: Before a new feature release, we'll make alpha, beta, and release candidate releases. These are of the form ``A.B alpha/beta/rc N``, which means the ``Nth`` alpha/beta/release candidate of version ``A.B``.
id: Sebelum terbitan fitur baru, kami akan membuat terbitan alpha, beta, dan calon terbitan. Ini adalah bentuk ``A.B alpha/beta/rc N``, yang berarti ``Nth`` alpha/beta/calon terbitan dari versi ``A.B``.
pt_br: Antes de uma nova feature release, nós vamos fazer releases alpha, beta e release candidate das versões ``A.B``.

source: In git, each Django release will have a tag indicating its version number, signed with the Django release key. Additionally, each release series has its own branch, called ``stable/A.B.x``, and bugfix/security releases will be issued from those branches.
id: Di git, setiap terbitan Django akan mempunyai etiket yang menunjukkan angka versi, ditandatangi dengan kunci terbitan Django. Selai itu, setiap rangkaian terbitan mempunai cabang tersendiri, dipanggil ``stable/A.B.x``, terbitan perbaikan kesalahan/keamanan akan diterbitkan dari cabang-cabang tersebut.
pt_br: No git, cada release do Django irá ter uma tag indicando o seu número de versão , assinada com a chave de releases do Django. Adicionalmente, cada śerie de releases tem a su própria branch, chamada de ``stable/A.B.x``, e releases de segurança ou correção de bugs serão geradas dessas branches.

source: For more information about how the Django project issues new releases for security purposes, please see :doc:`our security policies <security>`.
id: Untuk informasi lebih tentang bagaimana proyek Django mengeluarkan terbitan baru untuk tujuan keamanan, silahkan lihat :doc:`our security policies <security>`.
pt_br: Para mais informações sobre como o projeto Django emite novas releases para propósitos de segurança, por favor veja :doc:`nossa política de segurança <security>`.

source: Feature release
id: Terbitan akan datang

source: Feature releases (A.B, A.B+1, etc.) will happen roughly every eight months -- see `release process`_ for details. These releases will contain new features, improvements to existing features, and such.
id: Terbitan fitur (A.B, A.B+1, dll.) akan terjadi kurang lebih setiap delapan bulan -- lihat `release process`_ untuk rincian. Terbitan ini akan mengandung fitur baru, perbaikan pada fitur yang ada, dan sebagainya.
pt_br: Feature releases (A.B, A.B+1, etc.) irão ocorrer mais ou menos a cada oito meses -- veja `processo de release`_ para detalhes. Essas releases irão conter novas funcionalidades, melhorias para funcionalidades existentes, e similares.

source: Patch release
id: Terbitan tambalan

source: Patch releases (A.B.C, A.B.C+1, etc.) will be issued as needed, to fix bugs and/or security issues.
id: Terbitan tambalan (A.B.C, A.B.C+1, etc.) akan diterbitkan ketika dibutuhkan, untuk memperbaiki kesalahan dan/atau masalah keamanan.
pt_br: Patch releases (A.B.C, A.B.C+1, etc.) serão emitidas quando necessário, para corrigir bugs e /ou problemas de segurança.

source: These releases will be 100% compatible with the associated feature release, unless this is impossible for security reasons or to prevent data loss. So the answer to "should I upgrade to the latest patch release?" will always be "yes."
id: Terbitan ini akan 100% cocok dengan terbitan fitur yang terkait, meskipun ini sangat tidak mungkin untuk alasan keamanan atau untuk mencegah kehilangan data. Jadi jawaban pada "apakah Saya tingkatkan ke terbitan tambalan terakhir?" akan selalu "ya."
pt_br: Essas releases serão 100% compatíveis com a feature release associada, a não ser que isso seja impossível por questões de segurança ou para prevenir perda de dados. Então a resposta para "será que devo atualizar para a última patch release?" sempre será "sim".

source: Long-term support release
id: Terbitan dukungan jangka-panjang
pt_br: Suporte de longo prazo a uma release

source: Certain feature releases will be designated as long-term support (LTS) releases. These releases will get security and data loss fixes applied for a guaranteed period of time, typically three years.
id: Terbitan fitur tertentu akan dirancang sebagai terbitan long-term support (LTS). Terbitan ini akan mendapatkan perbaikan keamanan dan kehilangan data diberlakukan untuk jaminan masa dari waktu, secara khusus tiga tahun.
pt_br: Certas feature releases serão designadas como sendo de long-term support (LTS). Essas releases irão receber correções de segurança e para perda de dados aplicadas por um período de tempo garantido, tipicamente três anos.

source: See `the download page`_ for the releases that have been designated for long-term support.
id: Lihat `the download page`_ untuk terbitan yang telah dirancang untuk dukungan jangka-panjang.
pt_br: Veja a `página de download`_ para saber quais são as releases que foram designadas como sendo long-term support.

source: Release cadence
id: Irama terbitan
pt_br: Cadência de uma release

source: Starting with Django 2.0, version numbers will use a loose form of `semantic versioning <http://semver.org/>`_ such that each version following an LTS will bump to the next "dot zero" version. For example: 2.0, 2.1, 2.2 (LTS), 3.0, 3.1, 3.2 (LTS), etc.
id: Memulai dengan Django 2.0, angka versi akan menggunakan formulir longgar dari `semantic versioning <http://semver.org/>`_ seperti yang setiap versi mengikuti LTS akan berbenturan dengan versi "dot zero" selanjutnya. Sebagai contoh: 2.0, 2.1, 2.2 (LTS), 3.0, 3.1, 3.2 (LTS), dll.
pt_br: Começando com a versão 2.0 do Django, números de versões irão usar uma forma flexível `de versionamento semântico <http://semver.org/>`_ de modo que cada versão seguinte a uma LTS irá colidir com a próxima versão "ponto zero". Por exemplo: 2.0, 2.1, 2.2 (LTS), 3.0, 3.1, 3.2 (LTS), etc.

source: SemVer makes it easier to see at a glance how compatible releases are with each other. It also helps to anticipate when compatibility shims will be removed. It's not a pure form of SemVer as each feature release will continue to have a few documented backwards incompatibilities where a deprecation path isn't possible or not worth the cost. Also, deprecations started in an LTS release (X.2) will be dropped in a non-dot-zero release (Y.1) to accommodate our policy of keeping deprecation shims for at least two feature releases. Read on to the next section for an example.
id: SemVer membuatnya lebih mudah melihat sekilas bagaimana kesesuaian terbitan dengan satu sama lain. Itu juga membantu mengantisipasi kapan shim kesesuaian akan dipindahkan. Itu bukan murni formulir dari SemVer seeprti setiap terbitan fitur akan memiliki sedikit dokumentasi ketidaksesuaian kebelakang dimana jalur pengusangan tidak memungkinkan atau tidak berharga. Juga, pengusangan dimulai di terbitan LTS (X.2) akan dijatuhkan di terbitan bukan-titik-nol (Y.1) untuk mengakomodasi kebijakan kami dari menjaga pengusangan shim untuk setidaknya dua fitur terbitan. Baca bagian selanjutnya untuk sebuah contoh.
pt_br: Descobrir como as releases são compatíveis entre si fica mais simples com SemVer. Ele também ajuda a antecipar quando calços de compatibilidade serão removidos. Ele não é uma forma pura do SemVer já que cada feature release irá continuar a ter algumas incompatibilidades com versões anteriores documentadas onde o caminho de depreciação não for possível ou onde ele não valha a pena. Além disso, as depreciações que começaram em uma release LTS (X.2) serão descartadas em uma release sem ponto zero (Y.1) para acomodar as nossas políticas de manter os calços de compatibilidade por pelo menos duas feature releases. Leia a próxima seção para um exemplo.

source: Deprecation policy
id: Kebijakan bantahan
pt_br: Política de depreciação
