Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Pull requests at GitHub have only two states: open and closed. The committer who will deal with your pull request has only two options: merge it or close it. For this reason, it isn't useful to make a pull request until the code is ready for merging -- or sufficiently close that a committer will finish it himself.
id: Pull request pada GitHub mempunyai hanya dua keadaan: terbuka dan tertutup. Pembuat perbaikan yang berurusan dengan pull request anda hanya mempunyai dua pilihan: gabung dia atau tutup dia. Untuk alasan ini, itu tidak berguna untuk membuat pull request sampai kode siap digabungkan -- atau cukup menutup itu seorang pembuat perbaikan akan menyelesaikan nya diri sendiri.
pt_br: Pull Requests no GitHub só possuem dois estados: aberto e fechado. O committer que for lidar com o seu pull request só tem duas opções: fazer merge dele ou fechá-lo. Por esta razão, não é útil fazer um pull request enquanto o código não estiver pronto para o merging -- ou suficientemente concluído a ponto de o próprio committer finalizá-lo ele mesmo.

source: Rebasing branches
id: Rebase cabang-cabang
pt_br: Fazendo rebase de branches

source: In the example above, you created two commits, the "Fixed ticket_xxxxx" commit and "Added two more tests" commit.
id: Di contoh diatas, anda membuat dua perbaikan, perbaikan "Fixed ticket_xxxxx" dan perbaikan "Added two more tests".

source: We do not want to have the entire history of your working process in your repository. Your commit "Added two more tests" would be unhelpful noise. Instead, we would rather only have one commit containing all your work.
id: Kami tidak ingin memiliki seluruh riwayat dari pengolahan pekerjaan anda di gudang anda. Perbaikan anda "Added two more tests" akan menjadi kebisingan yang tidak membantu. Malahan, kami bukan hanya mempunyai satu perbaikan mengandung semua pekerjaan anda.
pt_br: Nós não queremos ter o histórico inteiro do seu processo de trabalho no seu repositório. O seu commit "Added two more tests" seria poluído e pouco amigável. Ao invés disso, nós preferimos ter apenas um commit contendo todo o seu trabalho.

source: To rework the history of your branch you can squash the commits into one by using interactive rebase::
id: Untuk bekerja kembali riwayat dari cabang anda anda dapat melumatkan perbaikan kedalam satu dengan menggunakan rebase interaktif::
pt_br: Para retrabalhar o histórico da sua branch você pode esmagar os commits tornando todos eles uma coisa só através do uso interativo do rebase::

source: The HEAD~2 above is shorthand for two latest commits. The above command will open an editor showing the two commits, prefixed with the word "pick".
id: HEAD~2 diatas adalah tangan cepat untuk dua perbaikan terakhir. Perintah diatas akan membuka sebuah penyunting menunjukkan dua perbaikan, diawali dengan kata "pick".
pt_br: O HEAD~2 acima é um atalho para os dois últimos commits. O comando acima irá abrir um editor mostrando os dois commits, prefixados com a palavra "pick".

source: Change "pick" on the second line to "squash" instead. This will keep the first commit, and squash the second commit into the first one. Save and quit the editor. A second editor window should open, so you can reword the commit message for the commit now that it includes both your steps.
id: Rubah "pick" pada baris kedua pada "squash" sebagai gantinya. Ini akan menjaga perbaikan pertama, dan melumat perbaikan kedua kedalam yang pertama. Simpan dan hemtikan penyunting. Jendela penyunting kedua harus terbuka, jadi anda dapat menaruh kata lain pesan perbaikan untuk perbaikan sekarang dimana dia menyertakan kedua langkah-langkah anda.
pt_br: Mude "pick" na segunda linha para "squash". Isso manterá o primeiro commit, e esmagará o segundo commit dentro do primeiro. Salve e feche o editor. Uma segunda janela do editor deverá abrir, de modo que você possa reescrever a mensagem de commit agora que ele está incluindo os seus dois passos.

source: You can also use the "edit" option in rebase. This way you can change a single commit, for example to fix a typo in a docstring::
id: Anda dapat juga menggunakan pilihan "edit" di rebase. Cara ini anda dapat merubah perbaikan tunggal, sebagai contoh untuk memperbaiki salah ketik dalam docstring::
pt_br: Você também pode usar a opção "edit" no rebase. Desta forma você pode mudar um único commit, por exemplo para corrigir um erro de ortografia em uma docstring::

source: If your topic branch is already published at GitHub, for example if you're making minor changes to take into account a review, you will need to force-push the changes::
id: Jika topik cabang anda sudah diterbitkan pada GitHub, sebagai contoh jika anda sedang membuat perubahan kecil untuk diambil ke tinjauan akun, anda akan butuh mendorong-paksa perubahan::

source: Note that this will rewrite history of ticket_xxxxx - if you check the commit hashes before and after the operation at GitHub you will notice that the commit hashes do not match anymore. This is acceptable, as the branch is merely a topic branch, and nobody should be basing their work on it.
id: Catat bahwa ini akan menulis kembali riwayat dari ticket_xxxxx - jika anda memeriksa potongan-potongan perbaikan sebelum dan sesudah tindakan pada GitHub anda akan melihat bahwa potongan-potongan perbaikan tidak cocok lagi. ini dapat diterima, ketika cabang hanya topik cabang, dan tidak seorangpun harus mendasarkan pekerjaan padanya.

source: After upstream has changed
id: Setelah upstream telah berubah
pt_br: Depois que o upstream foi modificado

source: When upstream (``django/django``) has changed, you should rebase your work. To do this, use::
id: Ketika hulu (``django/django``) telah berubah, anda harus rebase pekerjaan anda. Untuk melakukan ini, gunakan::

source: The work is automatically rebased using the branch you forked on, in the example case using ``upstream/master``.
id: Pekerjaan otomatis di rebase menggunakan cabang anda cabangkan, di contoh kasus menggunakan ``upstream/master``.

source: The rebase command removes all your local commits temporarily, applies the upstream commits, and then applies your local commits again on the work.
id: Perintah rebase memindahkan semua perbaikan lokal sementara, berlakukan perbaikan upstream, dan kemudian berlakukan perbaikan lokal anda pada pekerjaan.
pt_br: O comando rebase remove todos os seus commits locais temporariamente, aplica os commits do upstream, e então aplica os seus commits locais novamente.

source: If there are merge conflicts, you will need to resolve them and then use ``git rebase --continue``. At any point you can use ``git rebase --abort`` to return to the original state.
id: Jika ada pertentangan penggabungan, anda akan butuh menyelesaikan mereka dan kemudian menggunakan ``git rebase --continue``. Pada tiap titik anda dapat menggunakan ``git rebase --abort`` untuk mengembalikan ke keadaan asli.

source: Note that you want to *rebase* on upstream, not *merge* the upstream.
id: Catat bahwa anda ingin *rebase* pada upstream, bukan *merge* upstream.
pt_br: Note que você quer fazer *rebase* no upstream, e não *merge* do upstream.

source: The reason for this is that by rebasing, your commits will always be *on top of* the upstream's work, not *mixed in with* the changes in the upstream. This way your branch will contain only commits related to its topic, which makes squashing easier.
id: Alasan untuk ini adalah dengan rebase, perbaikan anda akan selalu *on top of* pekerjaan upstream, bukan *mixed in with* perubahan di upstream. Cara ini cabang anda akan mengandung hanya perbaikan terhubung pada topiknya, yang membuat pelumatan lebiih mudah.
pt_br: A razão para isso é que ao fazer o rebase, os seus commits sempre ficarão *no topo* do trabalho realizado no upstream e não *misturado com* as mudanças do upstream. Desta forma a sua topic branch irá conter somente commits relacionados a ela, o que faz com que o processo de esmagar os seus commits fique mais simples.

source: After review
id: Setelah meninjau
pt_br: Depois de revisar

source: It is unusual to get any non-trivial amount of code into core without changes requested by reviewers. In this case, it is often a good idea to add the changes as one incremental commit to your work. This allows the reviewer to easily check what changes you have done.
id: Itu tidak biasa mendapatkan setiap jumlah bukan sepele dari kode kedalam inti tanpa perubahan diminta oleh peninjau. Di kasus ini, itu adalah sering ide bagus untuk menambahkan perubahan sebagai perbaikan menaik pada pekerjaan anda. Ini mengizinkan peninjau dengan mudah memeriksa perubahan apa anda telah lakukan.
pt_br: É muito incomum receber qualquer porção de código não trivial incluída no core do Django sem quaisquer alterações sendo solicitadas pelos revisores. Neste caso, costuma ser uma boa ideia adicionar as mudanças na forma de um commit incremental para o seu trabalho. Isso permite que os revisores possam checar facilmente quais mudanças você fez.

source: In this case, do the changes required by the reviewer. Commit as often as necessary. Before publishing the changes, rebase your work. If you added two commits, you would run::
id: Dalam kasus ini, melakukan perubahan diwajibkan oleh peninjau. Perbaikan sesering kebutuhan. Sebelum menerbitkan perubahan, bangun tingkatan baru pekerjaan anda. Jika anda menambahkan dua perbaikan, anda harus menjalankan::
pt_br: Neste caso, faça as mudanças solicitadas pelo revisor. Faça commit tão frequentemente quanto necessário. Antes de publicar as mudanças, faça o rebase do seu trabalho. Se você adicionou mais dois commits, você pode rodar o seguinte comando::

source: Squash the second commit into the first. Write a commit message along the lines of::
id: Lumatkan perbaikan kedua kedalam yang pertama. Tulis sebuah pesan perbaikan bersama baris::
pt_br: Esmague o segundo commit dentro do primeiro. Escreva uma mensagem de commit junto das linhas de::

source: Finally, push your work back to your GitHub repository. Since you didn't touch the public commits during the rebase, you should not need to force-push::
id: Akhirnya, kirim kerjaan anda kembali ke gudang GitHub. Sejak anda tidak menyentuk perbaikan umum selama tingkatan dasar baru, anda tidak butuh untuk paksa-kirim::

source: Your pull request should now contain the new commit too.
id: Pull request anda sekarang harus mengandung perbaikan baru juga.
pt_br: O seu pull request deve agora conter um novo commit também.

source: Note that the committer is likely to squash the review commit into the previous commit when committing the code.
id: Catat bahwa pembuat perbaikan kemungkinan melumat tinjauan perbaikan kedalam perbaikan sebelumnya ketika memperbaiki kode.
pt_br: Note que o committer provavelmente irá esmagar o commit revisado dentro de outros commits prévios quando estiver fazendo a submissão do código.

source: Working on a patch
id: Bekerja pada tambalan
pt_br: Trabalhando em um patch

source: One of the ways that developers can contribute to Django is by reviewing patches. Those patches will typically exist as pull requests on GitHub and can be easily integrated into your local repository::
id: Satu cara bahwa pengembang dapat menyumbang ke Django adalah dengan meninjau tambalan-tambalan. Tambalan-tambalan tersebut khususnya ada sebagai pull request pada GitHub dan dapat dengan mudah dipadukan ke dalam gudang lokal anda::
pt_br: Uma das formas que os desenvolvedores podem contribuir com o Django é revisando patches. Esses patches tipicamente existirão na forma de pull requests no GitHub e poderão ser facilmente integrados dentro do seu repositório local::

source: This will create a new branch and then apply the changes from the pull request to it. At this point you can run the tests or do anything else you need to do to investigate the quality of the patch.
id: Ini akan membuat cabang baru dan kemudian memberlakukan perubahan dari pull request ke itu. Pada titik ini anda dapat menjalankan percobaan atau melakukan apapun lainnya anda butuhkan untuk menyelidiki kualitas tambalan.
pt_br: Isso irá criar uma nova branch e então aplicar as mudanças do pull request nela. Neste momento você pode rodar os testes ou fazer qualquer coisa que você precise para investigar a qualidade do patch.

source: For more detail on working with pull requests see the :ref:`guidelines for committers <handling-pull-requests>`.
id: Untuk lebih rinci pada bekerja dengan pull request lihat :ref:`guidelines for committers <handling-pull-requests>`.
pt_br: Para mais detalhes sobre como trabalhar com pull requests veja as :ref:`orientações para committers <handling-pull-requests>`.

source: Summary
id: Ringkasan
pt_br: Resumo

source: Work on GitHub if you can.
id: Bekerja pada GitHub jika anda bisa.
pt_br: Trabalhe no GitHub se você puder.

source: Announce your work on the Trac ticket by linking to your GitHub branch.
id: Umumkan pekerjaan anda di tiket Trac dengan menautkan ke cabang GitHub anda.
pt_br: Anuncie o seu trabalho no ticket do Trac adicionando um link para a sua branch no GitHub.

source: When you have something ready, make a pull request.
id: Ketika anda mempunyai sesuatu yang siap, buat pull request.
pt_br: Quando você tiver algo pronto, faça um pull request.

source: Make your pull requests as good as you can.
id: Buat pull request sebaik anda bisa.
pt_br: Faça os melhores pull requests que você puder fazer.

source: When doing fixes to your work, use ``git rebase -i`` to squash the commits.
id: Ketika melakukan perbaikan ke pekerjaan anda, gunakan ``git rebase -i`` untuk melumat perbaikan.
pt_br: Quando estiver fazendo correçṍes para o seu trabalho, use ``git rebase -i`` para esmagar os commits.

source: When upstream has changed, do ``git fetch upstream; git rebase``.
id: Ketika upstream telah dirubah, lakukan ``git fetch upstream; git rebase``.
pt_br: Quando o upstream tiver sido alterado, faça ``git fetch upstream; git rebase``.

source: Writing documentation
id: Menulis dokumentasi
pt_br: Escrevendo a documentação

source: We place a high importance on consistency and readability of documentation. After all, Django was created in a journalism environment! So we treat our documentation like we treat our code: we aim to improve it as often as possible.
id: Kami menempatkan sangat penting pada konsistensi dan kesiapan dari dokumentasi. Lagipula, Django dibuat dalam lingkungan jurnalis! Jadi kami memperlakukan dokumentasi kami seperti kami memperlakukan kode kami: kami membidik untuk meningkatkannya sesering mungkin.
pt_br: Nós damos uma grande importância a consistência e legibilidade de nossa documentação. Afinal, Django foi criado em um ambiente jornalístico! Então nós tratamos a nossa documentação como nós tratamos o nosso código: nós tentamos melhorá-lo sempre que possível.

source: Documentation changes generally come in two forms:
id: Dokumentasi berubah secara umum datang dalam dua bentuk:
pt_br: Mudanças na documentação geralmente aparecem de duas formas:

source: General improvements: typo corrections, error fixes and better explanations through clearer writing and more examples.
id: Perbaikan umum: pembenaran kesalahan ketik, perbaikan kesalahan dan penjelasan lebih baik melalui penulisan lebih jelas dan lebih contoh.
pt_br: Melhorias gerais: correção de ortografia, correções de erros e melhores explicações através de escrita clara e mais exemplos.

source: New features: documentation of features that have been added to the framework since the last release.
id: Fitur baru: dokumentasi dari ditur yang telah ditambahkan ke kerangka kerja sejak terbitan terakhir.
pt_br: Novas funcionalidades: documentação de funcionalidades que foram adicionadas ao framework desde a última release.

source: This section explains how writers can craft their documentation changes in the most useful and least error-prone ways.
id: Bagian ini menjelaskan bagaimana penulis dapat mengerjakan perubahan dokumentasi mereka dalam cara paling berguna dan setidaknya lawan kesalahan.
pt_br: Esta seção explica como os escritores podem construir suas mudanças na documentação de forma mais eficiente e menos suscetível a erros.

source: Getting the raw documentation
id: Mendapatkan dokumentasi mentah
pt_br: Obtendo a documentação bruta

source: Though Django's documentation is intended to be read as HTML at https://docs.djangoproject.com/, we edit it as a collection of text files for maximum flexibility. These files live in the top-level ``docs/`` directory of a Django release.
id: Meskipun dokumentasi Django diperuntukkan untuk dibaca sebagai HTML di https://docs.djangoproject.com/, kami menyuntingnya sebagai kumpulan dari berkas-berkas teks untuk fleksibel maksimal. Berkas-berkas ini berada di tingkat-atas pelipat ``docs/`` dari terbitan Django.
pt_br: Embora a documentação Django seja feita focando a leitura no formato HTML em https://docs.djangoproject.com/, nós editamos ela como uma coleção de arquivos de texto para maximizar a flexibilidade. Esses arquivos são armazenados no diretório ``docs/`` da release Django.

source: If you'd like to start contributing to our docs, get the development version of Django from the source code repository (see :ref:`installing-development-version`). The development version has the latest-and-greatest documentation, just as it has latest-and-greatest code. We also backport documentation fixes and improvements, at the discretion of the committer, to the last release branch. That's because it's highly advantageous to have the docs for the last release be up-to-date and correct (see :ref:`differences-between-doc-versions`).
id: Jika anda ingin mulai memperbaiki dokumen kami, dapatkan versi pengembangan dari Django dari gudang kode sumber (lihat :ref:`installing-development-version`). Versi pengembangan mempunyai dokumentasi terakhir-dan-terhebat, hanya karena itu memiliki kode terakhir-dan-terhebat. Kami juga backport dokumentasi pembenaran dan perbaikan, pada kebijaksanaan dari pembuat perbaikan, ke cabang terbitan terakhir. Yakni karena itu sangat menguntungkan memiliki dokumen untuk terbitan terakhir menjadi terbaru dan benar (lihat :ref:`differences-between-doc-versions`).
pt_br: Se você gostaria de contribuir com a nossa documentação, pegue a versão de desenvolvimento do Django do nosso repositório de código (veja :ref:`installing-development-version`). A versão de desenvolvimento possui a melhor e mais recente versão da documentação, assim como possui a melhor e mais recente versão do código. Nós também fazemos backport de correções e melhorias na documentação, dependendo da discrição do committer, para a branch da última release. Isto porque é extremamente vantajoso possuir a documentação para a última release correta e atualizada (see :ref:`differences-between-doc-versions`).

source: Getting started with Sphinx
id: Mulai dengan Sphinx
pt_br: Começando trabalhar com o Sphinx

source: Django's documentation uses the Sphinx__ documentation system, which in turn is based on docutils__. The basic idea is that lightly-formatted plain-text documentation is transformed into HTML, PDF, and any other output format.
id: Dokumentasi Django menggunakan sistem dokumentasi Sphinx__, yang pada gilirannya berdasarkan pada docutils__. Ide dasar adalah bahwa dokumentasi teks-tawar berbentuk-ringan dirubah kedalam HTML, PDF, dan bentuk keluaran lainnya.
pt_br: A documentação do Django usa o sistema de documentação Sphinx__, que por sua vez é baseado no docutils__. A ideia básica é que uma documentação em texto plano com formatação simples é transformada em HTML, PDF, e muitos outros formatos.

source: To actually build the documentation locally, you'll currently need to install Sphinx -- ``pip install Sphinx`` should do the trick.
id: Untuk sebenarnya membangun dokumentasi secara lokal, anda saat ini butuh memasang Sphinx -- ``pip install Sphinx`` akan melakukan triknya.
pt_br: Pra efetivamente construir a documentação localmente, você provavelmente terá que instalar o Sphinx -- ``pip install Sphinx`` deve ser o suficiente.

source: Then, building the HTML is easy; just ``make html`` (or ``make.bat html`` on Windows) from the ``docs`` directory.
id: Kemudian, membangun HTML sangat mudah; cukup ``make html`` (atau ``make.bat html`` pada Windows) dari direktori ``docs``.
pt_br: A partir desse momento, gerar o HTML é simples; basta executar o comando ``make html`` (ou ``make.bat html`` no Windows) de dentro do diretório ``docs``.

source: To get started contributing, you'll want to read the :ref:`reStructuredText Primer <sphinx:rst-primer>`. After that, you'll want to read about the :ref:`Sphinx-specific markup <sphinx:sphinxmarkup>` that's used to manage metadata, indexing, and cross-references.
id: Untuk mulai membantu, anda akan ingin membaca :ref:`reStructuredText Primer <sphinx:rst-primer>`. Setelah itu, anda akan ingin membaca tentang :ref:`Sphinx-specific markup <sphinx:sphinxmarkup>` yang digunakan untuk mengelola meta data, pengindeksan, dan acuan-silang.
pt_br: Para começar a contribuir, você vai querer ler o :ref:`reStructuredText Primer <sphinx:rst-primer>`. Depois disso, você vai querer ler sobre :ref:`Sphinx-specific markup <sphinx:sphinxmarkup>` que é usado para gerenciar metadados, indexação e referências cruzadas.

source: How the documentation is organized
id: Bagaimana dokumentasi diatur
pt_br: Como a documentação é organizada

source: The documentation is organized into several categories:
id: Dokumentasi disusun kedalam beberapa kategori:
pt_br: A documentação é organizada em vários categorias:

source: :doc:`Tutorials </intro/index>` take the reader by the hand through a series of steps to create something.
id: :doc:`Tutorials </intro/index>` membawa pembaca dengan tangan melalui rangkaian langkah-langkah untuk membuat sesuatu.
pt_br: :doc:`Tutorials </intro/index>` pega o leitor pelas mãos e o leva através de uma série de passos para criar algo.

source: The important thing in a tutorial is to help the reader achieve something useful, preferably as early as possible, in order to give them confidence.
id: Hal terpenting dalam tutorial ini adalah membantu pembaca mendapatkan sesuatu berguna, lebih disukai seawal mungkin, agar memberikan mereka rasa nyaman.
pt_br: O importante em um tutorial é ajudar o leitor a fazer algo útil, preferencialmente o mais rápido possível, para que ele passe a ganhar confiança.

source: Explain the nature of the problem we're solving, so that the reader understands what we're trying to achieve. Don't feel that you need to begin with explanations of how things work - what matters is what the reader does, not what you explain. It can be helpful to refer back to what you've done and explain afterwards.
id: Jelaskan sifat dari masalah kami sedang tangani, sehingga pembaca mengerti apa kami sedang coba capai. Jangan merasa bahwa anda butuh memulai dengan penjelasan bagaimana hal-hal bekerja - apa masalahnya adalah apa yang pembaca lakukan, bukan apa anda jelaskan. Itu dapat membantu menunjukkan kembali ke apa anda telah lakukan dan jelaskan kemudian.
pt_br: Explique a natureza do problema que estamos tentando resolver, de modo que o leitor entenda o que nós estamos tentando alcançar. Não sinta que você precisa começar com explicações de como as coisas funcionam - o que importa é que o leitor fará, não o que você explica. Pode ser útil lembrar o que você já fez e explicar posteriormente.

source: :doc:`Topic guides </topics/index>` aim to explain a concept or subject at a fairly high level.
id: :doc:`Topic guides </topics/index>` bertujuan untuk menjelaskan konsep atau subjek pada tingkatan yang cukup tinggi.
pt_br: :doc:`Topic guides </topics/index>` buscam explicar um conceito ou um assunto de modo bem abrangente.
