Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Reporting bugs and requesting features
id: Melaporkan kesalahan dan meminta fitur
pt_br: Relatando bugs e solicitando funcionalidades

source: Please report security issues **only** to security@djangoproject.com. This is a private list only open to long-time, highly trusted Django developers, and its archives are not public. For further details, please see :doc:`our security policies </internals/security>`.
id: Silahkan laporkan masalah keamanan **hanya** ke security@djangoproject.com. Ini adalah daftar pribadi hanya buka ke waktu-panjang, sangat dipercaya pengembang Django, dan arsipnya tidak untuk umum. Untuk rincian lebih jauh, silahkan lihat :doc:`our security policies </internals/security>`.
pt_br: Por favor relatar problemas de segurança **somente** em security@djangoproject.com. Esta é uma lista privada acessível apenas para desenvolvedores django veteranos e altamente confiáveis, seu conteúdo não está disponível publicamente. Para mais detalhes, por favor veja :doc: nossas políticas de segurança </internals/security>`.

source: Otherwise, before reporting a bug or requesting a new feature, please consider these general points:
id: Sebaliknya, sebelum melaporkan kesalahan atau meminta fitur baru, silahkan pertimbangkan titik umum ini:
pt_br: Caso contrário, antes de relatar um bug ou solicitar uma nova funcionalidade, por favor leve em consideração esses pontos gerais:

source: Check that someone hasn't already filed the bug or feature request by `searching`_ or running `custom queries`_ in the ticket tracker.
id: Periksa seseorang yang belum mengajukan kesalahan atau permintaan fitur dengan `searching`_ atau menjalankan `custom queries`_ di pelacak tiket.
pt_br: Verifique se alguém já relatou o bug ou solicitou sua funcionalidade fazendo consultas customizadas no rastreador de tickets

source: Don't use the ticket system to ask support questions. Use the |django-users| list or the `#django`_ IRC channel for that.
id: Jangan gunakan sistem tiket untuk meminta dukungan pertanyaan. Gunakan daftar |django-users| atau saluran `#django`_ IRC untuk itu.
pt_br: Não utilize o sistema de tickets para pedir suporte. Para isso utilize a lista |django-users| ou o canal IRC '#django'.

source: Don't reopen issues that have been marked "wontfix" by a core developer. This mark means that the decision has been made that we can't or won't fix this particular issue. If you're not sure why, please ask on |django-developers|.
id: Jangan membuka kembali masalah yang telah ditandai "wontfix" oleh pengembang inti. Tanda ini berarti bahwa keputusan telah dibuat bahwa kami tidak dapat atai tidak akan memperbaiki masalah khusus. Jika anda tidak yakin mengapa, silahkan tanya pada |django-developers|.
pt_br: Não reabra problemas que tenham sido marcados com a tag "wontfix" por um desenvolvedor do projeto. Essa tag significa que a decisão de não corrigir ou a conclusão de que não é possível corrigir foi tomada para esse problema em particular. Se você não sabe ao certo o porquê, por favor pergunte na lista django-developers.

source: Don't use the ticket tracker for lengthy discussions, because they're likely to get lost. If a particular ticket is controversial, please move the discussion to |django-developers|.
id: Jangan menggunakan pelacak tiket untuk obrolan panjang, karena mereka sepertinya hilang. Jika sebagian tiket kontroversial, silahkan pindahkan obrolan ke |django-developers|.
pt_br: Não utilize o rastreador de tickets para discussões importantes, elas provavelmente serão perdidas. Se um ticket em particular é controverso, por favor mova a discussão para a lista django-developers.

source: Reporting bugs
id: Melaporkan kesalahan
pt_br: Relatando bugs

source: Well-written bug reports are *incredibly* helpful. However, there's a certain amount of overhead involved in working with any bug tracking system so your help in keeping our ticket tracker as useful as possible is appreciated. In particular:
id: Penulisan-bagus laporan kesalahan adalah *luar biasa* sangat membantu. Bagaimanapun, ada jumlah tertentu dari atas ikut dalam bekerja dengan sistem pelacakan kesalahan apapun sehingga bantuan anda dalam menjaga pelacak tiket berguna mungkin sangat dihargai. Khususnya:
pt_br: Relatos de bugs bem escritos são *incrivelmente* úteis. Porém, existe uma certa quantidade de sobrecarga envolvida em trabalhar com qualquer sistema de rastreamento de bugs de modo que a sua ajuda em manter nosso rastreador de tickets o mais eficiente possível é muito apreciada. Em particular:

source: **Do** read the :doc:`FAQ </faq/index>` to see if your issue might be a well-known question.
id: **Lakukan** baca :doc:`FAQ </faq/index>` untuk melihat jika masalah anda mungkin menjadi pertanyaan dikenal.
pt_br: **Leia** a FAQ para saber se o seu problema não é uma questão recorrente.

source: **Do** ask on |django-users| or `#django`_ *first* if you're not sure if what you're seeing is a bug.
id: **Lakukan** tanya pada |django-users| atau `#django`_ *pertama* jika anda tidak yakin jika apa yang anda lihat adalah sebuah kesalahan.
pt_br: **Pergunte** na lista django-users ou no canal '#django" *primeiro* se você não tem certeza de que o que você está vendo é realmente um bug.

source: **Do** write complete, reproducible, specific bug reports. You must include a clear, concise description of the problem, and a set of instructions for replicating it. Add as much debug information as you can: code snippets, test cases, exception backtraces, screenshots, etc. A nice small test case is the best way to report a bug, as it gives us an easy way to confirm the bug quickly.
id: **Lakukan** tulis lengkap, dapat digandakan, laporan kesalahan tertentu. Anda harus menyertakan jelas, gambaran ringkas dari masalah, dan kumpulan perintah untuk menggandakannya. Tambah sebanyak informasi mencari kesalahan yang anda bisa: potongan kode, kasus percobaan, pengecualian pelacakan kembali, tampilan layar, dll. Sebuah kasus percobaan kecil adalah jalan terbaik untuk melaporkan sebuah kesalahan, seperti dia memberikan kami jalan untuk memastikan kesalahan dengan cepat.
pt_br: **Escreva** relatos de bugs que sejam reproduzíveis, completos, específicos. Você deve incluir uma descrição limpa, concisa do problema, e um conjunto de instruções para reproduzi-lo. Adicione o máximo de informações de debug que você puder: trechos de código, casos de teste, logs das exceções, screenshots, etc. A melhor forma de relatar um bug é escrevendo um bom e pequeno caso de teste, já que ele nos fornece uma maneira fácil de confirmar o bug rapidamente.

source: **Don't** post to |django-developers| just to announce that you have filed a bug report. All the tickets are mailed to another list, |django-updates|, which is tracked by developers and interested community members; we see them as they are filed.
id: **Jangan** menempatkan ke |django-developers| hanya untuk mengumumkan bahwa anda telah mengajukan laporan kesalahan. Semua tiket disurelkan ke daftar lain, |django-updates|, yang dilacak oleh pengembang dan anggota komunitas yang tertarik; kami melihat mereka seperti yang diajukan.
pt_br: **Não** poste na lista django-developers apenas para anunciar que você acabou de reportar um bug. Todos os novos tickets são enviados para outra lista, django-updates, que é monitorada por desenvolvedores e membros da comunidade interessados; assim que os tickets são criados nós somos avisados.

source: To understand the lifecycle of your ticket once you have created it, refer to :doc:`triaging-tickets`.
id: Untuk memahami siklus hidup tiket anda pertama anda telah membuatnya, mengacu ke :doc:`triaging-tickets`.
pt_br: Para entender o ciclo de vida do seu ticket uma vez que você o tenha criado, veja :doc:`triaging-tickets`.

source: Reporting user interface bugs and features
id: Melaporkan kesalahan antarmua pengguna dan fitur
pt_br: Relatando bugs de interface e funcionalidades

source: If your bug or feature request touches on anything visual in nature, there are a few additional guidelines to follow:
id: Jika kesalahan atau fitur anda menyentuh pada apapun penglihatan dalam alami, terdapat beberapa tambahan panduan untuk diikuti:
pt_br: Se a sua nova funcionalidade ou bug tem a ver com qualquer coisa visual, existem mais algumas regras para seguir:

source: Include screenshots in your ticket which are the visual equivalent of a minimal testcase. Show off the issue, not the crazy customizations you've made to your browser.
id: Sertakan tampilan layar dalam tiket anda yaitu setara penglihatan dari uji kasus minimal. Pamerkan masalah, bukan penyesuaian gila anda tlah buat ke perambah anda.
pt_br: Inclua screenshots no seu ticket que são o equivalente visual de um teste de caso pequeno. Mostre o problema, não as incríveis customizações que você fez no seu navegador.

source: If the issue is difficult to show off using a still image, consider capturing a *brief* screencast. If your software permits it, capture only the relevant area of the screen.
id: Jika masalah sulit untuk ditunjukkan menggunakan gambar diam, pertimbangkan mengambil rekaman layar *singkat*. Jika perangkat lunak anda mengizinkannya, tangkap hanya kawasan yang sesuai dari layar.
pt_br: Se o problema for muito difícil de mostrar usando uma imagem, considere capturar um breve screencast. Se o seu software permitir isso, capture somente a área relevante da tela.

source: If you're offering a patch which changes the look or behavior of Django's UI, you **must** attach before *and* after screenshots/screencasts. Tickets lacking these are difficult for triagers and core developers to assess quickly.
id: Jika anda sedang menawarkan tambalan yang merubah tampilan atau kebiasaan dari UI Django, anda **harus** melampirkan sebelum *dan* sesudah cuplikan layar/rekaman layar. Tiket melacak ini sangat sulit untuk mengurutkan dan pengembang inti untuk menilai dengan cepat.
pt_br: Se você está oferecendo um patch que muda a aparência ou o comportamento da UI do Django, você **deve** anexar screenshots/screencasts do antes *e* o depois . Tickets que não possuem isso são difíceis de fazer a triagem e para os desenvolvedores do núcleo avaliarem rapidamente.

source: Screenshots don't absolve you of other good reporting practices. Make sure to include URLs, code snippets, and step-by-step instructions on how to reproduce the behavior visible in the screenshots.
id: Cetak layar tidak membebaskan anda dari praktik pelaporan bagus. pastikan menyertakan URL, potongan kode, dan petunjuk langkah-demi-langkah pada bagaimana membuat kembali kebiasaan nampak dalam cetak layar.
pt_br: Screencasts não absolvem você de outras boas práticas ao reportar um bug. Certifique-se de incluir URLs, trechos de código, e instruções passo-a-passo sobre como reproduzir o comportamento exibido nas screenshots.

source: Make sure to set the UI/UX flag on the ticket so interested parties can find your ticket.
id: Pastikan menyetel bendera UI/UX pada tiket sehingga pihak tertarik dapat menemukan tiket anda.
pt_br: Certifique-se de incluir a tag UI/UX no ticket para que outras partes interessadas no problema possam encontrá-lo.

source: Requesting features
id: Meminta fitur
pt_br: Solicitando novas funcionalidades

source: We're always trying to make Django better, and your feature requests are a key part of that. Here are some tips on how to make a request most effectively:
id: Kami selalu mencoba membuat Django lebih baik, dan permintaan fitur anda adalah kunci bagian dari itu. Disini ada beberapa tip dalam bagaimana membuat permintaan paling efektif:
pt_br: Nós estamos sempre tentando deixar o Django melhor, e as suas solicitações por novas funcionalidades são uma peça chave nesse processo. Aqui vão algumas dicas sobre como fazer uma solicitação de forma eficiente.

source: Make sure the feature actually requires changes in Django's core. If your idea can be developed as an independent application or module — for instance, you want to support another database engine — we'll probably suggest that you to develop it independently. Then, if your project gathers sufficient community support, we may consider it for inclusion in Django.
id: Pastikan fitur sebenarnya membutuhkan perubahan di inti Django. Jika ide anda dapat dikembangkan sebagai aplikasi terpisah atau modul - sebagai contoh, anda ingin mendukung mesin basisdata lain - kami akan mungkin menduga bahwa anda untuk mengembangkannya secara mandiri. Kemudian, jika proyek anda mengumpulkan cukup dukungan komunitas, kami mungkin mempertimbangkannya untuk menyertakan di Django.
pt_br: Certifique-se de que a sua funcionalidade requer mudanças no núcleo do Django. Se a sua ideia pode ser desenvolvida como um módulo ou uma aplicação independente — como por exemplo, você deseja suporte a um novo banco de dados — nós provavelmente vamos sugerir que você desenvolva isso de forma independente. Só então, se o seu projeto tiver suporte suficiente da comunidade, nós podemos considerá-lo para inclusão dentro do Django.

source: First request the feature on the |django-developers| list, not in the ticket tracker. It'll get read more closely if it's on the mailing list. This is even more important for large-scale feature requests. We like to discuss any big changes to Django's core on the mailing list before actually working on them.
id: Permintaan pertama pada daftar |django-developers|,bukan di pelacak tiket. Dia akan membaca lebih dekat jika dia berada di daftar penyuratan. Ini bahkan lebih penting untuk permintaan fitur skala-besar. Kami suka mengobrol perubahan besar apapun pada inti Django pada daftar penyuratan sebelum sebenarnya bekerja dengan mereka.
pt_br: Primeiro faça a sua solicitação na lista django-developers, e não no rastreador de tickets. Ela será lida mais de perto e estará dentro de uma lista de e-mail. Isso é ainda mais importante para solicitações de grande impacto. Nós gostamos de discutir qualquer grande mudança no núcleo do Django em nossa lista de e-mail antes de começar a trabalhar nelas de fato.

source: Describe clearly and concisely what the missing feature is and how you'd like to see it implemented. Include example code (non-functional is OK) if possible.
id: Gambarkan dengan jelas dan secara singkat apa fitur yang hilang dan bagaimana anda ingin melihatnya diterapkan. Sertakan kode contoh (bukan-fungsional OKE) jika memungkinkan.
pt_br: Descreva claramente e de forma concisa qual é a funcionalidade que você não encontrou e como você gostaria que ela fosse implementada. Se possível inclua códigos como exemplos (código que não funciona é válido).

source: Explain *why* you'd like the feature. In some cases this is obvious, but since Django is designed to help real developers get real work done, you'll need to explain it, if it isn't obvious why the feature would be useful.
id: Jelaskan **kenapa** anda menyukai fitur. Dalam beberapa kasus sudah jelas, tetapi sejak Django dirancang untuk membantu pengembang asli menyelesaikan pekerjaannya, anda akan butuh menjelaskannya, jika tidak jelas mengapa fitur akan berguna.
pt_br: Explique porque você gostaria dessa funcionalidade. Em alguns casos é bem óbvio, mas como o Django foi desenvolvido para ajudar desenvolvedores de verdade a realizar tarefas de verdade, você terá que explicar, caso não seja óbvio, por qual motivo essa funcionalidade seria útil.

source: If core developers agree on the feature, then it's appropriate to create a ticket. Include a link the discussion on |django-developers| in the ticket description.
id: Jika pengembang umum setuju pada fitur, kemudian itu tepat untuk membuat sebuah tiket. Sertakan tautan obrolan pada |django-developers| di gambaran tiket.
pt_br: Se os desenvolvedores do projeto concordarem com a funcionalidade, então é apropriado criar um ticket. Inclua um link para a discussão na lista django-developers na descrição do ticket.

source: As with most open-source projects, code talks. If you are willing to write the code for the feature yourself or, even better, if you've already written it, it's much more likely to be accepted. Just fork Django on GitHub, create a feature branch, and show us your work!
id: Seperti kebanyakan proyek sumber-terbuka, code talk. Jika anda akan menulis kode untuk fitur itu sendiri atau, bahkan lebih baik, jika anda telah menulisnya, itu jauh lebih mungkin untuk diterima. Hanya cabangkan Django di GitHub, buat fitur cabang, dan tunjukkan kami pekerjaan anda!
pt_br: Como em muitos projetos open-source, o código fala. Se você estiver interessado em desenvolver a nova funcionalidade você mesmo, ou ainda melhor, se você já desenvolveu ela. As chances de ela ser aceita são muito maiores. Faça um fork do Django no GitHub, crie uma branch para a funcionalidade, e mostre-nos o seu trabalho!

source: See also: :ref:`documenting-new-features`.
id: Lihat juga: :ref:`documenting-new-features`.
pt_br: Veja também: :ref:`documenting-new-features`.

source: How we make decisions
id: Bagaimana kita membuat keputusan
pt_br: Como nós tomamos decisões

source: Whenever possible, we strive for a rough consensus. To that end, we'll often have informal votes on |django-developers| about a feature. In these votes we follow the voting style invented by Apache and used on Python itself, where votes are given as +1, +0, -0, or -1. Roughly translated, these votes mean:
id: Kapan saja memungkinkan, kami berjuang untuk pemufakatan kasar. Sampai akhir itu, kami akan sering mempunyai pilihan tidak resmi pada |django-developers| tentang sebuah fitur. Di pilihan ini kami mengikuti gaya yang dibuat oleh Apache dan menggunakan Python itu sendiri, dimana pilihan diberikan sebagai +1, +0, -0, atau -1. Diterjemahkan kasar, pilihan ini berarti:
pt_br: Quando possível, nós tentamos chegar em um consenso. Para tanto, nós geralmente temos votos informais na lista django-developers sobre uma funcionalidade. Nesses votos nós seguimos o estilo adotado pela Apache e usado no próprio Python, onde os votos são dados como +1, +0, -0, ou -1. Traduzindo, esses votos significam:

source: +1: "I love the idea and I'm strongly committed to it."
id: +1: "Saya cinta ide dan Saya sangat kuat melakukannya."
pt_br: +1: "Eu adorei a ideia e estou fortemente comprometido com ela."

source: +0: "Sounds OK to me."
id: +0: "Kedengarannya OKE buat saya."
pt_br: +0: "Por mim OK."

source: -0: "I'm not thrilled, but I won't stand in the way."
id: -0: "Saya tidak senang, tetapi Saya tidak berdiri di jalan."
pt_br: -0: "Não me animou, mas eu não vou ficar no caminho."

source: -1: "I strongly disagree and would be very unhappy to see the idea turn into reality."
id: -1: "Saya sangat tidak setuju dan akan sangat tidah bahagia untuk melihat ide berubah menjadi kenyataan."
pt_br: -1: "Eu definitivamente não gostei e ficaria realmente chateado de ver essa ideia virando realidade."

source: Although these votes on |django-developers| are informal, they'll be taken very seriously. After a suitable voting period, if an obvious consensus arises we'll follow the votes.
id: Meskipun pilihan ini pada |django-developers| tidak resmi, mereka akan mengambil sangat serius. Setelah masa pemilihan cocok, jika pemufawakatan jelas muncul kami akan mengikuti pilihan.
pt_br: Embora esses votos na lista django-developers sejam informais, eles são levados bem a sério. Depois de um tempo razoável de votação, se um consenso óbvio surge nós vamos seguir os votos.

source: However, consensus is not always possible. If consensus cannot be reached, or if the discussion towards a consensus fizzles out without a concrete decision, any :ref:`core team member <core-team>` may defer the decision to the :ref:`technical board <technical-board>`.
id: Bagaimanapun, pemufakatan tidak selalu mungkin. Jika pemufakatan tidak dapat diraih, atau jika obrolan menuju pemufakatan gagal tanpa keputusan nyata, apapun :ref:`anggota tim inti <core-team>` mungkin menunda keputusan ke :ref:`badan teknis <technical-board>`.
pt_br: Porém, consenso nem sempre é possível. Se ele não for atingido, ou se a discussão em busca de um consenso se perde sem uma decisão concreta, qualquer :ref:'membro do projeto <core-team>' pode delegar a decisão para o :ref:'conselho técnico <technical-board>'.

source: Internally, the technical board will use the same voting mechanism. A proposition will be considered carried if:
id: Di bagian dalam, badan teknis akan menggunakan mekanisme pemilihan sama. Sebuah saran akan dipertimbangkan dibawa jika:
pt_br: Internamente, o conselho técnico irá usar o mesmo mecanismo de votação. A proposição será considerada acatada se:

source: There are at least three "+1" votes from members of the technical board.
id: Terdapat setidaknya tiga pilihan "+1" dari anggota badan teknis.
pt_br: Existirem pelo menos 3 votos do tipo "+1" de membros do conselho técnico.

source: There is no "-1" vote from any member of the technical board.
id: Tidak ada pilihan "-1" untuk anggota badan teknis manapun.
pt_br: Não existem votos do tipo "-1" de membros do conselho técnico.

source: Votes should be submitted within a week.
id: Pemungutan suara harus diajukan dalam minggu ini.
pt_br: Votos devem ser submetidos dentro de uma semana.

source: Since this process allows any technical board member to veto a proposal, a "-1" vote should be accompanied by an explanation of what it would take to convert that "-1" into at least a "+0".
id: Sejak pengolahan ini mengizinkan anggota badan teknis manapun untuk mem veto pengajuan, sebuah pilihan "-1" harus ditemani oleh sebuah penjelasan dari apa yang akan diambil untuk merubah "-1" menjadi setidaknya "+0".
pt_br: Como esse processo permite que qualquer membro do conselho técnico vete a proposta, um voto do tipo "-1" deve estar acompanhado de uma explicação sobre o que seria preciso para converter esse "-1" em pelo menos um voto do tipo "+0".

source: Votes on technical matters should be announced and held in public on the |django-developers| mailing list.
id: Pilihan pada masalah teknis harus diumumkan dan diadakan secara umum pada daftar penyuratan |django-developers|.
pt_br: Votos sobre assuntos técnicos devem ser anunciados e mantidos públicos na lista de e-mail django-developers.

source: Committing code
id: Memperbaiki kode
pt_br: Enviando código

source: This section is addressed to the :ref:`committers` and to anyone interested in knowing how code gets committed into Django core. If you're a community member who wants to contribute code to Django, have a look at :doc:`writing-code/working-with-git` instead.
id: Bagian ini dialamatkan ke :ref:`committers` dan siapapun yang tertarik dalam mengetahui bagaimana kode diperbaiki kedalam inti Django. Jika anda adalah anggota komunitas yang ingin membantu kode pada Django, lihatlah ini :doc:`writing-code/working-with-git` sebagai gantinya.
pt_br: Esta seção é direcionada aos :ref:`committers` e a todos os interessados em saber como um trecho de código é incorporado ao Django pelos desenvolvedores do projeto. Se você é um membro da comunidade que deseja contribuir com o Django enviando o seu código, dê uma olhada em :doc:`writing-code/working-with-git`.

source: Handling pull requests
id: Penanganan pull request
pt_br: Manipulando pull requests

source: Since Django is now hosted at GitHub, most patches are provided in the form of pull requests.
id: Sejak Django sekarang disimpan pada GitHub, kebanyakan tambalan disediakan di formulir pull request.
pt_br: Como o Django agora é hospedado no GitHub, a maioria das melhorias é fornecida na forma de pull requests.
