Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: For details about the JavaScript code style used by Django, see :doc:`javascript`.
id: Untuk rincian tentang gaya kode JavaScript digunakan oleh Django, lihat :doc:`javascript`.
pt_br: Para detalhes sobre o estilo de código JavaScript adotado no Django, veja :doc:`javascript`.

source: Writing code
id: Penulisan kode
pt_br: Escrevendo código

source: So you'd like to write some code to improve Django. Awesome! Browse the following sections to find out how to give your code patches the best chances to be included in Django core:
id: Jadi anda suka menulis beberapa kode untuk memperbaiki Django. Menakjubkan! Jelajahi bagian berikut untuk menemukan bagaimana memberikan tambalan kode anda kesempatan terbaik untuk di sertakan kedalam inti Django:
pt_br: Então você gostaria de escrever algum código para melhorar o Django. Ótimo! Navegue pelas seções seguintes para descobrir como dar aos seus patches de código as melhores chances de serem incluídos no core do Django:

source: While most of Django core is Python, the ``admin`` and ``gis`` contrib apps contain JavaScript code.
id: Selagi kebanyakan inti Django adalah Python, aplikasi penyumbang ``admin`` and ``gis`` mengandung kode JavaScript.
pt_br: Embora a maior parte do núcleo do Django seja escrito em Python, alguns apps como o ``admin`` e ``gis`` contém código JavaScript.

source: Please follow these coding standards when writing JavaScript code for inclusion in Django.
id: Silahkan mengikuti standar pengkodean ketika menulis kode javaScript untuk penyertaan di Django.
pt_br: Por favor siga esses padrões de código quando estiver escrevendo código em JavaScript para inclusão no Django.

source: Code style
id: Gaya kode
pt_br: Estilo de código

source: Please conform to the indentation style dictated in the ``.editorconfig`` file. We recommend using a text editor with `EditorConfig`_ support to avoid indentation and whitespace issues. Most of the JavaScript files use 4 spaces for indentation, but there are some exceptions.
id: Harap konfirmasikan gaya lekukan didiktekan dalam berkas ``.editorconfig``. Kami menganjurkan menggunakan penyunting teks dengan dukungan `EditorConfig`_ untuk menghindari masalah lekukan dan ruang kosong. Kebanyakan berkas-berkas JavaScript menggunakan 4 spasi untuk lekukan, tetapi ada beberapa pengecualian.
pt_br: Por favor adapte-se ao estilo de identação ditado no arquivo ``.editorconfig``. Nós recomendamos usar o editor de textos com suporte a `EditorConfig`_ para evitar problemas com identação e espaços em branco. A maioria dos arquivos JavaScript usam 4 espaços para identação, mas existem algumas exceções.

source: When naming variables, use ``camelCase`` instead of ``underscore_case``. Different JavaScript files sometimes use a different code style. Please try to conform to the code style of each file.
id: Ketika memberi nama variabel, gunakan ``camelCase`` daripada ``underscore_case``. Berkas-berkas JavaScript berbeda terkadang menggunakan gaya kode berbeda. Harap coba tegaskan pada gaya kode dari setiap berkas.
pt_br: Quando estiver nomeando variáveis, use ``camelCase`` ao invés de ``underscore_case``. Arquivos JavaScript diferentes algumas vezes usam estilos de código diferentes. Por favor tente se adequar aos padrões de estilo de cada arquivo.

source: Use the `JSHint`_ code linter to check your code for bugs and style errors. JSHint will be run when you run the JavaScript tests. We also recommended installing a JSHint plugin in your text editor.
id: Gunakan linter kode `JSHint`_ untuk memeriksa kesalahan dan dan kekeliruan gaya. JSHint akan berjalan ketika anda menjalankan percobaan javaScript. Kami jug amenganjurkan memasang sumbatan JSHint di penyunting teks anda.
pt_br: Utilize o `JSHint`_ code linter para verificar bugs e erros de estilo no seu código. JSHint irá rodar quando você executar os testes JavaScript. Nós também recomendamos instalar o JSHint no seu editor de textos.

source: JavaScript patches
id: Tambalan JavaScript
pt_br: Patches JavaScript

source: Django's admin system leverages the jQuery framework to increase the capabilities of the admin interface. In conjunction, there is an emphasis on admin JavaScript performance and minimizing overall admin media file size. Serving compressed or "minified" versions of JavaScript files is considered best practice in this regard.
id: Sistem admin Django berpengaruh kerangka kerja jQuery untuk meningkatkan kemampuan dari antarmuka admin. Dalam hubungannya, ada sebuah tekanan pada penampilan admin JavaScript dan memiminalkan keseluruhan ukuran berkas media admin. Melayani versi dikempa atau "dikecilkan" dari berkas-berkas JavaScript adalah dianggap praktik terbaik dalam kasus ini.
pt_br: O admin do Django usa o framework jQuery para aumentar as capacidades da interface de administração. Além disso, existe uma ênfase na performance do JavaScript do admin e em minimizar o tamanho de arquivos de media do admin. Servir versões comprimidas ou "minificadas" dos arquivos JavaScript é considerado uma boa prática nesse quesito.

source: To that end, patches for JavaScript files should include both the original code for future development (e.g. ``foo.js``), and a compressed version for production use (e.g. ``foo.min.js``). Any links to the file in the codebase should point to the compressed version.
id: Untuk itu, tambalan-tambalan untuk berkas-berkas JavaScript harus menyertakan kedua kode asli untuk pengembangan akan datang (sebagai contoh ``foo.js``), dan versi dikempa untuk penggunaan produksi (sebagai contoh ``foo.min.js``). Tautan apapun pada berkas di basis kode harus menunjukkan ke versi terkempa.
pt_br: Por isso, patches para arquivos JavaScript devem incluir tanto código original para futuro desenvolvimento (e.g. ``foo.js``), quanto uma versão comprimida para uso em produção (e.g. ``foo.min.js``). Qualquer links para o arquivo no projeto devem apontar para a versão comprimida.

source: Compressing JavaScript
id: Memadatkan JavaScript
pt_br: Comprimindo JavaScript

source: To simplify the process of providing optimized JavaScript code, Django includes a handy Python script which should be used to create a "minified" version. To run it:
id: Untuk menyederhanakan pengolahan menyediakan kode JavaScript yang dioptimalkan, Django menyertakan tulisan Python berguna yang harus digunakan untuk membuat versi "dipekercil". Untuk menjalankannya:
pt_br: Para simplificar o processo de fornecimento de código JavaScript otimizado, O Django inclui um script Python extremamente útil que deve ser utilizado na criação da versão "minificada". Para executá-lo:

source: Behind the scenes, ``compress.py`` is a front-end for Google's `Closure Compiler`_ which is written in Java. The Closure Compiler library is not bundled with Django, but you can install it using pip as done above. The Closure Compiler library requires `Java`_ 7 or higher.
id: Dibelakang layar, ``compress.py`` adalah bagian-depan untuk `Closure Compiler`_ Google yang ditulis dalam Java. Pustaka Closure Compiler tidak digabungkan dengan Django, tetapi anda dapat memasangnya menggunakan pip seperti dilakukan dibawah. Pustaka Closure Compiler membutuhkan `Java`_ 7 atau lebih tinggi.
pt_br: Por trás das cortinas, ``compress.py`` é um front-end para o `Compilador Closure `_ do Google que é escrito em Java. A biblioteca do Compilador Closure não é distribuída com o Django, mas você pode instalá-la usando pip como feito acima. A biblioteca do Compilador Closure requer `Java`_ 7 ou versões maiores.

source: Please don't forget to run ``compress.py`` and include the ``diff`` of the minified scripts when submitting patches for Django's JavaScript.
id: Harap jangan lupa menjalankan ``compress.py`` dan sertakan ``diff`` dari tulisan yang diperkecil ketika mengajukan tambalan untuk JavaScript Django.
pt_br: Por favor não se esqueça de rodar o ``compress.py`` e incluir o ``diff`` dos scripts minificados quando estiver enviando os seus patches para o JavaScript do Django.

source: JavaScript tests
id: Percobaan JavaScript
pt_br: Testes JavaScript

source: Django's JavaScript tests can be run in a browser or from the command line. The tests are located in a top level ``js_tests`` directory.
id: Percobaan JavaScript Django dapat berjalan di perambah atau baris perintah. Percobaan ditempatkan di tingkat atas pelipat ``js_tests``.
pt_br: Os testes para o JavaScript do Django podem ser rodados em um browser ou diretamente da linha de comando. Os testes estão localizados no diretório ``js_tests``.

source: Writing tests
id: Menulis percobaan
pt_br: Escrevendo testes

source: Django's JavaScript tests use `QUnit`_. Here is an example test module:
id: Percobaan JavasScript Django menggunakan `QUnit`_. Ini adalah sebuah contoh percobaan modul:
pt_br: Os testes em JavaScript do Django utilizam `QUnit`_. Segue um exemplo de teste de um módulo.

source: Please consult the QUnit documentation for information on the types of `assertions supported by QUnit <https://api.qunitjs.com/category/assert/>`_.
id: Silahkan rundingkan dokumentasi QUnit untuk informasi pada jenis-jenis dari `assertions supported by QUnit <https://api.qunitjs.com/category/assert/>`_.
pt_br: Por favor consulte a documentação do QUnit para informações sobre os tipo de `asserções suportadas pelo QUnit <https://api.qunitjs.com/category/assert/>`_.

source: Running tests
id: Menjalankan percobaan
pt_br: Rodando testes

source: The JavaScript tests may be run from a web browser or from the command line.
id: Percobaan JavaScript dapat berjalan dari perambah jaringan atau dari baris perintah.
pt_br: Os testes JavaScript pode ser executados de um browser ou diretamente da linha de comando.

source: Testing from a web browser
id: Dicoba dari sebuah perambah jaringan
pt_br: Testando de um browser

source: To run the tests from a web browser, open up ``js_tests/tests.html`` in your browser.
id: Untuk menjalankan percobaan dari perambah jaringan, buka ``js_tests/tests.html`` di perambah anda.
pt_br: Para executar os testes através de um browser, abra o arquivo ``js_tests/tests.html`` dentro do seu browser.

source: To measure code coverage when running the tests, you need to view that file over HTTP. To view code coverage:
id: Untuk mengukur cakupan kode ketika menjalankan percobaan, anda butuh melihat berkas itu melalui HTTP. Untuk melihat cakupan kode:
pt_br: Para medir a cobertura de código quando estiver executando os testes, você precisará visualizar o arquivo através de um servidor HTTP. Para ver a cobertura de código:

source: Execute ``python -m http.server`` (or ``python -m SimpleHTTPServer`` on Python 2) from the root directory (not from inside ``js_tests``).
id: Jalankan ``python -m http.server`` (atau ``python -m SimpleHTTPServer`` pada Python 2) dari direktori akar (bukan dari dalam ``js_tests``).
pt_br: Execute o comando ``python -m http.server`` (ou ``python -m SimpleHTTPServer`` no Python 2) do diretório root (não de dentro do diretório ``js_tests``).

source: Open http://localhost:8000/js_tests/tests.html in your web browser.
id: Buka http://localhost:8000/js_tests/tests.html di perambah jaringan anda.
pt_br: Acesse o endereço http://localhost:8000/js_tests/tests.html no seu browser.

source: Testing from the command line
id: Percobaan dari baris perintah
pt_br: Testando da linha de comando

source: To run the tests from the command line, you need to have `Node.js`_ installed.
id: Untuk menjalankan percobaan dari baris perintah, anda butuh mempunyai `Node.js`_ terpasang.
pt_br: Para executar os testes da linha de comando, você precisará ter o `Node.js`_ instalado.

source: After installing `Node.js`, install the JavaScript test dependencies by running the following from the root of your Django checkout:
id: Setelah memasang `Node.js`, pasang ketergantungan percobaan JavaScript dengan menjalankan berikut dari akar dari pemeriksaan Django:
pt_br: Depois de instalar o `Node.js`, instale as dependências dos testes em JavaScript executando o comando seguinte do diretório root no qual o código fonte do Django foi baixado:

source: Then run the tests with:
id: lalu jalankan percobaan dengan:
pt_br: E então rode os testes com:

source: Submitting patches
id: Mengajukan tambalan
pt_br: Enviando patches

source: We're always grateful for patches to Django's code. Indeed, bug reports with associated patches will get fixed *far* more quickly than those without patches.
id: Kami semua selalu berterima kasih untuk tambalan-tambalan pada kode Django. Memang, laporan kesalahan dengan tambalan terhubung akan diperbaiki *jauh* lebih cepat daripada mereka yang tanpa tambalan.
pt_br: Nós estamos sempre gratos por patches para o código do Django. De fato, relatos de bugs com um respectivo patch serão corrigidos *muito* mais rápido do que os bugs relatados sem um patch.

source: Typo fixes and trivial documentation changes
id: Perbaikan kesalahan ketik dan perubahan dokumentasi sepele.
pt_br: Correções de ortografia e mudanças triviais na documentação

source: If you are fixing a really trivial issue, for example changing a word in the documentation, the preferred way to provide the patch is using GitHub pull requests without a Trac ticket.
id: Jika anda sedang memperbaiki masalah sepele, sebagai contoh merubah sebuah kata di dokumentasi, cara dipilih untuk menyediakan tambalan adalah menggunakan menarik permintaan GitHub tanpa tiket Trac.
pt_br: Se você está corrigindo um problema realmente trivial, por exemplo, mudando uma palavra na documentação, a melhor maneira de providenciar o patch é usando um pull request sem um ticket no Trac associado.

source: See the :doc:`working-with-git` for more details on how to use pull requests.
id: Lihat :doc:`working-with-git` untuk rincian lebih bagaimana menggunakan pull request.
pt_br: Veja a :doc:`working-with-git` para mais detalhes sobre como usar os pull requests.

source: "Claiming" tickets
id: Tiket "Meminta"
pt_br: "Reinvindicando" tickets

source: In an open-source project with hundreds of contributors around the world, it's important to manage communication efficiently so that work doesn't get duplicated and contributors can be as effective as possible.
id: Dalam sebuah proyek sumber-terbuka dengan ratusan penyumbang diseluruh dunia, adalah sangat penting untuk mengelola komunikasi secara efektif sehingga pekerjaan tidak ganda dan penyumbang dapat menjadi seefektif mungkin.
pt_br: Em um projeto open-source com voluntários espalhados por todo o mundo, é importante gerenciar a comunicação de forma eficiente de modo que o trabalho não seja duplicado e voluntários possam ser o mais eficiente quanto possível.

source: Hence, our policy is for contributors to "claim" tickets in order to let other developers know that a particular bug or feature is being worked on.
id: Oleh sebab itu, kebijakan kami untuk penyumbang dalam "menagih" tiket agar membiarkan pengembang lain mengetahui bahwa kesalahan atau fitur tertentu sedang dikerjakan.
pt_br: Por tanto, nossa política é que os voluntários "reinvindiquem" os tickets de modo a permitir que os desenvolvedores do projeto saibam que aquele bug em específico ou funcionalidade está sendo atendida.

source: If you have identified a contribution you want to make and you're capable of fixing it (as measured by your coding ability, knowledge of Django internals and time availability), claim it by following these steps:
id: Jika anda telah mencirikan bantuan anda ingin membuat dan anda mampu memperbaikinya (yang diukur dengan kemampuan pengkodean anda, pengetahuan dari internal Django dan ketersediaan waktu), tagih dia dengan mengikuti langkah-langkah berikut:
pt_br: Se você identificou uma contribuição que você gostaria de fazer e se você é capaz de fazer essa correção (capacidade aqui mensurada pelas suas abilidades para programar, conhecimento de como o Django funciona internamente e tempo disponível), reinvindique ele seguindo os passos abaixo:

source: `Login using your GitHub account`_ or `create an account`_ in our ticket system. If you have an account but have forgotten your password, you can reset it using the `password reset page`_.
id: `Login using your GitHub account`_ atau `create an account`_ di sistem tiket kami. Jika anda mempunyai sebuah akun tetapi lupa sandi anda, anda dapat mengatur kembali menggunakan `password reset page`_.
pt_br: `Faça login usando a sua conta no GitHub`_ ou `criando uma conta`_ no nosso sistema de tickets. Se você tem uma conta mas esqueceu sua senha, você pode resetá-la usando a `página de recuperação de senha`_.

source: If a ticket for this issue doesn't exist yet, create one in our `ticket tracker`_.
id: Jika sebuah tiket untuk masalah ini belum ada, buat satu di `ticket tracker`_ kami.
pt_br: Se um ticket para um problema não foi criado ainda, crie um no nosso `rastreador de tickets`_.

source: If a ticket for this issue already exists, make sure nobody else has claimed it. To do this, look at the "Owned by" section of the ticket. If it's assigned to "nobody," then it's available to be claimed. Otherwise, somebody else may be working on this ticket. Either find another bug/feature to work on, or contact the developer working on the ticket to offer your help. If a ticket has been assigned for weeks or months without any activity, it's probably safe to reassign it to yourself.
id: Jika tiket untuk masalah ini sudah ada, pastikan tidak seorangpun telah menagihnya. Untuk melakukan ini, lihat bagian "Owned by" dari tiket. Jika dia ditentukan ke "nobody", kemudian itu tersedia untuk ditagih. Jika tidak, seseorang lain mungkin bekerja pada tiket untuk menawarkan bantuan anda. Jika tiket diberikan selama mingguan atau bulanan tanpa aktivitas apapun, itu mungkin aman untuk ditetapkan untuk diri anda sendiri.
pt_br: Se o ticket para esse problema já existe, certifique-se de que ninguém mais o reinvindicou. Para fazer isso, procure na seção "Owned by" do ticket. Se ele estiver atribuído para "nobody", então ele está disponível para reinvindicação. Caso contrário, outra pessoa já pode estar trabalhando nesse ticket. Busque outro bug/funcionalidade para trabalhar em cima ou contate o desenvolvedor trabalhando nesse ticket para oferecer a sua ajuda. Se o ticket já foi atribuído por semanas ou meses sem qualquer atividade, provavelmente é seguro reatribuí-lo para você.

source: Log into your account, if you haven't already, by clicking "GitHub Login" or "DjangoProject Login" in the upper left of the ticket page.
id: Masuk kedalam akun anda, jika anda belum, dengan mengklik "GitHub Login" atau "DjangoProject Login" di kiri atas dari halaman tiket.
pt_br: Acesse a sua conta, se você não tem uma ainda, clicando em "GitHub Login" ou "DjangoProject Login" no topo esquerdo da página de tickets.

source: Claim the ticket by clicking the "assign to myself" radio button under "Action" near the bottom of the page, then click "Submit changes."
id: Tagih tiket dengan mengklik tombol radio "assign to myself" dibawah "Action" dekat bawah halaman, kemudian klik "Submit changes."
pt_br: Reinvindique o ticket clicando na opção "assign to myself" em "Action" quase no final da página do ticket, e depois clique em "Submit changes".

source: The Django software foundation requests that anyone contributing more than a trivial patch to Django sign and submit a `Contributor License Agreement`_, this ensures that the Django Software Foundation has clear license to all contributions allowing for a clear license for all users.
id: Yayasan perangkat lunak Django meminta bahwa siapapun yang menyumbang lebih dari tambalan sepele pada Django menandatangani dan mengirimkan `Contributor License Agreement`_, ini memastikan bahwa Django Software Foundation mempunyai lisensi jelas untuk semua bantuan mengizinkan untuk lisensi jelas untuk semua pengguna.
pt_br: A Django Software Foundation requer que todas as contribuições maiores que um patch trivial assinem e enviem o `Contributor License Agreement`_, isso garante que a Django Software Foundation tenha a licença para todas as contribuições permitindo assim uma licença limpa para todos os usuários.

source: Ticket claimers' responsibility
id: Tanggung jawab pengaku tiket
pt_br: Responsabilidade de quem reinvindicou um Ticket

source: Once you've claimed a ticket, you have a responsibility to work on that ticket in a reasonably timely fashion. If you don't have time to work on it, either unclaim it or don't claim it in the first place!
id: Sekali anda mengakui sebuah tiket, anda mempunyai tanggung jawab untuk bekerja pada tiket tepat waktu. Jika anda tidak mempunyai waktu untuk bekerja padanya, salah satu batalkan pengakuannya atau jangan mengakuinya di tempat pertama!
pt_br: Quando você reinvindicar um ticket, você terá a responsabilidade de trabalhar nele em uma quantidade de tempo razoável. Se você não tem tempo para trabalhar nele, ou abra mão dele ou nem se quer faça a reinvindicação do ticket em primeiro lugar!

source: If there's no sign of progress on a particular claimed ticket for a week or two, another developer may ask you to relinquish the ticket claim so that it's no longer monopolized and somebody else can claim it.
id: Jika tidak ada tanda kemajuan pada tiket tertentu yang diakui selama seminggu atau dua minggu, pengembang lain mungkin meminta anda melepaskan pengakuan tiket sehingga itu tidak lagi dikuasai dan seseorang lain dapat mengakuinya.
pt_br: Se não existir sinal de progresso em um ticket reinvindicado em particular por uma semana ou duas, outros desenvolvedores podem pedir para você abrir mão da reinvindicação do ticket de modo que ele não esteja mais monopolizado e alguém mais possa reinvindicá-lo novamente.

source: If you've claimed a ticket and it's taking a long time (days or weeks) to code, keep everybody updated by posting comments on the ticket. If you don't provide regular updates, and you don't respond to a request for a progress report, your claim on the ticket may be revoked.
id: Jika anda telah mengakui tiket dan itu memakan waktu lama (harian atau mingguan) untuk membuat kode, jaga semua orang terperbaharui dengan menempatkan komentar pada tiket. Jika anda tidak menyediakan pembaharuan reguler, dan anda tidak menjawab pada permintaan untuk laporan kemajuan, pengakuan anda pada tiket mungkin ditarik.
pt_br: Se você reinvindicou um ticket e está demorando um bom tempo (dias ou semanas) para programar, mantenha todo mundo atualizado postando comentários no ticket. Se você não fornecer atualizações regulares, e você não responder a um pedido por relatório de progresso, a sua reinvindicação ao ticket poderá ser revogada.

source: As always, more communication is better than less communication!
id: Seperti biasa, komunikasi lebih lebih baik daripada komunikasi kurang!
pt_br: Como sempre, mais comunicação é melhor do que menos comunicação.

source: Which tickets should be claimed?
id: Tiket mana harus diminta?
pt_br: Quais tickets devem ser reinvindicados?

source: Of course, going through the steps of claiming tickets is overkill in some cases.
id: Tentu saja, melalui langkah-langkah dari pengakuan tiket berlebihan dalam beberapa kasus.
pt_br: Claro, passar por todas as etapas de reinvindicar um ticket pode ser excessivo em alguns casos.
