Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Tests that only fail in combination
id: Percobaan hanya gagal di kombinasi
pt_br: Testes que só falham em combinação

source: In case a test passes when run in isolation but fails within the whole suite, we have some tools to help analyze the problem.
id: Dalam hal sebuah percobaan lulus ketika berjalan di pemisahan tetapi gagal dalam deretan keseluruhan, kami mempunyai beberapa alat untuk membantu menganalisa masalah.
pt_br: Caso um teste passe quando rodado isoladamente mas que falhe quando rodado dentro de uma suíte inteira de testes, nós temos algumas ferramentas para ajudar a analizar o problema.

source: The ``--bisect`` option of ``runtests.py`` will run the failing test while halving the test set it is run together with on each iteration, often making it possible to identify a small number of tests that may be related to the failure.
id: Pilihan ``--bisect`` dari ``runtests.py`` akan menjalankan percobaan kegagalan selama separuh kumpulan percobaan yang dijalankan bersama-sama pada setiap putaran, sering membuatnya memungkinkan untuk mencirikan sejumlah kecil dari percobaan yang mungkin terkait terhadap kegagalan.
pt_br: A opção ``--bisect`` do ``runtests.py`` irá executar o teste que falhou enquanto reparte o conjunto de testes do qual o teste falho faz parte a cada nova iteração, geralmente permitindo identificar um pequeno número de testes que podem estar relacionados com a falha.

source: For example, suppose that the failing test that works on its own is ``ModelTest.test_eq``, then using::
id: Sebagai contoh, andaikan percobaan gagal bekerja dengan sendirinya adalah ``ModelTest.test_eq``, lalu gunakan::
pt_br: Por exemplo, suponha que o teste que falha em grupo mas que funciona sozinho é o ``ModelTest.test_eq`, então usando::

source: will try to determine a test that interferes with the given one. First, the test is run with the first half of the test suite. If a failure occurs, the first half of the test suite is split in two groups and each group is then run with the specified test. If there is no failure with the first half of the test suite, the second half of the test suite is run with the specified test and split appropriately as described earlier. The process repeats until the set of failing tests is minimized.
id: akan mencoba menentukan percobaan yang mencampuri dengan satu yang diberikan. Pertama, percobaan berjalan dengan babak pertama dari deretan percobaan. Jika kegagalan muncul, babak pertama dari deretan percobaan dipisah dalam dua kelompok dan setiap kelompok berjalan dengan percobaan yang ditentukan. Jika tidak ada kegagalan dengan babak pertama dari deretan percobaan, babak kedua dari deretan percobaan berjalan dengan percobaan yang ditentukan dan dipisah dengan benar seperti digambarkan di awal. Pengolahan berulang sampai kumpulan percobaan kegagalan kecil.
pt_br: Nós vamos tentar descobrir um teste que interfere com o teste escolhido. Primeiro, o teste é rodado com a primeira metade da suíte de testes. Se uma falha ocorrer, a primeira metade da suíte de testes é dividida em dois grupos e cada grupo é então rodado com o teste especificado. Se não existe falha com a primeira metade da suíte de testes, a segunda metade da suíte é rodada com o teste especificado e dividida apropriadamente conforme descrito anteriormente. O processo se repete até que o conjunto de testes que falham é minimizado.

source: The ``--pair`` option runs the given test alongside every other test from the suite, letting you check if another test has side-effects that cause the failure. So::
id: Pilihan ``--pair`` menjalankan percobaan yang diberikan disamping setiap percobaan lain dari deretan, membiarkan anda memeriksa jika percobaan lain mempunyai efek-samping yang menyebabkan kegagal. Jadi::
pt_br: A opção ``--pair`` executa os testes dados junto de cada um dos demais testes da suíte, permitindo que você verifique se outro teste tem algum efeito colateral que causa a falha. Então::

source: will pair ``test_eq`` with every test label.
id: akan memperbaiki ``test_eq`` dengan setiap label percobaan.
pt_br: nós vamos parear ``test_eq`` com cada rótulo de teste

source: With both ``--bisect`` and ``--pair``, if you already suspect which cases might be responsible for the failure, you may limit tests to be cross-analyzed by :ref:`specifying further test labels <runtests-specifying-labels>` after the first one::
id: Dengan kedua ``--bisect`` dan ``--pair``, jika anda sudah menduga kasus mana mungkin bertanggungjawab untuk kegagalan, anda mungkin membatasi percobaan untuk dianalisa silang oleh :ref:`specifying further test labels <runtests-specifying-labels>` setelah satu yang pertama::
pt_br: Se você já tem uma suspeita de quais casos podem estar sendo responsáveis pela falha, você pode limitar os testes para fazer uma análise cruzada :ref:`especificando mais rótulos de teste <runtests-specifying-labels>` depois do primeiro::

source: You can also try running any set of tests in reverse using the ``--reverse`` option in order to verify that executing tests in a different order does not cause any trouble::
id: Anda dapat juga mencoba menjalankan kumpulan apapun dari percobaan dalam membalikkan menggunakan pilihan ``--reverse`` untuk mengecek bahwa percobaan yang dijalankan di perintah berbeda tidak menyebabkan masalah apapun::
pt_br: Você também pode tentar rodar qualquer conjunto de testes em ordem reversa usando a opção ``--reverse`` para verificar se a execução dos testes em uma ordem diferente não causa problemas::

source: Seeing the SQL queries run during a test
id: Melihat permintaan SQL berjalan selama percobaan
pt_br: Verificando as consultas SQL realizadas durante os testes

source: If you wish to examine the SQL being run in failing tests, you can turn on :ref:`SQL logging <django-db-logger>` using the ``--debug-sql`` option. If you combine this with ``--verbosity=2``, all SQL queries will be output::
id: Jika anda berharap menguji SQL yang sedang berjalan dalam percobaan kegagalan, anda dapat menyalakan :ref:`SQL logging <django-db-logger>` menggunakan pilihan ``--debug-sql``. Jika anda menggabungkan ini dengan ``--verbosity=2``, semua permintaan SQL akan mengeluarkan::
pt_br: Se você quer examinar o SQL sendo rodado em testes falhos, você pode ativar o :ref:`SQL logging <django-db-logger>` usando a opção ``--debug-sql``. Se você combinar isso com ``--verbosity=2``, todas as consultas SQL serão exibidas::

source: Seeing the full traceback of a test failure
id: Melihat melacak kembali penuh dari kegagalan percobaan
pt_br: Visualizando todo o traceback de um teste falho

source: By default tests are run in parallel with one process per core. When the tests are run in parallel, however, you'll only see a truncated traceback for any test failures. You can adjust this behavior with the ``--parallel`` option::
id: Secara awal percobaan berjalan di paralel dengan satu pengolahan per inti. Ketika percobaan berjalan di paralel, bagaimanapun, anda akan hanya melihat pelacakan terpotong untuk tiap kegagalan percobaan. Anda dapat menyesuaikan kebiasaan ini dengan pilihan ``--parallel``::
pt_br: Por padrão testes são executados em paralelo com um processo por core. Quando os testes são rodados em paralelo, porém, você só verá um traceback truncado em cada teste que falhar. Você pode ajustar esse comportamento com a opção ``--parallel``.

source: You can also use the ``DJANGO_TEST_PROCESSES`` environment variable for this purpose.
id: Anda dapat juga menggunakan variabel lingkungan ``DJANGO_TEST_PROCESSES`` untuk tujuan ini.
pt_br: Você também pode usar a variável de ambiente ``DJANGO_TEST_PROCESSES`` para isso.

source: Support for running tests in parallel and the ``--parallel`` option were added.
id: Mendukung untuk menjalankan percobaan secara paralel dan pilihan ``--parallel`` ditambahkan.
pt_br: Suporte para rodar testes em paralelo e a opção ``--parallel`` foram adicionados.

source: Tips for writing tests
id: Tip untuk menulis percobaan

source: Isolating model registration
id: Mengasingkan pendaftaran model

source: To avoid polluting the global :attr:`~django.apps.apps` registry and prevent unnecessary table creation, models defined in a test method should be bound to a temporary ``Apps`` instance::
id: Untuk menghindari registrar :attr:`~django.apps.apps` global dan mencegah pembuatan tabel tidak diperlukan, model ditentukan dalam cara percobaan harus diikat ke instance ``Apps`` sementara::

source: Since this pattern involves a lot of boilerplate, Django provides the :func:`~django.test.utils.isolate_apps` decorator. It's used like this::
id: Sejak corak ini melibatkan banyak boilerplate, Django menyediakan penghias :func:`~django.test.utils.isolate_apps`. Itu digunakan seperti ini::

source: Setting ``app_label``
id: Mengatur ``app_label``

source: Models defined in a test method with no explicit :attr:`~django.db.models.Options.app_label` are automatically assigned the label of the app in which their test class is located.
id: Model ditentukan dalam cara percobaan dengan tidak eksplisit :attr:`~django.db.models.Options.app_label` secara otomatis diberikan label dari aplikasi dimana kelas percobaan mereka ditempatkan.

source: In order to make sure the models defined within the context of :func:`~django.test.utils.isolate_apps` instances are correctly installed, you should pass the set of targeted ``app_label`` as arguments:
id: Untuk memastikan model ditentukan dalam konteks instance :func:`~django.test.utils.isolate_apps` dengan benar dipasang, anda harus lolos kumpulan ``app_label`` ditargetkan sebagai argumen:

source: The decorator can also be applied to classes::
id: Penghias dapat juga diberlakukan ke kelas-kelas::

source: The temporary ``Apps`` instance used to isolate model registration can be retrieved as an attribute when used as a class decorator by using the ``attr_name`` parameter::
id: Instance ``Apps`` sementara digunakan untuk mengasingkan pendaftaran model dapat ditarik sebagai sebuah atribut ketika digunakan sebagai kelas penghias dengan menggunakan parameter ``attr_name``::

source: Or as an argument on the test method when used as a method decorator by using the ``kwarg_name`` parameter::
id: Atau sebagai sebuah argumen pada cara percobaan ketika digunakan sebagai cara penghias dengan menggunakan parameter ``kwarg_name``::

source: Working with Git and GitHub
id: Bekerja dengan Git dan GitHub
pt_br: Trabalhando com Git e GitHub

source: This section explains how the community can contribute code to Django via pull requests. If you're interested in how core developers handle them, see :doc:`../committing-code`.
id: Bagian ini menjelaskan bagaimana komunitas dapat menyumbang kode pada Django melalui pull request. Jika anda tertarik dalam bagaimana pengembang inti menangani mereka, lihat :doc:`../committing-code`.
pt_br: Esta seção explica como a comunidade pode contribuir com código para o Django via pull requests. Se você está interessado em como os core developers manipulam eles, veja :doc:`../committing-code`.

source: Below, we are going to show how to create a GitHub pull request containing the changes for Trac ticket #xxxxx. By creating a fully-ready pull request, you will make the reviewer's job easier, meaning that your work is more likely to be merged into Django.
id: Dibawah ini, kami akan menunjukkan bagaimana membuat pull request GitHub mengandung perubahan untuk tiket Trac #xxxxx. Dengan membuat pull request sepenuhnya siap, anda akan membuat pekerjaan peninjau lebih mudah, berarti bahwa pekerjaan anda lebih mungkin digabungkan kedalam Django.

source: You could also upload a traditional patch to Trac, but it's less practical for reviews.
id: Anda dapat juga menunggah tambalan tradisional ke Trac, tetapi dia kurang praktis untuk peninjauan.
pt_br: Você também poderia fazer upload de um patch tradicional no Trac, mas isso é menos prático para os revisores.

source: Installing Git
id: Memasang Git
pt_br: Instalando Git

source: Django uses `Git`_ for its source control. You can `download <http://git-scm.com/download>`_ Git, but it's often easier to install with your operating system's package manager.
id: Django menggunakan `Git`_ untuk sumber kendalinya. Anda dapat `download <http://git-scm.com/download>`_ Git, tetapi dia sering lebih mudah memasang dengan pengelola paket sistem operasi anda.
pt_br: O Django utiliza `Git`_ para o seu versionamento código. Você pode `baixá-lo em <http://git-scm.com/download>`_ , mas costuma ser mais simples instalá-lo usando o gerenciador de pacotes do seu sistema operacional.

source: Django's `Git repository`_ is hosted on `GitHub`_, and it is recommended that you also work using GitHub.
id: `Git repository`_ Django disimpan di `GitHub`_, dan itu dianjurkan bahwa anda juga bekerja menggunakan GitHub.
pt_br: O repositório do Django é hospedado no `GitHub`_, e é recomendado que você também trabalhe usando o GitHub.

source: After installing Git, the first thing you should do is setup your name and email::
id: Setelah memasang Git, hal pertama anda harus lakukan adalah mengatur nama dan surel anda::

source: Note that ``user.name`` should be your real name, not your GitHub nick. GitHub should know the email you use in the ``user.email`` field, as this will be used to associate your commits with your GitHub account.
id: Catat bahwa ``user.name`` harus nama asli anda, bukan nama pendek GitHub. GitHub harus tahu surel anda gunakan di bidang ``user.email``, karena ini akan digunakan untuk menghubungkan perbaikan anda ke akun GitHub anda.
pt_br: Note que ``user.name`` deve ser o seu nome real, e não o seu nick no GitHub. O GitHub deve saber o email que você usa pelo campo ``user.email``, já que ele será usado para associar os seus commits com a sua conta no GitHub.

source: Setting up local repository
id: Mengatur gudang lokal
pt_br: Configurando o repositório local

source: When you have created your GitHub account, with the nick "GitHub_nick", and `forked Django's repository <https://github.com/django/django/fork>`__, create a local copy of your fork::
id: Ketika anda telah membuat akun GitHub anda, dengan nama pendek "GitHub_nick" dan `forked Django's repository <https://github.com/django/django/fork>`__, buat salinan lokal dari fork anda::

source: This will create a new directory "django", containing a clone of your GitHub repository. The rest of the git commands on this page need to be run within the cloned directory, so switch to it now::
id: Ini akan membuat pelipat baru "django", mengandung kloning dari gudang GitHub anda. Sisa dari perintah git pada halaman ini butuh dijalankan dalam pelipat kloning, jadi ganti ke itu sekarang::

source: Your GitHub repository will be called "origin" in Git.
id: Gudang GitHub anda akan dipanggil "origin" dalam Git.
pt_br: O seu repositório GitHub será chamado de "origin" no Git.

source: You should also setup ``django/django`` as an "upstream" remote (that is, tell git that the reference Django repository was the source of your fork of it)::
id: Anda harus juga mengatur ``django/django`` sebagai sebuah terpencil "hulu" (yaitu, memberitahu git bahwa acuan gudang Django adalah sumber dari fork anda darinya)::

source: You can add other remotes similarly, for example::
id: Anda dapat juga menambahkan terpencil lainnya dengan cara yang sama, sebagai contoh::
pt_br: Você pode adicionar outros "upstreams" remotos de modo similar, por exemplo::

source: Working on a ticket
id: Bekerja pada tiket
pt_br: Trabalhando em um ticket

source: When working on a ticket, create a new branch for the work, and base that work on upstream/master::
id: Ketika bekerja pada sebuah tket, buat cabang baru untuk pekerjaan, dan dasarkan pekerjaan itu pada upstream/master::

source: The -b flag creates a new branch for you locally. Don't hesitate to create new branches even for the smallest things - that's what they are there for.
id: Bendera -b membuat cabang baru untuk anda secara lokal. Jangan ragu-ragu membuat cabang-cabang baru bahkan untu hal-hal terkecil - itulah apa mereka ada.
pt_br: A flag -b cria uma nova branch para você localmente. Não hesite em criar novas branches mesmo para as coisas mais simples - esse é o motivo delas existirem.

source: If instead you were working for a fix on the 1.4 branch, you would do::
id: Jika malahan anda sedang bekerja untuk perbaikan pada cabang 1.4, anda akan melakukan::
pt_br: Se ao invés disso você estiver trabalhando em uma correção na branch 1.4, você poderia fazer::

source: Assume the work is carried on the ticket_xxxxx branch. Make some changes and commit them::
id: Anggap pekerjaan dibawah pada cabang ticket_xxxxx. Buat beberapa perubahan dan perbaiki mereka::

source: When writing the commit message, follow the :ref:`commit message guidelines <committing-guidelines>` to ease the work of the committer. If you're uncomfortable with English, try at least to describe precisely what the commit does.
id: Ketika menulis pesan perbaikan, ikuti :ref:`commit message guidelines <committing-guidelines>` untuk mempermudah pekerjaan dari pembuat perbaikan. Jika anda tidak nyaman dengan Inggris, coba setidaknya gambarkan secara tepat apa yang perbaikan lakukan.
pt_br: Quando estiver escrevendo uma mensagem de commit, siga as :ref:`orientações para mensagens de commit <committing-guidelines>` para facilitar o trabalho do committer. Se você estiver desconfortável em usar inglês, tente pelo menos descrever precisamente o que o commit faz.

source: If you need to do additional work on your branch, commit as often as necessary::
id: Jika anda butuh melakukan tambahan pekerjaan pada cabang anda, perbaikan sesering yang diperlukan::
pt_br: Se você precisar fazer trabalho adicional na sua branch, faça commit com tanta frequência quanto for necessário.

source: Publishing work
id: Menerbitkan pekerjaan
pt_br: Publicando trabalho

source: You can publish your work on GitHub just by doing::
id: Anda dapat menerbitkan pekerjaan anda pada GitHub dengan hanya melakukan::
pt_br: Você pode publicar o seu trabalho no GitHub fazendo o seguinte::

source: When you go to your GitHub page, you will notice a new branch has been created.
id: Ketika anda pergi ke halaman GitHub, anda akan melihat cabang baru telah dibuat.

source: If you are working on a Trac ticket, you should mention in the ticket that your work is available from branch ticket_xxxxx of your GitHub repo. Include a link to your branch.
id: Jika anda sedang bekerja pada tiket Trac, anda harus menyebutkan dalam tiket yang pekerjaan anda tersedia dari cabang ticket_xxxxx dari gudang GitHub. Sertakan sebuah tautan pada cabang anda.
pt_br: Se você está trabalhando em um ticket do Trac, você deve mencionar no ticket que o seu trabalho está disponível através da branch ticket_xxxxx do seu repositório no GitHub. Inclua um link para a sua branch.

source: Note that the above branch is called a "topic branch" in Git parlance. You are free to rewrite the history of this branch, by using ``git rebase`` for example. Other people shouldn't base their work on such a branch, because their clone would become corrupt when you edit commits.
id: Catat bahwa cabang diatas dipanggil "topic branch" di bahasa Git. Anda bebas menulis kembali riwayat dari cabang ini, dengan menggunakan ``git rebase`` sebagai contoh. Orang lain tidak harus dasarkan pekerjaan mereka pada cabang seperti itu, karena kloningan mereka akan menjadi rusak ketika anda menyunting perbaikan.
pt_br: Tenha em mente que a branch acima é chamada de "topic branch" no linguajar do Git. Você é livre para reescrever o histórico dessa branch, através do uso do ``git rebase`` por exemplo. Outras pessoas não deveriam basear o seu trabalho em uma branch como essa, porque os clones dela serão corrompidos quando você editar os seus commits.

source: There are also "public branches". These are branches other people are supposed to fork, so the history of these branches should never change. Good examples of public branches are the ``master`` and ``stable/A.B.x`` branches in the ``django/django`` repository.
id: Ada juga "cabang umum". Ini adalah cabang-cabang orang lain seharusnya untuk menyalin gudang kode, jadi riwayat dari cabang-cabang ini harus tidak pernah berubah. Contoh baik dari cabang umum adalah cabang ``master`` dan ``stable/A.B.x`` di gudang `django/django``.

source: When you think your work is ready to be pulled into Django, you should create a pull request at GitHub. A good pull request means:
id: Ketika anda berpikir pekerjaan anda siap untuk ditarik ke Django, anda harus membuat sebuah pull request pada GitHub. Pull request baik artinya:
pt_br: Quando você achar que o seu trabalho está pronto para ser enviado para o Django, você deve criar um pull request no GitHub. Um bom pull request significa:

source: commits with one logical change in each, following the :doc:`coding style <coding-style>`,
id: perbaiki dengan satu perubahan logika di setiapnya, mengikuti :doc:`coding style <coding-style>`,
pt_br: Commits com uma mudança lógica, seguindo o :doc:`estilo de código <coding-style>`,

source: well-formed messages for each commit: a summary line and then paragraphs wrapped at 72 characters thereafter -- see the :ref:`committing guidelines <committing-guidelines>` for more details,
id: Pesan-pesan berbentuk baik untuk setiap perbaikan: sebuah baris ringkasan dan kemudian paragraf dibungkus pada 72 karakter setelah itu -- lihat :ref:`committing guidelines <committing-guidelines>` untuk lebih rinci,
pt_br: Mensagens bem formatadas para cada commit: uma linha de sumário e então parágrafos embutidos em até 72 caracteres depois dela -- veja as :ref:`regras de commit <committing-guidelines>` para mais detalhes.

source: documentation and tests, if needed -- actually tests are always needed, except for documentation changes.
id: dokumentasi dan percobaan, jika dibutuhkan -- percobaan sebenarnya selalu dibutuhkan, kecuali untuk perubahan dokumentasi.
pt_br: Documentação e testes, quando necessário -- na verdade testes são sempre necessários, exceto para mudanças na documentação.

source: The test suite must pass and the documentation must build without warnings.
id: Rangkaian percobaan harus dilewati dan dokumentasi harus dibangun tanpa peringatan.
pt_br: A suíte de testes deve passar e a documentação deve ser gerada sem quaisquer warnings.

source: Once you have created your pull request, you should add a comment in the related Trac ticket explaining what you've done. In particular, you should note the environment in which you ran the tests, for instance: "all tests pass under SQLite and MySQL".
id: Sekali anda telah membuat pull request anda, anda harus menambahkan sebuah komentar di tiket Trac terkait menjelaskan apa yang telah anda lakukan. Khususnya, anda harus catat lingkungan dimana anda menjalankan percobaan, sebagai contoh: "semua percobaan lolos dibawah SQLite dan MySQL".
