Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Link to reference material rather than repeat it. Use examples and don't be reluctant to explain things that seem very basic to you - it might be the explanation someone else needs.
id: Tautkan ke bahan acuan daripada mengulanginya. Gunakan contoh dan jangan enggan menjelaskan hal-hal yang kelihatan sangan dasar ke anda- itu mungkin penjelasan seseorang lain butuhkan.
pt_br: Faça links para referências ao invés de repeti-las. Utilize exemplos e não seja relutante em explicar coisas que pareçam muito básicas para você - essa pode ser a explicação que outra pessoa precisa.

source: Providing background context helps a newcomer connect the topic to things that they already know.
id: Menyediakan konteks latar belakang membantu pendatang baru menghubungkan topik ke hal-hal yang mereka sudah ketahui.
pt_br: Contextualizar ajuda os novatos a ligar o assunto a coisas que eles já sabem.

source: :doc:`Reference guides </ref/index>` contain technical reference for APIs. They describe the functioning of Django's internal machinery and instruct in its use.
id: :doc:`Reference guides </ref/index>` mengandung acuan teknis untuk API. Mereka menggambarkan fungsi dari perlengkapan dalam Django dan petunjuk dalam penggunaannya.
pt_br: :doc:`Reference guides </ref/index>` contém referências técnicas para as APIs. Eles descrevem o funcionamento do maquinário interno do Django e instruem em sua utilização.

source: Keep reference material tightly focused on the subject. Assume that the reader already understands the basic concepts involved but needs to know or be reminded of how Django does it.
id: Jaga bahan acuan fokus pada subyek. Anggap bahwa pembaca sudah memahami konsep dasar yang dilibatkan tetapi butuh mengetahui atau diingatkan dari bagaimana Django melakukannya.
pt_br: Mantenha o material de referência focado estritamente no assunto. Assuma que o leitor já entende os conceitos básicos envolvidos mas precisa saber ou ser lembrado de como o Django faz isso.

source: Reference guides aren't the place for general explanation. If you find yourself explaining basic concepts, you may want to move that material to a topic guide.
id: Panduan acuan bukanlah tempat untuk penjelasan umum. Jika anda menemukan penjelasan konsep dasar, anda mungkin ingin memindahkan bahan itu ke panduan topik.
pt_br: Guias de referência não são o local para explicações genéricas. Se você se encontrar explicando conceitos básicos, você deve querer mover o material para um guia em um assunto em específico.

source: :doc:`How-to guides </howto/index>` are recipes that take the reader through steps in key subjects.
id: :doc:`How-to guides </howto/index>` adalah resep yang membawa pembaca melalui langkah-langkah dalam subjek kunci.
pt_br: :doc:`How-to guides </howto/index>` são receitas que levam o leitor através de uma série de passos em assuntos chave.

source: What matters most in a how-to guide is what a user wants to achieve. A how-to should always be result-oriented rather than focused on internal details of how Django implements whatever is being discussed.
id: Masalah-masalah apa paling di panduan bagaimana adalah apa yang pengguna ingin untuk dicapai. Bagaimana harus selalu berorientasi hasil daripada fokus pada rincian internal dari bagaimana Django menerapkan apapun yang sedang diobrolkan.
pt_br: O que importa mais em um guia how-to é o que um usuário deseja alcançar. Um how-to deve sempre estar orientado a resultados ao invés de focado em detalhes internos de como o Django implementa o que quer que esteja sendo discutido.

source: These guides are more advanced than tutorials and assume some knowledge about how Django works. Assume that the reader has followed the tutorials and don't hesitate to refer the reader back to the appropriate tutorial rather than repeat the same material.
id: Panduan ini lebih maju daripada tutorial dan anggapan beberapa pengetahuan tentang bagaimana Django bekerja. Anggap bahwa pembaca telah mengikuti tutorial dan tidak ragu-ragu untuk menunjuk pembaca kembali ke tutorial sesuai daripada mengulangi bahan yang sama.
pt_br: Esses guias são mais avançados que tutoriais e assumem algum conhecimento sobre como o Django trabalha. Assuma que o leitor seguiu os tutoriais e não hesite em enviar o leitor de volta para o tutorial apropriado ao invés de repetir o mesmo material.

source: Writing style
id: Gaya menulis
pt_br: Estilo de escrita

source: When using pronouns in reference to a hypothetical person, such as "a user with a session cookie", gender neutral pronouns (they/their/them) should be used. Instead of:
id: Ketika menggunakan kata ganti di acuan pada hipotesis orang, seperti "pengguna dengan sesi kue", kata ganti netral kelamin (they/their/them) harus digunakan. Sebagai gantinya:
pt_br: Quando usar pronomes em referência a uma pessoa hipotética, tais como "um usuário com um cookie de sessão", pronomes neutros (eles/seus/lhes) devem ser utilizados. Ao invés de:

source: he or she... use they.
id: dia laki-laki atau dia perempuan... gunakan mereka
pt_br: ele ou ela... utilize eles.

source: him or her... use them.
id: dia laki-laki atau dia perempuan... gunakan mereka
pt_br: Dele ou dela... utilize deles.

source: his or her... use their.
id: dia laki-laki atau dia perempuan... gunakan mereka
pt_br: Dele ou dela... utilize deles.

source: his or hers... use theirs.
id: dia laki-laki atau dia perempuan... gunakan mereka
pt_br: dele ou dela... use deles.

source: himself or herself... use themselves.
id: dia laki-laki atau dia perempuan... gunakan mereka
pt_br: ele mesmo ou ela mesma... use eles mesmos.

source: Commonly used terms
id: Istilah umum digunakan
pt_br: Termos usados com frequência

source: Here are some style guidelines on commonly used terms throughout the documentation:
id: Ini adalah beberapa panduan pada istilah paling umum digunakan sepanjang dokumentasi:
pt_br: Aqui vão algumas orientações de estilo para termos usados comumente por toda a documentação:

source: **Django** -- when referring to the framework, capitalize Django. It is lowercase only in Python code and in the djangoproject.com logo.
id: **Django** -- ketika mengacukan ke kerangka kerja, huruf besarkan Django. Huruf kecil hanya dalam kode Python dan dalam logo djangoproject.com.
pt_br: **Django** -- quando estiver se referindo ao framework, deve começar com letra maiúscula. Ele só deve ser escrito em letras minúsculas no código Python e no logo de djangoproject.com.

source: **email** -- no hyphen.
id: **surel** -- tanpa tanda penghubung
pt_br: **email** -- sem hífen.

source: **SQL** -- when referring to SQL, the expected pronunciation should be "Ess Queue Ell" and not "sequel". Thus in a phrase like "Returns an SQL expression", "SQL" should be preceded by "an" and not "a".
id: **SQL** -- ketika mengacu pada SQL, pengucapan yang diharapkan seharusnya "Ess Queue Ell" dan bukan "sequel". Dengan demikian dalam frase seperti "Returns an SQL expression", "SQL" harus didahului oleh "an" dan bukan "a".
pt_br: **SQL** -- quando estiver se referindo ao SQL, a pronunciação esperada deve ser "Ess Queue Ell" e não "sequel". Portanto, em uma frase como "Retorna uma expressão SQL", "SQL" deve ser precedido por "um" e não por "a".

source: **Python** -- when referring to the language, capitalize Python.
id: **Python** -- ketika mengac ke bahasa, huruf besar kan Python.
pt_br: **Python** -- quando estiver se referindo a linguagem, use letra maiúscula.

source: **realize**, **customize**, **initialize**, etc. -- use the American "ize" suffix, not "ise."
id: **realize**, **customize**, **initialize**, etc. -- menggunakan akhiran Amerika "ize", bukan "ise."
pt_br: **realize**, **customize**, **initialize**, etc. -- use o padrão Americano "ize" suffix, não "ise"

source: **subclass** -- it's a single word without a hyphen, both as a verb ("subclass that model") and as a noun ("create a subclass").
id: **subkelas** -- itu adalah kata tunggal tanpa tanda penghubung, kedua sebagai kata kerja ("subkelas model itu") dan sebagai kata benda ("buat sebuah subkelas").
pt_br: **subclass** -- É uma única palavra sem o hífen, tanto para o verbo ("subclassear o modelo") quanto para o substântivo ("criar uma subclasse").

source: **Web**, **World Wide Web**, **the Web** -- note Web is always capitalized when referring to the World Wide Web.
id: **Web**, **World Wide Web**, **the Web** -- catat Web selalu huruf besar ketika mengacu pada World Wide Web.
pt_br: **Web**, **World Wide Web**, **the Web** -- note que Web é sempre maiúsculo quando se referir a World Wide Web.

source: **website** -- use one word, without capitalization.
id: **website** -- gunakan satu kata, tanpa huruf besar.
pt_br: **website** -- utilize uma palavra, tudo em minúsculas.

source: Django-specific terminology
id: Istilah khusus-Django
pt_br: Terminologia específica do Django

source: **model** -- it's not capitalized.
id: **model** -- itu tidak huruf besar.
pt_br: **model** -- não tem maiúsculas.

source: **template** -- it's not capitalized.
id: **template** -- itu tidak huruf besar.
pt_br: **template** -- não tem maiúsculas.

source: **URLconf** -- use three capitalized letters, with no space before "conf."
id: **URLconf** -- gunakan tiga huruf besar, tanpa ruang sebelum "conf."
pt_br: **URLconf** -- utilize três as letras primeiras letras maiúsculas, sem espaço antes de "conf."

source: **view** -- it's not capitalized.
id: **view** -- itu tidak huruf besar.
pt_br: **view** -- não tem maiúsculas.

source: Guidelines for reStructuredText files
id: Panduan untuk berkas-berkas reStructuredText
pt_br: Orientações gerais para arquivos do tipo reStructuredText

source: These guidelines regulate the format of our reST (reStructuredText) documentation:
id: Panduan ini mengatur bentuk dari dokumentasi dari reST (reStructuredText) kami:
pt_br: Estas regras regulam o formato de nossa documentação em reST (reStructuredText):

source: In section titles, capitalize only initial words and proper nouns.
id: Di judul bagian, huruf besar hanya kata permulaan dan kata benda yang tepat.
pt_br: Na seção de títulos, só deixe em maiúsculas palavras iniciais e pronomes próprios.

source: Wrap the documentation at 80 characters wide, unless a code example is significantly less readable when split over two lines, or for another good reason.
id: Bungkus dokumentasi pada lebar 80 karakter, meskipun sebuah contoh kode secara signifikan kurang dibaca ketika dipisah terhadap dua baris, atau untukalasan baik lainnya.
pt_br: Restrinja a documentação em até 80 caracteres de comprimento, a não ser que o código de exemplo seja significativamente mais difícil de ler quando quebrado em duas linhas, ou por outra boa razão.

source: The main thing to keep in mind as you write and edit docs is that the more semantic markup you can add the better. So::
id: Hal utama untuk diingat ketika anda menulis dan menyunting dokumen adalah bahwa lebih markah semantik anda dapat tambah lebih baik. jadi::
pt_br: A principal coisa a se manter em mente enquanto você escreve e edita documentos é que quanto mais marcação semântica você puder adicionar melhor. Então::

source: Isn't nearly as helpful as::
id: Hampir tidak bermanfaat sebagai ::
pt_br: Não é nem de perto melhor do que::

source: This is because Sphinx will generate proper links for the latter, which greatly helps readers.
id: Ini karena Sphinx akan membangkitkan kaitan yang tepat untuk yang terakhir, yang sangat membantu pembaca.

source: You can prefix the target with a ``~`` (that's a tilde) to get just the "last bit" of that path. So ``:mod:`~django.contrib.auth``` will just display a link with the title "auth".
id: Anda dapat awali sasaran dengan sebuah ``~`` (itu adalah tilde) untuk mendapatkan "bit terakhir" dari jalur. Jadi ``:mod:`~django.contrib.auth``` akan hanya menampilkan sebuah tautan dengan judul "auth".

source: Use :mod:`~sphinx.ext.intersphinx` to reference Python's and Sphinx' documentation.
id: Gunakan :mod:`~sphinx.ext.intersphinx` untuk mengacu dokumentasi Python and Sphinx'.
pt_br: Utilize :mod:`~sphinx.ext.intersphinx` para referenciar a documentação do Python e do Sphinx.

source: Add ``.. code-block:: <lang>`` to literal blocks so that they get highlighted. Prefer relying on automatic highlighting simply using ``::`` (two colons). This has the benefit that if the code contains some invalid syntax, it won't be highlighted. Adding ``.. code-block:: python``, for example, will force highlighting despite invalid syntax.
id: Tambah ``.. code-block:: <lang>`` pada blok tepat sehingga mereka mendapatkan disorot. Pilih mengandalkan pada penyorotan otomatis hanya menggunakan ``::`` (dua titik dua). Ini mempunyai keuntungan bahwa jika kode mengandung beberapa sintaksis tidak sah, itu tidak akan disorot. Menambahkan ``.. code-block:: python``, sebagai contoh, akan memaksa menyorot meskipun sintaksis tidak sah.

source: Use these heading styles::
id: Gunakan gaya kepala ini::
pt_br: Utilize esses estilos de cabeçalhos:

source: Django-specific markup
id: Markah khusus-Django
pt_br: Marcação específica do Django

source: Besides the :ref:`Sphinx built-in markup <sphinx:sphinxmarkup>`, Django's docs defines some extra description units:
id: Disamping itu :ref:`Sphinx built-in markup <sphinx:sphinxmarkup>`, dokumen Django menentukan beberapa satuan gambaran tambahan:

source: Settings::
id: Pengaturan::

source: To link to a setting, use ``:setting:`INSTALLED_APPS```.
id: Untuk mengkaitkan ke pengaturan, gunakan ``:setting:`INSTALLED_APPS```.
pt_br: Para redirecionar para uma configuração, utilize ``:setting:`INSTALLED_APPS```.

source: Template tags::
id: Cetakan etiket::
pt_br: Tags de templates::

source: To link, use ``:ttag:`regroup```.
id: Untuk mengkaitkan, gunakan ``:ttag:`regroup```.
pt_br: Para redirecionar, utilize ``:ttag:`regroup```.

source: Template filters::
id: Cetakan penyaring::
pt_br: Filtros de templates::

source: To link, use ``:tfilter:`linebreaksbr```.
id: Untuk mengkaitkan, gunakan ``:tfilter:`linebreaksbr```.
pt_br: Para redirecionar, utilize ``:tfilter:`linebreaksbr```.

source: Field lookups (i.e. ``Foo.objects.filter(bar__exact=whatever)``)::
id: Pencarian bidang (yaitu ``Foo.objects.filter(bar__exact=whatever)``)::
pt_br: Busca de campos (por exemplo, `Foo.objects.filter(bar__exact=qualquercoisa)``)::

source: To link, use ``:lookup:`exact```.
id: Untuk mengkaitkan, gunakan ``:lookup:`exact```.
pt_br: Para redirecionar, utilize ``:lookup:`exact```.

source: ``django-admin`` commands::
id: Perintah ``django-admin``::
pt_br: Comandos do ``django-admin``::

source: To link, use ``:djadmin:`migrate```.
id: Untuk mengkaitkan, gunakan ``:djadmin:`migrate```.
pt_br: Para redirecionar, utilize ``:djadmin:`migrate```.

source: ``django-admin`` command-line options::
id: Pilihan baris-perintah ``django-admin``::
pt_br: Opções de linha de comando do ``django-admin``::

source: To link, use ``:option:`command_name --traceback``` (or omit ``command_name`` for the options shared by all commands like ``--verbosity``).
id: Untuk menautkan, gunakan ``:option:`command_name --traceback``` (atau hilangkan ``command_name`` untuk pilihan yang dibagi oleh semua perintah seperti ``--verbosity``).
pt_br: Para redirecionar, utilize ``:option:`command_name --traceback``` (ou omita ``command_name`` para as opções compartilhadas por todos os comandos como ``--verbosity``).

source: Links to Trac tickets (typically reserved for patch release notes)::
id: Tautan ke tiket Trac (khususnya disediakan untuk catatan terbitan tambalan)::
pt_br: Redirecionar para os tickets do Trac (tipicamente reservado a notas de releases de patches)::

source: Documenting new features
id: Mendokumentasikan fitur baru
pt_br: Documentando novas funcionalidades

source: Our policy for new features is:
id: Kebijakan kami untuk fitur baru adalah:
pt_br: Nossa política para novas funcionalidades é:

source: All documentation of new features should be written in a way that clearly designates the features are only available in the Django development version. Assume documentation readers are using the latest release, not the development version.
id: Semua dokumentasi dari fitur baru harus ditulis dalam cara yang menamai jelas fitur hanya tersedia di versi pengembangan Django. Anggap dokumetnasi menggunakan terbitan terakhir, bukan versi pengembangan.
pt_br: Toda a documentação de novas funcionalidades devem ser escritas de forma que fique claro que as funcionalidade só estão disponíveis na versão de desenvolvimento do Django. Assuma que os leitores da documentação estão usando a última release, e não a última versão de desenvolvimento.

source: Our preferred way for marking new features is by prefacing the features' documentation with: "``.. versionadded:: X.Y``", followed by a mandatory blank line and an optional description (indented).
id: Pilihan cara kami untuk menandai fitur baru adalah dengan mendahulukan fitur dokumentasi dengan "``.. versionadded:: X.Y``", diikuti oleh baris kosong wajib dan pilihan gambaran (bertakuk).
pt_br: Nossa forma preferida de marcar novas funcionalidades é adicionando um prefixo na documentação de novas funcionalidades com "``.. versionadded:: X.Y``", seguidas de uma linha em branco mandatória e uma descrição opcional (identada).

source: General improvements, or other changes to the APIs that should be emphasized should use the "``.. versionchanged:: X.Y``" directive (with the same format as the ``versionadded`` mentioned above.
id: Perbaikan umum, atau perubahan lain pada API yang harus digarisbawahi harus menggunakan petunjuk "``.. versionchanged:: X.Y``" (dengan bentuk sama sebagai ``versionadded`` disebutkan diatas.
pt_br: Melhorias gerais, ou outras mudanças para as APIs que deveriam ser enfatizadas devem usar a diretiva "``.. versionchanged:: X.Y``" (com o mesmo formato de ``versionadded`` mencionado acima.

source: These ``versionadded`` and ``versionchanged`` blocks should be "self-contained." In other words, since we only keep these annotations around for two releases, it's nice to be able to remove the annotation and its contents without having to reflow, reindent, or edit the surrounding text. For example, instead of putting the entire description of a new or changed feature in a block, do something like this::
id: Blok ``versionadded`` dan ``versionchanged`` ini harus "berdikari". Dengan kata lain, sejak kami hanya menjaga keterangan ini sekitar untuk dua terbitan, itu sangat baik dapat memindahkan keterangan dan isinya tanpa harus reflow, memasukkan ulang, atau menyunting teks sekelilingnya. Sebagai contoh, daripada menaruh gambaran keseluruhan dari fitur baru atau berubah dalam blok, lakukan sesuatu seperti ini::
pt_br: Esses blocos ``versionadded`` e ``versionchanged`` devem ser "auto contidos". Em outras palavras, já que nós só vamos manter essas anotações por volta de duas releases, é um bom poder remover a anotação e seus conteúdo sem ter que re-escoar, re-identar ou editar o texto ao redor. Por exemplo, ao invés de colocar a descrição inteira de uma mudança ou de uma nova funcionalidade em um block, faça algo como a seguir::

source: Put the changed annotation notes at the bottom of a section, not the top.
id: Taruh perubahan catatan penjelasan pada bawah dari bagian, bukan diatas.
pt_br: Coloque as considerações referentes as mudanças anotadas no final das seções, não no topo.

source: Also, avoid referring to a specific version of Django outside a ``versionadded`` or ``versionchanged`` block. Even inside a block, it's often redundant to do so as these annotations render as "New in Django A.B:" and "Changed in Django A.B", respectively.
id: Juga, hindari menunjukkan pada versi khusus dari Django diluar blok ``versionadded`` atau ``versionchanged``. Bahkan didalam sebuah blok, itu sering berulang untuk melakukan seperti pembangun keterangan ini seperti "Baru di Django A.B:" and "Berubah di Django A.B", masing-masing.
pt_br: Além disso, evite mencionar uma versão específica do Django fora dos blocos ``versionadded`` ou ``versionchanged``. Mesmo dentro de um bloco, Ainda costuma ser redundantes fazer isso já que essas anotações irão renderizar como "Novo no Django A.B" e "Alterado no Django A.B", respectivamente.

source: If a function, attribute, etc. is added, it's also okay to use a ``versionadded`` annotation like this::
id: Jika sebuah fungsi, atribut, dll. ditambahkan, itu juga tidak masalah menggunakan keterangan ``versionadded`` seperti ini::
pt_br: Se a função, atributo, etc. é adicionado, também pode ser usado uma anotação ``versionadded`` como a seguir::

source: We can simply remove the ``.. versionadded:: A.B`` annotation without any indentation changes when the time comes.
id: Kami dapat dengan mudah memindahkan keterangan ``.. versionadded:: A.B`` tanpa perubahan lekukan ketika waktu datang.
pt_br: Nós podemos simplesmente remover a anotação ``.. versionadded:: A.B`` sem quaisquer mudanças de identação quando a hora chegar.

source: Minimizing images
id: Mengecilkan gambar
pt_br: Minimizando imagens

source: Optimize image compression where possible. For PNG files, use OptiPNG and AdvanceCOMP's ``advpng``:
id: Optimalkan pemampatan gambar dimana memungkinkan. Untuk berkas-berkas PNG, gunakan OptiPNG dan ``advpng`` AdvanceCOMP:
pt_br: Otimize a compressão das imagens quando possível. Para arquivos PNG, utilize OptiPNG e o "advpng" da AdvanceCOMP:

source: This is based on OptiPNG version 0.7.5. Older versions may complain about the ``--strip all`` option being lossy.
id: Ini berbasis pada OptiPNG versi 0.7.5. Versi lama mungkin mengeluh tentang pilihan ``--strip all`` menjadi lossy.
pt_br: Isso é baseado na versão 0.7.5 do OptiPNG. Versões mais antigas podem reclamar da opção ``--strip all`` dizendo que existirá perda de qualidade.

source: An example
id: Sebuah contoh
pt_br: Um exemplo

source: For a quick example of how it all fits together, consider this hypothetical example:
id: Untuk contoh cepat dari bagaimana semua cocok bersama-sama, pertimbangkan contoh hipotesis ini:
pt_br: Para um rápido exemplo de como tudo se encaixa, considere este exemplo hipotético:

source: First, the ``ref/settings.txt`` document could have an overall layout like this:
id: Pertama, dokumen ``ref/settings.txt`` dapat mempunyai tata letak keseluruhan seperti ini:
pt_br: Primeiro, o documento ``ref/settings.txt`` pode ter um leiaute geral como esse:

source: Next, the ``topics/settings.txt`` document could contain something like this:
id: Selanjutnya, dokumen ``topics/settings.txt`` dapat mengandung sesuatu seperti ini:
pt_br: Depois, o documento ``topics/settings.txt`` pode ser algo assim:

source: We use the Sphinx :rst:role:`doc` cross reference element when we want to link to another document as a whole and the :rst:role:`ref` element when we want to link to an arbitrary location in a document.
id: Kami menggunakan Sphinx :rst:role:`doc` unsur penunjukan silang ketika kami ingin menautkan dokumen lain sebagai keseluruhan dan unsur :rst:role:`ref` ketika kami ingin menautkan tempat berubah-ubah dalam sebuah dokumen.
pt_br: Nós usamos o elmento de referência cruzada do Sphinx :rst:role:`doc` quando nós queremos redirecionar para outro documento como um todo e o elemento :rst:role:`ref` quando queremos redirecionar para uma localização arbitrária dentro do documento.

source: Next, notice how the settings are annotated:
id: Selanjutnya, perhatikan bagaimana pengaturan dijelaskan:
pt_br: Depois, repare em como os settings são anotados:
