Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: When a ticket has completed its useful lifecycle, it's time for it to be closed. Closing a ticket is a big responsibility, though. You have to be sure that the issue is really resolved, and you need to keep in mind that the reporter of the ticket may not be happy to have their ticket closed (unless it's fixed, of course). If you're not certain about closing a ticket, just leave a comment with your thoughts instead.
id: Ketika sebuah tiket telah melengkapi daur hidupnya, saatnya untuk itu ditutup. Menutup sebuah tiket adalah tanggung jawab besar, meskipun. Anda harus memastikan bahwa masalah benar-benar terselesaikan, dan anda butuh mengingat bahwa pelapor dari tiket mungkin tidak senang tiket mereka ditutup (meskipun sudah diperbaiki, tentunya). Jika anda tidak yakin tentang menutup sebuah tiket, ebih baik tinggalkan komentar dengan pemikiran anda.
pt_br: Quando um ticket completa o seu ciclo de vida útil, chegou a hora de fechá-lo. Porém, fechar um ticket é uma grande responsabilidade. Você precisa ter certeza que o problema está realmente resolvido, e você precisa manter em mente que quem reportou o ticket pode não gostar de ter tido o seu ticket fechado (a não ser que o problema tenha sido corrigido, claro). Se você não tem certeza se deve fechá-lo, ao invés fechá-lo, deixe um comentário com sua opinião a respeito.

source: If you do close a ticket, you should always make sure of the following:
id: Jika anda menutup sebuah tiket, anda harus selalu memastikan berikut:
pt_br: Se você realmente for fechar um ticket, você sempre deve ter certeza de que:

source: Be certain that the issue is resolved.
id: Pastikan bahwa masalah terselesaikan.
pt_br: Certifique-se de que o problema foi resolvido.

source: Leave a comment explaining the decision to close the ticket.
id: Tinggalkan komentar menjelaskan keputusan untuk menutup tiket.
pt_br: Deixe um comentário explicando a decisão de fechar o ticket.

source: If there is a way they can improve the ticket to reopen it, let them know.
id: JIka ada cara mereka dapat memperbaiki tiket untuk membukanya, biarkan mereka mengetahui.
pt_br: Se existe uma forma de melhorar o ticket para que ele seja reaberto, informe como.

source: If the ticket is a duplicate, reference the original ticket. Also cross-reference the closed ticket by leaving a comment in the original one -- this allows to access more related information about the reported bug or requested feature.
id: Jika tiket ganda, acukan tiket asli. Juga periksa acuan tiket tertutup dengan meninggalkan komentar dalam satu yang asli -- ini mengizinkan untuk mengakses lebih informasi terkait tentang kesalahan dilaporkan atau fitur diminta.
pt_br: Se o ticket está duplicado, faz uma referência ao ticket original. Também faça uma referência cruzada no ticket fechado deixando um comentário no ticket original -- isso permite acessar mais informações sobre o bug relatado ou a funcionalidade solicitada.

source: **Be polite.** No one likes having their ticket closed. It can be frustrating or even discouraging. The best way to avoid turning people off from contributing to Django is to be polite and friendly and to offer suggestions for how they could improve this ticket and other tickets in the future.
id: **Sopanlah** Tidak seorangpun suka tiket milik mereka tutup. Itu dapat mengecewakan atau bahkan mengecilkan. Jalan terbaik untuk menghindari merubah orang dari membantu ke Django adalah menjadi sopan dan ramah dan untuk menawarkan saran untuk bagaimana mereka dapat memperbaiki tiket ini dan tiket lainnya di masa depan.
pt_br: **Seja educado** Ninguém gosta de ter o seu ticket fechado. Isso pode ser frustrante e até mesmo desencorajante. A melhor forma de evitar que pessoas deixem de contribuir com o Django é sendo gentil e educado oferecendo sugestões sobre como eles podem melhorar esse ticket e outros tickets no futuro.

source: A ticket can be resolved in a number of ways:
id: Sebuah tiket dapat diselesaikan dalam sejumlah jalan:
pt_br: Um ticket pode ser resolvido de diversas maneiras:

source: fixed
id: diperbaiki
pt_br: Corrigido

source: Used by the core developers once a patch has been rolled into Django and the issue is fixed.
id: Digunakan oleh pengembang inti sekali sebuah tambalan telah di gulingkan ke dalam Django dan masalah diperbaiki.
pt_br: Utilizado pelos desenvolvedores do projeto quando um patch foi incorporado ao Django e o problema corrigido.

source: invalid
id: tidak sah
pt_br: Inválido

source: Used if the ticket is found to be incorrect. This means that the issue in the ticket is actually the result of a user error, or describes a problem with something other than Django, or isn't a bug report or feature request at all (for example, some new users submit support queries as tickets).
id: Digunakan jika tiket ditemukan tidak benar. Ini berarti bahwa masalah dalam tiket sebenarnya hasil dari kesalahan pengguna, atau menggambarkan sebuah masalah dengan sesuatu selain daripada Django, atau bukan laporan kesalahan atau permintaan kesalahan (sebagai contoh, beberapa pengguna baru mengajukan permintaan dukungan sebagai tiket).
pt_br: Utilizado caso constatado que o ticket estava incorreto. Isso significa que o problema relatado no ticket é na verdade o resultado de um erro cometido pelo usuário, ou descreve um problema com algo não relacionado ao Django, ou se não é um relato de um bug ou a solicitação de uma nova funcionalidade (por exemplo, alguns novos usuários enviam dúvidas de suporte como tickets).

source: Used when a core developer decides that this request is not appropriate for consideration in Django. This is usually chosen after discussion in the |django-developers| mailing list. Feel free to start or join in discussions of "wontfix" tickets on the |django-developers| mailing list, but please do not reopen tickets closed as "wontfix" by a :doc:`core developer</internals/team>`.
id: Digunakan ketika pengembang inti memutuskan bahwa permintaan ini tidak sesuai untuk pertimbangan dalam Django. Ini biasanya dipilih setelah obrolan dalam daftar penyuratan |django-developers|. Merasa bebas untuk mulai atau bergabung daam obrolan dari tiket "wontfix" pada daftar penyuratan, tetapi mohon jangan membuka kembali tiket tertutup sebagai "wontfix" oleh :doc:`core developer</internals/team>`.
pt_br: Usado quando o desenvolvedor do projeto decide que a funcionalidade não é apropriada para consideração no Django. Isso geralmente é decidido após de uma discussão na lista de email django-developers. Sinta-se livre para iniciar ou se juntar em uma discussão de tickets do tipo "wontfix" na lista django-developers, mas por favor não reabra tickets fechados como "wontfix" por um :doc:`desenvolvedor do projeto</internals/team>`.

source: duplicate
id: rangkap
pt_br: Duplicado

source: Used when another ticket covers the same issue. By closing duplicate tickets, we keep all the discussion in one place, which helps everyone.
id: Digunakan ketika tiket lainnya menutuoi masalah sama. Dengan menutup tiket ganda, kami menjaga semua obrolan dalam satu tempat, yang membantu semua orang.
pt_br: Usado quando outro ticket cobre o mesmo problema. Fechando tickets duplicados, nós mantemos toda a discussão em um só local, o que ajuda todo mundo.

source: Used when the ticket doesn't contain enough detail to replicate the original bug.
id: Digunakan ketika tiket tidak mengandung cukup rincian untuk mengulangi kesalahan asli.
pt_br: Usado quando o ticket não contém detalhes o suficiente para replicar o bug original.

source: Used when the ticket does not contain enough information to replicate the reported issue but is potentially still valid. The ticket should be reopened when more information is supplied.
id: Digunakan ketika tiket tidak mengandung cukup informasi untuk mengulangi masalah dilaporkan tetapi masih berpotensi sah. Tiket harus dibuka kembali ketika informasi lebih dipasok.
pt_br: Usado quando o ticket não contém informação o suficiente para replicar o problema relatado mas ainda tem o potencial de ser válido. O ticket deve ser reaberto quando mais informações foram fornecidas.

source: If you believe that the ticket was closed in error -- because you're still having the issue, or it's popped up somewhere else, or the triagers have made a mistake -- please reopen the ticket and provide further information. Again, please do not reopen tickets that have been marked as "wontfix" by core developers and bring the issue to |django-developers| instead.
id: Jika anda percaya bahwa tiket yang telah ditutup dalam salah -- karena anda masih mempunyai masalah sama, atau itu muncul ditempat lain, atau penyortir telah membuat sebuah kesalahan -- silahkan buka kembali tiket dan sediakan informasi lebih lanjut. Kembali, mohon jangan dibuka kembali tiket yang telah ditandai sebagai "wontfix" oleh pengembang inti dan membawa masalah ke |django-developers|.
pt_br: Se você acha que o ticket foi fechado indevidamente -- porque você ainda está tendo problemas, ou o problema apareceu em outro lugar, ou os agentes de triagem cometeram um erro -- por favor reabra o ticket fornecendo mais informações. Novamente, por favor não reabra tickets que foram marcados com a tag "wonfix" pelos desenvolvedores do projeto, nesses casos traga o problema para lista django-developers.

source: How can I help with triaging?
id: Bagaimana saya dapat membantu dengan penyortiran?
pt_br: Como eu posso ajudar com a triagem?

source: The triage process is primarily driven by community members. Really, **ANYONE** can help.
id: Pengolahan penyortiran adalah utamanya dikendalikan oleh anggota komunitas. Benar, **SIAPAPUN** dapat membantu.
pt_br: O processo de triagem é controlado primeiramente pelos membros da comunidade. De verdade, **QUALQUER PESSOA** pode ajudar.

source: Core developers may provide feedback on issues they're familiar with, or make decisions on controversial ones, but they aren't responsible for triaging tickets in general.
id: Pengembang inti mungkin menyediakan umpan balik pada masalah yang mereka paham, atau membuat keputusan pada satu yang berlawanan, tetapi mereka tidak bertanggung jawab untuk penyortiran tiket secara umum.
pt_br: Desenvolvedores do projeto podem fornecer feedback em problemas nos quais eles estejam familiarizados, ou tomar decisões em problemas controversos, mas eles não são responsáveis pela triagem em geral.

source: To get involved, start by `creating an account on Trac`_. If you have an account but have forgotten your password, you can reset it using the `password reset page`_.
id: Untuk ikut serta, mulai dengan `membuat sebuah akun pada Trac`_. Jika anda mempunyai sebuah akun tetapi lupa sandi anda, anda dapat menyetel kembali menggunakan `password reset page`_.
pt_br: Para contribuir, comece `criando uma conta no Trac`_. Se você tem uma conta mas esqueceu a sua senha, você pode resetá-la usando a `página de recuperação de senha`_.

source: Then, you can help out by:
id: lalu, anda dapat membantu dengan:
pt_br: A partir disso, você poderá ajudar com:

source: Closing "Unreviewed" tickets as "invalid", "worksforme" or "duplicate."
id: Menutup tiket "Unreviewed" sebagai "invalid", "worksforme" atau "duplicate."
pt_br: Fechando tickets do tipo "Unreviewed" como "invalid", "worksforme" ou "duplicate".

source: Closing "Unreviewed" tickets as "needsinfo" when the description is too sparse to be actionable, or when they're feature requests requiring a discussion on |django-developers|.
id: Menutup tiket "Unreviewed" sebagai "needsinfo" ketika gambaran terlalu jarang menjadi ditindaklanjuti, atau ketika mereka sedang meminta fitur membutuhkan obrolan pada |django-developers|.
pt_br: Fechando tickets "Inreviewed" como "needsinfo" quando a descrição é muito esparsa para ser acionável, ou quando eles são solicitações de funcionalidades requerindo uma discussão em |django-developers|.

source: Correcting the "Needs tests", "Needs documentation", or "Has patch" flags for tickets where they are incorrectly set.
id: Memperbaiki bendera "Butuh percobaan", "Butuh dokumentasi", atau "Mempunyai tambalan" untuk tiket dimana mereka disetel tidak benar.
pt_br: Corrigindo as flags "Needs tests", "Needs documentation", ou "Has patch" para tickets onde eles são setados incorretamente.

source: Setting the "`Easy pickings`_" flag for tickets that are small and relatively straightforward.
id: Mengatur bendera "`Easy pickings`_" untuk tiket yang kecil dan relatif mudah.
pt_br: Adicionando a flag "`Easy pickings`_" para tickets que são pequenos e relativamente simples.

source: Set the *type* of tickets that are still uncategorized.
id: Setel *jenis* dari tiket yang masih belum dikelompokkan.
pt_br: Adicionando um *tipo* para os tickets que ainda não foram categorizados.

source: Checking that old tickets are still valid. If a ticket hasn't seen any activity in a long time, it's possible that the problem has been fixed but the ticket hasn't yet been closed.
id: Memeriksa tiket lama itu masih sah. Jika sebuah tiket tidak kelihatan aktifitas apapun dalam jangka lama, itu dimungkinkan bahwa masalah telah diperbaiki tetapi tiket belum ditutup.
pt_br: Verificando se tickets antigos ainda são válidos. Se o ticket não possui atividade em um longo período, é possível que o problema tenha sido corrigido mas o ticket ainda não foi fechado.

source: Identifying trends and themes in the tickets. If there are a lot of bug reports about a particular part of Django, it may indicate we should consider refactoring that part of the code. If a trend is emerging, you should raise it for discussion (referencing the relevant tickets) on |django-developers|.
id: Kenali gaya dan tema dalam tiket. Jika ada banyak laporan kesalahan tentang bagian tertentu dari Django, itu mungkin menandakan kami harus mempertimbangkan refaktorisasi bagian itu dari kode. Jika sebuah gaya muncul, anda harus menampilkannya untuk obrolan (mengacu tiket yang sesuai) pada |django-developers|.
pt_br: Identificando tendências e temas nos tickets. Se existem vários relatos de bugs sobre uma determinada parte do Django, isso pode indicar que nós deveríamos refatorar essa parte do código. Se a tendência está emergindo, você pode trazer ela para discussão (referenciando os tickets relevantes) em django-developers.

source: Verify if patches submitted by other users are correct. If they are correct and also contain appropriate documentation and tests then move them to the "Ready for Checkin" stage. If they are not correct then leave a comment to explain why and set the corresponding flags ("Patch needs improvement", "Needs tests" etc.).
id: Periksa jika tambalan diajukan oleh pengguna lain adalah benar. Jika mereka benar dan juga mengandung dokumentasi dan percobaan yang sesuai kemudian pindahkan mereka ke tahapan "Siap untuk Pendaftaran". Jika mereka tidak benar lalu tinggalkan sebuah komentar untuk menjelaskan mengapa dan setel bendera sesuai ("Tambalan butuh perbaikan", "Butuh percobaan" dll.).
pt_br: Verifique se os patches submetidos por outros usuários estão corretos. Se eles estiverem e se também contém documentações e testes apropriados então mova os para o estágio "Ready for Checkin". Se eles não estão corretos deixe um comentário explicando porque e ative as flags correspondentes ("Patch needs improvement", "Needs tests", etc.).

source: The `Reports page`_ contains links to many useful Trac queries, including several that are useful for triaging tickets and reviewing patches as suggested above.
id: `Reports page`_ mengandung tautan ke banyak permintaan Trac berguna, termasuk beberapa yang berguna untuk memberikan tiket dan meninjau tambalan sebagai disarankan diatas.
pt_br: A `página de reports`_ contém links para muitas consultas úteis no Trac, incluindo várias que podem ser usadas na triagem dos tickets e na revisão de patches como sugerido acima.

source: You can also find more :doc:`new-contributors`.
id: Anda dapa juga menemukan lebih :doc:`new-contributors`.
pt_br: Você também pode encontrar mais em :doc:`novos-voluntários`.

source: However, we do ask the following of all general community members working in the ticket database:
id: Bagaimanapun, kami meminta berikut semua anggota komunitas umum yang bekerja di basisdata tiket:
pt_br: Porém, nós pedimos o seguinte de todos os membros da comunidade trabalhando no banco de dados de tickets:

source: Please **don't** close tickets as "wontfix." The core developers will make the final determination of the fate of a ticket, usually after consultation with the community.
id: Mohon **jangan** tutup tiket sebagai "wontfix." Pengembang inti akan membuat penentuan akhir dari takdir sebuah tiket, biasanya setelah berunding dengan komunitas.
pt_br: Por favor **não** feche tickets usando "wontfix". Os desenvolvedores do Django determinaram o destino final de um ticket, geralmente depois de uma consulta a comunidade.

source: Please **don't** promote your own tickets to "Ready for checkin". You may mark other people's tickets which you've reviewed as "Ready for checkin", but you should get at minimum one other community member to review a patch that you submit.
id: Mohon **jangan** mengenalkan tiket anda sendiri ke "Siap untuk Pendaftaran". Anda mungkin menandai tiket orang lain yang anda telah tinjau sebagai "Siap untuk Pendaftaran", tetapi anda harus mendapatkan minimal satu anggota komunitas lain untuk meninjau sebuah tambalan yang anda ajukan.
pt_br: Por favor **não** promova seus próprios tickets para "Ready for Checkin". Você pode marcar os tickets de outras pessoas que você tenha revisado como "Ready for Checkin", mas você deve ter pelo menos um membro da comunidade revisando um patch que você tenha submetido.

source: Please **don't** reverse a decision that has been made by a :doc:`core developer</internals/team>`. If you disagree with a decision that has been made, please post a message to |django-developers|.
id: Mohon **jangan** membalikkan keputusan yang telah dibuat oleh :doc:`pengembang inti</internals/team>`. Jika anda tidak setuju dengan sebuah keputusan yang telah dibuat, silahkan tempatkan sebuah pesan ke |django-developers|.
pt_br: Por favor **não** reverta uma decisão que tenha sido tomada por um :doc:`desenvolvedor do projeto</internals/team>`. Se você não concordar com a decisão que ele foi tomada, por favor poste uma mensagem em |django-developers|.

source: If you're unsure if you should be making a change, don't make the change but instead leave a comment with your concerns on the ticket, or post a message to |django-developers|. It's okay to be unsure, but your input is still valuable.
id: Jika anda tidak yakin jika anda harus membuat sebuah perubahan, jangan membuat perubahan tetapi lebih baik tinggalkan sebuah komentar dengan perhatian anda pada tiket, atau tempatkan sebuah pesan ke |django-developers|. Tidak apa-apa untuk tidak yakin, tetapi masukan anda masih berharga.
pt_br: Se vocẽ não tem certea se você deve ou não fazer uma alteração, não faça a alteração e ao invés disso deixe um comentário com suas reflexões no ticket, ou poste uma mensagem em |django-developers|. Não tem problema não ter certeza, mas suas considerações ainda são válidas.

source: Bisecting a regression
id: Membagi dua pemulihan
pt_br: Bisseccionando uma regressão

source: A regression is a bug that's present in some newer version of Django but not in an older one. An extremely helpful piece of information is the commit that introduced the regression. Knowing the commit that caused the change in behavior helps identify if the change was intentional or if it was an inadvertent side-effect. Here's how you can determine this.
id: Pemulihan adalah sebuah kesalahan yang hadir dalam beberapa versi terbaru dari Django tetapi tidak di versi lama. Sepotong informasi sangat membantu adalah perbaikan yang memperkenalkan pemulihan. Sepengetahuan penyerahan yang menyebabkan perubahan dalam kebiasaan membantu mencirikan jika perubahan disengaja atau jika itu efek samping tidak sengaja. Disini bagaimana anda dapat menentukan ini.
pt_br: Uma regressão é um bug que está presente em alguma versão nova do Django mas não em versões mais antigas. Uma informação extremamente valiosa é o commit que introduziu a regressão. Saber qual foi o commit que causou a mudança de comportamento ajuda a identificar se a mudança foi intencional ou se ela foi um efeito colateral inesperado. Aqui vamos mostrar como você pode determinar isso.

source: Begin by writing a regression test for Django's test suite for the issue. For example, we'll pretend we're debugging a regression in migrations. After you've written the test and confirmed that it fails on the latest master, put it in a separate file that you can run standalone. For our example, we'll pretend we created ``tests/migrations/test_regression.py``, which can be run with::
id: Mulai dengan menulis percobaan pemulihan untuk deretan percobaan Django untuk masalah. Sebagai contoh, kami akan berpura-pura kami sedang mencari kesalahan dalam perpindahan. Setelah anda menulis percobaan dan menegaskan bahwa kegagalan itu pada master terakhir, taruh itu dalam berkas berbeda yang anda dapat jalankan secara berdiri sendiri. Sebagai contoh, kami akan berpura-pura kami membuat ``tests/migrations/test_regression.py``, yang dapat dijalankan dengan::
pt_br: Comece escrevendo um teste de regressão na suíte de testes do Django para o problema. Por exemplo, nós vamos imaginar que nós estamos debugando uma regressão nas migrações. Depois de você ter escrito o teste e confirmado que ele falha na última versão da master, coloque-o em um arquivo separado que você possa rodar sozinho. Para o nosso exemplo, nós vamos imaginar que nós criamos o arquivo ``tests/migrations/test_regression.py``, que pode ser rodado com::

source: Next, we mark the current point in history as being "bad" since the test fails::
id: Selanjutnya, kami menandai titik saat ini dalam sejarah menjadi "buruk" sejak kegagalan percobaan::
pt_br: Em seguida, marque o ponto atual no histórico como sendo "ruim" já que o teste falhou::

source: Now, we need to find a point in git history before the regression was introduced (i.e. a point where the test passes). Use something like ``git checkout HEAD~100`` to checkout an earlier revision (100 commits earlier, in this case). Check if the test fails. If so, mark that point as "bad" (``git bisect bad``), then checkout an earlier revision and recheck. Once you find a revision where your test passes, mark it as "good"::
id: Sekarang, kami butuh menemukan titi dalam sejarah git sebelum pemulihan diperkenalkan (yaitu sebuah titik dimana percobaan lulus). Gunakan sesuatu seperti ``git checkout HEAD~100`` untuk memeriksa pembetulan awal (100 perbaikan awal, dalam kasus ini). Periksa jika percobaan gagal. Jika demikian, tandai titik itu sebagai "buruk" (``git bisect bad``), lalu periksa pembetulan awal dan periksa kembali. Sekali anda menemukan pembetulan dimana percobaan anda lulus, tandai itu sebagai "bagus"::
pt_br: Agora, nós precisamos encontrar um ponto no histórico do git anterior a introdução da regressão (por exemplo, um ponto onde os testes passam). Utilize algo como ``git checkout HEAD~100`` para fazer checkout de uma revisão anterior (100 commits antes, neste caso). Verifique se os testes falham. Se isso ocorrer, marque o ponto como sendo "ruim" ("git bisect bad"), então faça checkout de uma revisão mais antiga e verifique novamente. Quando você encontrar uma revisão em que os seus testes passam, marque ela como "boa"::
