Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: A feature release may deprecate certain features from previous releases. If a feature is deprecated in feature release A.x, it will continue to work in all A.x versions (for all versions of x) but raise warnings. Deprecated features will be removed in the B.0 release, or B.1 for features deprecated in the last A.x feature release to ensure deprecations are done over at least 2 feature releases.
id: Sebuah terbitan fitur mungkin mengusangkan fitur tertentu dari terbitan sebelumnya. Jika sebuah fitur diusangkan di terbitan fitur A.x, itu akan menlanjutkan bekerja di semua versi A.x (untuk semua versi dari x) tetapi menampilkan peringatan. Fitur diusangkan akan dipindahkan di terbitan B.0, atau B.1 untuk pengusangan fitur di terbitan fitur A.x terakhir untuk memastikan pengusangan selesai setidaknya 2 terbitan fitur.
pt_br: Uma feature release pode depreciar algumas funcionalidades de releases prévias. Se uma funcionalidade é depreciada em uma feature release A.x, ela irá continuar a funcionar em todas as versões A.x (para todas as versões de x) mas gerando warnings. Funcionalidades depreciadas serão removidas em uma release B.0, ou B.1 para features depreciadas na última feature release A.x para garantir que as depreciações sejam realizadas após pelo menos 2 feature releases.

source: So, for example, if we decided to start the deprecation of a function in Django 4.2:
id: Jadi, sebagai contoh, jika kami memutuskan untuk mulai mengusangkan dari sebuah fungsi di Django 4.2:
pt_br: Então, por exemplo, se nós decidimos começar a depreciação de uma função no Django 4.2:

source: Django 4.2 will contain a backwards-compatible replica of the function which will raise a ``RemovedInDjango51Warning``.
id: Django 4.2 akan mengandung tiruan kesesuaian-kebelakang dari fungsi yang akan memunculkan ``RemovedInDjango51Warning``.

source: Django 5.0 (the version that follows 4.2) will still contain the backwards-compatible replica.
id: Django 5.0 (versi yang mengikuti 4.2) akan masih mengandung tiruan kesesuaian-kebelakang.

source: Django 5.1 will remove the feature outright.
id: Django 5.1 akan memindahkan fitur sekaligus.
pt_br: Django 5.1 irá remover a funcionalidade por completo.

source: The warnings are silent by default. You can turn on display of these warnings with the ``python -Wd`` option.
id: Peringatan diam secara awal. Anda dapat menyalakan tampilan dari peringatan ini dengan pilihan ``python -Wd``.

source: A more generic example:
id: Contoh umum lain:
pt_br: Um exemplo mais genérico:

source: Y.0: Drop deprecation shims added in X.0 and X.1.
id: Y.0: Menjatuhkan pengusangan shim ditambahkan di X.0 dan X.1.
pt_br: Y.0: Remove os calços de depreciação adicionados em X.0 e X.1.

source: Y.1: Drop deprecation shims added in X.2.
id: Y.1: Menjatuhkan pengusangan shim ditambahkan di X.2.
pt_br: Y.1: Remove os calços de depreciação adicionados em X.2.

source: Y.2 LTS: No deprecation shims dropped (while Y.0 is no longer supported, third-party apps need to maintain compatibility back to X.2 LTS to ease LTS to LTS upgrades).
id: Y.2 LTS: tidak ada pengusangan shim dijatuhkan (selagi Y.0 tidak lagi didukung, aplikasi pihak-ketiga butuh merawat kesesuaian kembali ke X.2 LTS untuk memudahkan LTS untuk peningkatan LTS).
pt_br: Y.2 LTS: Nenhum calço de depreciação será retirado (embora Y.0 não seja mais suportada, apps de terceiros precisam manter compatibilidade com a versão anterior X.2 LTS para facilitar atualizações de LTS para LTS).

source: Z.0: Drop deprecation shims added in Y.0 and Y.1.
id: Z.0: Menjatuhkan pengusangan shim ditambahkan di Y.0 dan Y.1.
pt_br: Z.0: Remove os calços de compatibilidade adicionados em Y.0 e Y.1.

source: Supported versions
id: Versi didukung
pt_br: Versões suportadas

source: At any moment in time, Django's developer team will support a set of releases to varying levels. See `the supported versions section <https://www.djangoproject.com/download/#supported-versions>`_ of the download page for the current state of support for each version.
id: Setiap saat dalam waktu, tim pengembang Django akan mendukung kumpulan terbitan untuk beragam tingkatan. Lihat `the supported versions section <https://www.djangoproject.com/download/#supported-versions>`_ dari halaman unduhan untuk keadaan saat ini dari dukungan untuk setiap versi.
pt_br: A qualquer momento, o time de desenvolvedores do Django irão dar suporte a um conjunto de releases de vários leveis. Veja `a seção de versões suportadas <https://www.djangoproject.com/download/#supported-versions>`_ da página de downloads page para o estado atual de suporte de cada versão.

source: The current development master will get new features and bug fixes requiring non-trivial refactoring.
id: Master pengembangan saat ini akan mendapatkan fitur baru dan perbaikan kesalahan membutuhkan refaktor bukan sepele.
pt_br: A master de desenvolvimento atual irá receber novas funcionalidades e correções de bug requerendo refatoração não trivial.

source: Patches applied to the master branch must also be applied to the last feature release branch, to be released in the next patch release of that feature series, when they fix critical problems:
id: Tambalan-tambalan diberlakukan ke cabang master harus juga diberlakukan ke cabang terbitan fitur terakhir. untuk diterbitkan di tambalan terbitan selanjutnya dari rangkaian fitur, ketika mereka memperbaiki masalah-masalah kritis:
pt_br: Patches aplicados na branch master também devem ser aplicados para a branch da última feature release, para que sejam lançados na próxima patch release da sére da feature, quando resolverem problemas críticos:

source: Security issues.
id: Masalah keamanan
pt_br: Problemas de segurança.

source: Data loss bugs.
id: Kesalahan kehilangan data.
pt_br: Bugs envolvendo perda de dados

source: Crashing bugs.
id: Kesalahan tabrakan.
pt_br: Bugs que ocasionem em um crash da aplicação

source: Major functionality bugs in newly-introduced features.
id: Kesalahan fungsionalitas utama dalam fitur baru diperkenalkan.
pt_br: Grandes bugs no funcionamento de funcionalidades recém introduzidas.

source: Regressions from older versions of Django.
id: Pemulihan dari versi terlama dari Django.

source: The rule of thumb is that fixes will be backported to the last feature release for bugs that would have prevented a release in the first place (release blockers).
id: Aturan jempol adalah yaitu perbaikan akan di backport ke terbitan fitur terakhir untuk kesalahan yang akan mempunyai pencegahan terbitan di tempat pertama (pemblok terbitan).
pt_br: A regra prática é que serão feitos backports das correções para a última feature release para bugs que impediriam a conclusão da release em primeiro lugar (release blockers).

source: Security fixes and data loss bugs will be applied to the current master, the last two feature release branches, and any other supported long-term support release branches.
id: Perbaikan keamanan dan kesalahan kehilangan data akan diberlakukan pada master saat ini, cabang terbitan fitur dua terakhir, dan cabang terbitan dukungan jangka-panjang didukung lainnya.
pt_br: Correções de segurança e bugs que ocasionem perda de dados serão aplicados na master atual, nas branches das duas últimas feature releases e em quaisquer outras branches de releases com suporte de longa duração.

source: Documentation fixes generally will be more freely backported to the last release branch. That's because it's highly advantageous to have the docs for the last release be up-to-date and correct, and the risk of introducing regressions is much less of a concern.
id: Perbaikan dokumentasi umumnya akan lebih bebas di backport ke cabang terbitan terakhir. Itu karena itu sangat menguntungkan memiliki dokumen untuk terbitan terakhir menjadi terbaru dan benar, dan resiko dari memperkenalkan pemulihan jauh dari perhatian.
pt_br: Backports de correções de documentação geralmente serão mais livremente enviados para a branch da última release. Isso porque é altamente vantajoso possuir a última versão da documentação da última release atualizada e correta, e o risco de introduzir regressões é muito menor.

source: As a concrete example, consider a moment in time halfway between the release of Django 5.1 and 5.2. At this point in time:
id: Sebagai sebuah contoh nyata, pertimbangkan saat di waktu tengah jalan diantara terbitan dari Django 5.1 dan 5.2. Pada titik di waktu:
pt_br: Como exemplo concreto, considere um momento no tempo entre a release do Django 5.1 e 5.2. Nesse momento no tempo:

source: Features will be added to development master, to be released as Django 5.2.
id: Fitur akan ditambahkan pada induk pengembangan, akan diterbitkan sebagai Django 5.2.
pt_br: Funcionalidades serão adicionadas na master de desenvolvimento, para que sejam lançadas no Django 5.2.

source: Critical bug fixes will be applied to the ``stable/5.1.x`` branch, and released as 5.1.1, 5.1.2, etc.
id: Perbaikan kesalahan genting akan diberlakukan pada cabang ``stable/5.1.x``, dan terbitan seperti 5.1.1, 5.1.2, dll.
pt_br: Bugs críticos serão corrigidos e aplicados na branch ``stable/5.1.x``, e lançados como 5.1.1, 5.1.2, etc.

source: Security fixes and bug fixes for data loss issues will be applied to ``master`` and to the ``stable/5.1.x``, ``stable/5.0.x``, and ``stable/4.2.x`` (LTS) branches. They will trigger the release of ``5.1.1``, ``5.0.5``, ``4.2.8``, etc.
id: Perbaikan keamanan dan perbaikan kesalahan untuk masalah kehilangan data akan diberlakukan pada (LTS) cabang ``master`` dan pada ``stable/5.1.x``, ``stable/5.0.x``, dan ``stable/4.2.x``. Mereka akan memicu terbitan dari ``5.1.1``, ``5.0.5``, ``4.2.8``, dll.
pt_br: Correções de segurança e correções de bug envolvendo perda de dados serão aplicados nas branches ``master``, ``stable/5.1.x``, ``stable/5.0.x``, e ``stable/4.2.x`` (LTS). Eles irão disparar as releases ``5.1.1``, ``5.0.5``, ``4.2.8``, etc.

source: Documentation fixes will be applied to master, and, if easily backported, to the latest stable branch, ``5.1.x``.
id: Perbaikan dokumentasi akan diberlakukan pada master, dan jika dengan mudah dihubungkan, ke cabang stabil terakhir, ``5.1.x``.
pt_br: Correções na documentação será aplicadas na master, e, se o backport for simples, para a última branch estável ``5.1.x``.

source: Release process
id: Mengolah terbitan
pt_br: Processos da release

source: Django uses a time-based release schedule, with feature releases every eight months or so.
id: Django menggunakan jadwal terbitan berdasarkan-waktu, dengan fitur terbitan setiap delapan bulan atau lebih.
pt_br: O Django usa um cronograma de release temporal com feature releases a cada oito meses ou algo próximo a isso.

source: After each feature release, the release manager will announce a timeline for the next feature release.
id: Setelah setiap terbitan fitur, pengelola terbitan akan mengumumkan linimasa untuk terbitan masa depan selanjutnya.
pt_br: Depois de cada feature release, o gerente de release irá anunciar uma linha do tempo para a próxima release.

source: Release cycle
id: Daur terbitan
pt_br: Ciclo da release

source: Each release cycle consists of three parts:
id: Setiap daur terbitan terdiri dari tiga bagian:
pt_br: Cada ciclo de release consiste em três partes:

source: Phase one: feature proposal
id: Tahap satu: usulan fitur
pt_br: Fase um: propostas de funcionalidades

source: The first phase of the release process will include figuring out what major features to include in the next version. This should include a good deal of preliminary work on those features -- working code trumps grand design.
id: Fase pertama dari pengolahan terbitan akan menyertakan menetapkan apa fitur utama untuk disertakan di versi selanjutnya. Ini harus urusan bagus dari pekerjaan pendahuluan pada fitur-fitur itu -- bekerja kode truf rancangan lengkap.
pt_br: A primeira fase do processo de release inclui descobrir quais grandes funcionalidades incluir na próxima versão. Isso deve incluir uma boa quantidade de trabalho preliminar nessas funcionalidades -- código que funciona é mais importante que um excelente design.

source: Major features for an upcoming release will be added to the wiki roadmap page, e.g. https://code.djangoproject.com/wiki/Version1.9Roadmap.
id: Fitur utama untuk terbitan akan datang akan ditambahkan pada halaman peta jalan wiki, sebagai contoh https://code.djangoproject.com/wiki/Version1.9Roadmap.
pt_br: Grandes funcionalidades para uma próxima release serão adicionadas a página wiki de roadmap, ex. https://code.djangoproject.com/wiki/Version1.9Roadmap.

source: Phase two: development
id: Tahap dua: pengembangan
pt_br: Fase dois: desenvolvimento

source: The second part of the release schedule is the "heads-down" working period. Using the roadmap produced at the end of phase one, we'll all work very hard to get everything on it done.
id: Bagian kedua dari jadwal terbitan adalah periode bekerja "heads-down". menggunakan peta jalan dihasilkan pada akhir fase satu, kami akan semua bekerja sangat keras untuk mendapatkan semuanya selesai.
pt_br: A segunda parte do cronograma da release é um período de "cabeça baixa". Usando o roadmap produzido no final da fase um, nós vamos todos trabalhar duro para fazer com que tudo nele seja concluído.

source: At the end of phase two, any unfinished features will be postponed until the next release.
id: Pada akhir tahap kedua, fitur yang belum selesai akan ditunda sampai terbitan selanjutnya.
pt_br: No final da fase dois, qualquer funcionalidade não terminada será adiada até a próxima release.

source: Phase two will culminate with an alpha release. At this point, the ``stable/A.B.x`` branch will be forked from ``master``.
id: Tahap kedua akan berujung dengan terbitan alpha. Pada titik ini, cabang ``stable/A.B.x`` akan di cabangkan dari ``master``.
pt_br: A fase dois irá culminar com uma release alpha. Neste ponto, será feito um fork ``stable/A.B.x`` da branch ``master``.

source: Phase three: bugfixes
id: Tahap tiga: memperbaiki kesalahan
pt_br: Fase três: correções de bugs

source: The last part of a release cycle is spent fixing bugs -- no new features will be accepted during this time. We'll try to release a beta release one month after the alpha and a release candidate one month after the beta.
id: Bagian terakhir dari siklus terbitan sihabiskan memperbaiki kesalahan -- tidak ada fitur baru akan diterima selama waktu ini. Kami akan mencoba meerbitkan terbitan beta satu bulan setelah alpha dan calon terbitan satu bulan setelah beta.
pt_br: A última parte do ciclo de release é gasto corrigindo bugs -- novas funcionalidades não serão aceitas durante esse período. Nós vamos tentar soltar uma beta release um mês depois de uma alpha e uma release candidate um mês após a beta.

source: The release candidate marks the string freeze, and it happens at least two weeks before the final release. After this point, new translatable strings must not be added.
id: Calon terbitan menandai string freeze, dan itu terjadi setidaknya dua minggu sebelum terbitan akhir. Setelah titik ini, deretan karakter baru yang dapat diartikan harus tidak ditambahkan.
pt_br: A release candidate marca o congelamento de strings, e ele ocorre pelo menos duas semanas antes da release final. Depois desse ponto, novas strings traduzíveis não devem ser adicionadas.

source: During this phase, committers will be more and more conservative with backports, to avoid introducing regressions. After the release candidate, only release blockers and documentation fixes should be backported.
id: Selama tahap ini, pembuat perbaikan akan lebih dan lebih kolot dengan backport, untuk menghindari memperkenalkan pemulihan. Setelah kandidat terbitan, hanya pemblok terbitan dan dokumentasi tetap harus di backport.
pt_br: Durante essa fase, os committers serão mais e mais conservadores com os backports, para evitar a introdução de regressões. Depois do release candidate, só devem ser realizados backports de release blockers e de correções da documentação.

source: In parallel to this phase, ``master`` can receive new features, to be released in the ``A.B+1`` cycle.
id: Secara sejajar pada tahap ini, ``master`` dapat menerima fitur baru, untuk diterbitkan dalam siklus ``A.B+1``.
pt_br: Em paralelo a essa fase, a ``master`` pode receber novas funcionalidades, para serem lançadas no ciclo ``A.B+1``.

source: Bug-fix releases
id: Terbitak perbaikan-kesalahan
pt_br: Releases de correções de bugs

source: After a feature release (e.g. A.B), the previous release will go into bugfix mode.
id: Setelah terbitan fitur (sebagai contoh A.B), terbitan sebelumnya akan pergi kedalam suasana perbaikan kesalahan.
pt_br: Depois da feature release (ex A.B), a release prévia irá entrar no modo de correção de bugs.

source: The branch for the previous feature release (e.g. ``stable/A.B-1.x``) will include bugfixes. Critical bugs fixed on master must *also* be fixed on the bugfix branch; this means that commits need to cleanly separate bug fixes from feature additions. The developer who commits a fix to master will be responsible for also applying the fix to the current bugfix branch.
id: Cabang untuk terbitan fitur sebelumnya (sebagai contoh ``stable/A.B-1.x``) akan menyertakan perbaikan kesalahan. Perbaikan kesalahan genting pada master harus *juga* diperbaiki pada cabang perbaikan kesalahan; ini berarti bahwa perbaikan butuh dengan rapi memisahkan perbaikan kesalahan dari tambahan fitur. Pengembang yang memperbaiki perbaikan pada master akan bertanggungjawab untuk juga memberlakukan perbaikan pada cabang perbaikan kesalahan sekarang.
pt_br: A branch para a feature release prévia (ex. ``stable/A.B-1.x``) irá incluir correções de bugs. Bugs críticos corrigidos na master *também* devem ser corrigidas na branch de correção de bugs; isso significa que o commit precisa separar de modo limpo as correções de bugs das adições de funcionalidades. O desenvolvedor que fizer o commit de uma correção na master será responsável por também aplicar a correção para a branch de correção de bugs atual.

source: Roles
id: Peran
pt_br: Perfis

source: The technical board for the 1.10 release cycle is:
id: Badan teknis untuk siklus terbitan 1.10 adalah:

source: Committers
id: Pembuat Perbaikan

source: Most :ref:`core team <core-team>` members have commit access. They're called "committers" or "core developers".
id: Kebanyakan anggota :ref:`core team <core-team>` mempunyai akses perbaikan. Mereka disebut "committers" atau "pengembang inti".
pt_br: A maioria dos membros do :ref:`core team <core-team>` tem permissão de commit. Eles são chamados de "committers" ou "core developers".

source: Being part of the core team is a pre-requisite for having commit access.
id: Menjadi bagian dari tim inti adalah prasyarat untuk memiliki akses perbaikan.
pt_br: Ser parte do core team é um pré-requisito para ter permissão de commit.

source: Security team
id: Tim keamanan
pt_br: Time de segurança

source: The security team is responsible for :doc:`Django's security policies </internals/security>`. It handles private reports of security issues.
id: Tim keamanan bertanggungjawab untuk :doc:`Django's security policies </internals/security>`. Itu menangani laporan pribadi dari masalah-masalah keamanan.
pt_br: O time de segurança é responsável pela :doc:`Política de segurança do Django </internals/security>`. Ele manipula reports privados de problemas de segurança.

source: The current security team members are:
id: Anggota tim keamanan saat ini adalah:
pt_br: Os membros atuais do time de segurança são:

source: Releasers
id: Penerbit

source: Releasers take care of :doc:`building Django releases </internals/howto-release-django>`.
id: Pembuat terbitan mengurus :doc:`building Django releases </internals/howto-release-django>`.
pt_br: Releasers são responsáveis pela :doc:`construção das releases Django </internals/howto-release-django>`.

source: The current releasers are:
id: Terbitan saat ini adalah:
pt_br: Os releasers atuais são:

source: Ops team
id: Tim ops
pt_br: Time Operacional

source: The ops team maintains Django's infrastructure like the Django Project server, Trac instance, and continuous integration infrastructure.
id: Tim operasional merawat infrastruktur Django seperti peladen Django Project, instance Trac, dan perpaduan infrastruktur berkelanjutan.
pt_br: O time operacional mantém a infraestrutura do Django como o servidor do Projeto Django, a instância do Trac, e a infraestrutura de integração contínua.

source: Django's security policies
id: Kebijakan keamanan Django
pt_br: Política de Segurança do Django

source: Django's development team is strongly committed to responsible reporting and disclosure of security-related issues. As such, we've adopted and follow a set of policies which conform to that ideal and are geared toward allowing us to deliver timely security updates to the official distribution of Django, as well as to third-party distributions.
id: Tim pengembangan Django memiliki komitmen yang kuat untuk bertanggungjawab melaporkan dan menyingkap terbitan keamanan terkait. Dengan demikian, kami telah memungut dan mengikuti sekumpulan kebijakan yang menyesuaikan ke yang sesuai dan diarahkan kedepan mengizinkan kami untuk mengirim pembaharuan keamanan tepat waktu ke penyaluran resmi Django, sama halnya ke penyaluran pihak ketiga.
pt_br: O time de desenvolvimento do Django é fortemente comprometido em reportar e divulgar problemas de segurança. Como tal, nós adotamos e seguimos um conjunto de políticas que se adequam a esse ideal e são voltados a nos permitir entregar atualizações de segurança pontuais para as distribuições oficiais do Django, assim como para distribuições de terceiros.

source: Reporting security issues
id: Melaporkan masalah keamanan
pt_br: Reportando problemas de segurança

source: **Short version: please report security issues by emailing security@djangoproject.com**.
id: **Versi pendek: seilahkan laporkan masalah keamanan dengan menyurel security@djangoproject.com**.
pt_br: **Versão curta: por favor reporte problemas de segurança enviando email para security@djangoproject.com**.

source: Most normal bugs in Django are reported to `our public Trac instance`_, but due to the sensitive nature of security issues, we ask that they **not** be publicly reported in this fashion.
id: Kebanyakan kesalahan biasa di Django dilaporkan ke `our public Trac instance`_, tetapi karena sifat sensitif dari masalah keamanan, kami menanyakan bahwa mereka **tidak** dilaporkan ke umum dalam cara ini.
pt_br: A maioria dos bugs normais no Django são reportados na `nossa instância publica do Trac `_, mas devido a natureza sensível dos problemas de segurança, nós pedimos que eles **não** sejam publicamente reportados desta maneira.

source: Instead, if you believe you've found something in Django which has security implications, please send a description of the issue via email to ``security@djangoproject.com``. Mail sent to that address reaches a :ref:`subset of the core team <security-team-list>`, who can forward security issues into the private team's mailing list for broader discussion if needed.
id: Malahan, jika anda percaya anda telah menemukan sesuatu di Django yang mempunyai pengaruh keamanan, harap kirim gambaran dari masalah melalui surel ke ``security@djangoproject.com``. Surat terkirim ke alamat itu menggapai :ref:`subset of the core team <security-team-list>`, yang dapat meneruskan masalah keamanan kedalam daftar penyuratan tim pribadi untuk obrolan lebih luas jika dibutuhkan.
