Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: id, pt_br

source: Gary starting contributing patches to Django in 2006 while developing Web applications for `The University of Texas`_ (UT). Since, he has made contributions to the email and forms systems, as well as many other improvements and code cleanups throughout the code base.
id: Gary mulai membantu tambalan pada Django di 2006 selagi mengembangkan aplikasi Jaringan untuk `The University of Texas`_ (UT). Sejak, dia telah membuat bantuan pada surel dan sistem formulir, sama halnya banyak perbaikan lainnya dan pembersihan kode melalui basis kode.
pt_br: Gary começou a contribuir com patches para o Django em 2006 enquanto desenvolvia aplicações Web para `a Universidade do Texas`_ (UT). Desde então, ele tem feito contribuições para os sistemas de email e formulários, assim como muitas outras melhorias e limpezas de código através da base de código.

source: Gary lives in Austin, Texas, USA.
id: Gary tinggal di Austin, Texas, USA.
pt_br: Gary vive em Austin, Texas, EUA.

source: Brian enjoys learning more about programming languages and system architectures and contributing to open source projects.
id: Brian menikmati belajar lebih tentang bahasa pemrograman dan arsitektur sistem dan membantu pada proyek sumber terbuka.
pt_br: Brian gosta de aprender mais sobre linguagens de programação e arquiteturas de sistema e de contribuir com projetos open source.

source: He helped immensely in getting Django's "newforms-admin" branch finished in time for Django 1.0.
id: Dia sangat membantu dalam mendapatkan cabang "newforms-admin" Django selesai tepat waktu untuk Django 1.0.
pt_br: Ele ajudou enormemente em terminar a banch "newforms-admin" há tempo para o Django 1.0.

source: Brian lives in Denver, Colorado, USA.
id: Brian tinggal di Denver, Colorado, USA.
pt_br: Brian vive em Dever, Colorado, USA.

source: James is the lead developer of Pinax_ and the CEO and founder of Eldarion_. He has been doing open source software since 1993, Python since 1998 and Django since 2006. He serves on the board of the Python Software Foundation and is currently on a leave of absence from a PhD in linguistics.
id: James adalah pimpinan pengembang dari Pinax_ dan CEO dan pendiri dari Eldarion_. Dia telah mengerjakan perngkat lunak sumber terbuka sejak 1993, Python sejak 1998 dan Django sejak 2006. Dia melayani pada badan Python Software Foundation dan saat ini cuti dari ketidakhadiran dari PhD dalam ilmu bahasa.
pt_br: James é o desenvolvedor líder da Pinax_ e CEO e fundador da Eldarion_. Ele tem feito software open source desde 1993, Python desde 1998 e Django desde 2006. Ele atua no conselho da Python Software Foundation e está atualmente em uma licença de dispensa para um PhD em linguística.

source: James currently lives in Boston, MA, USA but originally hails from Perth, Western Australia where he attended the same high school as Russell Keith-Magee.
id: James saat ini tinggal di Boston, MA, USA tetapi aslinya datang dari Perth, Australia Barat dimana dia menghadiri sekolah atas yang sama seperti Russell Keith-Magee.
pt_br: James vive atualmente em Boston, MA, USA mas é originalmente de Perth, Western Australia onde frequentou a mesma escola secundária que Russell Keith-Magee.

source: Never change the published history of django/django branches! **Never force- push your changes to django/django.** If you absolutely must (for security reasons for example) first discuss the situation with the core team.
pt_br: Nunca mude o histórico publicado das branches django/django! **Nunca force um push para django/django.** Se você absolutamente precisar (por questões de segurança por exemplo) primeiro discuta a situação com o time do projeto.

source: If you mistakenly push a topic branch to django/django, just delete it. For instance, if you did: ``git push upstream feature_antigravity``, just do a reverse push: ``git push upstream :feature_antigravity``.
pt_br: Se você sem querer fez um push de uma branch para django/django, simplesmente delete ela. Por exemplo, se você fez: `git push upstream funcionalidade_antigravidade``, apenas faça um push reverso: ``git push upstream :funcionalidade_antigravidade``.

source: Django's documentation is great but it can always be improved. Did you find a typo? Do you think that something should be clarified? Go ahead and suggest a documentation patch! See also the guide on :doc:`writing-documentation`, in particular the tips for :ref:`improving-the-documentation`.
pt_br: A documentação do Django é excelente mas sempre é possível aprimorá-la. Você encontrou um erro de ortografia? Você acha que algo deveria estar mais claro? Vá em frente e sugira um patch na documentação! Veja também o guia :doc:`writing-documentation`, em particular as dicas para :ref:`improving-the-documentation`.

source: First off, it's not personal. Django is entirely developed by volunteers (even the core team), and sometimes folks just don't have time. The best thing to do is to send a gentle reminder to the |django-developers| mailing list asking for review on the ticket, or to bring it up in the #django-dev IRC channel.
pt_br: Primeiramente, não é pessoal. Django é inteiramente desenvolvido por voluntários (até mesmo o time do projeto), e às vezes as pessoas simplesmente não tem tempo. A melhor coisa a se fazer é enviar gentilmente um lembrete para lista de email django-developers pedindo uma revisão no ticket, ou no canal #django-dev do IRC.

source: ``class Meta``
pt_br: ``classe Meta``

source: Previous versions of Django had some ``Ignore*DeprecationWarningsMixin`` classes to prevent warnings from appearing. These have been replaced by the ``ignore_warnings`` decorator.
pt_br: Versões prévias do Django tinham algumas classes `Ignore*DeprecationWarningsMixin`` para prevenir warnings de aparecer. Esses foram substituiídos pelo decorator ``ignore_warnings``.

source: If you are on Python 2, you'll first need to install a backport of the ``unittest.mock`` module that's available in Python 3. See :ref:`running-unit-tests-dependencies` for details on installing `mock`_ and the other optional test dependencies.
pt_br: Se você estiver usando Python 2, você primeiro terá que instalar uma backport do módulo ``unittest.mock`` que está disponível no Python 3. Veja :ref:`running-unit-tests-dependencies` para mais detalhes na instalação do `mock`_ e de outras dependências opcionais de teste.

source: Running the tests requires a Django settings module that defines the databases to use. To make it easy to get started, Django provides and uses a sample settings module that uses the SQLite database. To run the tests::
pt_br: Rodar os testes requer um módulo settings do Django que defina qual banco de dados usar. Para simplificar, Django fornece e usa um settings sample que utiliza o banco de dados SQLite. Para rodar os testes::

source: You can avoid typing the ``PYTHONPATH`` bit each time by adding your Django checkout to your ``PYTHONPATH`` or by installing the source checkout using pip. See :ref:`installing-development-version`.
pt_br: Você pode evitar ter que escrever ``PYTHONPATH`` toda vez adicionando o local em que o código do Django foi baixado para o seu ``PYTHONPATH`` ou instalando o source checkout usando o pip. Veja :ref:`installing-development-version`.

source: The included settings module allows you to run the test suite using SQLite. If you want to test behavior using a different database (and if you're proposing patches for Django, it's a good idea to test across databases), you may need to define your own settings file.
pt_br: O módulo settings incluído permite que você rode os testes usando o SQLite. Se você deseja testar um comportamento usando um banco diferente (e se você está propondo patches para o Django, é uma boa ideia testar para diferentes bancos), você pode precisar definir o seu próprio arquivo settings.

source: A database with the alias ``other``. The ``other`` database is used to establish that queries can be directed to different databases. As a result, this database can use any backend you want. It doesn't need to use the same backend as the ``default`` database (although it can use the same backend if you want to). It cannot be the same database as the ``default``.
pt_br: Um banco de dados com o alias ``other``. O banco de dados ``other`` é usado para estabelecer que queries podem ser direcionadas para bancos de dados diferentes. Como resultado, esse banco de dados pode usar qualquer backend que você deseje. Ele não precisa usar o mesmo backend como o banco de dados ``default`` (embora ele possa usar o mesmo backend se você quiser). Ele não pode ser o mesmo banco de dados que o ``default``.

source: Some tests require Selenium and a Web browser (Firefox, Google Chrome, or Internet Explorer). To allow those tests to be run rather than skipped, you must install the selenium_ package into your Python path and run the tests with the ``--selenium`` option::
pt_br: Alguns testes precisam do Selenium e de um Web browser (Firefox, Google Chrome, ou Internet Explorer). Para permitir que esses testes rodem ao invés de serem pulados, você deve instalar o pacote selenium_ dentro do seu Python path e executar os testes com a opção:: ``--selenium``

source: The ``--reverse`` and ``--debug-sql`` options were added.
pt_br: As opções ``--reverse`` e ``--debug-sql`` foram adicionadas.

source: Below, we are going to show how to create a GitHub pull request containing the changes for Trac ticket #xxxxx. By creating a fully-ready pull request you will make the reviewer's job easier, meaning that your work is more likely to be merged into Django.
pt_br: Abaixo, nós vamos mostrar como criar um pull request no GitHub contendo as mudanças para o ticket #xxxxx do Trac. Criando um pull request totalmente pronto você irá facilitar o trabalho do revisor, significando que o seu trabalho tem maiores chances de ser mesclado dentro do Django.

source: After installing Git the first thing you should do is setup your name and email::
pt_br: Depois de instalar o Git a primeira coisa que você deve fazer é configurar o seu nome e e-mail::

source: When you have created your GitHub account, with the nick "GitHub_nick", and forked Django's repository, create a local copy of your fork::
pt_br: Uma vez que você tenha criado a sua conta no GitHub, com o nick "GitHub_nick", e realizado o fork do repositório do Django, crie uma cópia local do seu fork::

source: This will create a new directory "django", containing a clone of your GitHub repository. The rest of the git commands on this page need to be run within the cloned directory so switch to it now::
pt_br: Isso irá criar um novo diretório "django", contendo um clone do seu repositório no GitHub. O resto dos comandos nesta página precisam ser executados dentro do diretório clonado então mude para ele agora::

source: You should also setup django/django as an "upstream" remote (that is, tell git that the reference Django repository was the source of your fork of it)::
pt_br: Você também deverá configurar django/django como sendo um "upstream" remoto (isto é, diga ao git que a referência ao repositório do Django era a fonte do seu fork)::

source: When working on a ticket create a new branch for the work, and base that work on upstream/master::
pt_br: Quando estiver trabalhando em um ticket crie uma nova branch para ele, e utilize como base o upstream/master::

source: Assume the work is carried on ticket_xxxxx branch. Make some changes and commit them::
pt_br: Assumindo que o trabalho está sendo realizado na branch ticket_xxxxx. Altere algumas mudanças e faça o commit delas::

source: When you go to your GitHub page you will notice a new branch has been created.
pt_br: Quando você for para a sua página no GitHub você irá reparar que uma nova branch foi criada.

source: There are also "public branches". These are branches other people are supposed to fork, so the history of these branches should never change. Good examples of public branches are the ``master`` and ``stable/A.B.x`` branches in the django/django repository.
pt_br: Existem também "branches públicas". Essas são branches das quais espera-se que outras pessoas façam seus forks, então o histórico dessas branches não deve nunca ser mudado. Bons exemplos de branches públicas são a ``master`` e a ``stable/A.B.x`` no repositório do django/django.

source: Once you have created your pull request, you should add a comment in the related Trac ticket explaining what you've done. In particular you should note the environment in which you ran the tests, for instance: "all tests pass under SQLite and MySQL".
pt_br: Uma vez que você tenha criado o seu pull request, você deve adicionar um comentário no respectivo ticket do Trac explicando o que você fez. Em particular você deve descrever o ambiente no qual você rodou os testes, por exemplo: "todos os testes passam para o SQLite e MySQL".

source: In the example above you created two commits, the "Fixed ticket_xxxxx" commit and "Added two more tests" commit.
pt_br: No exemplo acima você criou dois commits, o commit "Fixed ticket_xxxxx" -- "Corrigido ticket_xxxxx" -- e o commit "Added two more tests" -- "Adicionado mais dois testes".

source: If your topic branch is already published at GitHub, for example if you're making minor changes to take into account a review, you will need to force- push the changes::
pt_br: Se a sua topic branch já está publicada no GitHub, por exemplo se você está fazendo pequenas mudanças para levar em consideração uma revisão, você precisará forçar o push das mudanças.

source: Note that this will rewrite history of ticket_xxxxx - if you check the commit hashes before and after the operation at GitHub you will notice that the commit hashes do not match any more. This is acceptable, as the branch is merely a topic branch, and nobody should be basing their work on it.
pt_br: Repare que isso irá reescrever o histórico do ticket_xxxxx - se você verificar os hashes dos commits antes e depois dessa operação no GitHub você vai perceber que eles não coincidem mais. Isso é aceitável já que o branch é meramente um topic branch e ninguém deveria estar trabalhando baseando o seu trabalho nele.

source: When upstream (django/django) has changed, you should rebase your work. To do this, use::
pt_br: Quando o upstream (django/django) é modificado, você deverá executar o comando rebase no seu trabalho. Para isso faça o seguinte::

source: The work is automatically rebased using the branch you forked on, in the example case using upstream/master.
pt_br: O trabalho é automaticamente rebaseado usando a branch da qual você fez o branch. No nosso exemplo usando upstream/master.

source: If there are merge conflicts you will need to resolve them and then use ``git rebase --continue``. At any point you can use ``git rebase --abort`` to return to the original state.
pt_br: Se existirem conflitos de merge você terá que resolvê-los e então usar ``git rebase --continue``. A qualquer momento você pode usar ``git rebase --abort`` para retornar ao estado original.

source: Finally push your work back to your GitHub repository. Since you didn't touch the public commits during the rebase, you should not need to force-push::
pt_br: Finalmente faça o push do seu trabalho de volta para o repositório do GitHub. Já que você não tocou nos commits públicos durante o rebase, você não deve precisar forçar um push::

source: Building the Django documentation requires Sphinx 1.0.2 or newer. Sphinx also requires the Pygments__ library for syntax highlighting; building the Django documentation requires Pygments 1.1 or newer (a new-enough version should automatically be installed along with Sphinx).
pt_br: A geração da documentação Django requer o Sphinx 1.0.2 ou maior. Sphinx também requer a biblioteca Pygments__ para realce de sintaxe; a geração da documentação requer Pygments 1.1 ou maior (uma versão nova o suficiente deve ser instalada automaticamente com a instalação do Sphinx).

source: This is because Sphinx will generate proper links for the latter, which greatly helps readers. There's basically no limit to the amount of useful markup you can add.
pt_br: Isso porque o Sphinx irá gerar os links apropriados para depois, o que beneficia enormemente os leitores. Praticamente não existem limites para a quantidade de marcação útil que você pode adicionar.

source: Besides the `Sphinx built-in markup`__, Django's docs defines some extra description units:
pt_br: Além da Sphinx built-in markup`__, a documentação do Django também define algumas unidades extras de descrição:

source: Improving the documentation
pt_br: Melhorando a documentação

source: A few small improvements can be made to make the documentation read and look better:
pt_br: Algumas pequenas melhorias podem ser feitas para melhorar o visual e a leitura da documentação.

source: Most of the various ``index.txt`` documents have *very* short or even non-existent intro text. Each of those documents needs a good short intro the content below that point.
pt_br: A maioria dos vários documentos ``index.txt`` têm uma introdução *bem* curta ou simplesmente nenhuma introdução. Cada um desses documentos precisam de uma boa e curta introdução para o conteúdo posterior a ela.

source: The glossary is very perfunctory. It needs to be filled out.
pt_br: O glossário é muito superficial. Ele precisa ser preenchido.

source: Add more metadata targets. Lots of places look like::
pt_br: Adicione mais alvos de metadados. A maioria dos locais está dessa forma::

source: \... these should be::
pt_br: \... eles deveriam ser assim::

source: That is, use metadata instead of titles.
pt_br: Ou seja, utilize metadados ao invés de títulos.

source: Whenever possible, use links. So, use ``:setting:`ADMINS``` instead of ````ADMINS````.
pt_br: Quando possível, utilize links. Ou seja, use ``:setting:`ADMINS``` ao invés de ````ADMINS````.

source: Use directives where appropriate. Some directives (e.g. ``.. setting::``) are prefix-style directives; they go *before* the unit they're describing. These are known as "crossref" directives. Others (e.g. ``.. class::``) generate their own markup; these should go inside the section they're describing. These are called "description units".
pt_br: Utilize as diretivas quando apropriado. Algumas diretivas (por exemplo: ``.. setting::``) são diretivas com prefixos; eles vão *antes* da unidade que eles descrevem. Essas diretivas são conhecidas como diretivas "crossref". Outras (por exemplo: ``.. class::``) geram a sua própria marcação; essas devem ir dentro da seção que estão descrevendo. Essas diretivas são chamads de "unidades descritivas".

source: You can tell which are which by looking at in :file:`_ext/djangodocs.py`; it registers roles as one of the other.
pt_br: Você pode descobrir quais são de qual tipo olhando em :file:`_ext/djangodocs.py`; ele registra os perfis aos quais cada uma delas pertence.

source: Add ``.. code-block:: <lang>`` to literal blocks so that they get highlighted.
pt_br: Adicione ``.. code-block:: <lang>`` para blocos literais para eles sejam destacados.

source: When referring to classes/functions/modules, etc., you'll want to use the fully-qualified name of the target (``:class:`django.contrib.contenttypes.models.ContentType```).
pt_br: Quando estiver referenciando classes/funções/módulos, etc., você vai querer usar o fully-qualified-name do alvo (``:class:`django.contrib.contenttypes.models.ContentType```).

source: Since this doesn't look all that awesome in the output -- it shows the entire path to the object -- you can prefix the target with a ``~`` (that's a tilde) to get just the "last bit" of that path. So ``:class:`~django.contrib.contenttypes.models.ContentType``` will just display a link with the title "ContentType".
pt_br: Já que isso não parece nem um pouco legal na saída -- ele te mostra o caminho completo até o objeto -- você pode prefixar o algo com ``~`` (isso é um til) para pegar apenas a "última parte" do caminho. Então ``:class:`~django.contrib.contenttypes.models.ContentType``` irá exibir apenas um link com o título "ContentType".

source: `pyenchant <https://pypi.python.org/pypi/pyenchant/>`_ (which requires `enchant <http://www.abisource.com/projects/enchant/>`_)
pt_br: `pyenchant <https://pypi.python.org/pypi/pyenchant/>`_ (que requer `enchant <http://www.abisource.com/projects/enchant/>`_)

source: The ability to :func:`~django.core.urlresolvers.reverse` URLs using a dotted Python path will be removed.
pt_br: A habilidade :func:`~django.core.urlresolvers.reverse` em URLs que contenham caminhos Python com pontos será removida.

source: The class :class:`~django.core.management.NoArgsCommand` will be removed. Use :class:`~django.core.management.BaseCommand` instead, which takes no arguments by default.
pt_br: A classe :class:`~django.core.management.NoArgsCommand` será removida. Utilize a classe :class:`~django.core.management.BaseCommand`, que não precisa de quaisquer argumentos por padrão.

source: ``django.utils.checksums`` will be removed; its functionality is included in django-localflavor 1.1+.
pt_br: ``django.utils.checksums`` será removido; A sua funcionalidade está incluída em django-localflavor 1.1+.

source: The :class:`~django.contrib.gis.geoip.GeoIP` class was moved to :mod:`django.contrib.gis.geoip` in 1.4 -- the shortcut in :mod:`django.contrib.gis.utils` will be removed.
pt_br: A classe :class:`~django.contrib.gis.geoip.GeoIP` foi movida para :mod:`django.contrib.gis.geoip` na 1.4 -- o atalho em :mod:`django.contrib.gis.utils` será removido.

source: ``django.conf.urls.defaults`` will be removed. The functions :func:`~django.conf.urls.include`, :func:`~django.conf.urls.patterns` and :func:`~django.conf.urls.url` plus :data:`~django.conf.urls.handler404`, :data:`~django.conf.urls.handler500`, are now available through :mod:`django.conf.urls` .
pt_br: ``django.conf.urls.defaults`` será removido. As funções :func:`~django.conf.urls.include`, :func:`~django.conf.urls.patterns` e :func:`~django.conf.urls.url` além de :data:`~django.conf.urls.handler404`, :data:`~django.conf.urls.handler500`, agora estão disponíveis através do :mod:`django.conf.urls` .

source: The :ttag:`url` and :ttag:`ssi` template tags will be modified so that the first argument to each tag is a template variable, not an implied string. In 1.4, this behavior is provided by a version of the tag in the ``future`` template tag library.
pt_br: As tags de template :ttag:`url` e :ttag:`ssi` serão modificadas de modo que o primeiro argumento para cada tag é a variável template, não uma string implícita. Na 1.4, esse comportamento é providenciado pela versão da tag dentro da biblioteca de tags de template ``future``.

source: :ref:`Update the django-admin manual page <django-admin-manpage>`::
pt_br: :ref:`Atualize a página de manual do django-admin <django-admin-manpage>`::

source: In 1.4, the version number in ``docs/conf.py`` and ``setup.py`` should also be updated. Here's `an example commit updating version numbers`__ for that.
pt_br: Na 1.4, o número de versão em ``docs/conf.py`` e ``setup.py`` também devem ser atualizados. Veja `um exemplo de um commit atualizando os números das versões`__ para isso.

source: Run ``make -f extras/Makefile`` to generate the release packages. This will create the release packages in a ``dist/`` directory. Note that we don't publish wheel files for 1.4.
pt_br: Roda o comando ``make -f extras/Makefile`` para gerar os pacotes da release. Isso irá criar os pactes da release no diretório ``dist/``. Repare que nós não publicamos arquivos wheel para 1.4.
