Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: You can chain together as many filters as you'd like. You can write :ref:`custom template filters <howto-writing-custom-template-filters>`. You can write :doc:`custom template tags </howto/custom-template-tags>`, which run custom Python code behind the scenes.
es: Usted puede encadenar tantos filtros como desee. Usted puede escribir: ref: ` filtros de plantillas personalizados <howto-writing-custom-template-filters>`. Usted puede escribir: doc: etiquetas de plantillas personalizadas </howto/custom-template-tags>` que ejecutan el código Python personalizado sin ser detectadas.
pt_br: Você pode atrelar tantos filtros quanto você quiser. Você pode escrever :ref:`filtros personalizados <howto-writing-custom-template-filters>`. Você pode escrever :doc:`tags de template personalizadas </howto/custom-template-tags>`, que irão rodar código Python personalizado por baixo dos panos.

source: Finally, Django uses the concept of "template inheritance". That's what the ``{% extends "base.html" %}`` does. It means "First load the template called 'base', which has defined a bunch of blocks, and fill the blocks with the following blocks." In short, that lets you dramatically cut down on redundancy in templates: each template has to define only what's unique to that template.
es: Por último, Django usa el concepto de "herencia de plantillas". Eso es lo que hace el `` {% extends "base.html"%} ``. Esto quiere decir "Primero cargue la plantilla llamada" base ", que ha definido un grupo de bloques, y llene los bloques con los siguientes bloques." En resumen, eso le permite reducir drásticamente la redundancia en las plantillas: cada plantilla tiene que definir sólo lo que es exclusivo de esa plantilla.
pt_br: Finalmente, o Django usa o conceito de "herança de templates": É isso que o ``{% extends "base.html" %}`` faz. Isso significa "primeiro carregue o template chamado 'base', o qual define uma série de blocos, e preencha os blocos com os seguintes blocos". Resumindo, isso permite a você reduzir drasticamente a redundância em seus templates: cada template tem que definir apenas aquilo que é único para aquele template.

source: Here's what the "base.html" template, including the use of :doc:`static files </howto/static-files/index>`, might look like:
es: Así es como la plantilla "base.html", incluyendo el uso de: doc: los archivos estáticos </howto/static-files/index>`, se podría ver:
pt_br: Aqui está como o template "base.html", incluindo o uso de :doc:`arquivos estáticos </howto/static-files/index>`, deve se parecer:

source: Simplistically, it defines the look-and-feel of the site (with the site's logo), and provides "holes" for child templates to fill. This makes a site redesign as easy as changing a single file -- the base template.
es: De forma simplista, define el aspecto del sitio (con el logo del sitio) y proporciona “agujeros” a llenar para las plantillas hijas. Esto hace un rediseño del sitio tan fácil como cambiar un solo archivo; la plantilla base.
pt_br: Simplesmente, ele define a aparência do site (com o logotipo do site), e fornece "buracos" para templates filhos preencherem. Isso torna o redesign do site tão fácil quanto modificar um único arquivo -- o template base.

source: It also lets you create multiple versions of a site, with different base templates, while reusing child templates. Django's creators have used this technique to create strikingly different mobile versions of sites -- simply by creating a new base template.
es: También le permite crear múltiples versiones de un sitio, con diferentes plantillas bases, a la vez que reutiliza las plantillas hijas. Los creadores de Django han usado sorprendentemente esta técnica para crear distintas versiones móviles de sitios; simplemente creando una nueva plantilla base.
pt_br: Isso também permite a você criar múltiplas versões de um site, com templates base diferentes, enquanto reutiliza templates filhos. Os criadores do Django utilizaram essa técnica para criar versões de sites para celulares totalmente diferentes -- simplesmente criando um novo template base.

source: Note that you don't have to use Django's template system if you prefer another system. While Django's template system is particularly well-integrated with Django's model layer, nothing forces you to use it. For that matter, you don't have to use Django's database API, either. You can use another database abstraction layer, you can read XML files, you can read files off disk, or anything you want. Each piece of Django -- models, views, templates -- is decoupled from the next.
es: Tenga en cuenta que usted no tiene que usar el sistema de plantillas de Django si prefiere otro sistema. Si bien el sistema de plantillas de Django está particularmente bien integrado con la capa modelo de Django, nada lo obliga a usarlo. No tiene tampoco que usar la API base de datos de Django. Puede usar otra capa de abstracción de base de datos, leer archivos XML, leer archivos de disco o lo que desee. Cada parte de Django ,modelos, vistas, plantillas, está separada de la siguiente.
pt_br: Note que você não tem que usar o sistema de templates do Django se você preferir outro. Enquanto o sistema de templates do Django é particularmente bem integrado com a camada de modelos do Django, nada força você a usá-lo. Da mesma maneira que, você não tem que usar a API de banco de dados do Django, também. Você pode usar outras camadas de abstração de banco de dados, você pode ler arquivos XML, você pode ler arquivos do disco, ou qualquer coisa que desejar. Cada parte do Django -- models, views e templates -- é desacoplada da próxima.

source: This is just the surface
es: Esto es sólo la superficie
pt_br: Isto é apenas a superfície

source: This has been only a quick overview of Django's functionality. Some more useful features:
es: Esta ha sido solamente una rápida introducción a la funcionalidad de Django. Otras características útiles:
pt_br: Esta foi apenas uma breve visão geral da funcionalidade do Django. Algumas características mais úteis:

source: A :doc:`caching framework </topics/cache>` that integrates with memcached or other backends.
es: Un doc: `framework de caché </topics/cache>` que se integra con memcached u otros backends.
pt_br: Um :doc:`framework para caching </topics/cache>` que se integra com o memcached e outros backends.

source: A :doc:`syndication framework </ref/contrib/syndication>` that makes creating RSS and Atom feeds as easy as writing a small Python class.
es: Un :doc: `framework de sindicación </ref/contrib/syndication>` que hace que la creación de feeds RSS y Atom sea tan fácil como escribir una pequeña clase de Python.
pt_br: Um :doc:`syndication framework </ref/contrib/syndication>` que torna a criação de RSS e Atom uma tarefa tão fácil quanto escrever uma classe Python.

source: More sexy automatically-generated admin features -- this overview barely scratched the surface.
es: Características del sitio administrativo más atractivas generadas automáticamente : esta descripción general apenas fue una mirada superficial.
pt_br: Mais recursos sexy da administração gerada automaticamente -- essa introdução mal arranhou a superfície.

source: The next obvious steps are for you to `download Django`_, read :doc:`the tutorial </intro/tutorial01>` and join `the community`_. Thanks for your interest!
es: Los próximos pasos son obvios para usted `descargar Django`, leer: doc: ` el tutorial </intro/tutorial01>` y unirse a `la comunidad`. ¡Gracias por su interés!
pt_br: Os próximos passos óbvios para você fazer é `baixar o Django`_, ler :ref:`o tutorial <intro-tutorial01>` e juntar-se `a comunidade`_. Obrigado pelo seu interesse!

source: Advanced tutorial: How to write reusable apps
es: Tutorial Avanzado: Cómo escribir aplicaciones reutilizables
pt_br: Tutorial avançado: Como escrever aplicações reutilizáveis

source: This advanced tutorial begins where :doc:`Tutorial 6 </intro/tutorial06>` left off. We'll be turning our Web-poll into a standalone Python package you can reuse in new projects and share with other people.
es: Este tutorial avanzado comienza donde quedó: doc:`Tutorial 6 </intro/tutorial06>`. Vamos a convertir nuestra Web-poll en un paquete independiente de Django que pueda reutilizar en nuevos proyectos y compartir con otras personas.
pt_br: Este tutorial avançado começa onde :doc:`Tutorial 6 </intro/tutorial06>` terminou. Nós transformaremos nossa aplicação web em um pacote Python autônomo que você pode reutilizar em novos projetos e compartilhar com outras pessoas.

source: If you haven't recently completed Tutorials 1–6, we encourage you to review these so that your example project matches the one described below.
es: Si usted no ha completado recientemente los tutoriales 1-6, le recomendamos que los revise para que su proyecto de ejemplo coincida con el que se describe a continuación.
pt_br: Se você não completou recentemente os Tutoriais 1-6, nós encorajamos você a rever estes de modo que seu projeto exemplo corresponda ao descrito abaixo.

source: Reusability matters
es: La reusabilidad importa
pt_br: Reutilização importa

source: It's a lot of work to design, build, test and maintain a web application. Many Python and Django projects share common problems. Wouldn't it be great if we could save some of this repeated work?
es: Requiere mucho trabajo diseñar, crear, probar y mantener una aplicación web. Muchos proyectos de Python y Django comparten problemas comunes. ¿No sería genial si pudiéramos guardar algo de este trabajo repetido?
pt_br: É um grande trabalho projetar, contruir, testar e manter uma aplicação web. Muitos projetos Python e Django compartilham problemas em comum. Não seria ótimo se nós pudessemos economizar um pouco desse trabalho repetido?

source: Reusability is the way of life in Python. `The Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ has a vast range of packages you can use in your own Python programs. Check out `Django Packages <https://www.djangopackages.com>`_ for existing reusable apps you could incorporate in your project. Django itself is also just a Python package. This means that you can take existing Python packages or Django apps and compose them into your own web project. You only need to write the parts that make your project unique.
es: La reusabilidad es el estilo de vida en Python. `El índice de paquete de Python (PyPI) <https://pypi.python.org/pypi>` tiene una amplia gama de paquetes que puede utilizar en sus propios programas Python. Revise `los paquetes de Django<https://www.djangopackages.com>` para aplicaciones reutilizables existentes que puede incluir en su proyecto. Django mismo es solo un paquete de Python. Esto quiere decir que puede tomar paquetes de Python existentes o aplicaciones Django y escribirlos en su propio proyecto web. Sólo tiene que escribir las partes que hacen que su proyecto sea único.
pt_br: Reusabilidade é o modo de vida em Python. O `Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ tem uma grande variedade de pacotes que você pode usar nos seus programas Python. Confira o `Django Packages <https://www.djangopackages.com>`_ para aplicações reusáveis existentes que você poderia incorporar no seu projeto. Django em si também é um pacote Python. Isso significa que você pode ter pacotes Python existentes ou aplicações Django e compô-los em seu próprio projeto web. Você então só precisa escrever as partes que tornam seu projeto único.

source: Let's say you were starting a new project that needed a polls app like the one we've been working on. How do you make this app reusable? Luckily, you're well on the way already. In :doc:`Tutorial 3 </intro/tutorial03>`, we saw how we could decouple polls from the project-level URLconf using an ``include``. In this tutorial, we'll take further steps to make the app easy to use in new projects and ready to publish for others to install and use.
es: Digamos que empezó un nuevo proyecto que necesitaba una aplicación encuestas como en la que hemos estado trabajando. ¿Cómo hace que esta aplicación sea reutilizable? Por suerte va bien encaminado. En el :doc: `Tutorial 3 </intro/tutorial03>`, vimos como podíamos separar encuestas de la URLconf a nivel de proyecto utilizando un ``include``. En este tutorial, adoptaremos las medidas para hacer que la aplicación sea fácil de utilizar en nuevos proyectos y esté lista para editar, instalar y utilizar por otros.
pt_br: Digamos que você estava iniciando um novo projeto que precisava de uma aplicação de enquetes, como a que estávamos trabalhando. Como você torna essa aplicação reusável? Felizmente, você já está no caminho certo. No :doc:`Tutorial 3 </intro/tutorial03>`, nós vimos como poderíamos desacoplar a aplicação de enquete no URLconf do projeto usando um ``include``. Neste tutorial, vamos tomar novas medidas para tornar a aplicação fácil de usar em novos projetos, e pronta para publicar para outros instalarem e usar.

source: Package? App?
es: ¿Paquete? ¿Aplicación?
pt_br: Pacote? Aplicação?

source: A Python `package <https://docs.python.org/tutorial/modules.html#packages>`_ provides a way of grouping related Python code for easy reuse. A package contains one or more files of Python code (also known as "modules").
es: Un `paquete Python <https://docs.python.org/tutorial/modules.html#packages>` proporciona un modo de agrupar código Python relacionado para su fácil reutilización. Un paquete contiene uno o más archivos de código Python (también conocidos como “módulos”).
pt_br: Um `pacote <https://docs.python.org/tutorial/modules.html#packages>`_ Python fornece uma maneira de agrupar código Python relacionado para fácil reuso. Um pacote contém um ou mais arquivos de código Python (também conhecidos como "módulos").

source: A package can be imported with ``import foo.bar`` or ``from foo import bar``. For a directory (like ``polls``) to form a package, it must contain a special file ``__init__.py``, even if this file is empty.
es: Un paquete puede ser importado con ``import foo.bar`` o ``from foo import bar``. Para que un directorio (como ` ` polls``) cree un paquete, debe contener un archivo especial `` __init __. py``, incluso si este archivo está vacío.
pt_br: Um pacote pode ser importado com ``import foo.bar`` ou ``from foo import bar``. Para um diretório (como ``polls``) formar um pacote, ele deve conter um arquivo especial ``__init__.py``, mesmo se este arquivo estiver vazio.

source: A Django *application* is just a Python package that is specifically intended for use in a Django project. An application may use common Django conventions, such as having ``models``, ``tests``, ``urls``, and ``views`` submodules.
es: Una aplicación Django es solo un paquete Python que está concebido especialmente para ser usado en un proyecto Django. Una aplicación puede utilizar las convenciones comunes de Django tal como tener submódulos “modelos”, “pruebas”, “urls” y “vistas”.
pt_br: Uma *aplicação* Django é apenas um pacote Python que é especificamente destinado para usar em um projeto Django. Uma aplicação pode usar convenções comuns do Django, tais como ter submódulos ``models``, ``tests``, ``urls``, e ``views``.

source: Later on we use the term *packaging* to describe the process of making a Python package easy for others to install. It can be a little confusing, we know.
es: Posteriormente, usamos el término *empaquetamiento* para describir el proceso de hacer que un paquete Python sea fácil de instalar para los demás. Sabemos que puede ser un poco confuso.
pt_br: Posteriormente usamos o termo *empacotamento* para descrever o processo de tornar um pacote Python fácil para outros instalarem. Pode ser um pouco confuso, nós sabemos.

source: Your project and your reusable app
es: Su proyecto y su aplicación reutilizable
pt_br: Seu projeto e sua aplicação reutilizável

source: After the previous tutorials, our project should look like this::
es: Después de los tutoriales anteriores, nuestro proyecto debe tener este aspecto ::
pt_br: Depois dos tutoriais anteriores, nosso projeto deve ficar assim::

source: You created ``mysite/templates`` in :doc:`Tutorial 7 </intro/tutorial07>`, and ``polls/templates`` in :doc:`Tutorial 3 </intro/tutorial03>`. Now perhaps it is clearer why we chose to have separate template directories for the project and application: everything that is part of the polls application is in ``polls``. It makes the application self-contained and easier to drop into a new project.
pt_br: Você criou ``mysite/templates`` em :doc:`Tutorial 7 </intro/tutorial07>`, e ``polls/templates`` en :doc:`Tutorial 3 </intro/tutorial03>`. Talvez agora fique caro porque escolhemos separar o diretório de templates do de projeto e aplicação: tudo que é parte da aplicação "polls" está em ``polls``. Isso torna a aplicação auto-contida e facilita adicioná-la em um novo projeto.

source: The ``polls`` directory could now be copied into a new Django project and immediately reused. It's not quite ready to be published though. For that, we need to package the app to make it easy for others to install.
es: El directorio “polls” ahora se podría copiar en un nuevo proyecto de Django e inmediatamente ser reutilizado. Sin embargo, no está listo para ser editado. Para ello, necesitamos empaquetar la aplicación para hacer más fácil que otros la instalen.
pt_br: O diretório ``polls`` poderia agora ser copiado em um novo projeto Django, e imediatamente reusada. Embora não esteja já pronta para ser publicada. Para isso, nós precisamos empacotar a aplicação para tornar fácil para outros instalarem.

source: Installing some prerequisites
es: instalando algunos requisitos previos
pt_br: Instalando alguns pré-requisitos

source: The current state of Python packaging is a bit muddled with various tools. For this tutorial, we're going to use setuptools_ to build our package. It's the recommended packaging tool (merged with the ``distribute`` fork). We'll also be using `pip`_ to install and uninstall it. You should install these two packages now. If you need help, you can refer to :ref:`how to install Django with pip<installing-official-release>`. You can install ``setuptools`` the same way.
es: El estado actual del empaquetamiento de Python es un poco confuso con diversas herramientas. Para este tutorial, vamos a utilizar setuptools para crear nuestro paquete. Es la herramienta de empaquetamiento recomendada (combinada con el fork de “distribución”). También vamos a utilizar `pip`_ para instalar y desinstalarlo. Debe ahora instalar estos dos paquetes. Si necesita ayuda puede consultar: ref: `Cómo instalar Django con pip<installing-official-release>`. Del mismo modo, puedes instalar ``setuptools``.
pt_br: O estado atual do empacotamento Python é um pouco complicado com várias ferramentas. Para este tutorial, vamos estar usando setuptools_ para construir nosso pacote. É a ferramenta de empacotamento recomendada (mergeado com o fork do ``distribute``). Estaremos usando também o `pip`_ para instalar e desinstalá-los. Você deve instalar esses dois pacotes agora. Se precisar de ajuda, você pode consultar o :ref:`como instalar Django com pip<installing-official-release>`. Você pode instalar o ``setuptools`` da mesma maneira.

source: Packaging your app
es: Empaquetando su aplicación
pt_br: Empacotando sua aplicação

source: Python *packaging* refers to preparing your app in a specific format that can be easily installed and used. Django itself is packaged very much like this. For a small app like polls, this process isn't too difficult.
es: El empaquetamiento Python se refiere a la preparación de su aplicación en un formato específico que pueda ser fácilmente instalado y utilizado. Django mismo está empaquetado de forma muy similar a esta. Para una aplicación pequeña como encuestas este proceso no es muy complejo.
pt_br: *Empacotamento* Python refere-se a preparar sua aplicação num formato específico que possa ser facilmente instalado e usado. O próprio Django é empacotado de uma maneira muito parecida. Para aplicações pequenas, como a de enquetes, esse processo não é tão difícil.

source: First, create a parent directory for ``polls``, outside of your Django project. Call this directory ``django-polls``.
es: En primer lugar, cree un directorio principal para “polls” fuera de su proyecto Django. Nombre este directorio como ``django-polls``.
pt_br: Primeiro, crie um diretório pai para ``polls``, fora do seu projeto Django. Nomeie esse diretório de

source: Choosing a name for your app
es: Eligiendo un nombre para su aplicación
pt_br: Escolhendo um nome para a sua aplicação

source: When choosing a name for your package, check resources like PyPI to avoid naming conflicts with existing packages. It's often useful to prepend ``django-`` to your module name when creating a package to distribute. This helps others looking for Django apps identify your app as Django specific.
es: Al momento de elegir un nombre para su paquete, revise recursos como PyPI para evitar conflictos de denominaciones con los paquetes existentes. Con frecuencia es útil anteponer `` django-`` a su nombre de módulo cuando crea un paquete para distribuir. Esto ayuda a otros que estén buscando aplicaciones Django identificar su aplicación como particular de Django.
pt_br: Quando for escolher um nome para o seu pacote, cheque fontes como PyPI para evitar conflitos de nomes com pacotes existentes. Ao criar um pacote para distribuir, geralmente é útil prefixar ``django-`` ao nome do seu módulo. Isso ajuda outros que estão procurando por aplicação Django identificarem sua aplicação como uma específica do Django.

source: Application labels (that is, the final part of the dotted path to application packages) *must* be unique in :setting:`INSTALLED_APPS`. Avoid using the same label as any of the Django :doc:`contrib packages </ref/contrib/index>`, for example ``auth``, ``admin``, or ``messages``.
es: Las etiquetas de la aplicación (es decir, la parte final del camino punteado a los paquetes de las aplicaciones) deben ser únicas en: configuración: `Aplicaciones instaladas`. Evite utilizar la misma etiqueta como las de algún doc: `paquete contrib de Django: </ref/contrib/index>`, por ejemplo ``autor``,` `Administrador`` ` o ` ` mensajes``.
pt_br: Rótulo da aplicação (isto é, a parte final do caminho pontilhado para os pacotes da aplicação) *deve* ser único no :setting:`INSTALLED_APPS`. Evite usar o mesmo rótulo como os do pacote :doc:`contrib </ref/contrib/index>` do Django, por exemplo ``auth``, ``admin``, ou ``messages``.

source: Move the ``polls`` directory into the ``django-polls`` directory.
es: Mueva el directorio `` polls`` al directorio `` django-polls``.
pt_br: Mova o diretório ``polls`` para dentro do diretório ``django-polls``.

source: Create a file ``django-polls/README.rst`` with the following contents:
es: Cree un archivo `` django-polls/ README.rst`` con el siguiente contenido:
pt_br: Crie um arquivo ``django-polls/README.rst`` com o seguinte conteúdo:
