Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: You can improve that by giving that method (in :file:`polls/models.py`) a few attributes, as follows:
es: Usted puede mejorar eso al darle a ese método (en: archivo:`polls/models.py`) algunos atributos, de la siguiente manera:
pt_br: Você pode melhorar isso adicionando ao método (em :file:`polls/models.py`) alguns atributos, como segue:

source: For more information on these method properties, see :attr:`~django.contrib.admin.ModelAdmin.list_display`.
es: Para obtener más información sobre estas propiedades del método, consulte: atributo: `~ django.contrib.admin.ModelAdmin.list_display`.
pt_br: Para obter mais informações sobre essas propriedades de método, veja :attr:`~django.contrib.admin.ModelAdmin.list_display.

source: Edit your :file:`polls/admin.py` file again and add an improvement to the ``Question`` change list page: filters using the :attr:`~django.contrib.admin.ModelAdmin.list_filter`. Add the following line to ``QuestionAdmin``::
es: Edite su: archivo: archivo `polls/admin.py` de nuevo y añada una mejora a la página de la lista de cambios de ``Pregunta``: filtre utilizando el: atributo: `~django.contrib.admin.ModelAdmin.list_filter`. Agregue la siguiente línea a `` QuestionAdmin``::
pt_br: Edite o arquivo :file:`polls/admin.py` de novo e adicione uma melhoria à página de lista de edição ``Question``: Um filtro usando :attr:`~django.contrib.admin.ModelAdmin.list_filter`. Adicione a seguinte linha ao ``QuestionAdmin``::

source: That adds a "Filter" sidebar that lets people filter the change list by the ``pub_date`` field:
es: Eso añade una barra lateral "Filtro" que permite a los usuarios filtrar la lista de cambios mediante el campo `` pub_date``:
pt_br: Isso adiciona uma barra lateral "Filter" que permite às pessoas filtrarem a lista de edição pelo campo ``pub_date``:

source: The type of filter displayed depends on the type of field you're filtering on. Because ``pub_date`` is a :class:`~django.db.models.DateTimeField`, Django knows to give appropriate filter options: "Any date", "Today", "Past 7 days", "This month", "This year".
es: El tipo de filtro que se muestra depende del tipo de campo que está filtrando. Debido a que la ``pub_date`` es una: clase: `~ django.db.models.DateTimeField`, Django sabe dar opciones de filtro apropiadas: "Cualquier fecha", "Hoy", "Los últimos ​​7 días", "Este mes", "Este año".
pt_br: O tipo do filtro apresentado depende do tipo do campo pelo qual você está filtrando. Por conta de ``pub_date`` ser uma instância da classe :class:`~django.db.models.DateTimeField`, o Django consegue deduzir que os filtros apropriados são: "Qualquer data", "Hoje", "Últimos 7 dias", "Esse mês", "Esse ano".

source: This is shaping up well. Let's add some search capability::
es: Esto se perfila bien. Vamos a añadir un poco de capacidad de búsqueda ::
pt_br: Isso está ficando bom. Vamos adicionar capacidade de pesquisa:

source: That adds a search box at the top of the change list. When somebody enters search terms, Django will search the ``question_text`` field. You can use as many fields as you'd like -- although because it uses a ``LIKE`` query behind the scenes, limiting the number of search fields to a reasonable number will make it easier for your database to do the search.
es: Eso añade un cuadro de búsqueda en la parte superior de la lista de cambios. Cuando alguien introduce los términos de búsqueda, Django buscará el campo ``question_text``. Usted puede utilizar tantos campos como desee, sin embargo, ya que utiliza una petición ``LIKE`` de forma inadvertida, limitar el número de campos de búsqueda a un número razonable, le facilitará a su base de datos la búsqueda.
pt_br: Isso adiciona um campo de pesquisa ao topo da lista de edição. Quando alguém informa termos de pesquisa, o Django irá pesquisar o campo ``question_text``. Você pode usar quantos campos quiser -- entretanto, por ele usar uma consulta ``LIKE`` internamente, limitar o número de campos de pesquisa a um número razoável, será mais fácil para o seu banco de dados para fazer pesquisas.

source: Now's also a good time to note that change lists give you free pagination. The default is to display 100 items per page. :attr:`Change list pagination <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`search boxes <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`filters <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`date-hierarchies <django.contrib.admin.ModelAdmin.date_hierarchy>`, and :attr:`column-header-ordering <django.contrib.admin.ModelAdmin.list_display>` all work together like you think they should.
es: Ahora también es un buen momento para señalar que las listas de cambios le dan paginación libre. El modo predeterminado muestra 100 items por página. : atributo: `Paginación de la lista de cambios <django.contrib.admin.ModelAdmin.list_per_page> `,: Atributo:` cuadros de búsqueda <django.contrib.admin.ModelAdmin.search_fields> , `: Atributo:` filtros <django.contrib.admin.ModelAdmin.list_filter> `,: Attr:` jerarquías de fecha <django.contrib.admin.ModelAdmin.date_hierarchy> `y :atributo: orden de la cabecera de columnas <django.contrib.admin.ModelAdmin.list_display> ` todos trabajan juntos como usted piensa que deberían.
pt_br: Agora é também uma boa hora para observar que a página de edição fornece uma paginação gratuitamente. O padrão é mostrar 100 itens por página. :attr:`Paginação da página de edição <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`campos de pesquisa <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`filters <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`hierarquia por data <django.contrib.admin.ModelAdmin.date_hierarchy>`, e :attr:`ordenação por cabeçalho de coluna <django.contrib.admin.ModelAdmin.list_display>` todos trabalham em sincronia como deveriam.

source: Customize the admin look and feel
es: Personalice la apariencia del sitio administrativo
pt_br: Personalize a aparência do site de administração

source: Clearly, having "Django administration" at the top of each admin page is ridiculous. It's just placeholder text.
es: Está claro que tener "la administración de Django" en la parte superior de cada página del sitio administrativo es ridículo. Es sólo texto del marcador de posición.
pt_br: Obviamente, ter "Django administration" no topo de cada página de administração é ridículo. Isso é só um texto de exemplo.

source: That's easy to change, though, using Django's template system. The Django admin is powered by Django itself, and its interfaces use Django's own template system.
es: Sin embargo, eso es fácil de cambiar, utilizando el sistema de plantillas de Django. El sitio administrativo de Django es impulsado por Django mismo, y sus interfaces utilizan el sistema de plantillas de Django.
pt_br: É fácil de editar, no entanto, usando o sistema de templates do Django. A página de administração de Django é feita com o próprio Django e conseqüentemente sua interface usa o sistema de templates nativo do Django.

source: Customizing your *project's* templates
es: Personalizando las plantillas de su proyecto
pt_br: Personalizando os templates do seu *projeto*

source: Create a ``templates`` directory in your project directory (the one that contains ``manage.py``). Templates can live anywhere on your filesystem that Django can access. (Django runs as whatever user your server runs.) However, keeping your templates within the project is a good convention to follow.
es: Cree un directorio ``plantillas`` en el directorio del proyecto (el que contiene `` manage.py``). Las plantillas pueden estar en cualquier parte de su sistema de archivos al que Django pueda acceder. (Django ejecuta como cualquier usuario ejecuta su servidor.) Sin embargo, guardar sus plantillas en el proyecto es una buena práctica a seguir.
pt_br: Criar um diretório ``templates`` no diretório do seu projeto (aquela que contém ``manage.py``). Os modelos podem viver em qualquer lugar em seu sistema de arquivos que o Django possa acessar. (Django é executado como qualquer usuário que seu servidor é executado.) No entanto, manter seus templates dentro do projeto é uma boa convenção a seguir.

source: Open your settings file (:file:`mysite/settings.py`, remember) and add a :setting:`DIRS <TEMPLATES-DIRS>` option in the :setting:`TEMPLATES` setting:
es: Abra el archivo de configuraciónes (:archivo: `mysite / settings.py`, recuerde) y añada una: configuración: Opción `DIRS <TEMPLATES-DIRS>` en: configuración: configuración de `plantillas`:
pt_br: Abra seu arquivo de configurações (:file:`mysite/settings.py`, lembre-se) e adicione uma opção :setting:`DIRS <TEMPLATES-DIRS>`. na configuração :setting:`TEMPLATES` setting:

source: :setting:`DIRS <TEMPLATES-DIRS>` is a list of filesystem directories to check when loading Django templates; it's a search path.
es: : configuración: `DIRS <TEMPLATES-DIRS> ` es una lista de directorios del sistema de archivos para comprobar cuando se cargan las plantillas de Django; es una ruta de búsqueda.
pt_br: :setting:`DIRS <TEMPLATES-DIRS>` é uma lista de diretórios de arquivos que serão checados quando o Django carregar seus templates, ou seja, caminhos de busca.

source: Organizing templates
es: Organizando las plantillas
pt_br: Organizando templates

source: Just like the static files, we *could* have all our templates together, in one big templates directory, and it would work perfectly well. However, templates that belongs to a particular application, we should put in the application’s template directory (e.g. ``polls/templates``) rather than the project’s (``templates``). We'll discuss in more detail in the :doc:`reusable apps tutorial </intro/reusable-apps>` *why* we do this.
es: Al igual que los archivos estáticos, podríamos tener todas nuestras plantillas juntas en un gran directorio de plantillas y funcionaría perfectamente. Sin embargo, las plantillas que pertenecen a una determinada aplicación, deberíamos ponerlas en el directorio de plantillas de la aplicación (por ejemplo, ``polls/templates``) en lugar de (``templates``) del proyecto. Hablaremos con más detalle por qué hacemos esto en el: doc: `tutorial de aplicaciones reutilizables </intro/reusable-apps> `.
pt_br: Assim como com os arquivos estáticos, nós *podemos* deixar os nossos juntos em um grande diretório de templates e isso funcionaria perfeitamente. Entretanto, templates que pertençam a uma app em particular, devem ser colocados dentro do diretório de templates da app (por exemplo, ``polls/templates``) ao invés de serem colocados no diretório de templates do projetos (``templates``). Nós iremos discutir isto mais em detalhes em :doc:`tutorial de apps reutilizáveis </intro/reusable-apps>` e o *porque* de o fazermos.

source: Now create a directory called ``admin`` inside ``templates``, and copy the template ``admin/base_site.html`` from within the default Django admin template directory in the source code of Django itself (``django/contrib/admin/templates``) into that directory.
es: Ahora cree un directorio llamado ``Admin`` dentro de ``templates``, y copie la plantilla ``admin / base_site.html`` desde dentro del directorio de plantillas predeterminado del sitio administrativo de Django en el código fuente de Django (``django/contrib/admin/templates``) en ese directorio.
pt_br: Agora crie um diretório chamado ``admin`` dentro de ``templates``, e copie o template ``admin/base_site.html`` de dentro do diretório padrão do site de administração do Django (``django/contrib/admin/templates``) para dentro deste diretório.

source: Where are the Django source files?
es: ¿Dónde están los archivos de origen de Django?
pt_br: Onde estão os arquivos de código-fonte do Django?

source: If you have difficulty finding where the Django source files are located on your system, run the following command:
es: Si tiene dificultad para encontrar donde están localizados los archivos fuente de Django en su sistema, ejecute el siguiente comando:
pt_br: Se você tiver dificuldade em encontrar onde os arquivos do Django estão localizados em seu sistema, execute o seguinte comando:

source: Then, just edit the file and replace ``{{ site_header|default:_('Django administration') }}`` (including the curly braces) with your own site's name as you see fit. You should end up with a section of code like:
es: Luego, solo edite el archivo y reemplace ``{{site_header|default: _ ('Django administración') }}`` (incluyendo las llaves) con el nombre de su propio sitio como mejor le parezca. Usted debe terminar con una sección de código como:
pt_br: Então, apenas edite o arquivo e substitua ``{{ site_header|default:_('Django administration') }}`` (incluindo as chaves) com nome do seu próprio site como desejar. Você deve acabar com uma secção de código como:

source: We use this approach to teach you how to override templates. In an actual project, you would probably use the :attr:`django.contrib.admin.AdminSite.site_header` attribute to more easily make this particular customization.
es: Utilizamos este método para enseñarle cómo reemplazar las plantillas. En un proyecto real, usted probablemente utilizaría el: atributo: atributo `django.contrib.admin.AdminSite.site_header` para hacer este ajuste particular con mayor facilidad.
pt_br: Nós usamos esta abordagem para ensinar-lhe como substituir templates. Em um projeto real, você provavelmente usaria o atributo :attr:`django.contrib.admin.AdminSite.site_header` para fazer mais facilmente essa personalização em particular.

source: This template file contains lots of text like ``{% block branding %}`` and ``{{ title }}``. The ``{%`` and ``{{`` tags are part of Django's template language. When Django renders ``admin/base_site.html``, this template language will be evaluated to produce the final HTML page, just like we saw in :doc:`Tutorial 3 </intro/tutorial03>`.
es: Este archivo de plantillas contiene una gran cantidad de texto como ``{% block branding%} `` y ``{{title}}``. El ``{%`` y las etiquetas ``{{`` son parte del lenguaje de plantillas de Django. Cuando Django crea ``admin/base_site.html``, este lenguaje de plantilla será evaluado para generar la página HTML definitiva, como vimos en el : doc: `Tutorial 3 </intro/tutorial03> `.
pt_br: Esse template contém uma série de textos como ``{% block branding %}`` e ``{{ tittle }}``. As tags ``{%`` e ``{{`` fazem pate da linguagem de templates do Django. Quando o Django renderiza o template "admin/base_site.html", o seu conteúdo é processado por essa linguagem de templates para produzir a página HTML final, assim como vimos no :doc:`Tutorial 3 </intro/tutorial03>`.

source: Note that any of Django's default admin templates can be overridden. To override a template, just do the same thing you did with ``base_site.html`` -- copy it from the default directory into your custom directory, and make changes.
es: Tenga en cuenta que cualquier plantilla del sitio administrativo predeterminado de Django se puede modificar. Para modificar una plantilla, simplemente haga lo mismo que hizo con `` base_site.html`` - cópiela desde el directorio predeterminado en el directorio personalizado, y realice los cambios.
pt_br: Note que qualquer template padrão do sire de administração pode ser sobrescrito. Para sobrescrever um template, apenas faça a mesma coisa que você fez com ``base_site.html`` -- copie ele do diretório padrão para o seu próprio diretório, e faça as mudanças.

source: Customizing your *application's* templates
es: Personalizar las plantillas de su aplicación
pt_br: Personalizando templates da sua *aplicação*

source: Astute readers will ask: But if :setting:`DIRS <TEMPLATES-DIRS>` was empty by default, how was Django finding the default admin templates? The answer is that, since :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` is set to ``True``, Django automatically looks for a ``templates/`` subdirectory within each application package, for use as a fallback (don't forget that ``django.contrib.admin`` is an application).
es: Los lectores agudos preguntarán: ¿Pero si: configuración: `DIRS <TEMPLATES-DIRS> ` estuviera vacío por defecto, ¿Cómo Django estaría buscando las plantillas del sitio administrativo predeterminado? La respuesta es que, ya que: configuración: `APP_DIRS <TEMPLATES-APP_DIRS> ` se establece en ``True``, Django busca automáticamente un subdirectorio ``templates /`` dentro de cada paquete de la aplicación, para su uso como una solución alternativa (no olvide que ``django.contrib.admin`` es una aplicación ).
pt_br: Leitores astutos irão se perguntar: Mas se :setting:`DIRS <TEMPLATES-DIRS>` estava vazio por padrão, como o Django pôde encontrar o diretório padrão dos templates do site de administração? A resposta é, Desde que :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` seja ``True``, o Django irá automaticamente procurar por um subdiretório ``templates/`` dentro de cada pacote de aplicação, para usar como fallback(Não esqueça que ``django.contrib.admin`` é uma aplicação)

source: Our poll application is not very complex and doesn't need custom admin templates. But if it grew more sophisticated and required modification of Django's standard admin templates for some of its functionality, it would be more sensible to modify the *application's* templates, rather than those in the *project*. That way, you could include the polls application in any new project and be assured that it would find the custom templates it needed.
es: Nuestra aplicación encuestas no es muy compleja y no necesita plantillas personalizadas del sitio administrativo. Pero si se hizo más sofisticada y requiere la modificación de las plantillas convencionales del sitio administrativo de Django para algunas de sus funciones, sería más sensato modificar las plantillas de la aplicación, en lugar de las que están en el proyecto. De esa manera, usted podría incluir la aplicación encuestas en cualquier nuevo proyecto y estaría seguro de que esta encontraría las plantillas personalizadas que necesitaba.
pt_br: Nossa aplicação enquete não é muito complexa e não precisa de templates personalizados para o site de administração. Mas se ele crescer e ficar mais sofisticado e necessária a modificação dos templates padrão de administração do Django para algumas de suas funcionalidades, seria mais sensato modificar os templates da *aplicação*, e não os do *projeto*. Dessa forma, você poderia incluir a aplicação de enquete em qualquer novo projeto e ter a certeza que iria encontrar os modelos personalizados que você precisa.

source: See the :ref:`template loading documentation <template-loading>` for more information about how Django finds its templates.
es: Consulte la: ref: `documentación sobre la carga de plantillas <template-loading> `para obtener más información sobre cómo Django encuentra sus plantillas.
pt_br: Veja a :ref:`documentação de carga de template <template-loaders>` - para mais informação sobre como o Django acha seus templates.

source: Customize the admin index page
es: Personalice la página del índice del sitio administrativo.
pt_br: Personalize a página inicial do site de administração

source: On a similar note, you might want to customize the look and feel of the Django admin index page.
es: En este sentido, es posible que desee personalizar la apariencia de la página de índice del sitio administrativo de Django.
pt_br: De maneira similar, você pode querer personalizar a aparência da página inicial do site de administração do Django.

source: By default, it displays all the apps in :setting:`INSTALLED_APPS` that have been registered with the admin application, in alphabetical order. You may want to make significant changes to the layout. After all, the index is probably the most important page of the admin, and it should be easy to use.
es: Por defecto, muestra todas las aplicaciones que se encuentran en: configuración: `INSTALLED_APPS` que han sido registradas en la aplicación del sitio administrativo, en orden alfabético. Es posible que desee realizar cambios significativos en el diseño. Después de todo, el índice es probablemente la página más importante del sitio administrativo y debería ser fácil de usar.
pt_br: Por padrão, ele exibe todas as aplicações em :setting:`INSTALLED_APPS`, que estão registrados na aplicação de administração, em ordem alfabética. E você pode querer fazer alterações significativas no layout. Além do que, a página inicial é provavelmente a página mais importante da página de administração, e deve ser fácil de usar.

source: The template to customize is ``admin/index.html``. (Do the same as with ``admin/base_site.html`` in the previous section -- copy it from the default directory to your custom template directory). Edit the file, and you'll see it uses a template variable called ``app_list``. That variable contains every installed Django app. Instead of using that, you can hard-code links to object-specific admin pages in whatever way you think is best.
es: La plantilla a modificar es ``admin/index.html``. (Haga lo mismo que con `` admin / base_site.html`` en la sección anterior - cópiela desde el directorio predeterminado en el directorio de plantillas personalizadas). Edite el archivo y verá que utiliza una variable de plantilla llamada `` app_list``. Esa variable contiene todas las aplicaciones instaladas de Django. En lugar de utilizar esa, usted puede predeterminar enlaces a páginas del sitio administrativo específicas de objeto de la manera que le parezca mejor.
pt_br: O template para personalizar é ``admin/index.html``. (Faça o mesmo que ``admin/base_site.html`` na seção anterior -- copie ele do diretório padrão para o seu diretório de template personalizado). Edite o arquivo e você verá que ele usa uma variável de template chamada ``app_list``. Esta variável contém cada app instalada no Django. Ao invés de usar isto, você pode criar links hard-coded para páginas do admin específicas em qualquer forma que você achar melhor.

source: The beginner tutorial ends here. In the meantime, you might want to check out some pointers on :doc:`where to go from here </intro/whatsnext>`.
es: El tutorial para principiantes finaliza aquí. Mientras tanto, es posible que desee ver algunos consejos sobre: ​​doc: `a dónde continuar a partir de ahora </intro/whatsnext> `.
pt_br: O tutorial dos iniciantes termina aqui. Entretanto, você pode querer verificar alguns indicadores em :doc:`onde ir partindo daqui </intro/whatsnext>`.

source: If you are familiar with Python packaging and interested in learning how to turn polls into a "reusable app", check out :doc:`Advanced tutorial: How to write reusable apps</intro/reusable-apps>`.
es: Si está familiarizado con el empaquetado Python e interesado en aprender cómo convertir la aplicación encuestas en una "aplicación reutilizable", consulte: doc: `tutorial avanzado: Cómo escribir aplicaciones reutilizables </intro/reusable-apps> `.
pt_br: Se você é familiar ao sistema de empacotamento Python e está interessado em como tornar a enquete em uma "app reusável", veja :doc:`Tutorial avançado: como escrever apps reusáveis </intro/reusable-apps>`.

source: What to read next
es: Qué leer después
pt_br: O que ler a seguir
