Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: Writing your first patch for Django
es: Escribiendo tu primer parche para Django
pt_br: Escrevendo seu primeiro patch para Django

source: Introduction
es: Introducción
pt_br: Introdução

source: Interested in giving back to the community a little? Maybe you've found a bug in Django that you'd like to see fixed, or maybe there's a small feature you want added.
es: Interesado en dar a la comunidad un poco? Quizás haz encontrado un bug en Django que te gustaría ver solucionado, o quizás hay una pequeña característica que quieras agregar.
pt_br: Interessado em retribuir um pouco para a comunidade? Talvez você tenha encontrado uma falha no Django que você gostaria de ver corrigida, ou talvez exista uma pequena funcionalidade que poderia ser adicionada.

source: Contributing back to Django itself is the best way to see your own concerns addressed. This may seem daunting at first, but it's really pretty simple. We'll walk you through the entire process, so you can learn by example.
es: Contribuir con Django en sí es la mejor forma de ver abordadas tus propias inquietudes. Esto puede parecer intimidante al principio, pero en realidad es bastante simple. Te guiaremos a través de todo el proceso para que puedas aprender mediante ejemplos.
pt_br: A melhor maneira de ver os seus próprios problemas serem resolvidos é contribuindo com o Django. Isto pode parecer assustador no começo, mas na verdade é bem simples. Nós lhe guiaremos por todo o processo para que você possa aprender através de exemplos.

source: Who's this tutorial for?
es: ¿Para quién es este tutorial?
pt_br: Para quem se destina este tutorial?

source: If you are looking for a reference on how to submit patches, see the :doc:`/internals/contributing/writing-code/submitting-patches` documentation.
es: Si usted está buscando una referencia sobre cómo presentar parches, consulte la: doc: documentación `/internals/contributing/writing-code/submitting-patches`
pt_br: Se você está procurando por uma referência sobre como enviar pacotes, veja a :doc:`/internals/contributing/writing-code/submitting-patches` documentação.

source: For this tutorial, we expect that you have at least a basic understanding of how Django works. This means you should be comfortable going through the existing tutorials on :doc:`writing your first Django app</intro/tutorial01>`. In addition, you should have a good understanding of Python itself. But if you don't, `Dive Into Python`__ is a fantastic (and free) online book for beginning Python programmers.
es: Para este tutorial, esperamos que comprendas al menos el funcionamiento básico de Django. Esto significa que no tendrías problemas explorando los tutoriales existentes para :doc:`crear tu primera aplicación Django </intro/tutorial01>`. Adicionalmente, deberías tener una buena comprensión de Python. Si no es así, `Dive into Python`__ es un fantástico libro disponible en línea para los programadores que comienzan en Python.
pt_br: Para este tutorial, esperamos que você tenha ao menos um conhecimento básico de como o Django funciona. Isso significa que você precisa estar confortável com o tutoriai "Escrevendo sua primeira aplicação Django</intro/tutorial01>". Além disso, você deve ter um bom conhecimento em Python. Mas se não tiver, "Dive Into Python" é um livro online fantástico (e gratuito) para iniciantes em Python.

source: Those of you who are unfamiliar with version control systems and Trac will find that this tutorial and its links include just enough information to get started. However, you'll probably want to read some more about these different tools if you plan on contributing to Django regularly.
es: Aquellos de ustedes que no están familiarizados con los sistemas de control de versiones y Trac encontrarán que este tutorial y sus vínculos incluyen información suficiente para empezar. Sin embargo, es probable que quiera leer un poco más acerca de estas diferentes herramientas si usted planea contribuir a Django con regularidad.
pt_br: Aqueles que não estão familiarizados com sistemas de controle de versão e Trac irão encontrar neste tutorial, e seus links inclusos, informações suficientes para iniciar. Entretanto, se você esta planejando contribuir com o Django regularmente, provavelmente você vai querer ler mais a respeito das destas diferentes ferramentas.

source: For the most part though, this tutorial tries to explain as much as possible, so that it can be of use to the widest audience.
es: En su mayor parte, sin embargo, este tutorial trata de explicar tanto como sea posible, de modo que pueda ser de utilidad para la audiencia más amplia.
pt_br: Para a maior parte, porém, este tutorial tenta explicar o máximo possível, tal que possa ser usado por um público mais amplo.

source: Where to get help:
es: Dónde obtener ayuda:
pt_br: Onde obter ajuda:

source: If you're having trouble going through this tutorial, please post a message to |django-developers| or drop by `#django-dev on irc.freenode.net`__ to chat with other Django users who might be able to help.
es: Si presentas problemas leyendo este tutorial, por favor envía un mensaje a |django-developers| o visita `#django-dev on irc.freenode.net`__ para chatear con otros usuarios de Django que podrían ayudarte.
pt_br: Se você estiver enfrentando problemas durante este tutorial, por favor envie um mensagem par |django-developers| ou acesse `#django-dev on irc.freenode.net`__ para conversar com outros usuários de Django que podem ser capazes de ajudá-lo.

source: What does this tutorial cover?
es: ¿Qué cubre esta guía?
pt_br: O que este tutorial cobre?

source: We'll be walking you through contributing a patch to Django for the first time. By the end of this tutorial, you should have a basic understanding of both the tools and the processes involved. Specifically, we'll be covering the following:
es: Te mostraremos cómo contribuir con parches para Django por primera vez. Al final de este tutorial, contarás con un entendimiento básico sobre las herramientas y procesos implicados. Específicamente, cubriremos los siguientes:
pt_br: Nós iremos guir você para que contribua com um "patch" para o Django pela primeira vez. Ao final deste tutorial, você deve possuir o conhecimento básico tanto para as ferramentas quanto para os processos envolvidos. Nós iremos cobrir especialmente os seguintes tópicos:

source: Installing Git.
es: Instalando Git.
pt_br: Instalando Git.

source: How to download a development copy of Django.
es: Cómo descargar una copia de desarrollo de Django.
pt_br: Como baixar uma cópia de desenvolvimento do Django.

source: Running Django's test suite.
es: Conjunto de pruebas de funcionamiento de Django.
pt_br: Executando suite de testes do Django.

source: Writing a test for your patch.
es: Escribiendo una prueba para su parche.
pt_br: Escrevendo um teste para o seu patch.

source: Writing the code for your patch.
es: Escribiendo el código para su parche.
pt_br: Escrevendo o código para o seu patch.

source: Testing your patch.
es: Probando su parche.
pt_br: Testando o seu patch.

source: Generating a patch file for your changes.
es: Generar un archivo de parche para sus cambios.
pt_br: Gerando um arquivo de patch para as suas alterações.

source: Where to look for more information.
es: Dónde buscar más información.
pt_br: Onde encontrar mais informações.

source: Once you're done with the tutorial, you can look through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`. It contains lots of great information and is a must read for anyone who'd like to become a regular contributor to Django. If you've got questions, it's probably got the answers.
es: Una vez que hayas terminado el tutorial, puedes revisar el resto de :doc:`la documentación para contribuir con Django</internals/contributing/index>`. Contiene una gran cantidad de información de lectura obligatoria para todo el que desee convertirse en contribuidor habitual de Django. Si tienes preguntas, es probable que obtengas las respuestas.
pt_br: Uma vez que você terminar este tutorial, você pode olhar o restante da :doc:`Documentação do Django sobre contribuição</internals/contributing/index>` Ela contém muitas informações úteis e deve ser lida por quem deseja se tornar um contribuidor do Django. Caso tenha perguntas, a documentação provavelmente contem as respostas.

source: Python 3 required!
es: ¡Se requiere Python 3 !
pt_br: Python 3 é requerido!

source: This tutorial assumes you are using Python 3. Get the latest version at `Python's download page <https://www.python.org/download/>`_ or with your operating system's package manager.
es: Este tutorial asume que usted está utilizando Python 3. Obtenga la versión más reciente en ‘la página de descargas de Python <https://www.python.org/download/>`_ o con el administrador de paquetes de su sistema operativo.
pt_br: Este tutorial acredita que você já está usando o Python 3. Obtenha a última versão do Python na sua página de download <https://www.python.org/download/>` ou com seu sistema de controle de pacotes.

source: For Windows users
es: Para los usuarios de Windows
pt_br: Para usuários do Windows

source: When installing Python on Windows, make sure you check the option "Add python.exe to Path", so that it is always available on the command line.
es: Al instalar Python en Windows, asegúrese de revisar la opción "Añadir python.exe a la Ruta", de modo que que siempre esté disponible en la línea de comandos.
pt_br: Quando instalar o Python no Windows, tenha certeza que você marcou a opção "Add python.exe to Path", então ele sempre vai estar disponível na linha de comando.

source: Code of Conduct
es: Código de Conducta
pt_br: Código de Conduta

source: As a contributor, you can help us keep the Django community open and inclusive. Please read and follow our `Code of Conduct <https://www.djangoproject.com/conduct/>`_.
es: Como un colaborador, usted puede ayudarnos a mantener abierta e inclusiva la comunidad Django. Por favor lea y siga nuestro 'Código de conducta' en <https://www.djangoproject.com/conduct/>`_.
pt_br: Como um contribuidor, você pode nos ajudar a manter a comunidade Django aberta e solidária. Por favor, leia e siga nosso 'Código de conduta' <https://www.djangoproject.com/conduct/>`_.

source: Installing Git
es: Instalando Git
pt_br: Instalando Git

source: For this tutorial, you'll need Git installed to download the current development version of Django and to generate patch files for the changes you make.
es: Para este tutorial, necesitará instalar Git para descargar la versión actual de desarrollo de Django y generar archivos de revisión de los cambios que realice.
pt_br: Para este tutorial será necessário ter o Git instalado para fazer o download da versão corrente de desenvolvimento do Django e para gerar arquivos de "patch" para as mudanças que você faça.

source: To check whether or not you have Git installed, enter ``git`` into the command line. If you get messages saying that this command could not be found, you'll have to download and install it, see `Git's download page`__.
es: Para revisar si tienes o no Git instalado, ejecuta ``git`` en la línea de comandos. Si recibes un mensaje diciendo que el comando no pudo ser encontrado, tendrás que descargarlo e instalarlo, consulte `la página de descarga de Git`__.
pt_br: Para verificar se o Git está instalado ou não no seu sistema, digite ``git`` na linha de comando. Se o resultado for uma mensagem dizendo que o comando não pode ser encontrado, você terá que fazer o download e instalar o Git. Dê uma olhada em `Git's download page`__.

source: When installing Git on Windows, it is recommended that you pick the "Git Bash" option so that Git runs in its own shell. This tutorial assumes that's how you have installed it.
es: Al instalar Git en Windows, se recomienda que usted seleccione la opción "Git Bash" para que Git se ejecute en su propia shell. Este tutorial asume que usted lo ha instalado de esa forma.
pt_br: Ao instalar o Git no Windows, é recomendável que você escolha a opção "Git Bash" para que o Git seja executado em seu próprio shell. Este tutorial assume que foi assim que você instalou.

source: If you're not that familiar with Git, you can always find out more about its commands (once it's installed) by typing ``git help`` into the command line.
es: Si no estás familiarizado con Git, siempre se puede encontrar más información sobre sus comandos (una vez instalado) escribiendo ``git help`` en la línea de comandos.
pt_br: Caso não esteja familiar com o Git, você sempre pode achar mais sobre seus comandos (uma vez que estiver instalado) digitando "git help" na linha de comando.

source: Getting a copy of Django's development version
es: Obtener una copia de la versión de desarrollo de Django
pt_br: Obtendo uma cópia da versão de desenvolvimento do Django

source: The first step to contributing to Django is to get a copy of the source code. From the command line, use the ``cd`` command to navigate to the directory where you'll want your local copy of Django to live.
es: El primer paso para contribuir con Django es obtener una copia de su código fuente. Desde la línea de comandos, usa ``cd`` para navegar hacia el directorio donde deseas hacer la copia local de Django.
pt_br: O primeiro Passo para contribuir com o Django é copiar o código fonte. Na linha de comando use o comando "cd" para navegar até o diretório que você deseja manter a sua cópia local do Django.

source: Download the Django source code repository using the following command:
es: Descargue el repositorio de código fuente de Django con el siguiente comando:
pt_br: Baixe o código fonte do repositório do Django usando o seguinte comando:

source: Now that you have a local copy of Django, you can install it just like you would install any package using ``pip``. The most convenient way to do so is by using a *virtual environment* (or virtualenv) which is a feature built into Python that allows you to keep a separate directory of installed packages for each of your projects so that they don't interfere with each other.
es: Ahora que usted tiene una copia local de Django, puede instalarla como instalaría cualquier paquete utilizando `` pip``. La forma más conveniente de hacerlo es mediante el uso de un *entorno virtual* (o virtualenv) que es una característica integrada en Python que permite mantener un directorio independiente de los paquetes instalados para cada uno de sus proyectos para que no interfieran entre sí.
pt_br: Agora que você tem uma cópia local do Django, você pode instalá-lo da mesma forma que você instalaria qualquer pacote usando ``pip``. A maneira mais conveniente de fazer isso é usando um *ambiente virtual* (ou virtualenv) que é um recurso embutido no Python que permite que você mantenha um diretório separado para os pacotes instalados de cada um dos seus projetos para que uns não interfiram com os outros.

source: It's a good idea to keep all your virtualenvs in one place, for example in ``.virtualenvs/`` in your home directory. Create it if it doesn't exist yet:
es: Es una buena idea guardar todos sus entornos virtuales en un lugar, por ejemplo, en ``.virtualenvs/`` en su directorio principal. Creelo si todavía no existe:
pt_br: É uma boa idéia mater todos os seus virtualenvs em um lugar, por exemplo em ``.virtualenvs/`` no seu diretório pessoal. Crie-o se ele ainda não existe:

source: Now create a new virtualenv by running:
es: Ahora cree un nuevo virtualenv ejecutando:
pt_br: Agora crie uma nova virtualenv executando:

source: The path is where the new environment will be saved on your computer.
es: La ruta es donde se guardará el nuevo entorno en su computadora.
pt_br: O caminho é o local onde o novo ambiente será salvo em seu computador.

source: Using the built-in ``venv`` module will not work if you are also using the Git Bash shell on Windows, since activation scripts are only created for the system shell (``.bat``) and PowerShell (``.ps1``). Use the ``virtualenv`` package instead:
es: Utilizar el módulo incorporado `` venv`` no funcionará si también está usando el Git Bash shell en Windows, ya que los scripts de activación se crean sólo para el shell del sistema (`` .bat``) y PowerShell (``. ps1``). Utilice en cambio el paquete ``virtualenv``:
pt_br: Usando o módulo embutido ``venv`` não irá funcionar se você também estiver usando o Git Bash shell no Windows, já que os scripts de ativação só são criados para o shell do sistema (``.bat``)e para o PowerShell (``.ps1``). Em vez disso use o pacote ``virtualenv``:

source: For Ubuntu users
es: Para los usuarios de Ubuntu
pt_br: Para usuários Ubuntu.

source: On some versions of Ubuntu the above command might fail. Use the ``virtualenv`` package instead, first making sure you have ``pip3``:
es: En algunas versiones de Ubuntu el comando anterior podría fallar. Utilice en cambio el paquete ``virtualenv``, primero asegúrese de que tiene `` pip3``:
pt_br: Em algumas versões do Ubuntu pode ser que o comando acima falhe. Ao invés disso use o pacote ``virtualenv``, antes certifique-se que você tem o ``pip3``:

source: The final step in setting up your virtualenv is to activate it:
es: El último paso para instalar su virtualenv es activarlo:
pt_br: O passo final na criação da sua virtualenv é ativá-la:

source: If the ``source`` command is not available, you can try using a dot instead:
es: Si el comando `` source`` no está disponible, puede intentar usar un punto en su lugar:
pt_br: Se o comando ``source`` não estiver disponível, você pode tentar usar um ponto em vez disso:

source: To activate your virtualenv on Windows, run:
es: Para activar su virtualenv en Windows, ejecute:
pt_br: Para ativar seu virtualenv no Windows, rode:

source: You have to activate the virtualenv whenever you open a new terminal window. virtualenvwrapper__ is a useful tool for making this more convenient.
es: Tiene que activar el virtualenv cada vez que abre una nueva ventana de terminal. virtualenvwrapper es una herramienta útil para hacer esto más fácil.
pt_br: Você tem que ativar o virtualenv sempre que abrir uma nova janela de terminal. virtualenvwrapper__ é uma ferramenta útil para deixar isso mais conveniente.

source: Anything you install through ``pip`` from now on will be installed in your new virtualenv, isolated from other environments and system-wide packages. Also, the name of the currently activated virtualenv is displayed on the command line to help you keep track of which one you are using. Go ahead and install the previously cloned copy of Django:
es: Todo lo que usted instala a través de `` pip`` a partir de ahora será instalado en su nuevo virtualenv, aislado de otros entornos y paquetes de todo el sistema. Además, el nombre del virtualenv actualmente activado se muestra en la línea de comandos para ayudarle a saber cuál está utilizando. Continúe e instale la copia de Django previamente clonada:
pt_br: Tudo o que você instalar através do ``pip`` a partir de agora será instalado no seu novo virtualenv, isolado de outros ambientes e pacotes de todo o sistema. Além disso, o nome do virtualenv atualmente ativado é exibido na linha de comando para lhe ajudar a saber qual deles você está usando. Vá em frente e instale a cópia previamente clonada do Django:

source: The installed version of Django is now pointing at your local copy. You will immediately see any changes you make to it, which is of great help when writing your first patch.
es: La versión instalada de Django está señalando su copia local. Inmediatamente verá los cambios que le realice a la misma, lo cual será de gran ayuda cuando escriba su primer parche.
pt_br: A versão instalada do Django agora está apontando para a sua cópia local. Você verá as mudanças que fizer de forma imediata, o que é uma grande ajuda quando se está escrevendo o primeiro patch

source: Rolling back to a previous revision of Django
es: Restaurar una versión previa de Django
pt_br: Revertendo para uma revisão anterior do Django

source: For this tutorial, we'll be using ticket :ticket:`24788` as a case study, so we'll rewind Django's version history in git to before that ticket's patch was applied. This will allow us to go through all of the steps involved in writing that patch from scratch, including running Django's test suite.
es: Para este tutorial, vamos a utilizar la incidencia: incidencia: `24788` como caso de estudio, por lo que vamos a rebobinar el historial de versiones de Django en git hasta antes de que se aplicara el parche de dicha incidencia. Esto nos permitirá revisar todos los pasos necesarios para escribir ese parche desde cero, incluyendo la ejecución del conjunto de pruebas de Django.
pt_br: Para este tutorial usaremos o ticket :ticket:`24788` como caso de estudo, então iremos voltar no histórico de versão do Django no git para antes que o "patch" deste ticket tenha sido aplicado. Isso nos possibilitará ir através de todos os passos envolvidos em escrever um patch do início, incluindo rodar a suíte de testes do Django.

source: **Keep in mind that while we'll be using an older revision of Django's trunk for the purposes of the tutorial below, you should always use the current development revision of Django when working on your own patch for a ticket!**
es: **Recuerde que aunque estaremos usando una revisión anterior del repositorio central de Django para los propósitos del tutorial a continuación, ¡Usted siempre debería usar la revisión actual de desarrollo de Django cuando trabaje en su propio parche para una incidencia!**
pt_br: **Tenha em mente que enquanto estamos usando uma revisão antiga da árvore do Django, para o propósito do tutorial abaixo, você deve sempre usar a versão corrente da árvore de desenvolvimento quando for trabalhar no seu próprio patch para um ticket!**

source: The patch for this ticket was written by Paweł Marczewski, and it was applied to Django as `commit 4df7e8483b2679fc1cba3410f08960bac6f51115`__. Consequently, we'll be using the revision of Django just prior to that, `commit 4ccfc4439a7add24f8db4ef3960d02ef8ae09887`__.
es: El parche para esta incidencia fue escrito por Paweł Marczewski, y se aplicó a Django como `commit 4df7e8483b2679fc1cba3410f08960bac6f51115`__. Por lo tanto, estaremos utilizando la revisión de Django inmediatamente anterior a esa, `commit 4ccfc4439a7add24f8db4ef3960d02ef8ae09887`__.
pt_br: O patch para este ticket foi escrito por Paweł Marczewskie foi aplicado ao Django como `commit 4df7e8483b2679fc1cba3410f08960bac6f51115`__. Consequentemente, usaremos a revisão anterior a esta, `commit 4ccfc4439a7add24f8db4ef3960d02ef8ae09887`__.

source: Navigate into Django's root directory (that's the one that contains ``django``, ``docs``, ``tests``, ``AUTHORS``, etc.). You can then check out the older revision of Django that we'll be using in the tutorial below:
es: Navegue en el directorio raíz de Django (es el único que contiene "django", "documentos", "pruebas", "autores", etc.). Usted puede después ver la revisión anterior de Django que estaremos utilizando en el tutorial a continuación:
pt_br: Navegue até o diretório raiz do Django (o diretório que contém 'django', 'docs, 'testes', 'autores' e etc). Pode-se verificar então a revisão mais antiga do Django que utilizaremos no tutorial abaixo:

source: Running Django's test suite for the first time
es: Ejecutando el conjunto de pruebas de Django por primera vez
pt_br: Executando a suíte de testes do Django pela primeira vez
