Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: For more information on all of this, see the :doc:`django-admin documentation </ref/django-admin>`.
es: Para obtener más información acerca de todo esto, vea el: doc: `documentación del sitio administrativo Django </ref/django-admin>`.
pt_br: Para mais informações sobre isso tudo, veja a :doc:`documentação do django-admin </ref/django-admin>`.

source: Once you're in the shell, explore the :doc:`database API </topics/db/queries>`::
es: Una vez que esté en el shell, explore la: doc: `API de base de datos </topics/db/queries> `::
pt_br: Assim que você estiver no shell, explore a :doc:`API de banco de dados </topics/db/queries>`::

source: Wait a minute. ``<Question: Question object>`` is, utterly, an unhelpful representation of this object. Let's fix that by editing the ``Question`` model (in the ``polls/models.py`` file) and adding a :meth:`~django.db.models.Model.__str__` method to both ``Question`` and ``Choice``:
es: Espere un momento. ``<Question: Question object>``es totalmente una representación inútil de este objeto. Vamos a solucionar esto editando el modelo “Pregunta” ( en el archivo ``polls/models.py``) y añadiendo un:método: método`~django.db.models.Model.__str__` tanto al modelo “Pregunta” como al modelo “Elección”:
pt_br: Espere um pouco. ``<Question: Question object>`` é uma representação totalmente inútil desse objeto. Vamos corrigir isso editando o model da ``Question`` (no arquivo ``polls/models.py``) e adicionando um método :meth:`~django.db.models.Model.__str__` a ambos ``Question`` e ``Choice``::

source: It's important to add :meth:`~django.db.models.Model.__str__` methods to your models, not only for your own convenience when dealing with the interactive prompt, but also because objects' representations are used throughout Django's automatically-generated admin.
es: Es importante añadir: método: métodos `~django.db.models.Model.__str__` a sus modelos, no solo para su conveniencia al lidiar con el prompt interactivo, sino también porque las representaciones de objetos se usan en todo el sitio administrativo generado automáticamente de Django.
pt_br: É importante adicionar métodos :meth:`~django.db.models.Model.__str__` aos seus models, não apenas para sua própria conveniência quando estiver lidando com o prompt interativo, mas também porque representações de objetos são usadas por todo projeto gerado automaticamente pelo Django.

source: Note these are normal Python methods. Let's add a custom method, just for demonstration:
es: Tenga en cuenta que estos son métodos normales de Python . Vamos a añadir un método personalizado, sólo como demostración:
pt_br: Note que esses são métodos Python normais. Vamos adicionar um método personalizado, apenas para demonstração:

source: Note the addition of ``import datetime`` and ``from django.utils import timezone``, to reference Python's standard :mod:`datetime` module and Django's time-zone-related utilities in :mod:`django.utils.timezone`, respectively. If you aren't familiar with time zone handling in Python, you can learn more in the :doc:`time zone support docs </topics/i18n/timezones>`.
es: Observe la adición de `import datetime`` y `from django.utils import timezone``, para consultar la norma de Python: mod: módulo `datetime` y las herramientas relacionadas con el huso horario de Django : mod:` django.utils. timezone` respectivamente. Si usted no está familiarizado con el manejo de zona horaria en Python, usted puede aprender más en el: doc: `documentos de soporte de huso horario </topics/i18n/timezones> `.
pt_br: Note a adição de ``import datetime`` e ``from django.utils import timezone``, para referenciar o módulo padrão do Python :mod:`datetime` e o modulo Django utilitário de fuso horário :mod:`django.utils.timezone`, respectivamente. Se você não é familiar com o gerenciamento de fuso horário no Python, você pode aprender mais no :doc:`documentação de suporte a fuso horários </topics/i18n/timezones>`.

source: Save these changes and start a new Python interactive shell by running ``python manage.py shell`` again::
es: Guarde estos cambios e inicie un nuevo shell interactivo Python ejecutando de nuevo`` python manage.py shell``::
pt_br: Salve essas mudanças e vamos iniciar uma nova sessão do shell interativo do Python rodando ``python manage.py shell`` novamente::

source: For more information on model relations, see :doc:`Accessing related objects </ref/models/relations>`. For more on how to use double underscores to perform field lookups via the API, see :ref:`Field lookups <field-lookups-intro>`. For full details on the database API, see our :doc:`Database API reference </topics/db/queries>`.
es: Para obtener más información sobre las relaciones de modelo, consulte: doc: `Acceso a objetos relacionados </ref/models/relations> `. Para más información sobre cómo utilizar guiones dobles para realizar búsquedas de campo a través de la API, consulte: ref: `búsquedas de campo <field-lookups-intro> `. Para más detalles sobre la API de base de datos, consulte nuestra: doc: `referencia de la API de base de datos </topics/db/queries> `.
pt_br: Para mais informações sobre relacionamento de modelos, veja :doc:`Acessando objetos relacionados </ref/models/relations>`. Para mais informação em como usar sublinhados duplos para pesquisa usando campos da API, veja :ref:`Pesquisa com campos<field-lookups-intro>`. Para um detalhamento completo da API de banco de dados, veja nossa :doc:`referência à API de Banco de Dados </topics/db/queries>`.

source: Introducing the Django Admin
es: Presentando el sitio administrativo de Django
pt_br: Escrevendo sua primeira aplicação Django, parte 7

source: Generating admin sites for your staff or clients to add, change, and delete content is tedious work that doesn't require much creativity. For that reason, Django entirely automates creation of admin interfaces for models.
es: La generación de sitios administrativos para su personal o clientes para agregar, modificar y eliminar contenido es un trabajo aburrido que no requiere mucha creatividad. Por esa razón, Django automatiza completamente la creación de interfaces de sitios administrativos para los modelos.
pt_br: Gerar o site de administração para seu time ou clientes para adicionar, alterar, e deletar conteúdo é uma tarefa tediosa que não requer muita criatividade. Por essa razão, o Django automatiza totalmente a criação da interface de admin para os modelos.

source: Django was written in a newsroom environment, with a very clear separation between "content publishers" and the "public" site. Site managers use the system to add news stories, events, sports scores, etc., and that content is displayed on the public site. Django solves the problem of creating a unified interface for site administrators to edit content.
es: Django fue escrito en un entorno de sala de redacción, con una separación muy clara entre "los editores de contenido" y el sitio "público". Los administradores de sitios utilizan el sistema para agregar noticias, eventos, resultados deportivos, etc., y que el contenido se muestra en el sitio público. Django resuelve el problema de crear una interfaz unificada para los administradores del sitio para editar el contenido.
pt_br: O Django foi desenvolvido em um ambiente de redação, onde havia uma clara separação entre "produtores de conteúdo" e o site "público". Gerentes de site usam o sistema para adicionar notícias, eventos, resultado de esportes, etc, e o conteúdo é exibido no site público. O Django soluciona o problema de criar uma interface unificada para os administradores editarem o conteúdo.

source: The admin isn't intended to be used by site visitors. It's for site managers.
es: El sitio administrativo no está destinado para ser utilizado por los visitantes del sitio. Es para los administradores del sitio.
pt_br: A administração não foi desenvolvida necessariamente para ser usada pelos visitantes do site, mas sim pelos gerentes.

source: Creating an admin user
es: Creando un usuario del sitio administrativo
pt_br: Criando um usuário administrador

source: First we'll need to create a user who can login to the admin site. Run the following command:
es: Primero tendremos que crear un usuario que pueda iniciar sesión en el sitio administrativo. Ejecute el siguiente comando:
pt_br: Primeiro temos que criar um usuário que possa acessar o site de administração. Rode o seguinte comando:

source: Enter your desired username and press enter.
es: Introduzca su nombre de usuario deseado y pulse ENTER.
pt_br: Digite seu nome de usuário desejado e pressione enter.

source: You will then be prompted for your desired email address:
es: A continuación se le solicitará su dirección de correo electrónico deseada:
pt_br: Em seguida, será requisitado seu endereço de e-mail desejado:

source: The final step is to enter your password. You will be asked to enter your password twice, the second time as a confirmation of the first.
es: El paso final es introducir su contraseña. Se le pedirá que introduzca su contraseña dos veces, la segunda vez como una confirmación de la primera.
pt_br: O último passo é digitar sua senha. Você será solicitado que digite sua senha duas vezes, a segunda vez como uma confirmação da primeira.

source: Start the development server
es: Inicie el servidor de desarrollo
pt_br: Inicie o servidor de desenvolvimento

source: The Django admin site is activated by default. Let's start the development server and explore it.
es: El sitio administrativo de Django se activa de forma predeterminada. Vamos a iniciar el servidor de desarrollo y explorarlo.
pt_br: O site de administração vem ativado por padrão. Vamos iniciar o servidor de desenvolvimento e explora-lo.

source: If the server is not running start it like so:
es: Si el servidor no está en marcha, inícielo así:
pt_br: Se o servidor não estiver sendo executado, inicie-o da seguinte forma:

source: Now, open a Web browser and go to "/admin/" on your local domain -- e.g., http://127.0.0.1:8000/admin/. You should see the admin's login screen:
es: A continuación, abra un navegador Web y vaya a "/ admin /" en su dominio local, por ejemplo, http://127.0.0.1:8000/admin/. Usted debe ver la pantalla de inicio de sesión del sitio administrativo:
pt_br: Agora, abra o navegador de internet e vá para "/admin/" no seu domínio local -- ex:, http://127.0.0.1:8000/admin/. Você deverá ver a tela de acesso:

source: Since :doc:`translation </topics/i18n/translation>` is turned on by default, the login screen may be displayed in your own language, depending on your browser's settings and if Django has a translation for this language.
es: Dado que :doc: `traducción </topics/i18n/translation> ` se activa de forma predeterminada, la pantalla de inicio de sesión puede aparecer en su propio idioma, dependiendo de la configuración del navegador y de si Django tiene una traducción para este idioma.
pt_br: Desde que :doc:`translation </topics/i18n/translation>` está habilitado por padrão, a tela de login talvez seja mostrada em sua própria língua, dependendo das configurações do seu browser a se o Django tem tradução para esta língua.

source: Enter the admin site
es: Acceda al sitio administrativo
pt_br: Entre no site de administração

source: Now, try logging in with the superuser account you created in the previous step. You should see the Django admin index page:
es: Ahora, intente iniciar sesión con la cuenta de superusuario que creó en el paso anterior. Usted debe ver la página de índice del sitio administrativo de Django:
pt_br: Agora, tente acessar o sistema com a conta de super usuário que criou no passo anterior. Você deverá ver a página inicial do site de administração do Django:

source: You should see a few types of editable content: groups and users. They are provided by :mod:`django.contrib.auth`, the authentication framework shipped by Django.
es: Usted debe ver algunos tipos de contenidos editables: grupos y usuarios. Ellos son proporcionados por: mod: `django.contrib.auth`, el framework de autenticación enviado por Django.
pt_br: Você deverá ver alguns outros tipos de conteúdos editáveis, incluindo grupos e usuários. Estas funcionalidades são fornecidas por mod:`django.contrib.auth`, o framework de autenticação fornecido pelo Django.

source: Make the poll app modifiable in the admin
es: Haga que la aplicación encuesta se pueda modificar en el sitio administrativo
pt_br: Torne a aplicação de enquetes editável no site de administração

source: But where's our poll app? It's not displayed on the admin index page.
es: Pero ¿Dónde está nuestra aplicación encuesta? No se muestra en la página de índice del sitio administrativo.
pt_br: Mas onde está nossa aplicação de enquete? Ela não está visível na página principal do site de administração.

source: Just one thing to do: we need to tell the admin that ``Question`` objects have an admin interface. To do this, open the :file:`polls/admin.py` file, and edit it to look like this:
es: Sólo hay una cosa por hacer: tenemos que indicarle al sitio administrativo que los objetos ``Pregunta`` tienen una interfaz del sitio administrativo. Para ello, abra el: archivo: archivo `polls/admin.py` y edítelo para que se vea así:
pt_br: Apenas uma coisa a ser feita: Nós temos que dizer para o site de administração que os objetos ``Question`` possuem uma interface de administração. Para fazer isto, crie um arquivo chamado :file:`polls/admin.py`, e edite para que se pareça com isto:

source: Explore the free admin functionality
es: Explore la funcionalidad del sitio administrativo sin restricciones
pt_br: Explore a funcionalidade de administração de graça

source: Now that we've registered ``Question``, Django knows that it should be displayed on the admin index page:
es: Ahora que hemos registrado el modelo `` Pregunta``, Django sabe que debe aparecer en la página de índice del sitio administrativo:
pt_br: Agora que nós registramos ``Question``, o Django sabe que ela deve ser exibida na página principal do site de administração:

source: Click "Questions". Now you're at the "change list" page for questions. This page displays all the questions in the database and lets you choose one to change it. There's the "What's up?" question we created earlier:
es: Haga clic en "Preguntas". Ahora usted está en la página "lista de cambios" para las preguntas. Esta página muestra todas las preguntas de la base de datos y le permite seleccionar una para modificarla. Ahí está la pregunta "¿Qué pasa?" que creamos anteriormente:
pt_br: Clique em "Questions". Agora cocê está na página "change list" para "questions". Essa página mostra todas as "questions" em seu banco de dados e lhe deixa escolher uma para alterar. Lá está a pergunta "What's up?" que criamos anteriormente.

source: Click the "What's up?" question to edit it:
es: Haga clic en la pregunta "¿Qué pasa?" para editarla:
pt_br: Clique na enquete "What's up?" para editá-la:

source: Things to note here:
es: Cosas a tener en cuenta aquí:
pt_br: Coisas para observar aqui:

source: The form is automatically generated from the ``Question`` model.
es: El formulario se genera automáticamente desde el modelo ``Pregunta``.
pt_br: O formulário é gerado automaticamente para o modelo ``Question``.

source: The different model field types (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) correspond to the appropriate HTML input widget. Each type of field knows how to display itself in the Django admin.
es: Los diferentes tipos de campos del modelo (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) corresponden al widget de entrada HTML adecuado. Cada tipo de campo sabe cómo mostrarse en el sitio administrativo de Django.
pt_br: Os diferentes tipos de campos (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) correspondem aos respectivos widgets HTML de inserção. Cada tipo de campo sabe como se exibir no site de administração do Django.

source: Each :class:`~django.db.models.DateTimeField` gets free JavaScript shortcuts. Dates get a "Today" shortcut and calendar popup, and times get a "Now" shortcut and a convenient popup that lists commonly entered times.
es: Cada: clase: `~ django.db.models.DateTimeField` obtiene atajos de JavaScrip sin restricción. Las fechas obtienen un atajo "Hoy" y la ventana emergente del calendario, y las horas obtienen un atajo "ahora" y una ventana emergente conveniente que enumera los horarios comúnmente introducidos.
pt_br: Cada :class:`~django.db.models.DateTimeField` ganha um atalho JavaScript de graça. Datas possuem um atalho "Hoje" e um calendário popup, e horas têm um atalho "Agora" e um conveniente popup com listas de horas utilizadas comumente.

source: The bottom part of the page gives you a couple of options:
es: La parte inferior de la página le da un par de opciones:
pt_br: A parte inferior da página fornece uma série de opções:

source: Save -- Saves changes and returns to the change-list page for this type of object.
es: Guardar - Guarda los cambios y vuelve a la página de la lista de cambios para este tipo de objeto.
pt_br: Salvar -- Salva as alterações e retorna para a pagina lista de modificação para este tipo de objeto.

source: Save and continue editing -- Saves changes and reloads the admin page for this object.
es: Guardar y continuar editando - Guarda los cambios y recarga la página del sitio administrativo para este objeto.
pt_br: Salvar e continuar editando -- Salva as alterações e recarrega a página do site de administração para este objeto.

source: Save and add another -- Saves changes and loads a new, blank form for this type of object.
es: Guardar y añadir otro - Guarda los cambios y carga un nuevo formulario vacio para este tipo de objeto.
pt_br: Salvar e adicionar outro -- Salva as informações e abre um novo formulário em branco para este tipo de objeto.

source: Delete -- Displays a delete confirmation page.
es: Eliminar - Muestra una página de confirmación de eliminación.
pt_br: Deletar -- Exibe uma página de confirmação de exclusão.

source: If the value of "Date published" doesn't match the time when you created the question in :doc:`Tutorial 1</intro/tutorial01>`, it probably means you forgot to set the correct value for the :setting:`TIME_ZONE` setting. Change it, reload the page and check that the correct value appears.
es: Si el valor de "Fecha de publicación" no coincide con la hora en la que creó la pregunta: doc: `Tutorial 1 </intro/tutorial01> `, Probablemente significa que se olvidó de establecer el valor correcto para la:configuración:configuración del `Huso horario`. Modifíquelo, recargue la página y compruebe que aparezca el valor correcto.
pt_br: Se o valor do "Date published" não bate com hora que a questão foi criada em :doc:`Tutorial 1</intro/tutorial01>`, provavelmente quer dizer que foi esquecido de configurar o correto valor da configuração do :setting:`TIME_ZONE`. Altere isso, e recarregue a página e verifique se o calor correto aparece.

source: Change the "Date published" by clicking the "Today" and "Now" shortcuts. Then click "Save and continue editing." Then click "History" in the upper right. You'll see a page listing all changes made to this object via the Django admin, with the timestamp and username of the person who made the change:
es: Modifique la “fecha de publicación” haciendo clic en los atajos “Hoy” y “Ahora”. Después, haga clic en “Guardar y continuar editando”. Luego haga clic en “Historial” en la parte superior derecha. Usted verá una página que enumera todos los cambios realizados a este objeto a través del sitio administrativo de Django, con el registro de tiempo y el nombre de usuario de la persona que realizó el cambio:
pt_br: Altere a "Data de publicação" clicando nos atalhos "Hoje" e "Agora". Em seguida, clique em "Salvar e continuar editando." Então clique em "Histórico" no canto superior direito. Você verá uma página exibindo todas as alterações feitas neste objeto pelo site de administração do Django, com a hora e o nome de usuário da pessoa que fez a alteração:

source: When you're comfortable with the models API and have familiarized yourself with the admin site, read :doc:`part 3 of this tutorial</intro/tutorial03>` to learn about how to add more views to our polls app.
es: Cuando usted se sienta cómodo con los modelos API y se haya familiarizado con el sitio administrativo, lea: doc: `la parte 3 de este tutorial </intro/tutorial03> `para aprender sobre cómo agregar más vistas a nuestra aplicación encuestas.
pt_br: Quando estiver confortável com a "API" dos modelos e estiver familiarizado com o "admin site", leia :doc:`part 3 of this tutorial</intro/tutorial03>` para aprender sobre como adicionar mais "views"para nossa app "polls".

source: Writing your first Django app, part 3
es: Escribiendo su primera aplicación en Django, parte 3
pt_br: Escrevendo sua primeira app Django, parte 3

source: This tutorial begins where :doc:`Tutorial 2 </intro/tutorial02>` left off. We're continuing the Web-poll application and will focus on creating the public interface -- "views."
es: Este tutorial comienza donde quedó: doc:`Tutorial 2 </intro/tutorial02>`. Vamos a continuar con la aplicación Web encuestas y vamos a enfocarnos en crear la interfaz pública “vistas”.
pt_br: Este tutorial inicia-se onde o :doc:`Tutorial 2 <intro-tutorial02>` terminou. Vamos continuar a aplicação web de enquete e focaremos na criação da interface pública -- "views".

source: Overview
es: Información general
pt_br: Visão Geral

source: A view is a "type" of Web page in your Django application that generally serves a specific function and has a specific template. For example, in a blog application, you might have the following views:
es: Una vista es un "tipo" de página Web en la aplicación Django, que generalmente cumple una función específica y tiene una plantilla específica. Por ejemplo, en una aplicación de blog, usted puede tener las siguientes vistas:
pt_br: Uma view é um "tipo" de página Web em sua aplicação Django que em geral serve a uma função específica e tem um template específico. Por exemplo, em uma aplicação de blog, você deve ter as seguintes views:

source: Blog homepage -- displays the latest few entries.
es: La página de inicio del blog - muestra las últimas pocas entradas.
pt_br: Página inicial do blog - exibe os artigos mais recentes.

source: Entry "detail" page -- permalink page for a single entry.
es: página de entrada "detalle" - Página de enlace permanente para una entrada individual.
pt_br: Página de "detalhes" - página de vínculo estático permanente para um único artigo.

source: Year-based archive page -- displays all months with entries in the given year.
es: Página de archivo en base al año - muestra todos los meses con entradas en un determinado año.
pt_br: Página de arquivo por ano - exibe todos os meses com artigos para um determinado ano.

source: Month-based archive page -- displays all days with entries in the given month.
es: Página de archivo en base al mes - muestra todos los días con las entradas en un mes determinado.
pt_br: Página de arquivo por mês - exibe todos os dias com artigos para um determinado mês.

source: Day-based archive page -- displays all entries in the given day.
es: Página de archivo en base al día-- muestra todas las entradas de un día determinado.
pt_br: Página de arquivo por dia - exibe todos os artigos de um determinado dia.

source: Comment action -- handles posting comments to a given entry.
es: Acción de comentario - gestiona la publicación de comentarios en una entrada determinada.
pt_br: Ação de comentários - controla o envio de comentários para um artigo.
