Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: In previous parts of the tutorial, the templates have been provided with a context that contains the ``question`` and ``latest_question_list`` context variables. For ``DetailView`` the ``question`` variable is provided automatically -- since we're using a Django model (``Question``), Django is able to determine an appropriate name for the context variable. However, for ListView, the automatically generated context variable is ``question_list``. To override this we provide the ``context_object_name`` attribute, specifying that we want to use ``latest_question_list`` instead. As an alternative approach, you could change your templates to match the new default context variables -- but it's a lot easier to just tell Django to use the variable you want.
es: En partes anteriores del tutorial, las plantillas se han dotado de un contexto que contiene las variables contextuales `pregunta``` y ``lista de preguntas recientes`. Para la “vista detallada”se suministra la variable “pregunta” de forma automática, ya que estamos utilizando un modelo Django (“Pregunta”), Django puede determinar un nombre adecuado para la variable contextual. Sin embargo, para la Vista Lista, la variable contextual generada de forma automática es “Lista de preguntas”. Para anular esto, proporcionamos el atributo ``nombre de objeto contextual” especificando que queremos utilizar en cambio “Lista de preguntas recientes”. Como un método alternativo, usted puede modificar sus plantillas para que coincidan con las nuevas variables contextuales predeterminadas, pero es mucho más sencillo solo indicarle a Django que utilice la variable que usted quiere.
pt_br: Nas partes anteriores deste tutorial, os templates tem sido fornecidos com um contexto que contém as variáveis ``question`` e ``latest_question_list``. Para a ``DetailView`` a variavel ``question`` é fornecida automaticamente -- já que estamos usando um model Django (``Question``), Django is able to determine an appropriate name for the context variable. However, for ListView, the automatically generated context variable is ``question_list``. To override this we provide the ``context_object_name`` attribute, specifying that we want to use ``latest_question_list`` instead. As an alternative approach, you could change your templates to match the new default context variables -- but it's a lot easier to just tell Django to use the variable you want.

source: Run the server, and use your new polling app based on generic views.
es: Ejecute el servidor y utilice su nueva aplicación encuesta basada en las vistas genéricas.
pt_br: Execute o servidor, e use sua nova aplicação de enquete baseada em generic views.

source: For full details on generic views, see the :doc:`generic views documentation </topics/class-based-views/index>`.
es: Para más detalles sobre las vistas genéricas, consulte la: doc: `documentación de las vistas genéricas </topics/class-based-views/index> `.
pt_br: Para detalhes completos sobre views genéricas, veja a :doc:`documentação de generic views documentation </topics/class-based-views/index>`.

source: When you're comfortable with forms and generic views, read :doc:`part 5 of this tutorial</intro/tutorial05>` to learn about testing our polls app.
es: Cuando esté familiarizado con los formularios y las vistas genéricas, lea la : doc: `parte 5 de este tutorial </intro/tutorial05> `para aprender sobre cómo probar nuestra aplicación encuestas.
pt_br: Quando você estiver confortável com formulários e generic views, leia a :doc:`parte 5 deste tutorial</intro/tutorial05>` para aprender sobre como testar nossa aplicação de enquete.

source: Writing your first Django app, part 5
es: Escribiendo su primera aplicación en Django, parte 5
pt_br: Escrevendo sua primeira aplicação Django, parte 5

source: This tutorial begins where :doc:`Tutorial 4 </intro/tutorial04>` left off. We've built a Web-poll application, and we'll now create some automated tests for it.
es: ¿Qué son las pruebas automatizadas?
pt_br: Este tutorial começa onde o :doc:`Tutorial 4 </intro/tutorial04>` parou. Nós construímos uma aplicação web de enquete, e agora nós vamos criar alguns testes automatizados para ela.

source: Introducing automated testing
es: Poniendo en práctica las pruebas automatizadas
pt_br: Apresentando testes automatizados

source: What are automated tests?
es: ¿Qué son las pruebas automatizadas?
pt_br: O que são testes automatizados?

source: Tests are simple routines that check the operation of your code.
es: Las pruebas son simples rutinas que comprueban el funcionamiento de su código.
pt_br: Testes são rotinas simples que checam o funcionamento do seu código.

source: Testing operates at different levels. Some tests might apply to a tiny detail (*does a particular model method return values as expected?*) while others examine the overall operation of the software (*does a sequence of user inputs on the site produce the desired result?*). That's no different from the kind of testing you did earlier in :doc:`Tutorial 2 </intro/tutorial02>`, using the :djadmin:`shell` to examine the behavior of a method, or running the application and entering data to check how it behaves.
es: Las pruebas se ejecutan en diferentes niveles. Algunas pruebas se pueden aplicar a un detalle pequeño (¿Un método modelo particular devuelve valores como se espera?) mientras que otras examinan el total funcionamiento del software (¿Una secuencia de entradas de usuarios en el sitio produce el resultado deseado?). No se diferencia del tipo de pruebas que usted ejecutó anteriormente en el :doc: `Tutorial 2 </intro/tutorial02>`, utilizando el :djadmin:`shell` para examinar el comportamiento de un método, o ejecutar la aplicación e ingresar datos para comprobar cómo se comporta.
pt_br: Testes funcionam em diferentes níveis. Alguns testes podem ser aplicados a um pequeno detalhe (*um determinado método de um modelo retorna o valor esperado?*) enquanto outros examinam o funcionamento global do software (*a sequência de entradas do usuário no site produz o resultado desejado?*). Isso não é diferente do teste que você fez anteriormente no :doc:`Tutorial 2 </intro/tutorial02>`, usando o :djadmin:`shell` para examinar o comportamento de um método, ou executar a aplicação e entrar com um dado para verificar como ele se comporta.

source: What's different in *automated* tests is that the testing work is done for you by the system. You create a set of tests once, and then as you make changes to your app, you can check that your code still works as you originally intended, without having to perform time consuming manual testing.
es: Lo que es diferente en las pruebas automatizadas es que el trabajo de pruebas lo hace el sistema para usted. Usted crea un conjunto de pruebas una vez, después, a medida que modifique su aplicación, puede comprobar que el código todavía funcione como originalmente lo concibió , sin necesidad de pruebas manuales engorrosas.
pt_br: A diferença em testes *automatizados* é que o trabalho de testar é feito para você pelo sistema. Você cria um conjunto de testes uma vez, e então conforme faz mudanças em sua aplicação, você pode checar se o seu código continua funcionando como você originalmente pretendia, sem ter que gastar tempo executando o teste manualmente.

source: Why you need to create tests
es: El por qué usted necesita crear pruebas
pt_br: Porque você precisa criar testes

source: So why create tests, and why now?
es: Entonces, ¿Por qué crear pruebas y por qué ahora?
pt_br: Então, por que criar testes, e por que agora?

source: You may feel that you have quite enough on your plate just learning Python/Django, and having yet another thing to learn and do may seem overwhelming and perhaps unnecessary. After all, our polls application is working quite happily now; going through the trouble of creating automated tests is not going to make it work any better. If creating the polls application is the last bit of Django programming you will ever do, then true, you don't need to know how to create automated tests. But, if that's not the case, now is an excellent time to learn.
es: Usted puede sentir que es más que suficiente nada más aprender Python y Django, y todavía tener otra cosa por aprender y hacer puede parecer abrumador y quizás innecesario. Después de todo, nuestra aplicación encuestas está funcionando ahora bastante bien, tomarse la molestia de crear pruebas automatizadas no va a hacer que funcione mejor. Si crear la aplicación encuestas es el último bit de programa de Django que usted hará, entonces es verdad, usted no necesita saber cómo crear pruebas automatizadas. Sin embargo, si ese no es el caso, ahora es un momento excelente para aprender.
pt_br: Você pode achar que já tem coisa suficiente no seu prato apenas aprendendo Python/Django, e tendo ainda outra coisa para aprender e fazer pode parecer exagerado e talvez desnecessário. Afinal, nossa aplicação de enquetes está funcionando muito bem agora; passar pelo trabalho de criar testes automatizados não vai fazê-la funcionar melhor. Se criar a aplicação de enquetes é a última coisa que você vai programar em Django, então realmente, você não precisa saber sobre como criar testes automatizados. Mas, se esse não é o caso, agora é uma excelente hora para aprender.

source: Tests will save you time
es: Las pruebas le ahorrarán tiempo
pt_br: Teste vão salvar seu tempo

source: Up to a certain point, 'checking that it seems to work' will be a satisfactory test. In a more sophisticated application, you might have dozens of complex interactions between components.
es: Hasta cierto punto, 'comprobar de que parece funcionar 'será una prueba satisfactoria. En una aplicación más sofisticada, es posible que tenga decenas de interacciones complejas entre los componentes.
pt_br: Até um certo ponto, 'verificar que parece funcionar' será um teste satisfatório. Em uma aplicação mais sofisticada, você pode ter dúzias de interações complexas entre componentes.

source: A change in any of those components could have unexpected consequences on the application's behavior. Checking that it still 'seems to work' could mean running through your code's functionality with twenty different variations of your test data just to make sure you haven't broken something - not a good use of your time.
es: Una modificación en cualquiera de esos componentes podría tener consecuencias inesperadas en el comportamiento de la aplicación. Comprobar que todavía ‘parece funcionar’ podría significar pasar por la funcionalidad de su código con veinte variaciones diferentes de sus datos de prueba solo para asegurarse de que no roto algo; no es un buen uso de su tiempo.
pt_br: Uma mudança em qualquer desses componentes pode trazer consequências inesperadas no comportamento da aplicação. Verificar que ainda 'parece funcionar' poderia significar rodar todas as funcionalidades do seu código com variações diferentes dos dados do seu teste, só pra ter certeza que você não tem nada quebrado - e isso não é um bom uso do seu tempo.

source: That's especially true when automated tests could do this for you in seconds. If something's gone wrong, tests will also assist in identifying the code that's causing the unexpected behavior.
es: Eso es especialmente cierto cuando las pruebas automatizadas pueden hacer esto por usted en cuestión de segundos. Si algo salió mal, las pruebas también ayudarán a identificar el código que está causando el comportamiento inesperado.
pt_br: Isso é verdade especialmente quando testes automatizados poderiam fazer isso pra você em segundos. Se alguma coisa errada acontecer, os testes também ajudarão em identificar o código que está causando o comportamento inesperado.

source: Sometimes it may seem a chore to tear yourself away from your productive, creative programming work to face the unglamorous and unexciting business of writing tests, particularly when you know your code is working properly.
es: A veces puede parecer una tarea para apartarse de su trabajo creativo y productivo de programación para afrontar la obligación poca atractiva y aburrida de escribir pruebas, particularmente cuando usted sabe que su código funciona de forma adecuada.
pt_br: Às vezes pode parece uma tarefa para afastar você da sua produtividade e criatividade em programar para enfrentar o trabalho nada excitante e glamouroso de escrever testes, particularmente quando você sabe que seu código está funcionando corretamente.

source: However, the task of writing tests is a lot more fulfilling than spending hours testing your application manually or trying to identify the cause of a newly-introduced problem.
es: Sin embargo, la tarea de escribir pruebas es mucho más gratificante que pasar horas probando su aplicación de forma manual o intentando identificar la causa de un problema recién introducido.
pt_br: No entanto, a tarefa de escrever testes é muito mais satisfatório do que gastar horas testando sua aplicação manualmente, ou tentando identificar a causa de um problema recém-introduzido.

source: Tests don't just identify problems, they prevent them
es: Las pruebas no solo identifican los problemas, ellas los previenen
pt_br: Testes não só identificam problemas, mas também os previnem

source: It's a mistake to think of tests merely as a negative aspect of development.
es: Es un error pensar en las pruebas sólo como un aspecto negativo del desarrollo.
pt_br: É um erro pensar dos testes simplesmente como um aspecto negativo do desenvolvimento.

source: Without tests, the purpose or intended behavior of an application might be rather opaque. Even when it's your own code, you will sometimes find yourself poking around in it trying to find out what exactly it's doing.
es: Sin las pruebas, el propósito o el comportamiento previsto de una aplicación pueden ser bastante incomprensibles. Incluso cuando es su propio código, usted a veces se encontrará buscando en él tratando de averiguar qué es exactamente lo que hace.
pt_br: Sem testes, o objetivo ou comportamento desejado de uma aplicação pode não ser tão claro. Mesmo quando é seu próprio código, algumas vezes você vai se encontrar bisbilhotando nele tentando descobrir exatamente o que está fazendo.

source: Tests change that; they light up your code from the inside, and when something goes wrong, they focus light on the part that has gone wrong - *even if you hadn't even realized it had gone wrong*.
es: Las pruebas cambian eso, ellas iluminan su código desde adentro, y cuando algo sale mal, ellas se centran en la parte que salió mal; incluso si usted no se ha dado cuenta de que salió mal.
pt_br: Testes mudam isso; eles mostram seu código por dentro, e quando algumas coisas saem errado, eles revelam parte do erro.

source: Tests make your code more attractive
es: Las pruebas hacen más atractivo su código
pt_br: Testes fazem seu código mais atraente.

source: You might have created a brilliant piece of software, but you will find that many other developers will simply refuse to look at it because it lacks tests; without tests, they won't trust it. Jacob Kaplan-Moss, one of Django's original developers, says "Code without tests is broken by design."
es: Usted puede haber creado una brillante pieza de software, pero encontrará que muchos otros desarrolladores simplemente se negarán a verla porque carece de pruebas; sin pruebas, no van a confiar en ella. Jacob Kaplan-Moss, uno de los desarrolladores originales de Django, dice "El código sin pruebas se rompe con el diseño."
pt_br: Você pode criar uma parte importante no software, mas você vai encontrar muitos outros desenvolvedores que vão simplesmente ignorar ao olhar isto, por que isto carece de testes, e sem testes, não há confiança. Jacob Kaplan-Moss, um dos primeiros desenvolvedores do Django diz "Código sem testes é quebra de design".

source: That other developers want to see tests in your software before they take it seriously is yet another reason for you to start writing tests.
es: Que otros desarrolladores quieran ver pruebas en su software antes de que se lo tomen en serio es una razón más para que usted comience a escribir las pruebas.
pt_br: Assim, esses outros desenvolvedores procuram ver os testes do seu software antes de levar a sério, e isso é uma outra razão para você iniciar a escrita dos testes.

source: Tests help teams work together
es: Las pruebas ayudan a los equipos a trabajar en conjunto
pt_br: Testes ajudam as equipes a trabalharem juntos

source: The previous points are written from the point of view of a single developer maintaining an application. Complex applications will be maintained by teams. Tests guarantee that colleagues don't inadvertently break your code (and that you don't break theirs without knowing). If you want to make a living as a Django programmer, you must be good at writing tests!
es: Los puntos anteriores están escritos desde el punto de vista de un único desarrolador que mantiene una aplicación. Las aplicaciones complejas serán mantenidas por los equipos. Las pruebas garantizan que los colegas no rompan inadvertidamente su código (y que usted no rompa los de ellos sin saber). Si quiere ganarse la vida como un programador de Django, !Usted debe ser bueno escribiendo pruebas!
pt_br: Os pontos anteriores foram escritos do ponto de vista de um único desenvolvedor mantendo uma aplicação. Aplicações complexas serão mantidas por times. Testes garantem que seus colegas de trabalho não quebrem acidentalmente o seu código (e que você não quebre o deles sem saber). Se você deseja trabalhar como um programador Django, deve ser bom escrevendo testes!

source: Basic testing strategies
es: Estrategias de pruebas básicas
pt_br: Estratégias básicas de testes

source: There are many ways to approach writing tests.
es: Hay muchas maneras de abordar las pruebas.
pt_br: Há várias maneiras de abordar a escrita de testes.

source: Some programmers follow a discipline called "`test-driven development`_"; they actually write their tests before they write their code. This might seem counter-intuitive, but in fact it's similar to what most people will often do anyway: they describe a problem, then create some code to solve it. Test-driven development simply formalizes the problem in a Python test case.
es: Algunos programadores siguen una disciplina llamada "'desarrollo basado en pruebas'"; ellos realmente escriben las pruebas antes de escribir el código. Esto puede parecer ir contra el sentido común, pero en realidad es similar a lo que la mayoría de la gente a menudo hará de todos modos: describen un problema, a continuación, crean un código para resolverlo. El desarrollo basado en pruebas simplemente formaliza el problema en un caso de prueba Python.
pt_br: Alguns programadores seguem uma disciplina chamada "`test-driven development`_"; eles escrevem seus testes antes de escrever o código. Isso talvez pareção não intuitivo, mas na verdade é similar o que muitas pessoas farão de qualquer forma: eles descrevem um problema, então criam um código para resolver isso. O desenvolvimento Test-driven simplesmente formaliza o problema em um caso de teste em Python.

source: More often, a newcomer to testing will create some code and later decide that it should have some tests. Perhaps it would have been better to write some tests earlier, but it's never too late to get started.
es: La mayoría de las veces, un principiante en pruebas va a crear código y luego decidirá que este debe tener algunas pruebas. Tal vez hubiera sido mejor escribir algunas pruebas antes, pero nunca es demasiado tarde para empezar.
pt_br: Comumente, um novato em testes irá criar algum código e depois decidir que ele deveria ser testado. Talvez seria melhor escrever alguns testes antes, mas nunca é tarde para começar.

source: Sometimes it's difficult to figure out where to get started with writing tests. If you have written several thousand lines of Python, choosing something to test might not be easy. In such a case, it's fruitful to write your first test the next time you make a change, either when you add a new feature or fix a bug.
es: A veces es difícil saber por dónde empezar con la escritura de pruebas. Si usted ha escrito varias miles de líneas de Python, elegir algo para probar podría no ser fácil. En tal caso, es provechoso escribir su primera prueba la próxima vez que realice una modificación, ya sea cuando agregue una nueva característica o soluciona un error.
pt_br: Às vezes é difícil saber por onde devemos começar a escrever testes. Se você tiver escrito milhares de linhas em Python, escolher algo para testar pode não ser fácil. Nesse caso, é interessante escrever seu primeiro teste na próxima vez que você fizer alguma alteração, seja a adição de uma nova função ou correção de um bug.

source: So let's do that right away.
es: Así que vamos a hacer eso de inmediato.
pt_br: Então vamos fazer isso a partir de agora.

source: Writing our first test
es: Escribiendo nuestra primera prueba
pt_br: Escrevendo nosso primeiro teste

source: We identify a bug
es: Identificamos un error
pt_br: Nós identificamos um bug

source: Fortunately, there's a little bug in the ``polls`` application for us to fix right away: the ``Question.was_published_recently()`` method returns ``True`` if the ``Question`` was published within the last day (which is correct) but also if the ``Question``’s ``pub_date`` field is in the future (which certainly isn't).
es: Afortunadamente, hay un pequeño error en la aplicación ``encuestas`` para que lo solucionemos de inmediato: el método`` Question.was_published_recently () `` devuelve ``True`` si la ``Pregunta`` fue publicada en el último día (que es correcto), pero también si "el campo de la "fecha de publicación" de la "Pregunta" está en el futuro (que por cierto no lo está).
pt_br: Felizmente, há um pequeno bug na aplicação ``polls`` para corrigirmos imediatamente: O método ``Question.was_published_recently()`` retorna ``True`` se a ``Question`` foi publicada dentro do último dia (o que está correto), mas também se o campo ``pub_date`` de ``Question`` está no futuro (o que certamente não é o caso).

source: To check if the bug really exists, using the Admin create a question whose date lies in the future and check the method using the :djadmin:`shell`::
es: Para comprobar si realmente existe el bug, cree una pregunta cuya fecha se encuentre en el futuro utilizando el sitio administrativo y compruebe el método utilizando la: djadmin: `consola` ::
pt_br: Para checar se o bug realmente existe, usando o Admin crie uma enquete na qual a data encontra-se no futuro e verifique o método através do :djadmin:`shell`::

source: Since things in the future are not 'recent', this is clearly wrong.
es: Puesto que las cosas en el futuro no son 'recientes', esto es claramente erróneo.
pt_br: Desde coisas no futuro não são 'recent', é claramente um erro.

source: Create a test to expose the bug
es: Cree una prueba para mostar el error
pt_br: Criar um teste para expor um bug

source: What we've just done in the :djadmin:`shell` to test for the problem is exactly what we can do in an automated test, so let's turn that into an automated test.
es: Lo que acabamos de hacer en la: djadmin: `consola` para detectar el problema es exactamente lo que podemos hacer en una prueba automatizada, así que vamos a convertir eso en una prueba automatizada.
pt_br: O que nós fizemos no :djadmin:`shell` para testar o problema é exatamente o que podemos fazer em um teste automatizado, então vamos voltar para o teste automatizado
