Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: A conventional place for an application's tests is in the application's ``tests.py`` file; the testing system will automatically find tests in any file whose name begins with ``test``.
es: Un lugar convencional para las pruebas de una aplicación se encuentra en el archivo ``tests.py`` de la aplicación; el sistema de pruebas encontrará automáticamente las pruebas en cualquier archivo cuyo nombre comience con `` test``.
pt_br: Um lugar convencional para os testes da aplicação é o arquivo ``tests.py``; o sistema de testes irá encontrar automaticamente todos os testes que estiverem em qualquer arquivo cujo o nome comece com ``test``.

source: Put the following in the ``tests.py`` file in the ``polls`` application:
es: Ponga lo siguiente en el archivo`` tests.py`` de la aplicación "encuestas":
pt_br: Coloque o seguinte código no arquivo ``tests.py`` na aplicação ``polls``:

source: What we have done here is created a :class:`django.test.TestCase` subclass with a method that creates a ``Question`` instance with a ``pub_date`` in the future. We then check the output of ``was_published_recently()`` - which *ought* to be False.
es: Lo que hemos hecho aquí es crear una: clase: `django.test.TestCase` subclase con un método que crea una instancia de ``Prueba`` con una "fecha de publicación" en el futuro. A continuación, comprobamos la salida de ``was_published_recently () `` que debe ser falsa.
pt_br: O que nós fizemos aqui foi ter criado uma subclasse :class:`django.test.TestCase` com o método que cria uma instância de ``Question`` with ``pub_date`` no futuro. Nós então vamos checar a saida de ``was_published_recently()`` - o quel deve ser ``False``.

source: Running tests
es: Ejecutando las pruebas
pt_br: Executando o teste

source: In the terminal, we can run our test::
es: Podemos ejecutar nuestra prueba en la terminal::
pt_br: No terminal, nós podemos executar nosso test::

source: and you'll see something like::
es: y usted verá algo como ::
pt_br: E você verá algo como:

source: What happened is this:
es: Esto es lo que ocurrió:
pt_br: O que ocorreu foi o seguinte:

source: ``python manage.py test polls`` looked for tests in the ``polls`` application
es: ``python manage.py test polls`` buscó las pruebas en la aplicación "encuestas"
pt_br: ``python manage.py test polls`` procurou por testes na aplicação ``polls``

source: it found a subclass of the :class:`django.test.TestCase` class
es: encontró una subclase de la: clase: clase `django.test.TestCase`
pt_br: ele encontrou uma subclass da classe :class:`django.test.TestCase`

source: it created a special database for the purpose of testing
es: creó una base de datos especial para las pruebas
pt_br: ele cria um banco de dados especial com o propósito de teste

source: it looked for test methods - ones whose names begin with ``test``
es: buscó métodos de prueba; aquellos cuyos nombres comienzan con `` test``
pt_br: ele procurou por métodos de test - aquele cujo nome começam com ``test``

source: in ``test_was_published_recently_with_future_question`` it created a ``Question`` instance whose ``pub_date`` field is 30 days in the future
es: En ``test_was_published_recently_with_future_question`` creó una instancia "pregunta" cuyo campo de "fecha de publicación" está 30 días en el futuro
pt_br: em ``test_was_published_recently_with_future_question`` é criado uma instância de ``Question`` na qual o campo ``pub_date`` está 30 dias no futuro

source: ... and using the ``assertEqual()`` method, it discovered that its ``was_published_recently()`` returns ``True``, though we wanted it to return ``False``
es: ... y utilizando el método ``assertEqual ()``, descubrió que su ``was_published_recently ()`` devuelve ``True``, aunque queríamos que devolviera `` False``
pt_br: .. e utilizando o método "assertEqual()" descobrimos que "was_published_recently()" retorna "True", mas queremos que retorne "False"

source: The test informs us which test failed and even the line on which the failure occurred.
es: La prueba nos informa que prueba falló e incluso la línea en la que se produjo el error.
pt_br: O teste nos informa que teste falhou e até mesmo a linha na qual a falha ocorreu.

source: Fixing the bug
es: Solucionando el bug
pt_br: Corrigindo o erro

source: We already know what the problem is: ``Question.was_published_recently()`` should return ``False`` if its ``pub_date`` is in the future. Amend the method in ``models.py``, so that it will only return ``True`` if the date is also in the past:
es: Ya sabemos cuál es el problema: `` Question.was_published_recently () `` debe devolver ``False`` si su ``fecha de publicación`` está en el futuro. Corrija el método `` models.py``, de modo que este sólo devolverá ``True`` si la fecha está también en el pasado:
pt_br: Nós sabemos onde o problema está. "Question.was_published_recently()" deveria retornar "False" se "pub_date" está no futuro. Emende o método no "models.py", dessa forma ele só retornará "True" se a data também estiver no passado:

source: and run the test again::
es: y ejecute la prueba de nuevo::
pt_br: execute e teste novamente

source: After identifying a bug, we wrote a test that exposes it and corrected the bug in the code so our test passes.
es: Después de identificar un bug, escribimos una prueba que lo muestra y corrije el bug en el código para que nuestra prueba pase.
pt_br: Depois de identificar um erro, nós escrevemos um teste que demonstra e corrige o erro no código, então o nosso teste passa.

source: Many other things might go wrong with our application in the future, but we can be sure that we won't inadvertently reintroduce this bug, because simply running the test will warn us immediately. We can consider this little portion of the application pinned down safely forever.
es: Muchas otras cosas pueden salir mal con nuestra aplicación en el futuro, pero podemos estar seguros de que no vamos a reintroducir este bug por descuido porque simplemente ejecutar la prueba nos avisará inmediatamente. Podemos considerar que esta pequeña parte de la aplicación está identificada con exactitud de forma segura para siempre.
pt_br: Muitas outras coisas podem dar errado com a nossa aplicação no futuro, mas você pode ter certeza que não vamos reintroduzir este bug inadivertidamente, porque simplesmente rodando os testes já receberemos o aviso imediatamente. Nós podemos considerar que esta pequena parte da aplicação está a salvo para sempre

source: More comprehensive tests
es: Pruebas más exhaustivas
pt_br: Testes mais abrangentes

source: While we're here, we can further pin down the ``was_published_recently()`` method; in fact, it would be positively embarrassing if in fixing one bug we had introduced another.
es: Ya que estamos aquí, podemos además precisar el método ``was_published_recently()``; de hecho, sería verdaderamente vergonzoso si al corregir un bug hubiéramos introducido otro.
pt_br: Enquanto estamos aqui, nós podemos nos aprofundar no método ``was_published_recently()``; De fato, seria certamente embaraçoso introduzir um novo bug enquanto arruma outro.

source: Add two more test methods to the same class, to test the behavior of the method more comprehensively:
es: Agregue dos métodos de pruebas más a la misma clase, para probar el comportamiento del método de forma más completa:
pt_br: Adicione mais dois métodos de teste na mesma classe, para testá-la melhor.

source: And now we have three tests that confirm that ``Question.was_published_recently()`` returns sensible values for past, recent, and future questions.
es: Y ahora tenemos tres pruebas que confirman que ``Question.was_published_recently()`` devuelve valores razonables para preguntas pasadas, recientes y futuras.
pt_br: E agora nós temos 3 testes que confirmam que ``Question.was_published_recently()`` retorna valores sensíveis de perguntas do passado, recente e futuro.

source: Again, ``polls`` is a simple application, but however complex it grows in the future and whatever other code it interacts with, we now have some guarantee that the method we have written tests for will behave in expected ways.
es: Una vez más, ``encuestas`` es una aplicación sencilla, pero por muy compleja que se vuelva en el futuro y de que interactúe con cualquier otro código , ahora tenemos alguna garantía de que el método para el cual hemos escrito las pruebas se comportará de la manera esperada.
pt_br: De novo, ``polls`` é uma simples aplicação, mas independente de quão complexa ela se torne no futuro e qualquer outro código que venha a interagir com ela, nós agora temos alguma garantia que o método que nós escrevemos com testes vão se comportar de maneira esperada.

source: Test a view
es: Pruebe una vista
pt_br: Teste a View

source: The polls application is fairly undiscriminating: it will publish any question, including ones whose ``pub_date`` field lies in the future. We should improve this. Setting a ``pub_date`` in the future should mean that the Question is published at that moment, but invisible until then.
es: La aplicación encuestas es bastante aleatoria: publicará cualquier pregunta, incluyendo aquellas cuyo campo de ``pub_date`` está en el futuro. Debemos mejorar esto. Establecer un ``pub_date`` en el futuro debería significar que la pregunta se publica en ese momento, pero que será invisible hasta entonces.
pt_br: A aplicação de enquete é bastante indiscriminatória: irá publicar qualquer questão, incluindo aquelas que o campo ``pub_date`` está no futuro. Devemos melhorar isso. Definindo um ``pub_date`` no futuro deveria fazer com que a Question seja publicada naquele momento, mas que esteja invisível até lá.

source: A test for a view
es: Una prueba para una vista
pt_br: Um teste para uma view

source: When we fixed the bug above, we wrote the test first and then the code to fix it. In fact that was a simple example of test-driven development, but it doesn't really matter in which order we do the work.
es: Cuando corregimos el bug anterior, escribimos primero la prueba y luego el código para corregirlo. De hecho ese fue un simple ejemplo de desarrollo basado en pruebas, pero en realidad no importa en qué orden hacemos el trabajo.
pt_br: Quando arrumamos o bug acima, escrevemos primeiro o teste e depois o código que o concerta. Defato aquilo foi um exemplo de desenvolvimento guiado por teste, mas não faz diferença a a ordem que fazemos o trabalho.

source: In our first test, we focused closely on the internal behavior of the code. For this test, we want to check its behavior as it would be experienced by a user through a web browser.
es: En nuestra primera prueba, nos centramos detalladamente en el comportamiento interno del código. Para esta prueba, queremos comprobar su comportamiento como lo experimentaría un usuario a través de un navegador web.
pt_br: Em nosso primeiro teste, focamos no comportamento interno do código. Para este teste, nós queremos checar seu comportamento como seria experienciado por um usuário através de um navegador web.

source: Before we try to fix anything, let's have a look at the tools at our disposal.
es: Antes de tratar de corregir algo, echemos un vistazo a las herramientas a nuestra disposición.
pt_br: Antes de tentarmos consertar alguma coisa, vamos dar uma olhada nas ferramentas à nossa disposição.

source: The Django test client
es: El cliente de prueba de Django
pt_br: O cliente de testes do Django

source: Django provides a test :class:`~django.test.Client` to simulate a user interacting with the code at the view level. We can use it in ``tests.py`` or even in the :djadmin:`shell`.
es: Django proporciona una prueba: clase: `~ django.test.Client` para simular un usuario interactúando con el código al nivel de la vista. Podemos utilizarlo en `` tests.py`` o incluso en la: djadmin: `consola`.
pt_br: o Django fornece um test :class:`~django.test.Client` para simular um usuário interagindo com o código no nível de view. POdemos usá-lo em ``tests.py`` ou memso no :djadmin:`shell`.

source: We will start again with the :djadmin:`shell`, where we need to do a couple of things that won't be necessary in ``tests.py``. The first is to set up the test environment in the :djadmin:`shell`::
es: Vamos a arrancar de nuevo con la: djadmin: `consola`, donde tenemos que hacer un par de cosas que no serán necesarias en` `tests.py``. La primera es configurar el entorno de prueba en la: djadmin: `consola` ::
pt_br: Começaremos denovo com o :djadmin:`shell`, onde faremos alumas coisas que não seriam necessárias no ``test.py``. A primeira é definir o ambiente de teste no :django:`shell`::

source: :meth:`~django.test.utils.setup_test_environment` installs a template renderer which will allow us to examine some additional attributes on responses such as ``response.context`` that otherwise wouldn't be available. Note that this method *does not* setup a test database, so the following will be run against the existing database and the output may differ slightly depending on what questions you already created.
es: :método:`~django.test.utils.setup_test_environment` instala un representador de plantillas que nos permitirá examinar algunos atributos adicionales sobre las respuestas como ``response.context`` que por otro lado no estarían disponibles. Tenga en cuenta que este método no crea una base de datos de pruebas, por lo que lo siguiente se ejecutará con la base de datos existente y la salida puede variar dependiendo de cuáles preguntas usted ya creó.
pt_br: O :meth:`~django.test.utils.setup_test_environment` instala um processador de templates o qual nos habilita a examinar alguns atributos adicionais na respostas tal como ``response.context`` que de outra maneira não estaria disponível. Note que este método *não* define um banco de dados de teste, então ele irá rodar sobre o banco de dados existente e a saida talvez seja diferente dependendo das questões que você já criou.

source: Next we need to import the test client class (later in ``tests.py`` we will use the :class:`django.test.TestCase` class, which comes with its own client, so this won't be required)::
es: A continuación tenemos que importar la clase de cliente de prueba (más tarde en `` tests.py`` usaremos la: clase: clase `django.test.TestCase` que viene con su propio cliente, por lo que esto no será necesario)::
pt_br: A diante precisamos importar a classe cliente de teste (depois iremos usar a classe :class:`django.test.TestCase` no ``tests.py``, a qual traz seu próprio cliente, então isso não será necessário)::

source: With that ready, we can ask the client to do some work for us::
es: Con eso listo, podemos pedirle al cliente que haga un trabajo para nosotros ::
pt_br: Com isso pronto, podemos pedir que o cliente faça algum trabalho para a gente::

source: Improving our view
es: Mejorando nuestra vista
pt_br: Melhorando a nossa view

source: The list of polls shows polls that aren't published yet (i.e. those that have a ``pub_date`` in the future). Let's fix that.
es: La lista de encuestas muestra las encuestas que no están aún publicadas (es decir, aquellos que tienen una ``pub_date`` en el futuro). Vamos a solucionar eso.
pt_br: A lista de enquete mostra enquetes que não estão publicadas ainda (isto é aqueles que tem um ``pub_date``no futuro). Vamos concertar isso.

source: In :doc:`Tutorial 4 </intro/tutorial04>` we introduced a class-based view, based on :class:`~django.views.generic.list.ListView`:
es: En el : doc: `Tutorial 4 </intro/tutorial04> ` presentamos una vista basada en clase, en base a: clase:` ~ django.views.generic.list.ListView`:
pt_br: No :doc:`Tutorial 4 </intro/tutorial04>` nós introduzimos o class-based views, baseado no :class:`~django.views.generic.list.ListView`:

source: We need to amend the ``get_queryset()`` method and change it so that it also checks the date by comparing it with ``timezone.now()``. First we need to add an import:
es: Tenemos que modificar el método ``get_queryset()`` y cambiarlo para que también compruebe la fecha comparándolo con `` timezone.now () ``. En primer lugar tenemos que añadir un import:
pt_br: Precisamos fazer uma adição no método ``get_queryset()`` e alterá-lo de modo que ele verifique também a data comparando com ``timezone.now()``. Antes precisamos adicionar uma importação:

source: and then we must amend the ``get_queryset`` method like so:
es: y luego hay que modificar el método ``get_queryset`` como sigue:
pt_br: e então devemos fazer uma adição ao método ``get_queryset`` como a seguir:

source: ``Question.objects.filter(pub_date__lte=timezone.now())`` returns a queryset containing ``Question``\s whose ``pub_date`` is less than or equal to - that is, earlier than or equal to - ``timezone.now``.
es: `` Question.objects.filter (pub_date__lte = timezone.now ()) `` devuelve un queryset que contiene `` Question``\s cuya `` pub_date`` es menor o igual a, es decir, anterior o igual a ``timezone.now``.
pt_br: ``Question.objects.filter(pub_date__lte=timezone.now())`` retorna um queryset contendo ``Question``\s cujo o ``pub_date`` é menor ou igual a - que quer dizer, anterior ou igual a - ``timezone.now``.

source: Testing our new view
es: Probando nuestra nueva vista
pt_br: Testando nossa nova view

source: Now you can satisfy yourself that this behaves as expected by firing up the runserver, loading the site in your browser, creating ``Questions`` with dates in the past and future, and checking that only those that have been published are listed. You don't want to have to do that *every single time you make any change that might affect this* - so let's also create a test, based on our :djadmin:`shell` session above.
es: Ahora puede asegurarse de que este se comporta como se esperaba ejecutando el runserver, cargando el sitio en su buscador, creando "Preguntas" con fechas en el pasado y el futuro y comprobando que se muestran solo aquéllas que han sido publicadas. Usted no quiere tener que hacer esto cada vez que usted realice algún cambio que pueda afectar esta, por lo que también vamos a crear una prueba, basada en nuestra sesión de consola anterior.
pt_br: Agora pode ficar satisfeito que isso se comporta como esperado disparando o "runserver", carregando no seu browser, criando ``Questions`` com datas no passado e no futuro, e verificando que somente aqueles que foram publicados são listados. Você não quer fazer isso *toda vez que fizer uma alteração que talvez afete isso* - então vamos criar um teste, baseado na sessão :djadmin:`shell` acima.

source: Add the following to ``polls/tests.py``:
es: Agregue lo siguiente a ``polls/ tests.py``:
pt_br: Adicione o seguinte a "polls/tests.py":

source: and we'll create a shortcut function to create questions as well as a new test class:
es: y vamos a crear una función de atajo para crear preguntas, así como una nueva clase de prueba:
pt_br: e nós vamos criar uma função de atalho para criar perguntas assim como uma nova classe de teste:

source: Let's look at some of these more closely.
es: Veamos algunas de estas más de cerca.
pt_br: Vejamos algumas delas mais de perto.

source: First is a question shortcut function, ``create_question``, to take some repetition out of the process of creating questions.
es: En primer lugar es una función de atajo a las preguntas, `` crear_pregunta``, para eliminar alguna repetición del proceso de creación de preguntas.
pt_br: O primeiro é uma função de atalho para questão, ``create_question``, para retirar algumas repetições do processo de criar questões.

source: ``test_index_view_with_no_questions`` doesn't create any questions, but checks the message: "No polls are available." and verifies the ``latest_question_list`` is empty. Note that the :class:`django.test.TestCase` class provides some additional assertion methods. In these examples, we use :meth:`~django.test.SimpleTestCase.assertContains()` and :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()`.
es: `` test_index_view_with_no_questions`` no crea alguna pregunta, pero comprueba el mensaje: "No hay encuestas disponibles." Además, verifica que la `` latest_question_list`` esté vacía. Tenga en cuenta que la: clase:clase `django.test.TestCase` ofrece algunos métodos de afirmación adicionales. En estos ejemplos, utilizamos: método: `~ django.test.SimpleTestCase.assertContains ()` y: método: `~ django.test.TransactionTestCase.assertQuerysetEqual ()`.
pt_br: ``test_index_view_with_no_questions`` não cria nenhuma questão, mas verifica a menssagem: "No polls are available." e verifica se a ``latest_question_list`` está vazia. Note que a classe :class:`django.test.TestCase` fornece algunns métodos adicionais de afirmação. Neste exemplo, nós usamos o :meth:`~django.test.SimpleTestCase.assertContains()` e :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()`.

source: In ``test_index_view_with_a_past_question``, we create a question and verify that it appears in the list.
es: En `` test_index_view_with_a_past_question``, creamos una pregunta y verificamos que aparezca en la lista.
pt_br: Em "test_index_view_with_a_past_question", nós criamos uma pergunta e verificamos que ela aparece na lista.

source: In ``test_index_view_with_a_future_question``, we create a question with a ``pub_date`` in the future. The database is reset for each test method, so the first question is no longer there, and so again the index shouldn't have any questions in it.
es: En `` test_index_view_with_a_future_question``, creamos una pregunta con una ``pub_date`` en el futuro. La base de datos se reinicia para cada método de prueba, por lo que la primera pregunta ya no está allí, de modo que de nuevo el índice no debería tener alguna pregunta.
pt_br: No ``test_index_view_with_a_future_question``, nós criamos uma questão com o ``pub_date`` no futuro. O banco de dados é redefinido para cada método de teste, então a primeira questão não está mais lá, e também o índice não deve ter nenhuma questão nele.

source: And so on. In effect, we are using the tests to tell a story of admin input and user experience on the site, and checking that at every state and for every new change in the state of the system, the expected results are published.
es: Y así sucesivamente. En efecto, estamos utilizando las pruebas para contar la historia de la entrada del sitio administrativo y la experiencia del usuario en el sitio, y comprobar que los resultados esperados se publican en cada estado y para cada nuevo cambio en el estado del sistema.
pt_br: E assim por diante. Defato, estamos usando os testes para contar uma história da entrada do admin e da experiencia do usuário no site, e verificando se para cada estado e para cada nova alteração no estado do sistema, o resultado esperado é publicado

source: Testing the ``DetailView``
es: Probando la "Vista detallada"
pt_br: Testando o ``DetailView``

source: What we have works well; however, even though future questions don't appear in the *index*, users can still reach them if they know or guess the right URL. So we need to add a similar constraint to ``DetailView``:
es: Lo que tenemos funciona bien; sin embargo, a pesar de que las preguntas futuras no aparecen en el índice, los usuarios pueden todavía llegar a ellas si saben o adivinan la dirección URL correcta. Así que tenemos que agregar una restricción similar a la `` Vista detallada``:
pt_br: O que temos funciona bem; Porém, mesmo quando questões futuras não aparecem no * index*, os usuários ainda podem acessá-las se eles conhecem ou adivinham a URL correta. Então precisamos adicionar uma regra similar ao ``DetailView``:
