Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: :attr:`request.POST <django.http.HttpRequest.POST>` is a dictionary-like object that lets you access submitted data by key name. In this case, ``request.POST['choice']`` returns the ID of the selected choice, as a string. :attr:`request.POST <django.http.HttpRequest.POST>` values are always strings.
es: : attr: `request.POST <django.http.HttpRequest.POST> `Es un objeto similar a un diccionario que le permite acceder a los datos presentados por el nombre clave. En este caso, `` request.POST ['elección'] `` devuelve la ID de la elección seleccionada como una cadena. : attr: Los valores `request.POST <django.http.HttpRequest.POST> ` son siempre cadenas.
pt_br: :attr:`request.POST <django.http.HttpRequest.POST>` é um objeto como dicionários que lhe permite acessar os dados submetidos pelos seus nomes chaves. Neste caso, ``request.POST['choice']`` retorna o ID da opção selecionada, como uma string. Os valores de :attr:`request.POST <django.http.HttpRequest.POST>` são sempre strings.

source: Note that Django also provides :attr:`request.GET <django.http.HttpRequest.GET>` for accessing GET data in the same way -- but we're explicitly using :attr:`request.POST <django.http.HttpRequest.POST>` in our code, to ensure that data is only altered via a POST call.
es: Tenga en cuenta que Django también proporciona: attr: `request.GET <django.http.HttpRequest.GET> ` para acceder a datos GET de la misma manera - pero estamos usando de manera explícita: attr:` request.POST <django.http.HttpRequest.POST> ` en nuestro código, para garantizar que los datos sólo se modifican a través de una llamada POST.
pt_br: Note que Django também fornece :attr:`request.GET <django.http.HttpRequest.GET>` para acesar dados GET da mesma forma -- mas nós estamos usando attr:`request.POST <django.http.HttpRequest.POST>` explicitamente no nosso código, para garantir que os dados só podem ser alterados por meio de uma chamada POST.

source: ``request.POST['choice']`` will raise :exc:`KeyError` if ``choice`` wasn't provided in POST data. The above code checks for :exc:`KeyError` and redisplays the question form with an error message if ``choice`` isn't given.
es: ``request.POST['choice']`` lanzará una :excepción: `KeyError` si la "elección” no fue proporcionada en los datos POST. El código anterior busca y muestra de nuevo el formulario de pregunta con un mensaje de error si no aparece la "elección".
pt_br: ``request.POST['choice']`` irá levantar a exceção :exc:`KeyError` caso uma ``choice`` não seja fornecida via dados POST. O código acima checa por :exc:`KeyError` e re-exibe o formulário da enquete com as mensagens de erro se uma ``choice`` não for fornecida.

source: After incrementing the choice count, the code returns an :class:`~django.http.HttpResponseRedirect` rather than a normal :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` takes a single argument: the URL to which the user will be redirected (see the following point for how we construct the URL in this case).
es: Después de incrementar el conteo de la elección, el código devuelve una :clase: `~django.http.HttpResponseRedirect` en lugar de una :clase: `~django.http.HttpResponse` normal. :clase: `~django.http.HttpResponseRedirect` toma un único argumento: La URL a la que el usuario será redirigido (vea el siguiente aspecto de cómo construimos la URL en este caso).
pt_br: Após incrementar uma opção, o código retorna um class:`~django.http.HttpResponseRedirect` em vez de um normal :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect`` recebe um único argumento: a URL para o qual o usuário será redirecionado (veja o ponto seguinte para saber como construímos a URL, neste caso).

source: As the Python comment above points out, you should always return an :class:`~django.http.HttpResponseRedirect` after successfully dealing with POST data. This tip isn't specific to Django; it's just good Web development practice.
es: Como señala el comentario Python anteriormente, usted siempre debe devolver una: clase: `~django.http.HttpResponseRedirect` después de gestionar exitosamente los datos POST. Esta sugerencia no es solo para Django, es solo una buena práctica de desarrollo Web.
pt_br: Como o comentário Python acima salienta, você deve sempre retornar uma :class:`~django.http.HttpResponseRedirect` depois de lidar com sucesso com dados POST. Esta dica não é específica do Django; mais sim uma boa prática para o desenvolvimento Web.

source: We are using the :func:`~django.core.urlresolvers.reverse` function in the :class:`~django.http.HttpResponseRedirect` constructor in this example. This function helps avoid having to hardcode a URL in the view function. It is given the name of the view that we want to pass control to and the variable portion of the URL pattern that points to that view. In this case, using the URLconf we set up in :doc:`Tutorial 3 </intro/tutorial03>`, this :func:`~django.core.urlresolvers.reverse` call will return a string like ::
es: Estamos utilizando la : func: `~ django.core.urlresolvers.reverse` función en el: clase: constructor` ~ django.http.HttpResponseRedirect` en este ejemplo. Esta función ayuda a evitar tener que codificar una URL en la función de vista. Se proporciona el nombre de la vista a la queremos pasar el control y la parte variable del patrón URL que señala esa vista. En este caso, utilizando la URLconf que configuramos en el : doc: `Tutorial 3 </intro/tutorial03> `, esta: func:` ~django.core.urlresolvers.reverse` llamada devolverá una cadena como ::
pt_br: Estamos usando, neste exemplo, a função :func:`~django.core.urlresolvers.reverse` no construtor da classe :class:`~django.http.HttpResponseRedirect`. Essa função ajuda a evitar escrevermos a URL na função da view. O nome da view a qual queremos passar o controle e a porção variável do pattern da URL que aponta para essa view são informados. Neste caso, usando o URLConf, criado no :doc:`Tutorial 3 </intro/tutorial03>`, esta chamada a :func:`~django.core.urlresolvers.reverse` irá retornar uma string como:

source: where the ``3`` is the value of ``question.id``. This redirected URL will then call the ``'results'`` view to display the final page.
es: donde el `` 3`` es el valor de `` question.id``. Esta URL redirigida entonces llamará a la vista " ' resultados'" para mostrar la página final.
pt_br: onde o ``3`` é o valor para ``question.id``. Esta URL redirecionada irá então chamar a view ``'results'`` para exibir a página final.

source: As mentioned in :doc:`Tutorial 3 </intro/tutorial03>`, ``request`` is an :class:`~django.http.HttpRequest` object. For more on :class:`~django.http.HttpRequest` objects, see the :doc:`request and response documentation </ref/request-response>`.
es: Como se mencionó en el: doc: `Tutorial 3 </intro/tutorial03> ``petición``` es: clase:`~django.http.HttpRequest` un objeto. Para más información sobre: ​​clase:`~django.http.HttpRequest` objetos, consulte el: doc:` documentación de petición y respuesta </ref/request-response> `.
pt_br: Como mencionado no :doc:`Tutorial 3 </intro/tutorial03>`, ``request`` é um objeto :class:`~django.http.HttpRequest` object. Para mais informações sobre objetos :class:`~django.http.HttpRequest`, veja :doc:`request and response documentation </ref/request-response>`.

source: After somebody votes in a question, the ``vote()`` view redirects to the results page for the question. Let's write that view:
es: Después de que alguien vota en una pregunta, la vista "votar()" remite a la página de resultados de la pregunta. Vamos a escribir dicha vista:
pt_br: Depois que alguém votar em uma enquete, a view ``vote()`` redireciona para a página de resultados da enquete. Vamos escrever essa view:

source: This is almost exactly the same as the ``detail()`` view from :doc:`Tutorial 3 </intro/tutorial03>`. The only difference is the template name. We'll fix this redundancy later.
es: Esto es casi exactamente lo mismo que la vista "detalle()" del: doc:`Tutorial 3 </intro/tutorial03>`. La única diferencia es el nombre de la plantilla. Solucionaremos esta redundancia más tarde.
pt_br: Isto é quase exatamente o mesmo que a view ``detail()`` do :doc:`Tutorial 3 <intro/tutorial03>`. A única diferença é o nome do template. Iremos corrigir esta redundância depois.

source: Now, create a ``polls/results.html`` template:
es: Ahora, cree una plantilla ``polls/results.html``:
pt_br: Agora, crie o template ``polls/results.html``:

source: Now, go to ``/polls/1/`` in your browser and vote in the question. You should see a results page that gets updated each time you vote. If you submit the form without having chosen a choice, you should see the error message.
es: A continuación, vaya a ``/polls/1/`` en su navegador y vote en la pregunta. Debería ver una página de resultados que se actualiza cada vez que usted vota. Si usted envía el formulario sin haber seleccionado una opción, usted debería ver el mensaje de error.
pt_br: Agora, vá para ``/polls/1/`` no seu navegador e vote em uma enquete. Você deverá ver uma página de resultados que será atualizado cada vez que você votar. Se você enviar o formulário sem ter escolhido uma opção, você deverá ver a mensagem de erro.

source: The code for our ``vote()`` view does have a small problem. It first gets the ``selected_choice`` object from the database, then computes the new value of ``votes``, and then saves it back to the database. If two users of your website try to vote at *exactly the same time*, this might go wrong: The same value, let's say 42, will be retrieved for ``votes``. Then, for both users the new value of 43 is computed and saved, but 44 would be the expected value.
es: El código para nuestra vista ``votar()`` tiene un pequeño problema. Primero, obtiene el `` objeto "selected_choice`` de la base de datos, luego, calcula el nuevo valor de `` votos``, y después lo guarda de nuevo en la base de datos. Si dos usuarios de su sitio Web intentan votar * exactamente en el mismo momento *, esto podría salir mal: El mismo valor, digamos 42, será recuperado para `` votos``. Entonces, se calcula y se guarda el nuevo valor de 43 para ambos usuarios, pero el 44 sería el valor esperado.
pt_br: O código da nossa view ``vote()`` tem um pequeno problema. Ele primeiro pega o objeto de ``selected_choice`` do banco de dados, calcula o novo valor de ``votes`` e os salva novamente. Se dois usuários do seu site tentarem votar *ao mesmo tempo*: o mesmo valor, digamos 42, será obtido para ``votes``. Então, para ambos usuários, o novo valor 43 é calculado e salvo, quando o valor esperado seria 44.

source: This is called a *race condition*. If you are interested, you can read :ref:`avoiding-race-conditions-using-f` to learn how you can solve this issue.
es: Esto se conoce como una “condición de carrera”. Si usted está interesado, puede leer: referencia: ‘evitar condiciones de carrera usando f’ para aprender cómo solucionar este problema.
pt_br: Isto é chamado de *condição de concorrência*. Se você estiver interessado, pode ler :ref:`avoiding-race-conditions-using-f` para aprender como resolver este problema.

source: Use generic views: Less code is better
es: Utilice vistas genéricas: Menos código es mejor
pt_br: Use views genéricas: Menos código é melhor

source: The ``detail()`` (from :doc:`Tutorial 3 </intro/tutorial03>`) and ``results()`` views are very simple -- and, as mentioned above, redundant. The ``index()`` view, which displays a list of polls, is similar.
es: Las vistas “detalle()” y “resultados()” (del :doc: `Tutorial 3 </intro/tutorial03>`) son muy sencillas y como se mencionó anteriormente, redundantes. La vista “índice()” que muestra una lista de encuestas es similar.
pt_br: As views ``detail()`` (de :doc:`Tutorial 3 </intro/tutorial03>`) e ``results()`` são muito simples -- e, como mencionado acima, redundantes. A view ``index()``, que mostra a lista de votações, é similar.

source: These views represent a common case of basic Web development: getting data from the database according to a parameter passed in the URL, loading a template and returning the rendered template. Because this is so common, Django provides a shortcut, called the "generic views" system.
es: Estas vistas representan un caso común de desarrollo Web básico: obtener datos de la base de datos según un parámetro pasado en la URL, cargar una plantilla y devolver la plantilla creada. Debido a que esto es tan común, Django proporciona un atajo, denominado el sistema de “vistas genéricas”.
pt_br: Estas views representam um caso comum do desenvolvimento Web básico: obter dados do banco de dados de acordo com um parâmetro passado na URL, carregar um template e devolvê-lo renderizado. Por isto ser muito comum, o Django fornece um atalho, chamado sistema de "views genéricas".

source: Generic views abstract common patterns to the point where you don't even need to write Python code to write an app.
es: Las vistas genéricas sintetizan los patrones comunes hasta el punto en que ni siquiera es necesario escribir código Python para escribir una aplicación.
pt_br: Views genéricas abstraem padrões comuns para um ponto onde você nem precisa escrever código Python para escrever uma aplicação.

source: Let's convert our poll app to use the generic views system, so we can delete a bunch of our own code. We'll just have to take a few steps to make the conversion. We will:
es: Vamos a convertir nuestra aplicación encuesta para utilizar el sistema de vistas genéricas, por lo que podemos eliminar mucho de nuestro propio código. Solo tendremos que seguir algunos pasos para hacer la conversión. Vamos a:
pt_br: Vamos converter a nossa aplicação de enquete para utilizar o sistema de views genéricas, por isso podemos excluir um monte do nosso próprio código. Iremos apenas ter que executar alguns passos para fazer a conversão. Nós iremos:

source: Convert the URLconf.
es: Convertir la URLconf.
pt_br: Converta o URLconf.

source: Delete some of the old, unneeded views.
es: Eliminar algunas de las vistas viejas e innecesarias.
pt_br: Delete algumas das views antigas, desnecessárias.

source: Introduce new views based on Django's generic views.
es: Introducir nuevas vistas basadas en las vistas genéricas de Django.
pt_br: Introduz novas views baseadas em views genéricas Django's.

source: Read on for details.
es: Siga leyendo para conocer más detalles.
pt_br: Leia para obter mais detalhes.

source: Why the code-shuffle?
es: ¿Por qué el número aleatorio?
pt_br: Por que o código ficou embarralhado?

source: Generally, when writing a Django app, you'll evaluate whether generic views are a good fit for your problem, and you'll use them from the beginning, rather than refactoring your code halfway through. But this tutorial intentionally has focused on writing the views "the hard way" until now, to focus on core concepts.
es: Generalmente, cuando se escribe una aplicación de Django, usted podrá evaluar si las vistas genéricas son una buena opción para su problema, y ​​las utilizará desde el principio, en lugar de reestructurar su código a medio camino. Sin embargo, este tutorial intencionadamente se ha centrado hasta ahora en escribir las vistas "de la manera difícil", para centrarse en los conceptos esenciales.
pt_br: Geralmente, quando estiver escrevendo uma aplicação Django, você vai avaliar se views genéricas são uma escolha adequada para o seu problema e você irá utilizá-las desde o início em vez de refatorar seu código no meio do caminho. Mas este tutorial intencionalmente tem focado em escrever views "do jeito mais difícil" até agora, para concentrarmos nos conceitos fundamentais.

source: You should know basic math before you start using a calculator.
es: Debe saber matemáticas básicas antes de comenzar a utilizar una calculadora.
pt_br: Você deve saber matemática básica antes de você começar a usar uma calculadora.

source: Amend URLconf
es: corregir la URLconf
pt_br: Corrija URLconf

source: First, open the ``polls/urls.py`` URLconf and change it like so:
es: Primero, abra la URLconf ``polls/urls.py`` y modifíquela así:
pt_br: Em primeiro lugar, abra a URLconf ``polls/urls.py`` e modifique para ficar assim:

source: Note that the name of the matched pattern in the regexes of the second and third patterns has changed from ``<question_id>`` to ``<pk>``.
es: Tenga en cuenta que el nombre del patrón coincidente en las expresiones regulares de los patrones segundo y tercero ha cambiado de `` <question_id> `` `` <pk> ``.
pt_br: Note que o nome do padrão correspondente na regexes do segundo e terceiro padrão mudou de ``<question_id>`` para ``<pk>``.

source: Amend views
es: Modificar vistas
pt_br: Views alteradas

source: Next, we're going to remove our old ``index``, ``detail``, and ``results`` views and use Django's generic views instead. To do so, open the ``polls/views.py`` file and change it like so:
es: A continuación, vamos a eliminar nuestras viejas vistas `índice``,` `detalle``` y `` resultados`` y en su lugar vamos a usar las vistas genéricas de Django. Para ello, abra el archivo ``polls/views.py`` y modifíquelo así:
pt_br: Em seguida, vamos remover a nossas velhas views ``index``, `` detail``, e ``results`` e usar views genéricas do Django em seu lugar. Para fazer isso, abra o arquivo ``polls/views.py`` e alterar para:

source: We're using two generic views here: :class:`~django.views.generic.list.ListView` and :class:`~django.views.generic.detail.DetailView`. Respectively, those two views abstract the concepts of "display a list of objects" and "display a detail page for a particular type of object."
es: Estamos utilizando dos vistas genéricas aquí: clase:`~django.views.generic.list.ListView` y :clase:`~django.views.generic.detail.DetailView`. Respectivamente, esas dos vistas sintetizan los conceptos de "mostrar una lista de objetos" y "mostrar una página detallada para un tipo específico de objeto".
pt_br: Nós estamos usando duas views genéricas aqui: :class:`~django.views.generic.list.ListView` e :class:`~django.views.generic.detail.DetailView`. Respectivamente, essas duas ``views`` abstraem o conceito de exibir uma lista de objetos e exibir uma página de detalhe para um tipo particular de objeto.

source: Each generic view needs to know what model it will be acting upon. This is provided using the ``model`` attribute.
es: Cada vista genérica tiene que saber cuál es el modelo sobre el que estará actuando. Esto se proporciona utilizando el atributo `` modelo``.
pt_br: Cada view genérica precisa saber qual é o modelo que ela vai agir. Isto é fornecido usando o atributo ``model``.

source: The :class:`~django.views.generic.detail.DetailView` generic view expects the primary key value captured from the URL to be called ``"pk"``, so we've changed ``question_id`` to ``pk`` for the generic views.
es: La: clase: vista genérica`~ django.views.generic.detail.DetailView` espera que el valor de la clave primaria capturado desde la URL sea denominado ` `" pk "` `, por lo que hemos cambiado` `question_id`` a` `pk`` para las vistas genéricas.
pt_br: A view genérica :class:`~django.views.generic.detail.DetailView` espera o valor de chave primaria capturado da URL chamada ``"pk"``, então mudamos ``question_id`` para ``pk`` para as views genérica.

source: By default, the :class:`~django.views.generic.detail.DetailView` generic view uses a template called ``<app name>/<model name>_detail.html``. In our case, it would use the template ``"polls/question_detail.html"``. The ``template_name`` attribute is used to tell Django to use a specific template name instead of the autogenerated default template name. We also specify the ``template_name`` for the ``results`` list view -- this ensures that the results view and the detail view have a different appearance when rendered, even though they're both a :class:`~django.views.generic.detail.DetailView` behind the scenes.
es: Por defecto, la : clase:`~django.views.generic.detail.DetailView` vista genérica utiliza una plantilla llamada “``<app name>/<model name>_detail.html``. En nuestro caso, utilizaría la plantilla ``"polls/question_detail.html"``. El atributo “nombre de plantilla” se utiliza para indicarle a Django que utilice un nombre de plantilla específico en vez del nombre de plantilla autogenerado de forma automática. También especificamos el “nombre de plantilla” para la vista de lista “resultados”; esto garantiza que la vista resultados y la vista detalle tengan un aspecto diferente cuando sean creadas, a pesar de que las dos son una: clase: `~ django .views.generic.detail.DetailView` en segundo plano.
pt_br: Por padrão, a view genérica :class:`~django.views.generic.detail.DetailView` utiliza um template chamado ``<app name>/<model name>_detail.html`. Em nosso caso, ela vai utilizar o template `"polls/question_detail.html"``. O atributo ``template_name`` é usado para indicar ao Django para usar um nome de template em vez de auto gerar uma nome de template. Nós também especificamos ``template_name`` para a view de listagem de ``results`` -- isto garante que a view de detalhe tem uma aparencia quando rederizada, mesmo que sejam tanto um class:`~django.views.generic.detail.DetailView` por trás das cenas.

source: Similarly, the :class:`~django.views.generic.list.ListView` generic view uses a default template called ``<app name>/<model name>_list.html``; we use ``template_name`` to tell :class:`~django.views.generic.list.ListView` to use our existing ``"polls/index.html"`` template.
es: Del mismo modo, la: clase: `~ django.views.generic.list.ListView` vista genérica utiliza una plantilla predeterminada llamada` ` <app name> / <model name> _list.html``; utilizamos ``nombre de plantilla`` para indicarle a : clase: `~ django.views.generic.list.ListView` que utilice nuestra plantilla ``"polls/index.html"`` existente.
pt_br: Semelhantemente, a view genérica :class:`~django.views.generic.list.ListView` utiliza um template chamado ``<app name>/<model name>_list.html``; Nós usamos ``template_name`` para informar :class:`~django.views.generic.list.ListView` para usar nossos templates ``"polls/index.html"``.
