Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: ``{% load staticfiles %}`` loads the :ttag:`{% static %} <staticfiles-static>` template tag from the ``staticfiles`` template library. The ``{% static %}`` template tag generates the absolute URL of the static file.
es: ``{% load staticfiles %}`` carga la :ttag:`{% static %}<staticfiles-static> ` etiqueta de plantilla de la biblioteca de plantillas ``archivos estáticos``. La etiqueta de plantilla ``{% static %}`` genera la URL definitiva del archivo estático.
pt_br: ``{% load staticfiles %}`` carrega o :ttag:`{% static %} <staticfiles-static>` template tag da biblioteca de template ``staticfiles``. O ``{% static %}`` template tag gera as URL absolutas do arquivo estático.

source: That's all you need to do for development. Reload ``http://localhost:8000/polls/`` and you should see that the question links are green (Django style!) which means that your stylesheet was properly loaded.
es: Eso es todo lo que necesita hacer para el desarrollo. Actualice `` http://localhost:8000/polls/`` y usted debería ver que los enlaces de preguntas son de color verde (¡el estilo Django!) lo que significa que su hoja de estilos se cargó correctamente.
pt_br: Isso é tudo que você precisa fazer para o desenvolvimento. Recarregue `http://localhost:8000/polls/`` e você deve ver que os links das questões estão verdes (Django style!) isso significa que seu stylesheet foi corretamente carregado.

source: Adding a background-image
es: Agregando una imagen de fondo
pt_br: Adicionar uma imagem de fundo

source: Next, we'll create a subdirectory for images. Create an ``images`` subdirectory in the ``polls/static/polls/`` directory. Inside this directory, put an image called ``background.gif``. In other words, put your image in ``polls/static/polls/images/background.gif``.
es: A continuación, vamos a crear un subdirectorio para imágenes. Cree un subdirectorio ``imágenes`` en el directorio ``polls/static/polls/``. Dentro de este directorio, ponga una imagen llamada `` background.gif``. En otras palabras, ponga su imagen en ``polls/static/polls/images/background.gif``.
pt_br: Após, nós vamos criar o subdiretório para imagens. Crie um subdiretório ``images`` no diretório ``polls/static/polls``. Dentro deste diretório, coloque uma imagem chamada ``background.gif``. Em outras palavras, coloque sua imagem em ``polls/static/polls/images//background.gif``.

source: Then, add to your stylesheet (``polls/static/polls/style.css``):
es: A continuación, agregue a su hoja de estilo (``polls/static/polls/style.css``):
pt_br: Então, adicione em seu stylesheet (``polls/static/polls/style.css``):

source: Reload ``http://localhost:8000/polls/`` and you should see the background loaded in the bottom right of the screen.
es: Actualice ``http://localhost:8000/polls/`` y usted debería ver el fondo cargado en la parte inferior derecha de la pantalla.
pt_br: Recarregue ``http://localhost:8000/polls/`` e você deve ver o fundo carregado no lado superior direito da tela.

source: Of course the ``{% static %}`` template tag is not available for use in static files like your stylesheet which aren't generated by Django. You should always use **relative paths** to link your static files between each other, because then you can change :setting:`STATIC_URL` (used by the :ttag:`static` template tag to generate its URLs) without having to modify a bunch of paths in your static files as well.
es: Por supuesto, la etiqueta de plantilla ``{% static %}`` no está disponible para su uso en archivos estáticos como su hoja de estilos que no son generadas por Django. Usted siempre debería utilizar rutas relativas para interrelacionar los archivos estáticos entre sí, porque entonces usted puede cambiar la : configuración: `STATIC_URL` (utilizada por la :ttag: la etiqueta de plantilla `estáticos` para generar sus URLs) sin tener tampoco que modificar muchas de las rutas en sus archivos estáticos.
pt_br: Claro que o ``{% static %}`` template tag não está disponível para uso em arquivos estáticos como o seu stylesheet que não são gerados pelo Django. Você deve sempre usar **caminhos relativos** para conectar seus arquivos estáticos entre cada um, porque assim, você pode mudar :setting:`STATIC_URL` (usado pelo :ttag:`static` template tag para gerar as URLs) sem ter que modificar um monte de caminhos em seus arquivos estáticos também.

source: These are the **basics**. For more details on settings and other bits included with the framework see :doc:`the static files howto </howto/static-files/index>` and :doc:`the staticfiles reference </ref/contrib/staticfiles>`. :doc:`Deploying static files </howto/static-files/deployment>` discusses how to use static files on a real server.
es: Estos son los fundamentos. Para más detalles sobre la configuración y otra información que se incluye con el framework consulte el : doc: `Cómo de los archivos estáticos </howto/static-files/index> ` y: doc:` la referencia de los archivos estáticos </ref/contrib/staticfiles> `. : doc: `La implementación de archivos estáticos </howto/static-files/deployment> ` habla sobre cómo utilizar los archivos estáticos en un servidor real.
pt_br: Estes são os **básicos**. Para mais detalhes nas configurações e outras coisas incluídas no framework veja :doc:`o howto arquivos estáticos </howto/static-files/index>`. :doc:`Fazendo deploy de arquivos estáticos </howto/static-files/deployiment>` discute como usar arquivos estáticos em um servidor real.

source: When you're comfortable with the static files, read :doc:`part 7 of this tutorial </intro/tutorial07>` to learn how to customize Django's automatically-generated admin site.
es: Cuando esté familiarizado con los archivos estáticos, lea la: doc: 'parte 7 de este tutorial </intro/tutorial07>` para aprender a personalizar el sitio administrativo generado automáticamente de Django.
pt_br: Quando você estiver confortável com os arquivos estáticos, leia :doc:`parte 7 deste tutorial </intro/tutorial07>` para aprender como customizar o site do admin auto-gerado do Django.

source: Writing your first Django app, part 7
es: Escribiendo su primera aplicación Djando, parte 7
pt_br: Escrevendo seu primeiro app Django, parte 7

source: This tutorial begins where :doc:`Tutorial 6 </intro/tutorial06>` left off. We're continuing the Web-poll application and will focus on customizing the Django's automatically-generated admin site that we first explored in :doc:`Tutorial 2 </intro/tutorial02>`.
es: Este tutorial comienza donde quedó: doc: `Tutorial 6 </intro/tutorial06> `. Continúamos con la aplicación Web encuestas y nos vamos a enfocar en personalizar el sitio administrativo de Django generado automáticamente que estudiamos primero en el: doc: `Tutorial 2 </intro/tutorial02> `.
pt_br: Este tutorial começa onde o :doc:`Tutorial 6 </intro/tutorial06>` parou. Nós vamos continuar a aplicação enquete online e vamos nos focar em customizar o admin automaticamente-gerado do Django que nós exploramos da primeira vez no :doc:`Tutorial 2 </intro/tutorial02>`.

source: Customize the admin form
es: Personalice el formulario del sitio administrativo
pt_br: Personalize o formulário do site de administração

source: By registering the ``Question`` model with ``admin.site.register(Question)``, Django was able to construct a default form representation. Often, you'll want to customize how the admin form looks and works. You'll do this by telling Django the options you want when you register the object.
es: Al registrar el modelo ``Pregunta`` con `admin.site.register (Question)` ``, Django pudo construir una representación del formulario predeterminado. A menudo, usted querrá personalizar la forma en cómo se ve y funciona el formulario del sitio administrativo. Usted hará esto indicándole a Django las opciones que desee cuando registre el objeto.
pt_br: Ao registrarmos o model de ``Question``através da linha ``admin.site.register(Question)``, o Django constrói um formulário padrão para representá-lo. Comumente, você desejará customizar a apresentação e o funcionamento dos formulários do admin do Django. Para isto, você precisará informar ao Django as opções que você quer utilizar ao registrar o seu modelo.

source: Let's see how this works by reordering the fields on the edit form. Replace the ``admin.site.register(Question)`` line with:
es: Veamos cómo funciona esto reordenando los campos en el formulario de edición. Reemplace la línea`` admin.site.register (Question) ``con:
pt_br: Vamos ver como isto funciona reordenando os campos no formulário de edição. Substitua a linha `àdmin.site.register(Question)`` por:

source: You'll follow this pattern -- create a model admin class, then pass it as the second argument to ``admin.site.register()`` -- any time you need to change the admin options for an model.
es: Usted seguirá este patrón cada vez que usted necesite cambiar las opciones del sitio administrativo para un modelo: cree una clase modelo del sitio administrativo y luego, pásela como el segundo argumento a ``admin.site.register ()``.
pt_br: Você vai seguir este padrão -- criar uma classe model admin, então passar ela como um segundo argumento para ``admin.site.register()`` -- a qualquer momento que você precisar modificar as opções de admin para um model.

source: This particular change above makes the "Publication date" come before the "Question" field:
es: Esta modificación concreta citada anteriormente hace que la "fecha de publicación" se anteponga al campo "Pregunta":
pt_br: Essa mudança específica no código acima faz com que a "Publication date" apareça antes do campo "Question":

source: This isn't impressive with only two fields, but for admin forms with dozens of fields, choosing an intuitive order is an important usability detail.
es: Esto no es impresionante con sólo dos campos, pero para los formularios del sitio administrativo con decenas de campos, elegir una orden intuitiva es un detalle importante de usabilidad.
pt_br: Isso não é impressionante com apenas dois campos, mas para formulários com dúzias deles, escolher uma ordem intuitiva é um detalhe importante para a usabilidade.

source: And speaking of forms with dozens of fields, you might want to split the form up into fieldsets:
es: y hablando de formularios con decenas de campos, es posible que desee dividir el formulario en grupos de campos:
pt_br: E por falar em dúzias de campos, você pode querer dividir o formulário em grupos:

source: The first element of each tuple in :attr:`~django.contrib.admin.ModelAdmin.fieldsets` is the title of the fieldset. Here's what our form looks like now:
es: El primer elemento de cada tupla en: atributo: `~ django.contrib.admin.ModelAdmin.fieldsets` es el título del grupo de campos. Así es como se ve el formulario ahora:
pt_br: O primeiro elemento de cada tupla em :attr:`~django.contrib.admin.ModelAdmin.fieldsets` é o título do grupo. Aqui está como o nosso formulário se parece agora:

source: Adding related objects
es: Agregando objetos relacionados
pt_br: Adicionando objetos relacionados

source: OK, we have our Question admin page, but a ``Question`` has multiple ``Choice``\s, and the admin page doesn't display choices.
es: OK, tenemos nuestra página de administración Pregunta, pero una ``Pregunta`` tiene varias `` Opción``\es, y la página de administración no muestra opciones.
pt_br: Ok, nós temos nossa página de administração Questão, mas a ``Questão`` tem múltiplas ``Questõe``\s, e a página de administração não exibe escolhas.

source: Yet.
es: Sin embargo,
pt_br: Ainda.

source: There are two ways to solve this problem. The first is to register ``Choice`` with the admin just as we did with ``Question``. That's easy:
es: Hay dos formas de resolver este problema. La primera es registrar ``Opción`` con el sitio administrativo tal como lo hicimos con ``Pregunta``. Eso es fácil:
pt_br: Há duas formas de solucionar esse problema. A primeira é registrar ``Choice`` no site de administração, assim como fizemos com ``Question``. Isto é fácil::

source: Now "Choices" is an available option in the Django admin. The "Add choice" form looks like this:
es: Ahora "Opciones" es una opción disponible en el sitio administrativo de Django. El formulario "Añadir opción" se ve así:
pt_br: Agora "Choices" é uma opção disponível no site de administração do Django. O formulário de "Add choice" se parece com isto:

source: In that form, the "Question" field is a select box containing every question in the database. Django knows that a :class:`~django.db.models.ForeignKey` should be represented in the admin as a ``<select>`` box. In our case, only one question exists at this point.
es: En ese formulario, el campo "Pregunta" es un cuadro de selección que contiene cada pregunta de la base de datos. Django sabe que una: clase: `~ django.db.models.ForeignKey` debería estar representada en el sitio administrativo como un cuadro `` <select>``. En nuestro caso, solo existe una pregunta en este momento.
pt_br: Nesse formulário, o campo "Question" é uma caixa de seleção contendo todas as enquetes no banco de dados. O Django sabe que uma :class:`~django.db.models.ForeignKey` deve ser representada no site de administração como um campo ``<select>``. No nosso caso, só existe uma enquete até agora.

source: Also note the "Add Another" link next to "Question." Every object with a ``ForeignKey`` relationship to another gets this for free. When you click "Add Another", you'll get a popup window with the "Add question" form. If you add a question in that window and click "Save", Django will save the question to the database and dynamically add it as the selected choice on the "Add choice" form you're looking at.
es: También tenga en cuenta el enlace "Añadir otro" que está al lado de "Pregunta". Cada objeto con una relación de "clave foránea" con otro obtiene esta libremente . Al hacer clic en "Agregar otro", obtendrá una ventana emergente con el formulario "Añadir pregunta". Si usted agrega una pregunta en esa ventana y hace clic en "Guardar", Django guardará la pregunta en la base de datos y la agregará dinámicamente como la opción seleccionada en el formulario "Añadir opción" que usted está mirando.
pt_br: Observe também o link "Add Another" ao lado de "Question". Todo objeto com um relacionamento de chave estrangeira para outro ganha essa opção gratuitamente. Quando você clica em "Add Another", você terá uma janela popup com o formulário "Add question". Se você adicionar uma enquete na janela e clicar em "Save", o Django salvará a enquete no banco de dados e irá dinamicamente adicionar a opção já selecionada ao formulário "Add choice" que você está vendo.

source: But, really, this is an inefficient way of adding ``Choice`` objects to the system. It'd be better if you could add a bunch of Choices directly when you create the ``Question`` object. Let's make that happen.
es: Pero, en realidad, se trata de una forma ineficiente de añadir objetos ``Opción`` al sistema. Sería mejor si usted podría agregar muchas opciones directamente cuando crea el objeto ``Pregunta``. Hagámoslo realidad.
pt_br: Mas, sério, essa é uma maneira ineficiente de adicionar objetos ``Choice`` ao sistema. Seria muito melhor se você pudesse adicionar várias opções diretamente quando criasse um objeto ``Question``. Vamos fazer isso acontecer.

source: Remove the ``register()`` call for the ``Choice`` model. Then, edit the ``Question`` registration code to read:
es: Elimine la llamada ``registro()`` para el modelo ``Opción``. A continuación, edite el `código de registro "Pregunta" para que diga:
pt_br: Remova a chamada ``register()`` do modelo ``Choice``. Então edite o código de registro de ``Question`` para que fique assim:

source: This tells Django: "``Choice`` objects are edited on the ``Question`` admin page. By default, provide enough fields for 3 choices."
es: Esto le indica a Django: "Los objetos ``Opción`` se editan en la página de administración ``Pregunta``. De forma predeterminada, proporciona suficientes campos para 3 opciones.".
pt_br: Isso informa ao Django: Objetos "``Choice`` são editados na mesma página de administração de ``Question``. Por padrão, forneça campos suficientes para 3 escolhas."

source: Load the "Add question" page to see how that looks:
es: Cargue la página "Añadir pregunta" para ver cómo que se ve:
pt_br: Carregue a página "Add question" para ver como está:

source: It works like this: There are three slots for related Choices -- as specified by ``extra`` -- and each time you come back to the "Change" page for an already-created object, you get another three extra slots.
es: Funciona así: Hay tres espacios para las opciones relacionadas, como indica `` extra``, y cada vez que usted vuelva a la página "cambio" para un objeto ya creado, usted obtiene otros tres espacios adicionales.
pt_br: Funciona assim: há três blocos para Escolhas relacionadas -- como especificado em ``extra`` --, mas a cada vez que você retorna à página de "Alteração" para um objeto já criado, você ganha outros três blocos extra.

source: At the end of the three current slots you will find an "Add another Choice" link. If you click on it, a new slot will be added. If you want to remove the added slot, you can click on the X to the top right of the added slot. Note that you can't remove the original three slots. This image shows an added slot:
es: Al final de los tres espacios actuales se encuentra un enlace "Añadir otra opción". Si hace clic en él, se añadirá un espacio nuevo. Si desea eliminar el espacio adicional, usted puede hacer clic en la X en la parte superior derecha del espacio añadido. Tenga en cuenta que no puede eliminar los tres espacios originales. Esta imagen muestra un espacio añadido:
pt_br: No final dos três blocos atuais você encontrará um link "Adicionar outra escolha". Se você clicar nele, será adicionado um novo bloco. Se você deseja remover o bloco adicional, você pode clicar no X ao topo direito do bloco acrescentado. Observe que você não pode remover os três blocos originais. Esta imagem mostra um bloco acrescentado:

source: One small problem, though. It takes a lot of screen space to display all the fields for entering related ``Choice`` objects. For that reason, Django offers a tabular way of displaying inline related objects; you just need to change the ``ChoiceInline`` declaration to read:
es: Sin embargo, hay un pequeño problema. Se necesita una gran cantidad de espacio en la pantalla para visualizar todos los campos para introducir los objetos ``Opción`` relacionados. Por esa razón, Django ofrece una forma tabular de mostrar los objetos relacionados en línea; usted sólo tiene que cambiar la declaración ``Opción en línea`` para que diga:
pt_br: No entanto, há um pequeno problema. Um monte de espaço na tela é tomado para exibir todos os três objetos ``Choice`` relacionados a serem inseridos. Por essa razão, o Django oferece uma maneira alternativa para exibir cada objeto relacionado em uma única linha; você só precisa alterar a declaração ``ChoiceInline`` para que seja:

source: With that ``TabularInline`` (instead of ``StackedInline``), the related objects are displayed in a more compact, table-based format:
es: Los objetos relacionados se muestran en un formato más compacto, basado en tablas con esa ``forma de tabla en línea`` (en lugar de `` apilados en línea``):
pt_br: Com o ``TabularInline`` (em vez de ``StackedInline``), os objetos relacionados são exibidos de uma maneira mais compacta, formatada em tabela:

source: Note that there is an extra "Delete?" column that allows removing rows added using the "Add Another Choice" button and rows that have already been saved.
es: Tenga en cuenta que hay una columna "Eliminar?" extra que permite la eliminación de filas añadidas utilizando el botón "Añadir otra opción" y las filas que ya han sido guardadas.
pt_br: Observe que há uma coluna extra "Delete?" que permite a remoção de linhas adicionadas usando o botão "Add Another Choice" e linhas que já foram salvas.

source: Customize the admin change list
es: Personalice la lista de cambios del sitio administrativo
pt_br: Personalize a listagem da página de administração

source: Now that the Question admin page is looking good, let's make some tweaks to the "change list" page -- the one that displays all the questions in the system.
es: Ahora que la página de administración Pregunta se ve bien, vamos a hacer algunos ajustes a la página "lista de cambios" - la que muestra todas las preguntas en el sistema.
pt_br: Agora que a página de administração de Pergunta está bonita, vamos fazer algumas melhorias à página "change list" -- aquela que exibe todas as enquetes do sistema.

source: Here's what it looks like at this point:
es: Así es como se ve en este momento:
pt_br: Aqui é como ela está até agora:

source: By default, Django displays the ``str()`` of each object. But sometimes it'd be more helpful if we could display individual fields. To do that, use the :attr:`~django.contrib.admin.ModelAdmin.list_display` admin option, which is a tuple of field names to display, as columns, on the change list page for the object:
es: Por defecto, Django muestra el ``str()`` de cada objeto. Pero a veces sería más útil si pudiéramos mostrar los campos individuales. Para hacerlo, utilice el: atributo: opción del sitio administrativo `~ django.contrib.admin.ModelAdmin.list_display`, que es una tupla de nombres de campos para que se muestre, como columnas, en la página de lista de cambios para el objeto:
pt_br: Por padrão, o Django mostra o ``str()`` de cada objeto. Mas algumas vezes seria mais útil se pudéssemos mostrar campos individuais. Para fazer isso, use a opção :attr:`~django.contrib.admin.ModelAdmin.list_display`, que é uma tupla de nomes de campos a serem exibidos, como colunas, na lista de mudança dos objetos:

source: Just for good measure, let's also include the ``was_published_recently()`` method from :doc:`Tutorial 2 </intro/tutorial02>`:
es: Sólo por si acaso, también vamos a incluir el método `` was_published_recently () `` del: doc: `Tutorial 2 </intro/tutorial02> `:
pt_br: Apenas bom demais para mensurar, vamos também incluir o método ``was_published_recently()`` do :doc:`Tutorial 2 </intro/tutorial02>`:

source: Now the question change list page looks like this:
es: Ahora la página de lista de cambios de preguntas se ve así:
pt_br: Agora a página de edição de enquetes está assim:

source: You can click on the column headers to sort by those values -- except in the case of the ``was_published_recently`` header, because sorting by the output of an arbitrary method is not supported. Also note that the column header for ``was_published_recently`` is, by default, the name of the method (with underscores replaced with spaces), and that each line contains the string representation of the output.
es: Usted puede hacer clic en las cabeceras de las columnas para ordenar por esos valores ,excepto en el caso de la cabecera ``was_published_recently``, porque ordenar por la salida de un método arbitrario no es compatible. También tenga en cuenta que la cabecera de la columna `` was_published_recently`` es, por defecto, el nombre del método (con guiones bajos reemplazado con espacios), y que cada línea contiene la representación de cadena de la salida.
pt_br: Você pode clicar no cabeçalho da coluna para ordená-las por estes valores -- exceto no caso do ``was_published_recently``, porque a ordenação pelo resultado de um método arbitrário não é suportada. Também note que o cabeçalho da coluna para ``was_published_recently`` é, por padrão, o nome do método (com underscores substituídos por espaços), e que cada linha contem a representação da saída.
