Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: The name of each :class:`~django.db.models.Field` instance (e.g. ``question_text`` or ``pub_date``) is the field's name, in machine-friendly format. You'll use this value in your Python code, and your database will use it as the column name.
es: El nombre de cada: clase: instancia ~ django.db.models.Field` (por ejemplo, `` question_text`` o `` pub_date``) `es el nombre del campo, en formato adaptado a la computadora. Va a usar este valor en el código Python y su base de datos va a usarlo como el nombre de la columna.
pt_br: O nome de cada instância :class:`~django.db.models.Field` (e.g. ``question_text`` ou ``pub_date``) é o nome do campo, em formato amigável para a máquina. Você irá usar este valor no seu código Python, e seu banco de dados irá usá-lo como nome de coluna.

source: You can use an optional first positional argument to a :class:`~django.db.models.Field` to designate a human-readable name. That's used in a couple of introspective parts of Django, and it doubles as documentation. If this field isn't provided, Django will use the machine-readable name. In this example, we've only defined a human-readable name for ``Question.pub_date``. For all other fields in this model, the field's machine-readable name will suffice as its human-readable name.
es: Puede emplear un primer argumento posicional opcional a una: class: `~ django.db.models.Field` para designar un nombre legible por humanos. Ese se utiliza en varias partes introspectivas de Django y sirve al mismo tiempo como documentación. Si no se proporciona este campo, Django usará el nombre legible por la máquina. En este ejemplo, sólo hemos definido un nombre legible por `` Question.pub_date``. Para el resto de los campos en este modelo, el nombre del campo legible por la máquina será suficiente al igual que el nombre legible por humanos.
pt_br: Você pode usar um argumento opcional na primeira posição de um :class:`~django.db.models.Field` para designar um nome legível por seres humanos o qual será usado em uma série de partes introspectivas do Django, e também servirá como documentação. Se esse argumento não for fornecido, o Django utilizará o nome legível pela máquina. Neste exemplo nós definimos um nome legível por humanos apenas para ``Question.pub_date``. Para todos os outros campos neste model, o nome legível pela máquina será utilizado como nome legível por humanos.

source: Some :class:`~django.db.models.Field` classes have required arguments. :class:`~django.db.models.CharField`, for example, requires that you give it a :attr:`~django.db.models.CharField.max_length`. That's used not only in the database schema, but in validation, as we'll soon see.
es: Algunas: clase: clases `~ django.db.models.Field` precisan argumentos. La : clase: `~ django.db.models.CharField`, por ejemplo, requiere que usted le asigne un: atributo:` ~ django.db.models.CharField.max_length` que se utiliza no sólo en el esquema de la base de datos, sino también en la validación como veremos dentro de poco.
pt_br: Algumas classes de :class:`~django.db.models.Field` possuem elementos obrigatórios. O :class:`~django.db.models.CharField`, por exemplo, requer que você informe a ele um :attr:`~django.db.models.Field.max_length` que é usado não apenas no esquema do banco de dados, mas na validação, como nós veremos em breve.

source: A :class:`~django.db.models.Field` can also have various optional arguments; in this case, we've set the :attr:`~django.db.models.Field.default` value of ``votes`` to 0.
es: Una: clase: `~ django.db.models.Field` también puede tener varios argumentos opcionales; en este caso, hemos fijado el: atributo: `~ django.db.models.Field.default` valor de ``votos`` en 0.
pt_br: Um :class:`~django.db.models.Field` pode ter varios argumentos opcionais; neste caso, nos definimos :attr:`~django.db.models.Field.default` o valor de ``votes`` para 0.

source: Finally, note a relationship is defined, using :class:`~django.db.models.ForeignKey`. That tells Django each ``Choice`` is related to a single ``Question``. Django supports all the common database relationships: many-to-one, many-to-many, and one-to-one.
es: Por último, tenga en cuenta que una relación se define usando: clase: `~ django.db.models.ForeignKey`. Eso le indica a Django que ccada `` Elección`` se relaciona con un sola `` Pregunta``. Django es compatible con todas las relaciones de bases de datos comunes: varias a una, varias a varias y una a una.
pt_br: Finalmente, note que uma relação foi criada, usando :class:`~django.db.models.ForeignKey`. Isso dia ao Django que cada ``Choice`` está relacionada a uma única ``Question``. O Django suporta todos os relacionamentos comuns de um banco de dados: muitos-para-um, muitos-para-muitos e um-para-um

source: Activating models
es: Activando los modelos
pt_br: Ativando modelos

source: That small bit of model code gives Django a lot of information. With it, Django is able to:
es: Ese pequeño fragmento de código de modelo le proporciona a Django mucha información. Con él, Django es capaz de:
pt_br: Aquela pequena parte do model fornece ao Django muita informação. Com ela o Django é capaz de:

source: Create a database schema (``CREATE TABLE`` statements) for this app.
es: Cree un esquema de base de datos para esta aplicación (oraciones `` CREATE TABLE``).
pt_br: Criar um esquema de banco de dados (instruções ``CREATE TABLE``) para a aplicação.

source: Create a Python database-access API for accessing ``Question`` and ``Choice`` objects.
es: Cree una API Python de acceso a la base datos para acceder a los objetos ``Elección y `` Pregunta``.
pt_br: Criar uma API de acesso a banco de dados para acessar objetos ``Question`` e ``Choice``.

source: But first we need to tell our project that the ``polls`` app is installed.
es: Pero primero tenemos que indicarle a nuestro proyecto que la aplicación ``encuestas`` está instalada.
pt_br: Mas primeiro nós precisamos dizer ao nosso projeto que a aplicação ``polls`` está instalada.

source: Django apps are "pluggable": You can use an app in multiple projects, and you can distribute apps, because they don't have to be tied to a given Django installation.
es: Las aplicaciones Django son “conectables”: Usted puede utilizar una aplicación en diversos proyectos y puede distribuir aplicaciones porque ellas no necesitan estar atadas a una determinada instalación de Django.
pt_br: Aplicações Django são "plugáveis": Você pode usar uma aplicação em múltiplos projetos, e você pode distribuir aplicações, porque elas não precisam ser atreladas a uma determinada instalação do Django.

source: Edit the :file:`mysite/settings.py` file again, and change the :setting:`INSTALLED_APPS` setting to include the string ``'polls.apps.PollsConfig'``. It'll look like this:
es: Edite de nuevo el: archivo: archivo `mysite/settings.py` y cambie la: configuración: configuración de las `Aplicaciones instaladas` para incluir la cadena ``'polls.apps.PollsConfig'``. Se Verá así:
pt_br: Edite o arquivo :file:`mysite/settings.py` novamente, e altere a configuração em :setting:`INSTALLED_APPS` para incluir a string ``'polls.apps.PollsConfig'``. Irá ficar parecido com isso:

source: Now Django knows to include the ``polls`` app. Let's run another command:
es: Ahora Django sabe incluir la aplicación "encuestas". Vamos a ejecutar otro comando:
pt_br: Agora o Django sabe que deve incluir a aplicação ``polls``. Vamos rodar outro comando:

source: You should see something similar to the following:
es: Usted debe ver algo similar a lo siguiente:
pt_br: Você deverá ver algo similar ao seguinte:

source: By running ``makemigrations``, you're telling Django that you've made some changes to your models (in this case, you've made new ones) and that you'd like the changes to be stored as a *migration*.
es: Al ejecutar ``makemigrations``, usted le indica a Django que ha realizado algunas modificaciones a sus modelos (en este caso, ha realizado modificaciones nuevas) y que le gustaría que las guarde como una *migración*.
pt_br: Ao executar ``makemigrations``, você está dizendo Django que você fez algumas mudanças em seus modelos (neste caso, você fez novas modificações) e que você gostaria que as alterações sejam armazenadas como uma *migração*.

source: Migrations are how Django stores changes to your models (and thus your database schema) - they're just files on disk. You can read the migration for your new model if you like; it's the file ``polls/migrations/0001_initial.py``. Don't worry, you're not expected to read them every time Django makes one, but they're designed to be human-editable in case you want to manually tweak how Django changes things.
es: Django guarda las modificaciones en sus modelos como migraciones (y por lo tanto su esquema de base de datos); son solo archivos en el disco. Usted puede leer la migración para su nuevo modelo si lo desea, es el archivo ``polls/migrations/0001_initial.py``. No se preocupe, no se espera que usted las lea cada vez que Django hace una, sino que están diseñadas para que sean editables por el hombre en caso de que usted desee manualmente modificar como Django modifica los objetos.
pt_br: As migrações são como o Django armazena as alterações nos seus modelos (e, portanto, seu esquema de banco de dados) - eles são apenas arquivos no disco. Você pode ler a migração para o novo modelo, se quiser; é o arquivo ``polls/migrations/0001_initial.py``. Não se preocupe, você não precisa lê-los cada vez Django cria um, mas eles são projetados para ser editável no caso de você queira ajustar manualmente como Django muda as coisas.

source: There's a command that will run the migrations for you and manage your database schema automatically - that's called :djadmin:`migrate`, and we'll come to it in a moment - but first, let's see what SQL that migration would run. The :djadmin:`sqlmigrate` command takes migration names and returns their SQL:
es: Hay un comando que ejecutará las migraciones para usted y gestionará el esquema de base de datos automáticamente; este se denomina: djadmin: `migrar`, y hablaremos de ello en un momento, pero primero, vamos a ver qué SQL ejecutaría esa migración . El: djadmin: comando ` sqlmigrate` recibe nombres de migración y devuelve su SQL:
pt_br: Existe um comando que vai rodar as migrações para você e gerenciar o esquema do banco de dados automaticamente - que é chamado :djadmin:`migrate`, e nós vamos chegar a ele em um momento - mas primeiro vamos ver qual SQL está migração vai rodar. O comando :djadmin:`sqlmigrate` recebe o nome da migração e o seu SQL.

source: You should see something similar to the following (we've reformatted it for readability):
es: Debería ver algo similar a lo siguiente (lo hemos reformateado para facilitar la lectura):
pt_br: Você deve ver algo semelhante ao seguinte (reformatamos para facilitar a leitura):

source: Note the following:
es: Tenga en cuenta lo siguiente:
pt_br: Note o seguinte:

source: The exact output will vary depending on the database you are using. The example above is generated for PostgreSQL.
es: La salida exacta variará dependiendo de la base de datos que esté utilizando. El ejemplo anterior se genera para PostgreSQL.
pt_br: A saída exata irá variar dependendo do banco de dados que você está utilizando.

source: Table names are automatically generated by combining the name of the app (``polls``) and the lowercase name of the model -- ``question`` and ``choice``. (You can override this behavior.)
es: Los nombres de las tablas se generan automáticamente combinando el nombre de la aplicación (“encuestas”) y el nombre del modelo en minúscula; “pregunta” y “elección”. (Usted puede anular este comportamiento).
pt_br: Os nomes das tabelas são gerados automaticamente combinando o nome da aplicação (``polls``) e o nome em minúsculas do model -- ``question`` e ``choice``. (Você pode alterar esse comportamento.)

source: Primary keys (IDs) are added automatically. (You can override this, too.)
es: Las claves primarias (IDS) se agregan automáticamente. (Usted también puede anular esto).
pt_br: Chaves primárias (IDs) são adicionadas automaticamente. (Você também pode modificar isso.)

source: By convention, Django appends ``"_id"`` to the foreign key field name. (Yes, you can override this, as well.)
es: Convencionalmente, Django añade ``"_id"`` al nombre del campo de la clave foránea( sí, usted también puede anular esto).
pt_br: Por convenção, o Django adiciona ``"_id"`` ao nome do campo de uma chave estrangeira. (Sim, você pode alterar isso, como quiser.)

source: The foreign key relationship is made explicit by a ``FOREIGN KEY`` constraint. Don't worry about the ``DEFERRABLE`` parts; that's just telling PostgreSQL to not enforce the foreign key until the end of the transaction.
es: La relación de la clave foránea se hace explícita por una restricción “Clave Foránea”. No se preocupe por las partes “postergables”; eso solo le indica a PostgreSQL que no aplique, la clave foránea hasta el final de la transacción.
pt_br: O relacionamento da chave estrangeira é feito explicitamente por uma instrução ``FOREIGN KEY``. Não se preocupe sobre partes ``DEFERRABLE``; Está apenas instruindo o PostgreSQL para não forçar a criação da chave estrangeira até o fim da transação.

source: It's tailored to the database you're using, so database-specific field types such as ``auto_increment`` (MySQL), ``serial`` (PostgreSQL), or ``integer primary key autoincrement`` (SQLite) are handled for you automatically. Same goes for the quoting of field names -- e.g., using double quotes or single quotes.
es: Se adapta a la base de datos que está utilizando, así que los tipos de campos específicos de la bases de datos como “autoincrementación” (MySQL), “serial” (PostgreSQL) o “autoincrementación de la clave primaria entera” (SQLite) se gestionan de forma automática. Lo mismo se aplica para la cita de nombres de campos, por ejemplo, el uso de comillas dobles o comillas simples.
pt_br: Isto é atrelado ao banco que você está usando, então a utilização de campos específicos do banco de dados como ``auto_increment`` (MySQL), ``serial`` (PostgreSQL), ou ``integer primary key`` (SQLite) é feita para você automaticamente. O mesmo ocorre com as aspas dos nomes de campos -- e.g., usando aspas duplas ou aspas simples.

source: The :djadmin:`sqlmigrate` command doesn't actually run the migration on your database - it just prints it to the screen so that you can see what SQL Django thinks is required. It's useful for checking what Django is going to do or if you have database administrators who require SQL scripts for changes.
es: El: djadmin: comando `sqlmigrate` en realidad no ejecuta la migración en su base de datos, sólo la imprime en la pantalla para que pueda ver lo que SQL Django piensa que se requiere. Es útil para comprobar lo que Django va a hacer o si usted tiene administradores de bases que requieran scripts SQL para introducir cambios.
pt_br: O comando :djadmin:`sqlmigrate` na realidade não roda o SQL no seu banco de dados - ele apenas o exibe na tela para que você saiba qual SQL o Django acha que é necessário. É útil para verificar o que Django vai fazer ou se você tem administradores de bancos de dados que necessitam dos scripts SQL para mudanças.

source: If you're interested, you can also run :djadmin:`python manage.py check <check>`; this checks for any problems in your project without making migrations or touching the database.
es: Si le interesa, usted también puede ejecutar:djadmin:`python manage.py check <check>`; este revisa cualquier problema en su proyecto sin hacer migraciones o modificar la base de datos.
pt_br: Se você tiver interesse, você pode rodar :djadmin:`python manage.py check <check>`; Ele checa por problemas no seu projeto sem criar migrations ou tocar seu banco de dados.

source: Now, run :djadmin:`migrate` again to create those model tables in your database:
es: A continuación, ejecute: djadmin: de nuevo `migrar` para crear esas tablas modelos en su base de datos:
pt_br: Agora rode o :djadmin:`migrate` novamente para criar essas tabelas dos modelos no seu banco de dados:

source: The :djadmin:`migrate` command takes all the migrations that haven't been applied (Django tracks which ones are applied using a special table in your database called ``django_migrations``) and runs them against your database - essentially, synchronizing the changes you made to your models with the schema in the database.
es: El: djadmin: comando `migrar` toma todas las migraciones que no han sido aplicadas (Django rastrea cuales se aplican utilizando una tabla especial en su base de datos llamada ` `django_migrations``) y las ejecuta en su base de datos; básicamente, sincronizando las modificaciones que usted ha hecho a sus modelos con el esquema en la base de datos.
pt_br: O comando :djadmin:`migrate` pega todas as migrações que ainda não foram aplicadas (Django rastreia quais foram aplicadas usando uma tabela especial em seu banco de dados chamada ``django_migrations``) e aplica elas contra seu banco de dados - essencialmente, sincronizando as alterações feitas aos seus modelos com o esquema no banco de dados.

source: Migrations are very powerful and let you change your models over time, as you develop your project, without the need to delete your database or tables and make new ones - it specializes in upgrading your database live, without losing data. We'll cover them in more depth in a later part of the tutorial, but for now, remember the three-step guide to making model changes:
es: Las migraciones son muy potentes y le permiten modificar sus modelos con el tiempo, a medida que usted desarrolla su proyecto, sin necesidad de eliminar su base de datos o las tablas y hacer otras nuevas. Este se especializa en la actualización de su base de datos en vivo, sin perder datos. Vamos a hablar de ellas con mayor profundidad en la última parte del tutorial, pero por ahora, recuerde la guía de tres pasos para hacer cambios en el modelo:
pt_br: Migrações são muito poderosas e permitem que você altere seus modelos ao longo do tempo, à medida que desenvolve o seu projeto, sem a necessidade de remover o seu banco de dados ou tabelas e criar de novo - ele é especializado em atualizar seu banco de dados ao vivo, sem perda de dados. Nós vamos cobri-los com mais profundidade em uma parte posterior do tutorial, mas para agora, lembre-se deste guia de três passos para fazer mudanças nos seus modelos:

source: Change your models (in ``models.py``).
es: Cambie sus modelos en (``models.py``).
pt_br: Mude seus modelos (em ``models.py``).

source: Run :djadmin:`python manage.py makemigrations <makemigrations>` to create migrations for those changes
es: Ejecute: djadmin: `makemigrations python manage.py <makemigrations> `Para crear migraciones para esos cambios
pt_br: Rode :djadmin:`python manage.py makemigrations <makemigrations>` para criar migrações para suas modificações

source: Run :djadmin:`python manage.py migrate <migrate>` to apply those changes to the database.
es: Ejecute: djadmin: `python manage.py migrate <migrate>` para aplicar esos cambios a la base de datos.
pt_br: Rode :djadmin:`python manage.py migrate <migrate>` para aplicar suas modificações no banco de dados.

source: The reason that there are separate commands to make and apply migrations is because you'll commit migrations to your version control system and ship them with your app; they not only make your development easier, they're also useable by other developers and in production.
es: La razón por la que hay comandos separados para hacer y aplicar las migraciones es porque usted consigna migraciones al sistema de control de versiones y las envia con su aplicación; ellas no sólo hacen que su desarrollo sea más fácil, también son utilizables por otros desarrolladores y en la producción.
pt_br: A razão de haver comandos separados para criar e aplicar as migrações é porque você vai submeter migrações para o seu sistema de controle de versão e enviá-los com sua aplicação; eles não só fazem o seu desenvolvimento mais fácil, eles também são utilizáveis ​​por outros desenvolvedores e em produção.

source: Read the :doc:`django-admin documentation </ref/django-admin>` for full information on what the ``manage.py`` utility can do.
es: Lea el: doc: `documentación del sitio adfministrativo de Django </ref/django-admin> `para obtener información detallada sobre lo que puede hacer la utilidad `` manage.py``.
pt_br: Leia a :doc:`documentação do django-admin </ref/django-admin>` para informações completas sobre o que o utilitário ``manage.py`` pode fazer.

source: Playing with the API
es: Jugando con la API
pt_br: Brincando com a API

source: Now, let's hop into the interactive Python shell and play around with the free API Django gives you. To invoke the Python shell, use this command:
es: Ahora, vayamos al shell interactivo de Python y juguemos con la API gratuita que Django le proporciona. Para llamar el shell de Python, utilice este comando:
pt_br: Agora vamos dar uma passada no shell interativo do Python e brincar um pouco com a API livre que o Django dá a você. Para invocar o shell do Python, use esse comando:

source: We're using this instead of simply typing "python", because :file:`manage.py` sets the ``DJANGO_SETTINGS_MODULE`` environment variable, which gives Django the Python import path to your :file:`mysite/settings.py` file.
es: Estamos usando esto en vez de escribir simplemente "python", porque :archivo: `manage.py` establece la variable de entorno` `DJANGO_SETTINGS_MODULE``, que le suministra a Django la ruta de importación de Python para su :archivo: archivo ` mysite / settings.py `.
pt_br: Nós usaremos isso em vez de simplesmente digitar "python", porque o :file:`manage.py` configura a variável de ambiente ``DJANGO_SETTINGS_MODULE``, O que da ao Django o caminho de importação Python do arquivo :file:`mysite/settings.py`.

source: Bypassing manage.py
es: Evitando manage.py
pt_br: Ignorando manage.py

source: If you'd rather not use :file:`manage.py`, no problem. Just set the :envvar:`DJANGO_SETTINGS_MODULE` environment variable to ``mysite.settings``, start a plain Python shell, and set up Django:
es: Si prefiere no utilizar: archivo: `manage.py`, no hay problema. Sólo tiene que configurar la: envvar: variable de entorno `DJANGO_SETTINGS_MODULE` para` `mysite.settings``, inicie un shell de Python sencillo y ponga en marcha Django:
pt_br: Se você optar por não usar o :file:`manage.py`, não há problemas. Apenas configure a variável de ambiente :envvar:`DJANGO_SETTINGS_MODULE` para ``mysite.settings``, Inicie um shell Python puro e e configure o Django:

source: If this raises an :exc:`AttributeError`, you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
es: Si esto produce un: exc: `AttributeError`, probablemente esté usando una versión de Django que no coincida con la versión del tutorial. Usted querrá ya sea cambiar al tutorial anterior o a la versión más reciente de Django.
pt_br: Se levantar um :exc:`AttributeError`, Você provavelmente está usando uma versão do Django que funciona com está versão do tutorial. Você vai querer quer mudar para um tutorial mais velho ou a versão mais recente do Django.

source: You must run ``python`` from the same directory :file:`manage.py` is in, or ensure that directory is on the Python path, so that ``import mysite`` works.
es: Usted debe ejecutar `` python`` desde el mismo directorio: file: en el que está `manage.py` o asegúrese de que el directorio está en la ruta Python para que ``import mysite`` funcione.
pt_br: Você deve rodar ``python`` a partir do mesmo diretório que :file:`manage.py` está, ou garantir que este diretório está no cominho do Python, e assim ``import mysite`` funcionara.
