Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: When contributing to Django it's very important that your code changes don't introduce bugs into other areas of Django. One way to check that Django still works after you make your changes is by running Django's test suite. If all the tests still pass, then you can be reasonably sure that your changes haven't completely broken Django. If you've never run Django's test suite before, it's a good idea to run it once beforehand just to get familiar with what its output is supposed to look like.
es: Al contribuir con Django es muy importante que las modificaciones de su código no introduzca bugs en otras áreas de Django. Una manera de comprobar que Django todavía funciona después de que usted realiza las modificaciones es ejecutar el conjunto de pruebas de Django. Si todavía todas las pruebas pasan, entonces usted puede estar razonablemente seguro de que sus modificaciones no descompusieron por completo a Django. Si usted nunca antes ha ejecutado el conjunto de pruebas de Django, es una buena idea ejecutarlas una vez con anterioridad para familiarizarse con lo que se supone sería su resultado.
pt_br: Quando contribuir para o Django é muito imoprtante que suas mudanças no código não introduzam bugs em outras área do Django. Uma maneira de verificar se o Django ainda funciona depois de adicionar suas alterações é executando a suite de testes do Django. Se ainda passa em todos os testes, então você pode ter uma certeza razoável de que suas alterações não quebraram completamente o Django. Se você nunca rodou os testes antes, é uma boa idéia executá-los uma vez só para estar familiarizado com o que a sua saída deveria parecer.

source: Before running the test suite, install its dependencies by first ``cd``-ing into the Django ``tests/`` directory and then running:
es: Antes de ejecutar el conjunto de pruebas, instale sus dependencias, primero cambiándose al directorio “pruebas” de Django y después ejecutando:
pt_br: Antes de rodar a suíte de testes, instale suas dependências primeiramente entrando no diretório ``tests/`` do Django e então executando-a.

source: Now we are ready to run the test suite. If you're using GNU/Linux, Mac OS X or some other flavor of Unix, run:
es: Ahora estamos listos para ejecutar el conjunto de pruebas. Si está usando GNU / Linux, Mac OS X o alguna otra versión de Unix, ejecute:
pt_br: Agora estamos prontos para executar a suite de testes. Se você estiver usando o GNU/Linux, Mac OS X ou alguma outra distro do UNIX, execute:

source: Now sit back and relax. Django's entire test suite has over 9,600 different tests, so it can take anywhere from 5 to 15 minutes to run, depending on the speed of your computer.
es: Ahora siéntese y relájese. Todo el conjunto de pruebas de Django tiene más de 9.600 pruebas diferentes, por lo que puede tomar de 5 a 15 minutos para ejecutarse, dependiendo de la velocidad de su computadora.
pt_br: Agora sente e relaxe. A suíte de testes do Django tem mais de 9.600 testes diferentes, por isso pode levar de 5 a 15 minutos para ser executado, dependendo da velocidade do seu computador.

source: While Django's test suite is running, you'll see a stream of characters representing the status of each test as it's run. ``E`` indicates that an error was raised during a test, and ``F`` indicates that a test's assertions failed. Both of these are considered to be test failures. Meanwhile, ``x`` and ``s`` indicated expected failures and skipped tests, respectively. Dots indicate passing tests.
es: Mientras que el conjunto de pruebas de Django se esté ejecutando, usted verá una cadena de caracteres que representa el estado de cada prueba mientras se ejecuta. La "E" indica que se produjo un error durante una prueba, y la "F" indica que los asertos de una prueba fallaron. Ambos se consideran errores de pruebas. Mientras tanto, la ``x`` y la ``s`` indican los errores esperados y las pruebas omitidas respectivamente. Los puntos indican las pruebas aprobadas.
pt_br: Enquanto a suíte de testes do Django estiver sendo executada, você verá um fluxo de caracteres representando o status de cada teste conforme vão sendo executados. "E" indica que foi lançado um erro durante o teste, "F" indica que as asserções do teste falharam. Ambos são considerados como se o teste tivesse falhado. Enquanto que "x" e "s" indicam falhas esperadas e testes ignorados, respectivamente. Pontos indicam que o teste passou.

source: Skipped tests are typically due to missing external libraries required to run the test; see :ref:`running-unit-tests-dependencies` for a list of dependencies and be sure to install any for tests related to the changes you are making (we won't need any for this tutorial).
es: Las pruebas omitidas por lo general se deben a la falta de bibliotecas externas necesarias para ejecutar la prueba; consulte: ref: `running-unit-tests-dependencies` para una lista de dependencias y asegúrese de instalar alguna para las pruebas relacionadas con los cambios que está realizando (no vamos a necesitar ninguna para este tutorial).
pt_br: Testes pulados são tipicamente devido à falta de bibliotecas externas necessárias para executar o teste; veja :ref:'running-unit-tests-dependencies' para uma lista de dependencias e certifique-se de instalar qualquer um para testes relacionados com as mudanças que está fazendo. (Não necessitamos nenhum para este tutorial).

source: Once the tests complete, you should be greeted with a message informing you whether the test suite passed or failed. Since you haven't yet made any changes to Django's code, the entire test suite **should** pass. If you get failures or errors make sure you've followed all of the previous steps properly. See :ref:`running-unit-tests` for more information.
es: Una vez que las pruebas finalicen, usted debe ser recibido con un mensaje que le informa si el conjunto de pruebas pasó o falló. Dado que aún no ha realizado ningún cambio en el código de Django, todo el conjunto de pruebas debe pasar. Si obtiene fallos o errores asegúrese de que ha seguido correctamente todos los pasos anteriores . Consulte: ref: `running-unit-tests` para más información.
pt_br: Assim que os testes são finalizados, você deveria ser notificado com uma mensagem informando se a suíte de testes passou ou falhou. Uma vez que você não realizou mudanças no código do Django, toda a suíte de testes **deveria** passar. Se você receber notificação de falhas ou erros certifique-se de que você seguiu todos os passos anteriores de maneira apropriada. Ver :ref:`executando-testes-de-unidade` para mais informações.

source: Note that the latest Django trunk may not always be stable. When developing against trunk, you can check `Django's continuous integration builds`__ to determine if the failures are specific to your machine or if they are also present in Django's official builds. If you click to view a particular build, you can view the "Configuration Matrix" which shows failures broken down by Python version and database backend.
es: Tenga en cuenta que el último trunk de Django no siempre puede ser estable. Cuando se desarrolla sobre trunk se pueden verificar "las versiones de integración continuas de Django" para determinar si las fallas son específicas de su máquina o si también están presentes en la versión oficial de Django. Si hace clic para ver una versión en particular, usted puede ver la "Matriz de configuración", que muestra los fallos analizados por la versión de Python y el repositorio de la base de datos.
pt_br: Perceba que o trunk mais recente do Django pode nem sempre estar estável. Quando estiver desenvolvendo utilizando o trunk você pode checar `builds de integração contínua do Django`__ para determinar se as falhas são específicas à sua máquina ou se elas estão presentes também nas builds oficiais do Django. Se você clicar para visualizar uma build em particular, você pode visualizar a "Matriz de Configuração", que mostra falhas discriminadas por versão de Python e backend de banco de dados.

source: For this tutorial and the ticket we're working on, testing against SQLite is sufficient, however, it's possible (and sometimes necessary) to :ref:`run the tests using a different database <running-unit-tests-settings>`.
es: Para este tutorial y la incidencia en la que estamos trabajando, es suficiente probar SQLite, sin embargo, es posible (y a veces necesario): ref: `ejecutar las pruebas utilizando una base de datos diferente <running-unit-tests-settings>`.
pt_br: Para este tutorial e para o ticket em que iremos trabalhar, testar usando o SQLite é suficiente. Entretanto, é possível (e às vezes necessário) :ref:`usar um banco de dados diferente para testes<running-unit-tests-settings>`.

source: Writing some tests for your ticket
es: Escribiendo algunas pruebas para su reporte.
pt_br: Escrevendo alguns testes para o seu ticket

source: In most cases, for a patch to be accepted into Django it has to include tests. For bug fix patches, this means writing a regression test to ensure that the bug is never reintroduced into Django later on. A regression test should be written in such a way that it will fail while the bug still exists and pass once the bug has been fixed. For patches containing new features, you'll need to include tests which ensure that the new features are working correctly. They too should fail when the new feature is not present, and then pass once it has been implemented.
es: En la mayoría de los casos, para que un parche sea aceptado en Django tiene que incluir pruebas. Para los parches de corrección de errores, esto significa escribir una prueba de regresión para asegurar que el bug no sea reintroducido en Django más adelante. Una prueba de regresión debe ser escrita de forma tal que fallará mientras que todavía exista el bug y pasará una vez que el bug se haya corregido. Para los parches que contienen nuevas características, tendrás que incluir pruebas que garanticen que las nuevas características estén funcionando correctamente. Ellos también deben fallar cuando la nueva característica no esté presente y por lo tanto, pasar una vez que haya sido aplicada.
pt_br: Na maioria dos casos, para um patch ser aceito no Django, ele tem que incluir testes. Para patches de correção de erros, significa escrever um teste de regressão para garantir que o erro nunca mais seja reintroduzido no Django mais tarde. Um teste de regressão deve ser escrito de tal forma que irá falhar enquanto o erro ainda existir e passar uma vez que o erro foi corrigido. Para patches contendo novos recursos, você precisa incluir testes que garantem que os novos recursos estão funcionando corretamente. Eles também devem falhar quando o novo recurso não estiver presente, e em seguida passar, uma vez que foi implementado.

source: A good way to do this is to write your new tests first, before making any changes to the code. This style of development is called `test-driven development`__ and can be applied to both entire projects and single patches. After writing your tests, you then run them to make sure that they do indeed fail (since you haven't fixed that bug or added that feature yet). If your new tests don't fail, you'll need to fix them so that they do. After all, a regression test that passes regardless of whether a bug is present is not very helpful at preventing that bug from reoccurring down the road.
es: Una buena forma de hacer esto, es escribir primero tus nuevas pruebas antes de realizar cualquier cambio en el código. Este estilo de desarrollo se llama "desarrollo guiado por pruebas" y se puede aplicar tanto a proyectos completos como a parches individuales. Después de escribir tus pruebas, a continuación, ejécutalas para asegurarte de que en efecto fallan (ya que no has corregido ese bug o añadido aún esa característica). Si tus nuevas pruebas no fallan, tendrás que arreglarlas de manera que lo hagan. Después de todo, una prueba de regresión que pasa sin importar si un error está presente, no es muy útil en prevenir que ese error se repita en el futuro.
pt_br: Uma boa maneira de fazer isso é escrever seus novos testes primeiro, antes de realizar quaisquer modificações no código. Este estilo de desenvolvimento é chamado `desenvolvimento orientado a testes`__ e pode ser aplicado tanto a projetos inteiros quanto a patches isolados. Após escrever seus testes você os roda para garantir que eles realmente falham (uma vez que você ainda não consertou o bug ou adicionou a nova funcionalidade). Se seus novos testes não falharem, você terá de corrigí-los para que falhem. Afinal, um teste de regressão que passa independentemente de um bug estar presente não é muito útil na prevenção de que um bug ocorra novamente no futuro.

source: Now for our hands-on example.
es: Ahora a nuestro ejemplo práctico.
pt_br: Agora para nosso exemplo mão-na-massa.

source: Writing some tests for ticket #24788
es: Escribiendo algunas pruebas para la incidencia #24788
pt_br: Escrevendo alguns testes para o ticket #24788

source: Ticket :ticket:`24788` proposes a small feature addition: the ability to specify the class level attribute ``prefix`` on Form classes, so that::
es: Incidencia: incidencia: `24788` propone una pequeña adición de característica: la capacidad para especificar el atributo de nivel de la clase “prefijo” en las clases de formularios, de modo que::
pt_br: Ticket :ticket:`24788` propõe uma pequena adição: a habilidade de especificar o atributo de classe ``prefix`` nas classes de Form, então que::

source: In order to resolve this ticket, we'll add a ``prefix`` attribute to the ``BaseForm`` class. When creating instances of this class, passing a prefix to the ``__init__()`` method will still set that prefix on the created instance. But not passing a prefix (or passing ``None``) will use the class-level prefix. Before we make those changes though, we're going to write a couple tests to verify that our modification functions correctly and continues to function correctly in the future.
es: Para resolver esta incidencia, vamos a añadir un atributo “prefijo” a la clase “formulario base”. Cuando se crean instancias de esta clase, pasar un prefijo al método ``__init__()`` todavía asignará ese prefijo en la instancia creada. Sin embargo, no pasar un prefijo ( o pasar “Ninguno”) usará el prefijo de nivel de clase. No obstante, antes de realizar esas modificaciones, vamos a escribir varias pruebas para comprobar que nuestra modificación funciona correctamente y seguirá funcionando en el futuro.
pt_br: Para resolver este ticket, iremos adicionar um atributo ``prefix`` a classe ``BaseForm``. Quando criar instancias desta classe, passando um prefixo para o método ``__init__()`` ainda será setado o prefixo na instancia criada. Mas não passando um prefix (ou passando ``None``) será usado o prefixo da classe. Antes de fazermos estas mudanças, nós iremos escrever alguns testes para verificar que nossas modificações funcionam corretamente e continuem funcionando corretamente no futuro.

source: Navigate to Django's ``tests/forms_tests/tests/`` folder and open the ``test_forms.py`` file. Add the following code on line 1674 right before the ``test_forms_with_null_boolean`` function::
es: Navegue a la carpeta ``tests/forms_tests/tests/`` de Django y abra el archivo ``test_forms.py``. Agregue el siguiente código en la línea 1674 antes de la función ``test_forms_with_null_boolean``::
pt_br: Navegue para o diretório ``tests/forms_tests/tests/`` do Django e abra o arquivo ``test_forms.py``. Adicione o seguinte código na linha 1674 logo antes da função ``test_forms_with_null_boolean`` function::

source: This new test checks that setting a class level prefix works as expected, and that passing a ``prefix`` parameter when creating an instance still works too.
es: Esta nueva prueba comprueba que asignar un prefijo de nivel de clase funciona como se esperaba, y que pasar un parámetro “prefijo” cuando se crea una instancia también funciona todavía.
pt_br: Este novo teste verifica que a configuração de um prefixo nível de classe funciona como esperado, e que passando um parâmetro `` prefix`` ao criar uma instância ainda funciona também.

source: But this testing thing looks kinda hard...
es: Pero este asunto de las pruebas parece un poco difícil...
pt_br: Mas esse lance de testar parece difícil...

source: If you've never had to deal with tests before, they can look a little hard to write at first glance. Fortunately, testing is a *very* big subject in computer programming, so there's lots of information out there:
es: Si usted nunca había tenido que lidiar con las pruebas anteriormente, pueden parecer un poco difíciles de escribir a primera vista. Afortunadamente, las pruebas son un tema muy importante en la programación informática, así que hay mucha información disponible:
pt_br: Caso você nunca tenha lidado com testes anteriormente, num primeiro momento eles podem parecer um pouco difíceis de escrever . Felizmente, testes são um assunto *muito* extenso em programação de computadores, então existe muita informção por aí:

source: A good first look at writing tests for Django can be found in the documentation on :doc:`/topics/testing/overview`.
es: Un buen primer vistazo a las pruebas de escritura para Django se puede encontrar en la documentación en: doc: `/topics/testing/overview`.
pt_br: Uma boa introdução em testes para Django pode ser encontrada na documentação :doc:`/topics/testing/overview`.

source: Dive Into Python (a free online book for beginning Python developers) includes a great `introduction to Unit Testing`__.
es: Sumérgete en Python (un libro en línea gratis para los desarrolladores principiantes de Python) incluye una gran introducción a las pruebas unitarias.
pt_br: Megulhando no Python (um livro gratuito online para desenvolvedores iniciantes de Python) inclui uma ótima `introdução ao Teste de Unidade`__.

source: After reading those, if you want something a little meatier to sink your teeth into, there's always the `Python unittest documentation`__.
es: Después de leer esas, si quieres algo un poco más sustancioso para hincar el diente, siempre está la documentación de las pruebas unitarias de Python.
pt_br: Após ler esse material, se você quiser algo a mais para se aprofundar, sempre haverá a `documentação do Python sobre unittest`__.

source: Running your new test
es: Ejecutando su nueva prueba
pt_br: Executando o seu novo teste

source: Remember that we haven't actually made any modifications to ``BaseForm`` yet, so our tests are going to fail. Let's run all the tests in the ``forms_tests`` folder to make sure that's really what happens. From the command line, ``cd`` into the Django ``tests/`` directory and run:
es: Recuerde que no hemos hecho de hecho todavía ninguna modificación al ``BaseForm``, así que nuestras pruebas van a fallar. Vamos a ejecutar todas las pruebas en la carpeta ``forms_tests`` para asegurarnos de que es lo que realmente sucede. Desde la línea de comandos, cámbiese al directorio de pruebas de Django y ejecute ::
pt_br: Lembre que na verdade ainda não fizemos nenhuma modificação no ``BaseForm``, então os testes irão falhar. Vamos rodar todos os testes no diretório ``forms_tests`` para ter ceteza que é isso que acontecerá. Na linha de comando, acesse o diretório ``tests/`` do Django e execute:

source: If the tests ran correctly, you should see one failure corresponding to the test method we added. If all of the tests passed, then you'll want to make sure that you added the new test shown above to the appropriate folder and class.
es: Si las pruebas se ejecutaron correctamente, usted debería ver tres fallos correspondientes a cada uno de los métodos de prueba que hemos añadido. Si todas las pruebas pasan, entonces usted querrá asegurarse de que ha agregado la nueva prueba mostrada arriba a la carpeta y clase apropiadas.
pt_br: Se os testes foram executados corretamente, você deverá ver uma falha que corresponde ao método de teste que adicionamos. Se todos estes testes passaram, então você deverá ter certeza que você adicionou o novo teste mostrado acima no diretório e classe apropriados.

source: Writing the code for your ticket
es: Escribiendo el código para tu incidencia
pt_br: Escrevendo o código para o seu ticket

source: Next we'll be adding the functionality described in ticket :ticket:`24788` to Django.
es: A continuación vamos a estar agregando la funcionalidad descrita en la incidencia: incidencia: `24788` a Django.
pt_br: Em seguida nós iremos adicionar a funcionalidade descrita no ticket :ticket:`24788` ao Django.

source: Writing the code for ticket #24788
es: Escribiendo el código para la incidencia # 24788
pt_br: Escrevendo o código para o ticket #24788

source: Navigate to the ``django/django/forms/`` folder and open the ``forms.py`` file. Find the ``BaseForm`` class on line 72 and add the ``prefix`` class attribute right after the ``field_order`` attribute::
es: Navegue a la carpeta ``django/django/forms/`` y abra el archivo ``forms.py``. Encuentre la clase "BaseForm" en la línea 72 y agregue el atributo de clase "prefijo" justo después del atributo ``field_order``::
pt_br: Vá até o diretório ``django/django/forms/` e abra o arquivo ``forms.py``. Ache a classe ``BaseForm`` a linha 72 e adicione o atributo de classe ``prefix`` logo após o ``field_order`` attribute::

source: Verifying your test now passes
es: Comprobando que ahora su prueba pase
pt_br: Verificando se o seu teste passa agora

source: Once you're done modifying Django, we need to make sure that the tests we wrote earlier pass, so we can see whether the code we wrote above is working correctly. To run the tests in the ``forms_tests`` folder, ``cd`` into the Django ``tests/`` directory and run:
es: Una vez que haya terminado de modificar Django, tenemos que asegurarnos de que las pruebas que escribimos anteriormente pasan para que podamos ver si el código que escribimos anteriormente funciona correctamente. Para ejecutar las pruebas en la carpeta , ``forms_tests``, cámbiese al directorio "pruebas" de Django y ejecute::
pt_br: Uma vez que tenha modificado o Django, precisamos ter ceteza que os testes que escreveu anteriormente passem, então você poder ver se o código que escrevemos anteriormente está funcionando corretamente. Para rodar os testes no diretório ``forms_tests`` , acesse (``cd``) o diretório ``tests/`` do Django e execute:

source: Oops, good thing we wrote those tests! You should still see one failure with the following exception::
es: ¡Vaya, que bien que escribimos esas pruebas! Aún debe ver 3 fallos con la siguiente excepción ::
pt_br: Opa, ainda bem que escrevemos esses testes! Você ainda deve ver uma falha com a seguinte exceção ::

source: We forgot to add the conditional statement in the ``__init__`` method. Go ahead and change ``self.prefix = prefix`` that is now on line 87 of ``django/forms/forms.py``, adding a conditional statement::
es: Olvidamos agregar la sentencia condicional en el `` método __init__``. Continúe y modifique `` self.prefix = prefix`` que ahora está en la línea 87 de ``django/forms/forms.py``, añadiendo una sentencia condicional ::
pt_br: Esquecemos de adicionar comando de condição no método ``__init__``. Vá em frente e altere ``self.prefix = prefix`` que está agora na linha 87 do ``django/forms/forms.py``, adicionando o comando de condição.
