Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: When Django finds a regular expression match, Django calls the specified view function, with an :class:`~django.http.HttpRequest` object as the first argument and any “captured” values from the regular expression as other arguments. If the regex uses simple captures, values are passed as positional arguments; if it uses named captures, values are passed as keyword arguments. We'll give an example of this in a bit.
es: Cuando Django encuentra una coincidencia de expresiones regulares, Django llama a la función vista especificada, con un: class: objeto `~ django.http.HttpRequest` como el primer argumento y los valores" capturados "de la expresión regular como otros argumentos. Si la expresión regular utiliza capturas sencillas, los valores se pasan como argumentos posicionales; si utiliza capturas identificadas, los valores se pasan como argumentos de palabra clave. Le daremos un ejemplo de esto en un momento.
pt_br: Quando o Django encontra uma expressão regular correspondente, o Django executa a função view especificada, com um objeto :class:`~django.http.HttpRequest` como o primeiro argumento e qualquer outro valor "capturados" da expressão regular como argumentos. Se a regex usa captura simples, os valores são passados ​​como argumentos posicionais; se ele usa capturas nomeadas, os valores são passados ​​como argumentos nomeados. Vamos dar um exemplo já já.

source: :func:`~django.conf.urls.url` argument: kwargs
es: :func: argumento `~django.conf.urls.url`:kwargs
pt_br: Argumento :func:`~django.conf.urls.url`: kwargs

source: Arbitrary keyword arguments can be passed in a dictionary to the target view. We aren't going to use this feature of Django in the tutorial.
es: Los argumentos arbitrarios de palabra clave se pueden pasar en un diccionario a la vista destino. No vamos a utilizar esta característica de Django en el tutorial.
pt_br: Argumentos nomeados arbitrários podem ser passadas em um dicionário para a view de destino. Nós não vamos usar este recurso do Django neste tutorial.

source: :func:`~django.conf.urls.url` argument: name
es: :func: argumento `~django.conf.urls.url`: nombre
pt_br: Argumento :func:`~django.conf.urls.url`: name

source: Naming your URL lets you refer to it unambiguously from elsewhere in Django especially templates. This powerful feature allows you to make global changes to the url patterns of your project while only touching a single file.
es: Identificar su URL le permite consultarla de forma inequívoca desde otras partes de Django sobre todo las plantillas. Esta potente característica le permite realizar cambios globales en los patrones de URL de su proyecto mientras modifica un único archivo.
pt_br: Nomear sua URL permite que você referencie ela de forma inequívoca a partir de outros lugares em Django especialmente templates. Este poderoso recurso permite que você faça alterações globais para os padrões de URL do seu projeto, enquanto apenas modificando um único arquivo.

source: When you're comfortable with the basic request and response flow, read :doc:`part 2 of this tutorial </intro/tutorial02>` to start working with the database.
es: Cuando se familiarice con el flujo básico de solicitud y respuesta, lea: doc: `la parte 2 del presente tutorial </intro/tutorial02> `Para empezar a trabajar con la base de datos.
pt_br: Quando estiver confortável com o básico da sequência de request e response, leia :doc:`part 2 of this tutorial </intro/tutorial02>` para começar a trabalhar com banco de dados.

source: Writing your first Django app, part 2
es: Escribir su primera aplicación en Django, parte 2
pt_br: Escrevendo sua primeira aplicação Django, parte 2

source: This tutorial begins where :doc:`Tutorial 1 </intro/tutorial01>` left off. We'll setup the database, create your first model, and get a quick introduction to Django's automatically-generated admin site.
es: Este tutorial comienza donde quedó: doc: `Tutorial 1 </intro/tutorial01>`. Vamos a configurar la base de datos, crear su primer modelo y recibir una rápida introducción al sitio administrativo generado automáticamente de Django.
pt_br: Este tutorial inicia onde :doc:`Tutorial 1 </intro/tutorial01>` termina. Iremos configurar um banco de dados, criar seu primeiro modelo, e ter uma rápida introdução ao admin site do Django automaticamente gerado.

source: Database setup
es: Configuración de la base de datos
pt_br: Configuração do banco de dados

source: Now, open up :file:`mysite/settings.py`. It's a normal Python module with module-level variables representing Django settings.
es: Ahora, abra el :archivo: `mysite / settings.py`. Es un módulo normal de Python con variables de nivel de módulo que representan la configuración de Django.
pt_br: Agora, abra o :file:`mysite/settings.py`. Ele é um módulo normal do Python com variáveis de módulo representando as configurações do Django.

source: By default, the configuration uses SQLite. If you're new to databases, or you're just interested in trying Django, this is the easiest choice. SQLite is included in Python, so you won't need to install anything else to support your database. When starting your first real project, however, you may want to use a more robust database like PostgreSQL, to avoid database-switching headaches down the road.
es: Por defecto, la configuración utiliza SQLite. Si no tiene mucha experiencia con bases de datos, o simplemente está interesado en probar Django, esta es la opción más fácil. SQLite está incluido en Python, por lo que no tendrá que instalar nada más para soportar su base de datos. Sin embargo, al iniciar su primer proyecto real, es posible que desee utilizar una base de datos más potente como PostgreSQL para evitar dolores de cabeza en el futuro por conmutación de base de datos .
pt_br: Por padrão, a configuração usa SQLite. Se você é novo em banco de dados ou você está apenas interessado em experimentar o Django, Está é a melhor escolha. O SQLite é incluído no Python, então você não precisará instalar nada para adicionar suporte a banco de dados. Contudo quando começar um projeto real, você vai precisar usa um banco de dados mais robusto como PostgreSQL, para evitar dores de cabeça com a mudança de banco de dados mais para frente.

source: If you wish to use another database, install the appropriate :ref:`database bindings <database-installation>` and change the following keys in the :setting:`DATABASES` ``'default'`` item to match your database connection settings:
es: Si desea utilizar otra base de datos, instale ligaduras apropiadas de base de datos <database-installation>`, y cambie las siguientes claves en el: configuración: ítem “predeterminado” de `Bases de datos` para ajustar la configuración de conexión de la base de datos.
pt_br: Se você quiser usar outro banco de dados, instale o de acordo :ref:`database bindings <database-installation>` e altere os seguinte parâmetros no item :setting:`DATABASES` ``'default'`` de acordo com o seu banco de dados.

source: :setting:`ENGINE <DATABASE-ENGINE>` -- Either ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql'``, ``'django.db.backends.mysql'``, or ``'django.db.backends.oracle'``. Other backends are :ref:`also available <third-party-notes>`.
es: :Configuración: `Motor <Motor de base de datos>` bien sea ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql_psycopg2'``, ``'django.db.backends.mysql'``, o ``'django.db.backends.oracle'``. Otros backends:ref: `también están disponibles <third-party-notes>`.
pt_br: :setting:`ENGINE <DATABASE-ENGINE>` -- ou mesmo ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql'``, ``'django.db.backends.mysql'``, ou ``'django.db.backends.oracle'``. Outros backends são :ref:`also available <third-party-notes>`.

source: :setting:`NAME` -- The name of your database. If you're using SQLite, the database will be a file on your computer; in that case, :setting:`NAME` should be the full absolute path, including filename, of that file. The default value, ``os.path.join(BASE_DIR, 'db.sqlite3')``, will store the file in your project directory.
es: :Configuración: `Nombre`, el nombre de su base de datos. Si está utilizando SQLite, la base de datos será un archivo en su computadora; en ese caso:configuración:`Nombre`debe ser la ruta absoluta completa, incluyendo el nombre del archivo de ese archivo. El valor predeterminado, ``os.path.join(BASE_DIR, 'db.sqlite3')``, guardará el archivo en el directorio de su proyecto.
pt_br: :setting:`NAME` -- O nome do seu banco de dados, se você estiver usando SQLite, o banco de dados será uma arquivo no seu computador; neste caso, :setting:`NAME` deve ser o caminho completo, incluindo o nome, para este arquivo. O valor padrão ``os.path.join(BASE_DIR, 'db.sqlite3')``, ira criar este arquivo no diretorio do seu projeto.

source: If you are not using SQLite as your database, additional settings such as :setting:`USER`, :setting:`PASSWORD`, and :setting:`HOST` must be added. For more details, see the reference documentation for :setting:`DATABASES`.
es: Si no está utilizando SQLite como su base de datos, se deben añadir ajustes adicionales tales como: `Usuario`, : configuración: `contraseña`, :configuración: `servidor`. Para más información, vea la documentación de referencia para: configuración: `Base de datos`.
pt_br: Caso não use o SQLite como banco de dados, configurações adicionais como :setting:`USER`, :setting:`PASSWORD`, e :setting:`HOST` deverão ser adicionadas. Para mais detalhes, veja a referência na documentação para :setting:`DATABASES`.

source: For databases other than SQLite
pt_br: Para fins diferentes da base de dados SQLite

source: If you're using a database besides SQLite, make sure you've created a database by this point. Do that with "``CREATE DATABASE database_name;``" within your database's interactive prompt.
pt_br: Caso use um banco de dados além do SQLite, tenha certeza que o banco de dados foi criado até este ponto. Faça isso com "``CREATE DATABASE database_name;``" dentro do prompt interativo do seu banco de dados.

source: Also make sure that the database user provided in :file:`mysite/settings.py` has "create database" privileges. This allows automatic creation of a :ref:`test database <the-test-database>` which will be needed in a later tutorial.
pt_br: Também se certifique que o "database user" indicado em :file:`mysite/settings.py` tenha a permissão "create database". Isso permite a criação automática de :ref:`test database <the-test-database>` o qual será necessário e um tutorial mais adiante.

source: If you're using SQLite, you don't need to create anything beforehand - the database file will be created automatically when it is needed.
es: Si estás usando SQLite, no es necesario crear nada de antemano - el archivo de base de datos se creará automáticamente cuando sea necesario.
pt_br: Se você está utilizando SQLite você não precisa criar nada de antemão - o arquivo do banco de dados será criado automaticamente quando ele for necessário.

source: While you're editing :file:`mysite/settings.py`, set :setting:`TIME_ZONE` to your time zone.
es: Mientras que usted está editando: archivo: `mysite / settings.py`, configure: configuración: `TIME_ZONE` a su zona horaria.
pt_br: Enquanto estiver editando :file:`mysite/settings.py`, mude :setting:`TIME_ZONE` para o seu fuso horário.

source: Also, note the :setting:`INSTALLED_APPS` setting at the top of the file. That holds the names of all Django applications that are activated in this Django instance. Apps can be used in multiple projects, and you can package and distribute them for use by others in their projects.
es: Además, observe que: configuración: la configuración de `aplicaciones instaladas` se encuentra en la parte superior del archivo. Esta contiene los nombres de todas las aplicaciones Django que están activadas en esta instancia de Django. Las aplicaciones se pueden usar en diversos proyectos y usted puede empaquetar y distribuirlas para que otras personas las puedan utilizar en sus proyectos.
pt_br: Também observe a configuração do :setting:`INSTALLED_APPS` na parte superior do arquivo. Ela possui os nomes de todas as aplicações Django ativas para essa instância do Django. Aplicações podem ser usadas em múltiplos projetos, e você pode empacotá-las e distribuí-las para uso por outros em seus projetos.

source: By default, :setting:`INSTALLED_APPS` contains the following apps, all of which come with Django:
es: Por defecto, : configuración: ` Aplicaciones instaladas` contienen las siguientes aplicaciones y Django viene equipado con todas ellas.
pt_br: Por padrão, o :setting:`INSTALLED_APPS` contém as seguintes aplicações, que vêm com o Django:

source: :mod:`django.contrib.admin` -- The admin site. You'll use it shortly.
es: : mod: `django.contrib.admin` - El sitio administrativo. Usted lo utilizará dentro de poco.
pt_br: :mod:`django.contrib.admin` -- O admin site. Irá usar isso em breve.

source: :mod:`django.contrib.auth` -- An authentication system.
es: : mod: `django.contrib.auth` - Un sistema de autenticación.
pt_br: :mod:`django.contrib.auth` -- Um sistema de autenticação.

source: :mod:`django.contrib.contenttypes` -- A framework for content types.
es: : mod: django.contrib.contenttypes` `- Un framework para los tipos de contenido.
pt_br: :mod:`django.contrib.contenttypes` -- Um framework para tipos de conteúdo.

source: :mod:`django.contrib.sessions` -- A session framework.
es: : mod: `django.contrib.sessions` - Un framework de sesión.
pt_br: :mod:`django.contrib.sessions` -- Um framework de sessão.

source: :mod:`django.contrib.messages` -- A messaging framework.
es: : mod: `django.contrib.messages` - Un framework de mensajería.
pt_br: :mod:`django.contrib.messages` -- Um framework de envio de mensagem.

source: :mod:`django.contrib.staticfiles` -- A framework for managing static files.
es: : mod: django.contrib.staticfiles` `- Un framework para la gestión de archivos estáticos.
pt_br: :mod:`django.contrib.staticfiles` -- Um framework para gerenciamento de arquivos estáticos.

source: These applications are included by default as a convenience for the common case.
es: Estas aplicaciones se incluyen de forma predeterminada como una conveniencia para el caso común.
pt_br: Estas aplicações são incluídas por padrão como uma conveniência para o caso comum.

source: Some of these applications make use of at least one database table, though, so we need to create the tables in the database before we can use them. To do that, run the following command:
es: Algunas de estas aplicaciones utilizan al menos una tabla de base de datos, por lo que necesitamos crear las tablas en la base de datos antes de poder utilizarlas. Para ello, ejecute el siguiente comando:
pt_br: Algumas dessas aplicações fazem uso de pelo menos uma tabela no banco de dados, assim sendo, nós precisamos criar as tabelas no banco de dados antes que possamos utilizá-las. Para isso rode o seguinte comando:

source: The :djadmin:`migrate` command looks at the :setting:`INSTALLED_APPS` setting and creates any necessary database tables according to the database settings in your :file:`mysite/settings.py` file and the database migrations shipped with the app (we'll cover those later). You'll see a message for each migration it applies. If you're interested, run the command-line client for your database and type ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MySQL), ``.schema`` (SQLite), or ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle) to display the tables Django created.
es: El:djadmin: comando `migrar` examina la: configuración: configuración de `Aplicaciones instaladas` y crea las tablas de base de datos necesarias según la configuración de base de datos en su :archivo: archivo `mysite/settings.py` y las migraciones de base de datos enviadas con la aplicación (trataremos este tema más tarde). Verá un mensaje para cada migración que aplique. Si está interesado, ejecute el cliente de línea de comandos para su base de datos y teclee ``\dt`` (PostgreSQL), ``Mostrar las tablas;`` (MySQL), ``.esquema`` (SQLite), o ``seleccionar el nombre de la tabla a partir de las tablas de usuario;`` (Oracle) para mostrar las tablas que creó Django.
pt_br: O comando :djadmin:`migrate` verifica a configuração em :setting:`INSTALLED_APPS` e cria qualquer tabela do banco de dados necessária de acordo com as configurações do banco de dados no seu arquivo :file:`mysite/settings.py` e as migrações que venham com a app (cobriremos isso mais tarde). É mostrado uma mensagem para cada migração que foi aplicada. Se lhe interessar, execute cliente de linha de comando para seu banco de dados e dgite ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MySQL), ``.schema`` (SQLite), ou ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle) para mostrar as tabelas mostradas pelo Django.

source: For the minimalists
es: Para los minimalistas
pt_br: Para os minimalistas

source: Like we said above, the default applications are included for the common case, but not everybody needs them. If you don't need any or all of them, feel free to comment-out or delete the appropriate line(s) from :setting:`INSTALLED_APPS` before running :djadmin:`migrate`. The :djadmin:`migrate` command will only run migrations for apps in :setting:`INSTALLED_APPS`.
es: Como dijimos anteriormente, las aplicaciones predeterminadas se incluyen para el caso común, pero no todos las necesitan. Si usted no necesita alguna o ninguna de ellas, no dude en comentar o borrar las línea(s) correspondientes desde: configuración: `Aplicaciones instaladas` antes de ejecutar: djadmin: ` migrar`. El:djadmin: comando `migrar` solo ejecutará migraciones para aplicaciones en:configuración: `Aplicaciones instaladas`.
pt_br: Como dissemos acima, as aplicações padrão são incluídas para casos comuns, mas nem todo mundo precisa delas. Se você não precisa de nenhuma delas, sinta-se livre para comentar ou deletar a(s) linha(s) apropriada(s) do :setting:`INSTALLED_APPS` antes de rodar o :djadmin:`migrate`. O comando :djadmin:`migrate` irá executar as migrações apenas para as aplicações que estiverem no :setting:`INSTALLED_APPS`.

source: Creating models
es: Creando modelos
pt_br: Criando modelos

source: Now we'll define your models -- essentially, your database layout, with additional metadata.
es: A continuación definiremos sus modelos, sobre todo su estructura de base de datos, con metadatos adicionales.
pt_br: Agora vamos definir seus modelos -- essencialmente, o layout do banco de dados, com metadados adicionais.

source: Philosophy
es: Filosofía
pt_br: Filosofia

source: A model is the single, definitive source of truth about your data. It contains the essential fields and behaviors of the data you're storing. Django follows the :ref:`DRY Principle <dry>`. The goal is to define your data model in one place and automatically derive things from it.
es: Un modelo es la fuente única y definitiva de información sobre sus datos. Contiene los campos esenciales y los comportamientos de los datos que usted guarda. Django sigue el: ref: `Principio DRY <dry> `. El objetivo es definir el modelo de datos en un solo lugar y derivar cosas de este automáticamente.
pt_br: Um model é a única e definitiva fonte de verdade sobre seus dados. Ele contém os campos essenciais e os comportamentos para os dados que você estiver armazenando. O Django segue o :ref:`princípio DRY <dry>`. O objetivo é definir seu modelo de dados em um único local e automaticamente derivar coisas a partir dele.

source: This includes the migrations - unlike in Ruby On Rails, for example, migrations are entirely derived from your models file, and are essentially just a history that Django can roll through to update your database schema to match your current models.
es: Este incluye las migraciones, a diferencia de Ruby On Rails, por ejemplo, las migraciones se derivan totalmente de su archivo de modelos y son esencialmente sólo un registro por el que Django puede pasar para actualizar su esquema de base de datos para que coincida con sus modelos actuales.
pt_br: Isso inclui as migrações - ao contrário em Ruby on Rails, por exemplo, as migrações são inteiramente derivada de seu arquivo de modelos, e são essencialmente apenas uma história que o Django pode avançar para atualizar o esquema de banco de dados para coincidir com seus modelos atuais.

source: In our simple poll app, we'll create two models: ``Question`` and ``Choice``. A ``Question`` has a question and a publication date. A ``Choice`` has two fields: the text of the choice and a vote tally. Each ``Choice`` is associated with a ``Question``.
es: En nuestra sencilla aplicación encuesta, vamos a crear dos modelos: `` Pregunta`` y ``Elección``. Una `` Pregunta`` tiene una pregunta y una fecha de publicación. Una `` Elección`` tiene dos campos: el texto de la elección y un conteo de votos. Cada `` Elección`` se asocia con una `` Pregunta``.
pt_br: Em nossa simples aplicação de enquete, nós iremos criar dois modelos: ``Question`` e ``Choice``. Uma ``Question`` tem uma pergunta e uma data de publicação. Uma ``Choice`` tem dois campos: o texto da escolha e um totalizador de votos. Cada ``Choice`` é associada a uma ``Question``.

source: These concepts are represented by simple Python classes. Edit the :file:`polls/models.py` file so it looks like this:
es: Estos conceptos se representan mediante clases sencillas de Python . Edite el: archivo: archivo `polls/models.py` de modo que se vea así:
pt_br: Esses conceitos são representados por simples classes Python. Edite o arquivo :file:`polls/models.py` de modo que fique assim::

source: The code is straightforward. Each model is represented by a class that subclasses :class:`django.db.models.Model`. Each model has a number of class variables, each of which represents a database field in the model.
es: El código es sencillo. Cada modelo está representado por una clase que subclasifica: class: `django.db.models.Model`. Cada modelo tiene una serie de variables de clase, cada uno de los cuales representa un campo de la base de datos en el modelo.
pt_br: O código é auto-explicativo. Cada model é representado por uma classe derivada da classe :class:`django.db.models.Model`. Cada model possui um número de atributos de classe, as quais por sua vez representam campos de banco de dados no model.

source: Each field is represented by an instance of a :class:`~django.db.models.Field` class -- e.g., :class:`~django.db.models.CharField` for character fields and :class:`~django.db.models.DateTimeField` for datetimes. This tells Django what type of data each field holds.
es: Cada campo está representado por una instancia de una: class: clase` ~django.db.models.Field` , por ejemplo, class:` ~ django.db.models.CharField` para campos de caracteres y: class: `~ django .db.models.DateTimeField` para datetimes. Esto le dice a Django qué tipo de datos de cada campo contiene.
pt_br: Cada campo é representado por uma instância de uma classe :class:`~django.db.models.Field` -- e.g., :class:`~django.db.models.CharField` para campos do tipo caractere e :class:`~django.db.models.DateTimeField` para data/hora. Isto diz ao Django qual tipo de dado cada campo contém.
