Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: And of course, we will add some tests, to check that a ``Question`` whose ``pub_date`` is in the past can be displayed, and that one with a ``pub_date`` in the future is not:
es: Y, por supuesto, vamos a agregar algunas pruebas, para comprobar que una ``Pregunta`` cuya `` pub_date`` que está en el pasado se puede mostrar, y que una con un `` pub_date`` en el futuro no se puede:
pt_br: E claro, adicionaremos alguns testes, para verificar que uma ``Question`` a qual seu ``pub_date`` está no passado pode ser mostrada, e que uma com ``pub_date``no futuro não pode:

source: Ideas for more tests
es: Ideas para más pruebas
pt_br: Ideias para mais testes

source: We ought to add a similar ``get_queryset`` method to ``ResultsView`` and create a new test class for that view. It'll be very similar to what we have just created; in fact there will be a lot of repetition.
es: Debemos agregar un método `` get_queryset`` similar a `` ResultsView`` y crear una nueva clase de prueba para esa vista. Va a ser muy similar a lo que acabamos de crear; de hecho, habrá mucha repetición.
pt_br: Devemos adicionar um método similar ao ``get_queryset`` ao ``ResultsView`` e criar uma nova classe de teste para essa "view". Isso será muito parecido com o que criamos há pouco; defato terá muitas repetições.

source: We could also improve our application in other ways, adding tests along the way. For example, it's silly that ``Questions`` can be published on the site that have no ``Choices``. So, our views could check for this, and exclude such ``Questions``. Our tests would create a ``Question`` without ``Choices`` and then test that it's not published, as well as create a similar ``Question`` *with* ``Choices``, and test that it *is* published.
es: También podríamos mejorar nuestra aplicación de otras maneras, agregando pruebas a lo largo del camino. Por ejemplo, es una tontería que se puedan publicar``Preguntas`` en el sitio que no tienen ``Opciones``. Por lo tanto, nuestras vistas podrían comprobar esto y excluir dichas ``Preguntas``. Nuestras pruebas crearían una ``Pregunta`` sin ``opciones`` y luego probarían que no está publicada, así como crearían una ``Pregunta`` similar con ``opciones`` y probarían que está publicada.
pt_br: Podemos também melhorar nossa aplicação de várias outras maneiras, adicionando testes no caminho. Por exemplo é estranho que ``Questions`` possam ser publicadas no site sem que tenham ``Choices``. Então, nossas "views" podem verificar isso, e excluir tais ``Questions``. Nossos testes podem criar uma ``Question`` sem ``Choices`` e então testar que não estão publicadas, também criar uma ``Question`` parecida *com* ``Choices``, e testar se *estão* publicadas.

source: Perhaps logged-in admin users should be allowed to see unpublished ``Questions``, but not ordinary visitors. Again: whatever needs to be added to the software to accomplish this should be accompanied by a test, whether you write the test first and then make the code pass the test, or work out the logic in your code first and then write a test to prove it.
es: Quizás se les deba permitir a los usuarios registrados en el sitio administrativo ver las ``Preguntas`` que no han sido publicadas, pero no a los visitantes ordinarios. Una vez más: lo que se tenga que agregar al software para lograr esto debe ir acompañado de una prueba, si usted escribe la prueba primero y luego hace que el código pase la prueba, o primero soluciona la lógica en el código y luego escribe una prueba para probarlo.
pt_br: Talvez usuários registrados no admin devam ser permitidos a ver ``Questions`` não publicadas, mas não os visitantes comuns. Denovo: independente da necessidade a serem adicionadas ao software para que isso seja realizado, isso deve ser acompanhado por um teste, não importando se você escreve o teste primeiro e então faz o código para passar no teste, ou escreva o código da lógica primeiro e então escreva o teste para fazer a prova.

source: At a certain point you are bound to look at your tests and wonder whether your code is suffering from test bloat, which brings us to:
es: En un momento dado usted está obligado a examinar sus pruebas y a preguntarse si su código sufre de exceso de pruebas, lo que nos lleva a:
pt_br: Em um certo ponto, você precisará olhar seus testes e se perguntar se o seu código está sofrendo de inchaço de testes, o que nos trás a:

source: When testing, more is better
es: Cuando se trata de pruebas, más es mejor
pt_br: Quando estiver testando, mais é melhor

source: It might seem that our tests are growing out of control. At this rate there will soon be more code in our tests than in our application, and the repetition is unaesthetic, compared to the elegant conciseness of the rest of our code.
es: Podría parecer que nuestras pruebas están creciendo fuera de control. A este paso pronto habrá más código en nuestras pruebas que en nuestra aplicación y la repetición es poco estética, en comparación con la refinida concisión del resto de nuestro código.
pt_br: Pode parecer que nossos testes estão crescendo fora de controle. Nessa taxa teremos logo mais código nos testes do que em nossa aplicação, e a repetição não é muito estética, comparado a concisa elegância do resto do nosso código.

source: **It doesn't matter**. Let them grow. For the most part, you can write a test once and then forget about it. It will continue performing its useful function as you continue to develop your program.
es: No importa. Deje que crezcan. Por lo general, usted puede escribir una prueba una vez y luego olvidarse de ella. Esta seguirá cumpliendo su función útil mientras usted continúe desarrollando su programa.
pt_br: **Isso não importa**. Deixe eles crescerem. Por boa parte do tempo, você pode escrever um teste uma vez e então esquecer dele. Ele vai continuar a executar sua função útil enquanto você continua a escrever seu programa.

source: Sometimes tests will need to be updated. Suppose that we amend our views so that only ``Questions`` with ``Choices`` are published. In that case, many of our existing tests will fail - *telling us exactly which tests need to be amended to bring them up to date*, so to that extent tests help look after themselves.
es: A veces las pruebas tendrán que ser actualizadas. Supongamos que modificamos nuestras vistas de modo que sólo las ``Preguntas`` con ``opciones`` se publican. En ese caso, muchas de nuestras pruebas existentes fallarán, indicándonos exactamente qué pruebas necesitan ser modificadas para actualizarlas, de modo que hasta ese grado las pruebas ayudan a ocuparse de sí mismas.
pt_br: Algumas vezes os testes precisarão ser atualizados. Suponha que emendamos nossas "views" para que somente ``Questions``com ``Choices`` são publicadas. Neste caso, muitos dos nossos testes existentes irão falahar - *nos dizendo exatamente quais testes precisam ter ajustes para que sejam atualizados*, assim que os próprios testes auxiliam na manutenção deles mesmos.

source: At worst, as you continue developing, you might find that you have some tests that are now redundant. Even that's not a problem; in testing redundancy is a *good* thing.
es: En el peor de los casos, a medida que continúe desarrollando, usted podría encontrar que tiene algunas pruebas que ahora son redundantes. Incluso eso no es un problema; cuando se trata de pruebas, la redundancia es una buena cosa.
pt_br: Na pior das hipóteses, ao continuar a desenvolver, você talvez encontre alguns tests que são reduntantes agora. Mesmo isso não é um problema; em testes redundância é uma boa coisa.

source: As long as your tests are sensibly arranged, they won't become unmanageable. Good rules-of-thumb include having:
es: Siempre y cuando las pruebas se organicen de forma razonablementte, no van a ser difíciles de manejar. Las reglas básicas de uso incluyen el hecho de tener:
pt_br: Enquanto seus testes estiverem organizados sensatamente, eles não vão se tornar desorganizados. Boas práticas incluem ter:

source: a separate ``TestClass`` for each model or view
es: una `` TestClass`` independiente para cada modelo o vista
pt_br: um "TestClass" separado para cada modelo ou view

source: a separate test method for each set of conditions you want to test
es: un método de prueba independiente para cada conjunto de condiciones que usted quiere probar
pt_br: um método de teste separado para cada conjunto de condições que você quer testar

source: test method names that describe their function
es: nombres de los métodos de prueba que describan su función
pt_br: nomes de métodos de teste que descrevem a sua função

source: Further testing
es: Pruebas adicionales
pt_br: Mais testes

source: This tutorial only introduces some of the basics of testing. There's a great deal more you can do, and a number of very useful tools at your disposal to achieve some very clever things.
es: Este tutorial sólo presenta algunos de los temas fundamentales de las pruebas. Hay mucho más que usted puede hacer y una serie de herramientas muy útiles a su disposición para lograr algunas cosas muy interesantes.
pt_br: Esse tutorial apenas introduz alguns conceitos básicos de testes. Há muito mais do que você pode fazer, e uma série de ferramentas muito úteis à sua disposição para conseguir algumas coisas muito inteligentes.

source: For example, while our tests here have covered some of the internal logic of a model and the way our views publish information, you can use an "in-browser" framework such as Selenium_ to test the way your HTML actually renders in a browser. These tools allow you to check not just the behavior of your Django code, but also, for example, of your JavaScript. It's quite something to see the tests launch a browser, and start interacting with your site, as if a human being were driving it! Django includes :class:`~django.test.LiveServerTestCase` to facilitate integration with tools like Selenium.
es: Por ejemplo, ya que nuestras pruebas aquí han tratado algo de la lógica interna de un modelo y la forma en que nuestras vistas publican información, usted puede utilizar un framework "dentro del navegador" como Selenium para probar la forma en que su HTML en realidad se crea en un navegador. Estas herramientas le permiten comprobar no sólo el comportamiento de su código Django, sino también, por ejemplo, el de su JavaScript. Es impresionante ver que las pruebas inicien el navegador, y que empiece a interactuar con el sitio, como si un ser humano lo manejara! Django incluye: class: `~ django.test.LiveServerTestCase` para facilitar la integración con herramientas como Selenium.
pt_br: Por exemplo, enquanto nossos testes aqui tem coberto algumas lógicas internas de um modelo e a informação publicada nas nossas "views", você pode usar um framework para browsers como o Selenium_ para testar a maneira como seu HTML é processado de verdade pelo browser. Isso permite a você testar não somente o comportamente do seu código Django, mas também, por exemplo, do seu javascript. É bem legal ver seus testes iniciarem um navegador, e começar a intergir com seu site, como se fosse um ser humano guiando! O Django inclue a :class:`~django.test.LiveServerTestCase` para facilitar a integração com ferramentas como o Selenium.

source: If you have a complex application, you may want to run tests automatically with every commit for the purposes of `continuous integration`_, so that quality control is itself - at least partially - automated.
es: Si usted tiene una aplicación compleja, es posible que desee ejecutar las pruebas de forma automática con cada commit a efectos de `integración continua `, por lo que el control de calidad es en sí , al menos parcialmente, automatizado.
pt_br: Se você tem uma aplicação complexa, você pode querer rodar testes automaticamente com cada commit pelo propósito de `integração contínua`_, e o próprio controle de qualidade - ao menos parcialmente - é automatizado.

source: A good way to spot untested parts of your application is to check code coverage. This also helps identify fragile or even dead code. If you can't test a piece of code, it usually means that code should be refactored or removed. Coverage will help to identify dead code. See :ref:`topics-testing-code-coverage` for details.
es: Una buena manera de detectar las partes de su aplicación que no han sido probadas es comprobar la cobertura de código. Esto también ayuda a identificar el código frágil o incluso muerto. Si no puede probar un trozo de código, por lo general significa que el código debe ser reestructurado o eliminado. La cobertura ayudará a identificar el código muerto. Consulte: ref: `topics-testing-code-coverage` para más detalles.
pt_br: Uma boa forma de encontrar partes não testadas de sua aplicação é verificar a cobertura de código. Isto também ajuda a identificar códigos frágeis ou mesmo morto. Se você não pode testar um pedaço do código, isso normalmente significa que o código precisa ser refatorado ou removido. Cobertura vai ajudar a identificar código morto. Veja :ref:`topics-testing-code-coverage` para mais detalhes.

source: :doc:`Testing in Django </topics/testing/index>` has comprehensive information about testing.
es: : doc: `Las pruebas en Django </topics/testing/index> `tiene información completa acerca de las pruebas.
pt_br: :doc:`Testes no django </topic/testing/index>` tem informações sobre testes.

source: For full details on testing, see :doc:`Testing in Django </topics/testing/index>`.
es: Para más detalles sobre las pruebas, consulte: doc: `Las pruebas en Django </topics/testing/index> `.
pt_br: Para maiores detalhes sobre testing, veja :doc:`Testando no Django </topics/testing/index>`.

source: When you're comfortable with testing Django views, read :doc:`part 6 of this tutorial</intro/tutorial06>` to learn about static files management.
es: Cuando usted esté familiarizado con las pruebas de las vistas de Django, lea la: doc: `parte 6 de este tutorial </intro/tutorial06> `para aprender sobre la gestión de los archivos estáticos.
pt_br: Quando estiver confortável testando "views" Django, leia: doc:`parte 6 deste tutorial</intro/tutorial06>` para aprender sobre gerenciamente de arquivos estáticos.

source: Writing your first Django app, part 6
es: Escribir tu primera aplicación en Django, parte 6
pt_br: Escrevendo sua primeira aplicação Django, parte 6

source: This tutorial begins where :doc:`Tutorial 5 </intro/tutorial05>` left off. We've built a tested Web-poll application, and we'll now add a stylesheet and an image.
es: Este tutorial comienza donde quedó:doc:`Tutorial 5 </intro/tutorial05>`. Hemos creado una aplicación Web encuestas probada y a continuación vamos a agregar una hoja de estilo y una imagen.
pt_br: Este tutorial começa onde o :doc:`Tutorial 5 </intro/tutorial05>` parou. Nós construímos uma aplicação web de enquete testada, e agora nós vamos adicionar uma folha de estilos e uma imagem.

source: Aside from the HTML generated by the server, web applications generally need to serve additional files — such as images, JavaScript, or CSS — necessary to render the complete web page. In Django, we refer to these files as "static files".
es: Aparte del HTML generado por el servidor, las aplicaciones Web por lo general, tienen que proporcionar archivos adicionales tales como imágenes, JavaScript o CSS necesarios para crear la página web completa. En Django, nos referimos a estos archivos como "archivos estáticos".
pt_br: Além do HTML gerado pelo servidor, aplicações web normalmente precisam servir outros arquivos -- como imagens, JavaScript, ou CSS -- necessário para renderizar a página web completa. No Django, nós chamamos estes arquivos de "arquivos estáticos".

source: For small projects, this isn't a big deal, because you can just keep the static files somewhere your web server can find it. However, in bigger projects -- especially those comprised of multiple apps -- dealing with the multiple sets of static files provided by each application starts to get tricky.
es: Para proyectos pequeños, esto no es un gran problema, ya que usted puede guardar los archivos estáticos en algún lugar donde su servidor web pueda encontrarlos. Sin embargo, en proyectos más grandes; especialmente aquellos compuestos de múltiples aplicaciones, lidiar con los distintos conjuntos de archivos estáticos proporcionados por cada aplicación empieza a ser difícil.
pt_br: Para projetos pequenos, isto não é um grande problema, porque você pode simplesmente manter os arquivos estáticos em algum lugar que o seu servidor web consegue encontrar. Entretanto, em grandes projetos -- especialmente aqueles comprometidos com múltiplas apps -- lidar com múltiplos conjuntos de arquivos estáticos provindos de cada aplicação começa a se tornar complicado.

source: That's what ``django.contrib.staticfiles`` is for: it collects static files from each of your applications (and any other places you specify) into a single location that can easily be served in production.
es: Eso es para lo que `` django.contrib.staticfiles`` es: Recoge los archivos estáticos de cada una de sus aplicaciones (y de cualquier otro lugar que usted especifique) en un solo lugar que se puede proporcionar fácilmente en la producción.
pt_br: É para isto que o ``django.contrib.staticfiles`` serve: ele coleciona os arquivos estáticos de cada uma de suas aplicações (e qualquer outro lugar que você especifique) em um único local que pode ser facilmente servido em produção.

source: Customize your *app's* look and feel
es: Personalice la apariencia de su aplicación
pt_br: Personalize a aparência do seu *app*

source: First, create a directory called ``static`` in your ``polls`` directory. Django will look for static files there, similarly to how Django finds templates inside ``polls/templates/``.
es: En primer lugar, cree un directorio llamado ``estáticos`` en su directorio ``encuestas``. Django buscará archivos estáticos allí, del mismo modo cómo Django encuentra las plantillas dentro de ``polls/templates/``.
pt_br: Primeiro, crie um diretório chamado ``static`` no seu diretório ``polls``. O Django vai procurar os arquivos estáticos ali, de maneira similar a como o Django encontra os templates dentro de ``polls/templates/``.

source: Django's :setting:`STATICFILES_FINDERS` setting contains a list of finders that know how to discover static files from various sources. One of the defaults is ``AppDirectoriesFinder`` which looks for a "static" subdirectory in each of the :setting:`INSTALLED_APPS`, like the one in ``polls`` we just created. The admin site uses the same directory structure for its static files.
es: La :configuración: opción `STATICFILES_FINDERS` de Django contiene una lista de buscadores que saben cómo hallar archivos estáticos de diversas fuentes. Uno de los predeterminados es `` AppDirectoriesFinder`` que busca un subdirectorio "estáticos" en cada una de las:configuración: `INSTALLED_APPS`, como el que está en "encuestas" que acabamos de crear. El sitio de administrativo utiliza la misma estructura de directorios para sus archivos estáticos.
pt_br: A configuração :setting:`STATICFILES_FINDERS` do Django contém uma lista de buscadores que sabem como descobrir os arquivos estáticos de diversas fontes. Um dos padrões é o ``AppDirectoriesFinder`` que procura por um subdiretório "static" em cada uma das :setting:`INSTALLED_APPS`, como a ``polls`` que nós acabamos de criar. O site admin usa a mesma estrutura de diretórios para os arquivos estáticos.

source: Within the ``static`` directory you have just created, create another directory called ``polls`` and within that create a file called ``style.css``. In other words, your stylesheet should be at ``polls/static/polls/style.css``. Because of how the ``AppDirectoriesFinder`` staticfile finder works, you can refer to this static file in Django simply as ``polls/style.css``, similar to how you reference the path for templates.
es: Dentro del directorio `` estáticos`` que usted acaba de crear, cree otro directorio llamado``encuestas`` y dentro de ese cree un archivo llamado `` style.css``. En otras palabras, su hoja de estilo debe estar en ``polls/static/polls/style.css``. Debido a la forma en cómo funciona el buscador de archivos estáticos ``AppDirectoriesFinder`` usted puede consultar este archivo estático en Django simplemente como ``polls/style.css``, igual como usted consulta la ruta de acceso de las plantillas.
pt_br: Com o diretório ``static`` que você acabou de criar, crie outro diretório chamado ``polls`` e com ele crie um arquivo chamado ``style.css``. Em outras palavras, o seu stylesheet deve ficar em ``polls/static/polls/style.css``. Por conta da forma que o buscador de arquivos estáticos ``AppDirectoriesFinder`` funciona, você pode referênciar este arquivo estático no Django simplesmente como ``polls/style.css``, similarmente como você referência o caminho para templates.

source: Static file namespacing
es: Espacio de nombres de archivo estático
pt_br: Arquivo estático namespace

source: Just like templates, we *might* be able to get away with putting our static files directly in ``polls/static`` (rather than creating another ``polls`` subdirectory), but it would actually be a bad idea. Django will choose the first static file it finds whose name matches, and if you had a static file with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those static files inside *another* directory named for the application itself.
es: Al igual que las plantillas, podemos considerar poner nuestros archivos estáticos directamente en ``polls/static`` (en lugar de crear otro subdirectorio ``encuestas``), pero en realidad sería una mala idea. Django elegirá el primer archivo estático que encuentre cuyo nombre coincida, y si usted tuviera un archivo estático con el mismo nombre en una aplicación diferente, Django sería incapaz de distinguir entre ellos. Tenemos que ser capaces de indicarle a Django el correcto, y la forma más fácil de asegurar esto es organizándolos. Es decir, poniendo los archivos estáticos dentro de otro directorio con el nombre de la aplicación.
pt_br: Assim como templates, nós *podemos* nos safar somente colocando os arquivos estáticos diretamente em ``polls/static`` (ao invés de criar outro subdiretório ``polls``), mas na verdade isso seria uma má idéia. O Django vai escolher o primeiro o arquivo estático que encontrar com aquele nome, e se você tem um arquivo estático com aquele mesmo nome em uma aplicação *diferente*, o Django não conseguiria distinguir entre elas. Nós precisamos poder apontar o Django para o arquivo correto, e a forma mais fácil de garantir isso é por usar um *namespacing* com eles. Isto é, colocando aqueles arquivos estáticos dentro de *outro* diretório com o mesmo nome da aplicação.

source: Put the following code in that stylesheet (``polls/static/polls/style.css``):
es: Introduzca el siguiente código en esa hoja de estilo (``polls/static/polls/style.css``):
pt_br: Coloque o seguinte código na sua folha de estilo (``polls/static/polls/style.css``):

source: Next, add the following at the top of ``polls/templates/polls/index.html``:
es: A continuación, agregue lo siguiente en la parte superior de ``polls/templates/polls/index.html``:
pt_br: Em seguida, adicione o seguinte no topo de "polls//templates/polls/index.html":
