Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: Note that once we've done this in all these views, we no longer need to import :mod:`~django.template.loader` and :class:`~django.http.HttpResponse` (you'll want to keep ``HttpResponse`` if you still have the stub methods for ``detail``, ``results``, and ``vote``).
es: Tenga en cuenta que una vez que hemos hecho esto en todas estas vistas, ya no necesitamos importar: mod:`~django.template.loader` y clase:`~django.http.HttpResponse` (usted querrá continuar ``HttpResponse`` si usted todavía tiene los métodos stub para "detalle", "resultados" `` y "voto").
pt_br: Note que uma vez que você tiver feito isto em todas as views, nós não vamos mais precisar importar :mod:`~django.template.loader` e :class:`~django.http.HttpResponse` (você vai querer manter ``HttpResponse`` se você ainda tiver os métodos criados para ``detail``, ``results``, e ``vote``).

source: The :func:`~django.shortcuts.render` function takes the request object as its first argument, a template name as its second argument and a dictionary as its optional third argument. It returns an :class:`~django.http.HttpResponse` object of the given template rendered with the given context.
es: La :func: función `~django.shortcuts.render` toma el objeto solicitado como su primer argumento, un nombre de plantilla como su segundo argumento y un diccionario como su tercer argumento opcional. Ella devuelve un: clase: objeto `~django.http.HttpResponse` de la plantilla determinada creada con el contexto dado.
pt_br: A função :func:`~django.shortcuts.render` recebe o nome do template como primeiro argumento e um dicionário opcional como segundo argumento. Ele retorna um objeto :class:`~django.http.HttpResponse` do template informado renderizado com o contexto determinado.

source: Raising a 404 error
es: Lanzar un error 404
pt_br: Levantando um erro 404

source: Now, let's tackle the question detail view -- the page that displays the question text for a given poll. Here's the view:
es: Ahora vamos a abordar la vista detallada de la pregunta; la página que muestra el texto de pregunta para una encuesta determinada. Aquí está la vista:
pt_br: Agora, vamos abordar a view de detalhe de pergunta -- a página que mostra as questões para uma enquete lançada. Aqui esta a view::

source: The new concept here: The view raises the :exc:`~django.http.Http404` exception if a question with the requested ID doesn't exist.
es: El nuevo concepto aquí: La vista lanza la :exc: excepción `~django.http.Http404` si no existe una pregunta con la ID solicitada.
pt_br: Um novo conceito aqui: A view levanta uma exceção :exc:`~django.http.Http404` se a enquete com ID requisitado não existir.

source: We'll discuss what you could put in that ``polls/detail.html`` template a bit later, but if you'd like to quickly get the above example working, a file containing just:
es: Hablaremos de lo que podría poner en esa plantilla ``polls/detail.html`` un poco más tarde, pero si desea empezar a trabajar con el ejemplo anterior, un archivo que contiene simplemente:
pt_br: Nós iremos discutir o que você poderia colocar no template ``polls/detail.html`` mais tarde, mas se você gostaria de ter o exemplo acima funcionando rapidamente, um arquivo contendo:

source: will get you started for now.
es: le ayudará a empezar por ahora.
pt_br: irá ajudar a começar por enquanto.

source: A shortcut: :func:`~django.shortcuts.get_object_or_404`
es: Un atajo:func:`~django.shortcuts.get_object_or_404`
pt_br: Um atalho: :func:`~django.shortcuts.get_object_or_404`

source: It's a very common idiom to use :meth:`~django.db.models.query.QuerySet.get` and raise :exc:`~django.http.Http404` if the object doesn't exist. Django provides a shortcut. Here's the ``detail()`` view, rewritten:
es: Es un lenguaje muy común para utilizar: método: `~ django.db.models.query.QuerySet.get` y lanzar la : excepción:` ~ django.http.Http404` si no existe el objeto. Django proporciona un atajo. Aquí está la vista "detalle ()", reescrita:
pt_br: É um estilo muito comum usar :meth:`~django.db.models.QuerySet.get` e levantar uma exceção :exc:`~django.http.Http404` se o objeto não existir. O Django fornece um atalho para isso. Aqui esta a view ``detail()``, reescrita:

source: The :func:`~django.shortcuts.get_object_or_404` function takes a Django model as its first argument and an arbitrary number of keyword arguments, which it passes to the :meth:`~django.db.models.query.QuerySet.get` function of the model's manager. It raises :exc:`~django.http.Http404` if the object doesn't exist.
es: La :func: función `~django.shortcuts.get_object_or_404` toma un modelo Django como su primer argumento y un número arbitrario de argumentos de palabra clave que pasa a la: método: función `~django.db.models.query.QuerySet.get` del administrador del modelo. Lanza la :excepción:`~django.http.Http404` si no existe el objeto.
pt_br: A função :func:`~django.shortcuts.get_object_or_404` recebe um modelo do Django como primeiro argumento e um número arbitrário de argumentos chave, que ele passa para a função do módulo :meth:`~django.db.models.QuerySet.get`. E levanta uma exceção :exc:`~django.http.Http404` se o objeto não existir.

source: Why do we use a helper function :func:`~django.shortcuts.get_object_or_404` instead of automatically catching the :exc:`~django.core.exceptions.ObjectDoesNotExist` exceptions at a higher level, or having the model API raise :exc:`~django.http.Http404` instead of :exc:`~django.core.exceptions.ObjectDoesNotExist`?
es: ¿Por qué utilizamos una función auxiliar:func:`~django.shortcuts.get_object_or_404` en lugar de capturar las :exc: excepciones `~django.core.exceptions.ObjectDoesNotExist` en un nivel superior, o tener que mostrar la API modelo:exc: `~django.http.Http404` en vez de :exc:`~django.core.exceptions.ObjectDoesNotExist`?
pt_br: Porquê usamos uma função auxiliar :func:`~django.shortcuts.get_object_or_404` ao invés de automaticamente capturar as exceções :exc:`~django.core.exceptions.ObjectDoesNotExist` em alto nível ou fazer a API do modelo levantar :exc:`~django.http.Http404` ao invés de :exc:`~django.core.exceptions.ObjectDoesNotExist`?

source: Because that would couple the model layer to the view layer. One of the foremost design goals of Django is to maintain loose coupling. Some controlled coupling is introduced in the :mod:`django.shortcuts` module.
es: Debido a que eso acoplaría la capa de modelos con la capa de vistas, uno de los objetivos de diseño más destacados de Django es mantener el bajo acoplamiento. Algún acoplamiento controlado se introduce en el :mod: módulo `django.shortcuts`.
pt_br: Porque isso seria acoplar a camada de modelo com a camada de visão. Um dos principais objetivo do design do Django é manter o baixo acoplamento. Alguns acoplamento controlado é introduzido no módulo :mod:`django.shortcuts`.

source: There's also a :func:`~django.shortcuts.get_list_or_404` function, which works just as :func:`~django.shortcuts.get_object_or_404` -- except using :meth:`~django.db.models.query.QuerySet.filter` instead of :meth:`~django.db.models.query.QuerySet.get`. It raises :exc:`~django.http.Http404` if the list is empty.
es: También hay una: func: `~ django.shortcuts.get_list_or_404` función, que funciona igual: func:` ~ django.shortcuts.get_object_or_404` - excepto usando: meth: `~ django.db.models.query.QuerySet. filter`en lugar de: meth: `~ django.db.models.query.QuerySet.get`. Lanza la : excepción: `~ django.http.Http404` si la lista está vacía.
pt_br: Existe também a função :func:`~django.shortcuts.get_list_or_404`, que trabalhada da mesma forma que :func:`~django.shortcuts.get_object_or_404` -- com a diferença de que ela usa :meth:`~django.db.models.QuerySet.filter` ao invés de :meth:`~django.db.models.QuerySet.get`. Ela levanta :exc:`~django.http.Http404` se a lista estiver vazia.

source: Use the template system
es: Utilice el sistema de plantillas
pt_br: Use o sistema de template

source: Back to the ``detail()`` view for our poll application. Given the context variable ``question``, here's what the ``polls/detail.html`` template might look like:
es: Vuelva a la vista ``detalle()`` para nuestra aplicación encuesta. Teniendo en cuenta la variable de contexto `` pregunta``, así es como la plantilla` podría verse:
pt_br: De volta para a view ``detail()`` da nossa aplicação de enquentes. Dada a variável de contexto ``question``, aqui está como o template ``polls/detail.htm`` deve ser:

source: The template system uses dot-lookup syntax to access variable attributes. In the example of ``{{ question.question_text }}``, first Django does a dictionary lookup on the object ``question``. Failing that, it tries an attribute lookup -- which works, in this case. If attribute lookup had failed, it would've tried a list-index lookup.
es: El sistema de plantillas utiliza la sintaxis de búsqueda con puntos para acceder a los atributos de variables. En el ejemplo de `{{question.question_text}}` `, Django primero realiza una consulta en el diccionario sobre el objeto` ``pregunta``. Si esto falla, intenta una búsqueda de atributos que en este caso funciona. Si la búsqueda de atributos hubiera fallado, hubiera intentado una búsqueda de índice de lista.
pt_br: O sistema de templates usa uma sintaxe separada por pontos para acessar os atributos da variável. No exemplo de ``{{ question.question_text }}``, primeiro o Django procura por dicionário no objeto ``question``. Se isto falhar, ele tenta procurar por um atributo -- que funciona, neste caso. Se a procura do atributo também falhar, ele irá tentar uma chamada do tipo list-index.

source: Method-calling happens in the :ttag:`{% for %}<for>` loop: ``question.choice_set.all`` is interpreted as the Python code ``question.choice_set.all()``, which returns an iterable of ``Choice`` objects and is suitable for use in the :ttag:`{% for %}<for>` tag.
es: El llamado del método ocurre en el: ttag: bucle `{% for%} <for>`: ` `question.choice_set.all`` se interpreta como el código Python` `question.choice_set.all ()` `, que devuelve un iterable de objetos "Elección" y es adecuado para usarse en la: TTAG : `{% for%} <for> `etiqueta.
pt_br: A chamada do método acontece no laço :ttag:`{% for %}<for>`: ``poll.choice_set.all`` é interpretado como código Python ``poll.choice_set.all()``, que retorna objetos ``Choice`` iteráveis que são suportado para ser usado na tag :ttag:`{% for %}`.

source: See the :doc:`template guide </topics/templates>` for more about templates.
es: Vea el: doc: `guía de plantillas </topics/templates>` para más información sobre las plantillas.
pt_br: Veja o :doc:`guia de templates </topics/templates>` para maiores detalhes sobre templates.

source: Removing hardcoded URLs in templates
es: Quitar URLs codificadas de forma rígida en las plantillas
pt_br: Removendo URLs codificados nos templates

source: Remember, when we wrote the link to a question in the ``polls/index.html`` template, the link was partially hardcoded like this:
es: Recuerde que cuando escribimos el enlace para una pregunta en la plantilla ``polls/index.html``, el enlace estaba parcialmente codificado de forma fija como este:
pt_br: Lembre-se, quando escrevemos o link para uma pergunta no template ``polls/templates/index.html``, o link foi parcialmente codificado como este:

source: The problem with this hardcoded, tightly-coupled approach is that it becomes challenging to change URLs on projects with a lot of templates. However, since you defined the name argument in the :func:`~django.conf.urls.url` functions in the ``polls.urls`` module, you can remove a reliance on specific URL paths defined in your url configurations by using the ``{% url %}`` template tag:
es: El problema con este método de codificación fija y estrechamente acoplada es que se hace difícil modificar las URLs en proyectos que tengan muchas plantillas. Sin embargo, puesto que usted definió el argumento de nombre en las :func: funciones `~django.conf.urls.url` en el módulo ``polls.urls``, usted puede eliminar la seguridad de rutas URL específicas definida en su configuración de URL usando la etiqueta de plantilla ``{% url %}``.
pt_br: O problema com esta abordagem, muita acoplada é que ele se torna um desafio para mudar URLs em projetos com um monte de templates. No entanto, uma vez que você definiu o argumento nome na :func:`~django.conf.urls.url` no módulo ``polls.urls``, você pode remover uma dependência de caminhos de URL específicos definidos em suas configurações de URL usando a tag de template ``{% url%}`:

source: The way this works is by looking up the URL definition as specified in the ``polls.urls`` module. You can see exactly where the URL name of 'detail' is defined below::
es: La forma como esto funciona es buscando la definición de la URL como se específica en el módulo ``polls.urls``. Usted puede ver exactamente donde se define el nombre de la URL de ‘detalle’ a continuación::
pt_br: A maneira como isso funciona é, observando as definições de URL como especificado no módulo ``polls.urls``. Você pode ver exatamente onde o nome de URL 'detalhe' é definido a seguir ::

source: If you want to change the URL of the polls detail view to something else, perhaps to something like ``polls/specifics/12/`` instead of doing it in the template (or templates) you would change it in ``polls/urls.py``::
es: Si desea modificar la URL de la vista detallada de las encuestas a algo diferente, quizás a algo como ``polls/specifics/12/``, en lugar de hacerlo en la plantilla (o plantillas), usted la modificaría en ``polls/urls.py``::
pt_br: Se você quiser alterar a URL das views de detalhe da enquete para outra coisa, talvez para algo como ``polls/specifics/12/`` em vez de fazê-lo no template (ou templates) você mudaria em ``polls/urls.py``::

source: Namespacing URL names
es: Asignando los nombres de URLs,
pt_br: Namespacing nomes de URL

source: The tutorial project has just one app, ``polls``. In real Django projects, there might be five, ten, twenty apps or more. How does Django differentiate the URL names between them? For example, the ``polls`` app has a ``detail`` view, and so might an app on the same project that is for a blog. How does one make it so that Django knows which app view to create for a url when using the ``{% url %}`` template tag?
es: El proyecto tutorial solo tiene una aplicación; “encuestas”. En proyectos reales de Django, puede haber cinco, diez, veinte o más aplicaciones. ¿Cómo diferencia Django los nombres de las URLs entre ellos? Por ejemplo, la aplicación “encuestas” tiene una vista “detalle”, y así puede tener una aplicación en el mismo proyecto que es para un blog. ¿Cómo hacer para que Django sepa cual vista de aplicaciones crear para una URL cuando se utiliza la etiqueta de plantilla`` {% url%}``?
pt_br: Este projeto tutorial tem apenas um aplicação, ``polls``. Em projetos reais Django, pode haver cinco, dez, vinte ou mais aplicações. Como o Django diferencia os nomes de URL entre eles? Por exemplo, a aplicação ``polls`` tem uma view ``detail``, e assim pode um aplicativo no mesmo projeto que é para um blog. Como é que faz para que o Django saiba qual view da aplicação será criada para a url ao usar a tag de template`` {% url%} ``?

source: The answer is to add namespaces to your URLconf. In the ``polls/urls.py`` file, go ahead and add an ``app_name`` to set the application namespace:
es: La solución es añadir espacios de nombres a su URLconf. En el archivo ``polls/urls.py``, continúe y añada un “nombre de aplicación” para configurar el espacio de nombres de la aplicación:
pt_br: A resposta é adicionar namespaces a seu URLconf. No arquivo ``polls/urls.py``, continue e adicione um ``app_name`` para configurar o namespace da aplicação.

source: Now change your ``polls/index.html`` template from:
es: Ahora modifique su plantilla ``polls/index.html`` desde:
pt_br: Agora mudo seu template``polls/index.html`` de:

source: to point at the namespaced detail view:
es: Para señalar la vista detallada con espacio de nombres
pt_br: para apontar para a view de detalhes d namespace:

source: When you're comfortable with writing views, read :doc:`part 4 of this tutorial </intro/tutorial04>` to learn about simple form processing and generic views.
es: Cuando esté familiarizado con escribir vistas, lea la :doc: ‘parte 4 de este tutorial’ </intro/tutorial04>` para aprender más sobre el procesamiento de formularios sencillos y vistas genéricas.
pt_br: Quando você estiver confortável em escrever views, leia :doc:`a parte 4 deste tutorial <intro/tutorial04>` para aprender sobre processamento de formulários simples e sobre as views genéricas.

source: Writing your first Django app, part 4
es: Escribir tu primera aplicación en Django, parte 4
pt_br: Escrevendo sua primeira aplicação Django, parte 4

source: This tutorial begins where :doc:`Tutorial 3 </intro/tutorial03>` left off. We're continuing the Web-poll application and will focus on simple form processing and cutting down our code.
es: Este tutorial comienza donde quedó: doc: ‘Tutorial 3 </intro/tutorial03>`. Vamos a continuar la aplicación Web encuestas y nos enfocaremos en el procesamiento de formularios sencillos y la reducción de nuestro código.
pt_br: Este tutorial inicia-se onde o :doc:`Tutorial 3 <intro/tutorial03>` terminou. Estamos continuando a aplicação web de enquete e será sobre uma forma simples de processamento de formulário e a redução de nosso código.

source: Write a simple form
es: Escribe un formulario sencillo
pt_br: Crie um formulário simples

source: Let's update our poll detail template ("polls/detail.html") from the last tutorial, so that the template contains an HTML ``<form>`` element:
es: Vamos a actualizar nuestra plantilla detallada encuestas ("polls/detail.html") a partir del último tutorial, de modo que la plantilla contenga un elemento “<formulario>” HTML.
pt_br: Vamos atualizar nosso template de detalhamento da enquete ("polls/detail.html") do último tutorial, para que ele contenha um elemento HTML ``<form>``:

source: A quick rundown:
es: Un rápido resumen:
pt_br: Uma rápida explicação:

source: The above template displays a radio button for each question choice. The ``value`` of each radio button is the associated question choice's ID. The ``name`` of each radio button is ``"choice"``. That means, when somebody selects one of the radio buttons and submits the form, it'll send the POST data ``choice=#`` where # is the ID of the selected choice. This is the basic concept of HTML forms.
es: La plantilla anterior muestra un botón de opción para cada pregunta elección. El “valor” de cada botón de opción es la ID de la pregunta elección asociada. El “nombre” de cada botón de opción es “elección”. Esto significa que cuando alguien selecciona uno de los botones de opción y envía el formulario, enviará los datos POST ``choice=#`` donde # es la ID de la elección seleccionada. Este es el concepto básico de los formularios HTML.
pt_br: O template acima exibe um botão radio para cada opção da enquete. O ``value`` de cada botão radio está associado ao ID da opção. O ``name`` de cada botão radio é a escolha ``"choice"``. Isso significa que, quando alguém escolhe um dos botões de radio e submete a formulário, ele vai enviar o dado``choice=#`` por POST onde # é o ID da escolha selecionada. Este é o conceito básico sobre formulários HTML.

source: We set the form's ``action`` to ``{% url 'polls:vote' question.id %}``, and we set ``method="post"``. Using ``method="post"`` (as opposed to ``method="get"``) is very important, because the act of submitting this form will alter data server-side. Whenever you create a form that alters data server-side, use ``method="post"``. This tip isn't specific to Django; it's just good Web development practice.
es: Ajustamos la “acción” del formulario a ``{% url 'polls:vote' question.id %}``, y configuramos el ``method="post"``. Utilizar ``method="post"`` (en lugar de ``method="get"``) es muy importante porque enviar este formulario modificará el aspecto del servidor de datos. Cuando cree un formulario que altere el aspecto del servidor de datos, utilice ``method="post"``. Esta sugerencia no es solo para Django, es solo una buena práctica de desarrollo Web.
pt_br: Nós definimos o parâmetro ``action`` do formulário para ``{% url 'polls:vote' question.id %}``, e definimos ``method=post``. Usando ``method=post`` (em vez de do ``method=get``) é muito importante, porque o ato de enviar este formulário irá alterar dados do lado servidor. Sempre que criar um formulário que modifique os dados do lado do servidor, utilize ``method="post"``. Esta dica não é específica do Django; mais sim uma boa prática para o desenvolvimento é Web.

source: ``forloop.counter`` indicates how many times the :ttag:`for` tag has gone through its loop
es: `` forloop.counter`` indica cuántas veces la: ttag: etiqueta ` for` ha pasado por el bucle
pt_br: ``forloop.counter`` indica quantas vezes a tag :ttag`for` passou pelo laço.

source: Since we're creating a POST form (which can have the effect of modifying data), we need to worry about Cross Site Request Forgeries. Thankfully, you don't have to worry too hard, because Django comes with a very easy-to-use system for protecting against it. In short, all POST forms that are targeted at internal URLs should use the :ttag:`{% csrf_token %}<csrf_token>` template tag.
es: Ya que estamos creando un formulario POST (que puede suponer la modificación de datos) tenemos que preocuparnos de las falsificaciones de peticiones en sitios cruzados. Afortunadamente, no tiene que preocuparse demasiado porque Django cuenta con un sistema muy fácil de usar para protegerse contra ello. En pocas palabras, todos los formularios POST que están dirigidos a las URLs internas deben utilizar la: ttag: etiqueta de plantilla `{% csrf_token %}<csrf_token>`.
pt_br: Desde que nós estamos criando um formulário POST (que pode ter o efeito de modificação de dados), nós temos que se preocupar com Cross Site Request Forgeries. Felizmente, você não precisa se preocupar muito, porque o Django vem com um sistema muito fácil de usar para se proteger contra isto. Em suma, todas as formas de POST que são direcionados a URLs internas devem usar uma tag :ttag:`{% csrf_token%} <csrf_token>` de template.

source: Now, let's create a Django view that handles the submitted data and does something with it. Remember, in :doc:`Tutorial 3 </intro/tutorial03>`, we created a URLconf for the polls application that includes this line:
es: A continuación, vamos a crear una vista Django que maneja los datos enviados y hace algo con ello. Recuerde que en el:doc:`Tutorial 3 </intro/tutorial03>`, creamos una URLconf para la aplicación encuestas que incluye esta línea:
pt_br: Agora, vamos criar uma ``view`` Django que manipula os dados submetidos e faz algo com eles. Lembre-se, no :doc:`Tutorial 3 <intro/tutorial03>`, criamos uma URLconf para a aplicação de enquete que inclui esta linha:

source: We also created a dummy implementation of the ``vote()`` function. Let's create a real version. Add the following to ``polls/views.py``:
es: También creamos una aplicación ficticia de la función`` votar()`` . Vamos a crear una versión real. Agregue lo siguiente a ``polls/views.py``:
pt_br: Nós tambem criamos uma implementação falsa da função ``vote()``. Vamos criar a versão real. Adicione o seguinte em ``polls/views.py``:

source: This code includes a few things we haven't covered yet in this tutorial:
es: Este código incluye algunas cosas que no hemos cubierto todavía en este tutorial:
pt_br: Este código inclui algumas coisas que ainda não foram cobertas neste tutorial:
