Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: The primary documentation on djangoproject.com is an HTML version of the latest docs in Git. These docs always correspond to the latest official Django release, plus whatever features we've added/changed in the framework *since* the latest release.
es: La documentación principal en djangoproject.com es una versión HTML de los últimos documentos en Git. Estos documentos corresponden siempre a la versión oficial más reciente de Django y cualquier característica que hayamos añadido y/o cambiado en el framework a partir de la última versión.
pt_br: A documentação primária do djangoproject.com é uma versão HTML dos últimos docs no Git. Estes docs sempre correspondem com a última versão ofocial do Django, mais qualquer qualquer novo aspecto adicionado/modificado no framework *desde* o último lançamento.

source: As we add features to Django's development version, we try to update the documentation in the same Git commit transaction.
es: A medida que añadimos características a la versión de desarrollo de Django, tratamos de actualizar la documentación en la misma transacción de commit de Git.
pt_br: A medida que adicionamos novos recursos a versão de desenvolvimento do Django, tentamos atualizar a documentação no mesmo commit do git

source: To distinguish feature changes/additions in the docs, we use the phrase: "New in version X.Y", being X.Y the next release version (hence, the one being developed).
es: Para distinguir los cambios y adiciones de características en la documentación, usamos la frase: "Nuevo en la versión XY", siendo XY la próxima versión de lanzamiento (por lo tanto, la que está siendo desarrollada).
pt_br: Para distinguir alterações/adições de recursos na documentação, nós usamos a frase: "Novo na versão X.Y", sendo X.Y a próxima versão (assim sendo, o que está sendo desenvolvido).

source: Documentation fixes and improvements may be backported to the last release branch, at the discretion of the committer, however, once a version of Django is :ref:`no longer supported<backwards-compatibility-policy>`, that version of the docs won't get any further updates.
es: Las correcciones y mejoras de la documentación pueden ser portadas a la última rama de la versión, según el criterio del committer, sin embargo, una vez que una versión de Django: ref: `ya no es compatible <backwards-compatibility-policy>`, esa versión de los documentos no recibirá actualizaciones adicionales.
pt_br: Correções de documentação e melhorias podem ser versionadas de versões anteriores para a última revisão de seu branch, entretanyo, quando uma versão do Django :ref:`não é mais suportada <backwards-compatibility-policy>`, a versão da documentação não receberá mais nenhuma atualização.

source: The `main documentation Web page`_ includes links to documentation for all previous versions. Be sure you are using the version of the docs corresponding to the version of Django you are using!
es: La página Web principal de la documentación incluye enlaces a la documentación para todas las versiones anteriores. Asegúrese de que está utilizando la versión de los documentos que corresponden a la versión de Django que usted está utilizando!
pt_br: A `página da web principal da documentação`_ inclui links para documentação de todas as versões anteriores. Certifique-se de que você está usando a versão da documentação correspondente à versão do Django que você está usando!

source: You created ``mysite/templates`` in :doc:`Tutorial 2 </intro/tutorial02>`, and ``polls/templates`` in :doc:`Tutorial 3 </intro/tutorial03>`. Now perhaps it is clearer why we chose to have separate template directories for the project and application: everything that is part of the polls application is in ``polls``. It makes the application self-contained and easier to drop into a new project.
es: Usted creó `` mysite / templates`` en el: doc: `Tutorial 2 </intro/tutorial02>` y `` polls / templates`` en el: doc: `Tutorial 3 </intro/tutorial03>`. Ahora quizás está más claro porque decidimos tener directorios de plantillas independientes para el proyecto y la aplicación: todo lo que forma parte de la aplicación encuestas está en ``polls``. Esto hace que la aplicación sea autónoma y más fácil de arrastrar en el nuevo proyecto.

source: If you're using PostgreSQL or MySQL, make sure you've created a database by this point. Do that with "``CREATE DATABASE database_name;``" within your database's interactive prompt.
es: Si usted está utilizando PostgreSQL o MySQL, asegúrese de que ha creado una base de datos para este momento. Hágalo con "``Crear base de datos nombre_de base de datos;``"dentro del prompt interactivo de su base de datos.
