Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: In our poll application, we'll have the following four views:
es: En nuestra aplicación encuestas, vamos a tener las siguientes cuatro vistas:
pt_br: Em nossa aplicação de enquetes, nós teremos as seguintes views:

source: Question "index" page -- displays the latest few questions.
es: La página “índice” de preguntas- muestra las últimas preguntas.
pt_br: Página de "índice" de enquetes - exibe as enquetes mais recente.

source: Question "detail" page -- displays a question text, with no results but with a form to vote.
es: La página “detalle” de preguntas- muestra un texto de pregunta sin resultados, pero con un formulario para votar.
pt_br: Página de "detalhes" da enquete - exibe os textos das perguntas, sem os resultados mas com um formulário para votar.

source: Question "results" page -- displays results for a particular question.
es: Página "Resultados" de preguntas- muestra los resultados de una pregunta en particular.
pt_br: Página de "resultados" de perguntas - exibe os resultados de uma pergunta em particular.

source: Vote action -- handles voting for a particular choice in a particular question.
es: Acción de votar- gestiona la votación para una elección concreta en una pregunta específica.
pt_br: Ação de voto - gerencia a votação para uma escolha particular em uma enquete em particular.

source: In Django, web pages and other content are delivered by views. Each view is represented by a simple Python function (or method, in the case of class-based views). Django will choose a view by examining the URL that's requested (to be precise, the part of the URL after the domain name).
es: En django, las páginas Web y otros contenidos se envían por vistas. Cada vista está representada por una sencilla función Python (o método, en el caso de las vistas basadas en clases). Django escogerá una vista examinando la URL que se solicita (para ser preciso, la parte de la URL que se encuentra después del nombre del dominio).
pt_br: No Django, páginas web e outros conteúdos são entregues por views. Cada view é representada por uma simples função Python(ou metodos, no caso das class-based views). O django irá escolher uma view examinando a URL que foi requisitada (para ser preciso, a parte da URL depois do nome de dominio).

source: Now in your time on the web you may have come across such beauties as "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". You will be pleased to know that Django allows us much more elegant *URL patterns* than that.
es: En su tiempo en la web es posible que haya encontrado este tipo de bellezas como "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". Usted estará encantado de saber que Django nos ofrece patrones URLs mucho más elegantes que ese.
pt_br: Agora em seu tempo pela internet você deve ter visto coisas lindas como "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". Você ficará satisfeito em saber que o Django permite *padrões de URL* muito mais elegantes do que isso.

source: A URL pattern is simply the general form of a URL - for example: ``/newsarchive/<year>/<month>/``.
es: Un patrón URL no es más que el molde general de una URL - por ejemplo:``/newsarchive/<year>/<month>/``.
pt_br: Um padrão de URL é simplesmente a forma geral de uma URL - por exemplo: ``/newsarchive/<year>/<month>/``.

source: To get from a URL to a view, Django uses what are known as 'URLconfs'. A URLconf maps URL patterns (described as regular expressions) to views.
es: Para llegar desde una URL a una vista, Django usa lo que se conoce como "URLconfs'. Una URL mapea patrones URLs (descritos como expresiones regulares) para las vistas.
pt_br: Para ir de uma URL para uma view, O Django usa oque é conhecido como 'URLconfs'. Uma URLconf mapeia padrões de URL (descritas com expressões regulares) para views.

source: This tutorial provides basic instruction in the use of URLconfs, and you can refer to :mod:`django.core.urlresolvers` for more information.
es: Este tutorial proporciona instrucción básica en el uso de URLconfs y puede consultar: mod: `django.core.urlresolvers` para obtener más información.
pt_br: Este tutorial fornece instruções básicas sobre uso de URLconfs, e você pode recorrer a :mod:`django.core.urlresolvers` para mais informações.

source: Writing more views
es: Escribir más vistas
pt_br: Escrevendo mais views

source: Now let's add a few more views to ``polls/views.py``. These views are slightly different, because they take an argument:
es: A continuación vamos a agregar más vistas a ``polls/views.py``. Estas vistas son un poco diferentes porque toman un argumento:
pt_br: Agora vamos adicionar mais algumas views em ``polls/views.py``. Estas views são um pouco diferentes, porque elas recebem um argumento:

source: Wire these new views into the ``polls.urls`` module by adding the following :func:`~django.conf.urls.url` calls:
es: Envíe estas nuevas vistas al módulo ``polls.urls`` añadiendo lo siguiente: func: llamadas `~django.conf.urls.url`:
pt_br: Ligue estas novas views dentro do módulo ``polls.urls`` adicionando as seguintes chamadas :func:`~django.conf.urls.url`:

source: Take a look in your browser, at "/polls/34/". It'll run the ``detail()`` method and display whatever ID you provide in the URL. Try "/polls/34/results/" and "/polls/34/vote/" too -- these will display the placeholder results and voting pages.
es: Eche un vistazo en su navegador en "/polls/34/". Se va a ejecutar el método ``detalle ()`` y mostrar cualquier ID que usted suministre en la URL. Pruebe "/polls/34/results/" y también "/polls/34/vote/" - estas mostrarán los resultados del marcador de posición y las páginas de votación.
pt_br: Dê uma olhada no seu navegador, em ``/polls/34/``. Ele vai executar o método ``detail()`` e mostrar o ID que você informou na URL. Tente "/polls/34/results/" e "/polls/34/vote/" também -- Eles vão mostrar a pagina resultadoss e a pagina de votação.

source: When somebody requests a page from your website -- say, "/polls/34/", Django will load the ``mysite.urls`` Python module because it's pointed to by the :setting:`ROOT_URLCONF` setting. It finds the variable named ``urlpatterns`` and traverses the regular expressions in order. The :func:`~django.conf.urls.include` functions we are using simply reference other URLconfs. Note that the regular expressions for the :func:`~django.conf.urls.include` functions don't have a ``$`` (end-of-string match character) but rather a trailing slash. Whenever Django encounters :func:`~django.conf.urls.include`, it chops off whatever part of the URL matched up to that point and sends the remaining string to the included URLconf for further processing.
es: Cuando alguien solicita una página desde su sitio web - digamos, "/polls/34/", Django cargará el módulo Python ``mysite.urls`` porque está señalado por la: configuración: configuración del` ROOT_URLCONF`. Encuentra la variable llamada `` urlpatterns`` y atraviesa las expresiones regulares en orden. Las: func: funciones ` ~django.conf.urls.include` que estamos utilizando simplemente buscan otras URLconfs. Tenga en cuenta que las expresiones regulares para las : func: funciones`~django.conf.urls.include` no tienen un` `$ '' (carácter final de la cadena de búsqueda), sino más bien una barra al final. Cuando Django encuentra: func: `~ django.conf.urls.include`, elimina cualquier parte de la URL que coincida hasta ese momento y envía la cadena restante a la URLconf incluida para su posterior procesamiento.
pt_br: Quando alguém requisita uma página do seu website -- por exemplo, "/polls/34/", o Django irá carregar o módulo Python ``mysite.urls`` porque este está indicado para tal pelo configuração em :setting:`ROOT_URLCONF`. Ele procura pela variável chamada ``urlpatterns`` e aplica as expressões regulares mantendo a ordem. As funções :func:`~django.conf.urls.include` que estamos usando simplesmente referenciam outros URLconfs. Note que as expressões regulares para funçõeses em :func:`~django.conf.urls.include` não tem um ``$`` (caracter que indica fim de linha) mas ao invés disso uma barra. Quando Django encontra um :func:`~django.conf.urls.include`, ele corta fora qualquer parte do URL que combina até aquele ponto e envia a string remanescente para o URLconf do include para futuro processamento.

source: The idea behind :func:`~django.conf.urls.include` is to make it easy to plug-and-play URLs. Since polls are in their own URLconf (``polls/urls.py``), they can be placed under "/polls/", or under "/fun_polls/", or under "/content/polls/", or any other path root, and the app will still work.
es: La idea detrás de: func: `~ django.conf.urls.include` es facilitar la conexión y ejecución de las URLs. Dado que las encuestas están en su propia URLconf (``polls/urls.py``), se pueden ubicar en"/polls/", en "/ fun_polls /", "/content/polls/" o en cualquier otra ruta raíz , y la aplicación todavía seguirá funcionando.
pt_br: A idéia por trás do :func:`~django.conf.urls.include` é criar facilmente URLs plug-and-play. Agora que as polls possuem sua própria URLconf (``polls/urls.py``), elas podem ser colocadas abaixo de ``"/polls/"``, ou abaixo de ``"/fun_polls/"``, ou abaixo de ``"/content_polls/"``, ou qualquer outra raiz de URL, que a aplicação irá continuar funcionando.

source: Here's what happens if a user goes to "/polls/34/" in this system:
es: Esto es lo que sucede si un usuario va a "/polls/34/"en este sistema:
pt_br: Aqui o que acontece se um usuário vai para ``"/polls/34/"`` neste sistema:

source: Django will find the match at ``'^polls/'``
es: Django encontrará la coincidencia en ``'^polls/'``
pt_br: O Django irá encontrar uma combinacao em ``'^polls/'``

source: Then, Django will strip off the matching text (``"polls/"``) and send the remaining text -- ``"34/"`` -- to the 'polls.urls' URLconf for further processing which matches ``r'^(?P<question_id>[0-9]+)/$'`` resulting in a call to the ``detail()`` view like so::
es: Luego, Django separará el texto correspondiente ("polls/") y enviará el resto del texto -- ``"34/"`` -- a la URLconf 'polls.urls' para su posterior procesamiento que coincide con``r'^(?P<question_id>[0-9]+)/$'`` lo que resulta como tal en una llamada a la vista "detalle()"::
pt_br: Ele irá separar o texto que combinar com (``"polls/"``) e enviar o restante do texto -- ``"34/"`` -- para a URLconf 'polls.urls' para um tratamento posterior que casar com ``r'^(?P<question_id>[0-9]+)/$'`` resultando em uma chamada para a view ``detail()`` como::

source: The ``question_id='34'`` part comes from ``(?P<question_id>[0-9]+)``. Using parentheses around a pattern "captures" the text matched by that pattern and sends it as an argument to the view function; ``?P<question_id>`` defines the name that will be used to identify the matched pattern; and ``[0-9]+`` is a regular expression to match a sequence of digits (i.e., a number).
es: La parte `question_id = '34'`` proviene de `` (? P <question_id> [0-9] +) ``. Utilizar paréntesis en torno a un patrón "captura" el texto buscado por ese patrón y lo envía como un argumento a la función de vista; ``?P<question_id>`` define el nombre que se utilizará para identificar el patrón buscado y `` [0-9] + `` es una expresión regular para buscar una secuencia de dígitos (es decir, un número).
pt_br: A parte ``question_id='34'`` vem de ``(?P<question_id>[0-9]+)``. Usando parênteses em torno de um padrão "captura" o texto casado por este padrão e envia ele como um argumento da função; ``?P<question_id>`` define o nome que será usado para identificar o padrão casado; e ``[0-9]+`` é a expressão regular para casar uma sequência de dígitos (ex., um número).

source: Because the URL patterns are regular expressions, there really is no limit on what you can do with them. And there's no need to add URL cruft such as ``.html`` -- unless you want to, in which case you can do something like this::
es: Debido a que los patrones de URL son expresiones regulares, realmente no hay límites en lo que puede hacer con ellos. Además, no hay necesidad de añadir códigos redundantes a la URL como `` .html``; a menos que lo desee, en cuyo caso usted puede hacer algo como esto ::
pt_br: Como os padrões de URL são expressões regulares, realmente não há limites para o que você possa fazer com elas. E também não é necessário adicionar extensão na URL como ``.html`` - a menos que você queira, neste caso você pode fazer algo como::

source: But, don't do that. It's silly.
es: Pero, no hagas eso. Es una tontería.
pt_br: Mas, não o faça isso, Isto é idiota.

source: Write views that actually do something
es: Escriba vistas que realmente hagan algo
pt_br: Escreva views que façam algo

source: Each view is responsible for doing one of two things: returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :exc:`~django.http.Http404`. The rest is up to you.
es: Cada vista es responsable de hacer una de dos cosas: devolver un: clase: objeto `~ django.http.HttpResponse` que contiene el contenido de la página solicitada, o lanzar una excepción como: exc:` ~ django.http.Http404` . El resto depende de ti.
pt_br: Cada view é responsável por fazer uma das duas coisas: retornar um objeto :class:`~django.http.HttpResponse` contendo o conteúdo para a página requisitada, ou levantar uma exceção como :exc:`~django.http.Http404`. O resto é com você.

source: Your view can read records from a database, or not. It can use a template system such as Django's -- or a third-party Python template system -- or not. It can generate a PDF file, output XML, create a ZIP file on the fly, anything you want, using whatever Python libraries you want.
es: Su vista puede leer registros de una base de datos o no, puede usar un sistema de plantillas como el de Django o un sistema de plantillas Python de terceros o no. Puede crear un archivo PDF, salida XML, crear un archivo ZIP en la marcha, todo lo que quiera, utilizando cualquier biblioteca Python que desee.
pt_br: Sua view pode ler registros do banco de dados, ou não. Ela pode usar um sistema de templates como o do Django - ou outro sistema de templates Python de terceiros - ou não. Ele pode gerar um arquivo PDF, saída em um XML, criar um arquivo ZIP sob demanda, qualquer coisa que você quiser,usando qualquer biblioteca Python você quiser.

source: All Django wants is that :class:`~django.http.HttpResponse`. Or an exception.
es: Todo Django quiere es eso: clase: `~ django.http.HttpResponse` o una excepción.
pt_br: Tudo que o Django espera é que a view retorne um :class:`~django.http.HttpResponse`. Ou uma exceção.

source: Because it's convenient, let's use Django's own database API, which we covered in :doc:`Tutorial 2 </intro/tutorial02>`. Here's one stab at a new ``index()`` view, which displays the latest 5 poll questions in the system, separated by commas, according to publication date:
es: Debido a que es conveniente, vamos a utilizar la propia API de base de datos de Django, que estudiamos en el : doc: `Tutorial 2 </intro/tutorial02> `. A continuación señalaremos una nueva vista “índice()” que muestra en el sistema las 5 últimas preguntas de la encuesta, separadas por comas, según su fecha de publicación:
pt_br: Porque é conveniente, vamos usar a própria API de banco de dados do Django, a qual cobrimos em :doc:`Tutorial 2 </intro/tutorial02>`. Aqui uma nova tentativa de view ``index()``, a qual mostra as últimas 5 "poll questions" do sistema, separada por vírgulas, de acordo com sua data de publicação:

source: There's a problem here, though: the page's design is hard-coded in the view. If you want to change the way the page looks, you'll have to edit this Python code. So let's use Django's template system to separate the design from Python by creating a template that the view can use.
es: Sin embargo, aquí hay un problema: el diseño de la página está codificado de forma fija en la vista. Si desea cambiar la forma en que se ve la página, tendrá que editar el código Python. Así que vamos a usar el sistema de plantillas de Django para separar el diseño de Python mediante la creación de una plantilla que la vista pueda utilizar.
pt_br: Há um problema aqui, no entanto: o design da página esta codificado na view. Se você quiser mudar a forma de apresentação de sua página, você terá de editar este código diretamente em Python. Então vamos usar o sistema de templates do Django para separar o design do código Python::

source: First, create a directory called ``templates`` in your ``polls`` directory. Django will look for templates in there.
es: Primero, cree un directorio llamado "plantillas" en su directorio "encuestas". Django buscará las plantillas allí.
pt_br: Primeiro, crie um diretório chamado `` templates`` em seu diretório ``polls``. O Django irá procurar templates lá.

source: Your project's :setting:`TEMPLATES` setting describes how Django will load and render templates. The default settings file configures a ``DjangoTemplates`` backend whose :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` option is set to ``True``. By convention ``DjangoTemplates`` looks for a "templates" subdirectory in each of the :setting:`INSTALLED_APPS`.
es: La:configuración: configuración "Plantillas" de su proyecto describe cómo Django cargará y creará las plantillas. El archivo de configuración predeterminada configura un backend "DjangoTemplates" cuya :configuración: opción `APP_DIRS <TEMPLATES-APP_DIRS>` está configurada como "True". Convencionalmente, "DjangoTemplates" busca un subdirectorio “plantillas” en cada una de las: configuración: `Aplicaciones instaladas`.
pt_br: A sua configuração de projeto :setting:`TEMPLATES` descreve como o Django vai carregar e renderizar templates. O arquivo de configuração padrão usa o backend ``DjangoTemplates`` do qual a opção :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` é configurada como ``True``. Por convenção `DjangoTemplates`` procura por um subdiretório "templates" em cada uma das :setting:`INSTALLED_APPS`.

source: Within the ``templates`` directory you have just created, create another directory called ``polls``, and within that create a file called ``index.html``. In other words, your template should be at ``polls/templates/polls/index.html``. Because of how the ``app_directories`` template loader works as described above, you can refer to this template within Django simply as ``polls/index.html``.
es: Dentro del directorio ``plantillas`` que usted acaba de crear, cree otro directorio llamado ``encuestas``y dentro de ese cree un archivo llamado `` index.html``. En otras palabras, su plantilla debe estar en ``polls/templates/polls/index.html``. Debido a cómo funciona el cargador de plantillas `` app_directories`` como se describió anteriormente, usted puede consultar esta plantilla dentro de Django simplemente como ``polls/index.html``.
pt_br: Dentro do diretório ``templates`` que acabou de criar, crie outro diretório ``polls``, e dentro crie um arquivo chamado ``index.html``. Em outras palavras, seu template deve estar em ``polls/templates/polls/index.html``. Devido a forma como o carregador de templates ``app_directories`` funciona como descrito acima, você pode referenciar este template dentro do Django simplesmente como ``polls/index.html``.

source: Template namespacing
es: Espacio de nombres de plantillas
pt_br: Namespacing de template

source: Now we *might* be able to get away with putting our templates directly in ``polls/templates`` (rather than creating another ``polls`` subdirectory), but it would actually be a bad idea. Django will choose the first template it finds whose name matches, and if you had a template with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those templates inside *another* directory named for the application itself.
es: Ahora podemos poner nuestras plantillas directamente en ``polls/templates`` (en lugar de crear otro subdirectorio "encuestas"), pero en realidad sería una mala idea. Django elegirá la primera plantilla que encuentre cuyo nombre coincida, y si usted tuviera una plantilla con el mismo nombre en una aplicación diferente, Django no podría distinguir entre ellas. Tenemos que ser capaces de indicarle a Django la correcta, y la forma más fácil de asegurar esto es organizándolas, es decir, poniendo esas plantillas dentro de otro directorio nombrado para la aplicación.
pt_br: Agora nós *podemos* ser capazes de avnçar com a colocação dos nossos modelos diretamente em ``polls/templates`` (em vez de criar outro ``subdiretório poll``), mas na verdade seria uma má ideia. Django irá escolher o primeiro template que encontra cujo nome corresponde, e se você tivesse um template com o mesmo nome em uma aplicação *diferente*, O Django e incapaz de distinguir entre eles. Precisamos ser capazes de apontar Django no caminho certo, e a maneira mais fácil de garantir isso é usar *namespacing*. Ou seja, colocando esses templates dentro de *outro* diretório nomeado para a aplicação em si.

source: Put the following code in that template:
es: Introduzca el siguiente código en esa plantilla:
pt_br: Ponha o seguinte código neste template:

source: Now let's update our ``index`` view in ``polls/views.py`` to use the template:
es: Ahora vamos a actualizar nuestra vista ``índice`` en ``polls/ views.py`` para usar la plantilla:
pt_br: Agora vamos atualizar nossa view ``index`` em ``polls/views.py`` para usar o template:

source: That code loads the template called ``polls/index.html`` and passes it a context. The context is a dictionary mapping template variable names to Python objects.
es: Ese código carga la plantilla llamada ``polls/index.html`` y la pasa a un contexto. El contexto es un diccionario que le indica los nombres de variables de plantillas a los objetos Python.
pt_br: Esse código carrega o template chamado ``polls/index.html`` e passa um contexto para ele. O contexto é um dicionário mapeando nomes de variáveis ​​para objetos Python.

source: Load the page by pointing your browser at "/polls/", and you should see a bulleted-list containing the "What's up" question from :doc:`Tutorial 2 </intro/tutorial02>`. The link points to the question's detail page.
es: Cargue la página señalando su navegador en "/polls/", y usted debería ver una lista con viñetas que contiene la pregunta "¿Qué pasa" del: doc: `Tutorial 2 </intro/tutorial02> `. El enlace señala la página detallada de la pregunta.
pt_br: Carregue a página apontando seu navegador para "/polls/", e você deve ver uma lista contendo a questão "What's up" do :doc:`Tutorial 2 </intro/tutorial02>`. O link aponta para página de detalhes das perguntas.

source: A shortcut: :func:`~django.shortcuts.render`
es: Un atajo:: func: `~ django.shortcuts.render`
pt_br: Um atalho: :func:`~django.shortcuts.render`

source: It's a very common idiom to load a template, fill a context and return an :class:`~django.http.HttpResponse` object with the result of the rendered template. Django provides a shortcut. Here's the full ``index()`` view, rewritten:
es: Es un lenguaje muy común para cargar una plantilla, llenar un contexto y devolver un: clase: objeto`~ django.http.HttpResponse` con el resultado de la plantilla creada. Django proporciona un atajo. A continuación la vista "índice()"completa, reescrita:
pt_br: É um estilo muito comum carregar um template, preenchê-lo com um contexto e retornar um objeto :class:`~django.http.HttpResponse` com o resultado do template renderizado. O Django fornece este atalho. Aqui esta toda a view ``index()`` reescrita::
