Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: Re-run the tests and everything should pass. If it doesn't, make sure you correctly modified the ``BaseForm`` class as shown above and copied the new test correctly.
es: Vuelva a ejecutar las pruebas y todas deben pasar. Si no es así, asegúrese de que ha modificado correctamente la clase ``BaseForm`` como se muestra arriba y que ha copiado las nuevas pruebas correctamente.
pt_br: Re-execute os testes e tudo deve passar. Caso contrário, tenha certeza que modificou corretamente a classe ``BaseForm`` como mostrado acima e copiado o novo teste corretamente.

source: Running Django's test suite for the second time
es: Ejecutando el conjunto de pruebas de Django por segunda vez
pt_br: Executando a suíte de testes do Django pela segunda vez

source: Once you've verified that your patch and your test are working correctly, it's a good idea to run the entire Django test suite just to verify that your change hasn't introduced any bugs into other areas of Django. While successfully passing the entire test suite doesn't guarantee your code is bug free, it does help identify many bugs and regressions that might otherwise go unnoticed.
es: Una vez que haya verificado que su parche y su prueba funcionan correctamente, es una buena idea ejecutar todo el conjunto de pruebas de Django sólo para comprobar que su cambio no ha introducido ningún bug en otras áreas de Django. A pesar de que pasar con éxito todo el conjunto de pruebas no garantiza que su código está libre de errores, sí ayuda a identificar muchos bugs y regresiones que de otro modo podrían pasar desapercibidos.
pt_br: Depois de verificar que seu patch e seu teste estão funcionando corretamente, é uma boa ídeia executar toda a suite de testes do Django apenas para verificar se sua mudança não introduziu algum erro em outras áreas do Django. Ao passar com sucesso em toda a suite de testes, não garante que seu código esteja livre de erros, ele ajuda identificar muitos erros e regressões que poderiam passar despercebidos.

source: To run the entire Django test suite, ``cd`` into the Django ``tests/`` directory and run:
es: Para ejecutar todo el conjunto de pruebas de Django, cámbiese al directorio "pruebas/" de Django y ejecute:
pt_br: Para executar toda a suíte de testes do Django, `` cd`` no diretório `` testes / `` do Django e execute:

source: As long as you don't see any failures, you're good to go.
es: Siempre y cuando no haya fallos, ya está listo para arrancar.
pt_br: Contanto que você não veja qualquer falha, você está pronto para seguir.

source: Writing Documentation
es: Escribiendo la documentación
pt_br: Escrevendo Documentação

source: This is a new feature, so it should be documented. Add the following section on line 1068 (at the end of the file) of ``django/docs/ref/forms/api.txt``::
es: Esta es una nueva característica, por lo tanto se debe documentar. Agregue la siguiente sección en la línea 1068 (al final del archivo) de `django/docs/ref/forms/api.txt``::
pt_br: Isos é uma funcionalidade nova, então deve ser documentada. Adicione a seguinte seção na linha 1068 (no final do arquivo) do ``django/docs/ref/forms/api.txt``::

source: Since this new feature will be in an upcoming release it is also added to the release notes for Django 1.9, on line 164 under the "Forms" section in the file ``docs/releases/1.9.txt``::
es: Dado que esta nueva característica estará en una próxima versión también se añade a las notas de la versión de Django 1.9, en la línea 164 debajo de la sección “Formularios” en el archivo ``docs/releases/1.9.txt``::
pt_br: Já que essa nova funcionalidade estará em uma próxima revisão esta é também adicionada nas notas de release do Django 1.9, na linha 164 sob a seção "Forms" no arquivo ``docs/releases/1.9.txt``::

source: For more information on writing documentation, including an explanation of what the ``versionadded`` bit is all about, see :doc:`/internals/contributing/writing-documentation`. That page also includes an explanation of how to build a copy of the documentation locally, so you can preview the HTML that will be generated.
es: Para obtener más información sobre escribir la documentación, incluyendo una explicación de lo que se trata el ``versionadded`` bit, consulte: doc: `/internals/contributing/writing-documentation`. Esa página incluye también una explicación de cómo hacer una copia de la documentación localmente, por lo que puede obtener una vista previa del código HTML que se generará.
pt_br: Para mais informações sobre escrita de documentação, incluindo uma explicação sobre o que ``versionadded`` significa, verifique :doc:`/internals/contributing/writing-documentation`. Essa página também inclui uma explicação sobre como construir uma cópia local da documentação, de maneira que você possa pré-visualizar o HTML que será gerado.

source: Generating a patch for your changes
es: Creando un parche para sus cambios
pt_br: Criando um patch para as suas alterações

source: Now it's time to generate a patch file that can be uploaded to Trac or applied to another copy of Django. To get a look at the content of your patch, run the following command:
es: Ahora es el momento de crear un archivo de parche que se pueda cargar a Trac o aplicarse a otra copia de Django. Para ver el contenido de su parche, ejecute el siguiente comando::
pt_br: Agora é hora de gerar um arquivo de "patch" que pode ser feito o upload no Trac ou aplicado em outra cópia do Django. Para dar uma olhada no conteúdo do seu "patch", execute o seguinte comando:

source: This will display the differences between your current copy of Django (with your changes) and the revision that you initially checked out earlier in the tutorial.
es: Este mostrará las diferencias entre su copia actual de Django (con sus cambios) y la revisión que usted revisó anteriormente en el tutorial.
pt_br: Isso mostrará as diferenças entre sua cópia corrente do Django (com suas modificações) e a revisão que inicialmente você realizou check out , anteriormente no tutorial.

source: Once you're done looking at the patch, hit the ``q`` key to exit back to the command line. If the patch's content looked okay, you can run the following command to save the patch file to your current working directory:
es: Una vez que hayas terminado de mirar el parche, pulse la tecla `` q`` para volver a la línea de comandos. Si el contenido del parche se veía bien, puede ejecutar el siguiente comando para guardar el archivo de parche en su directorio de trabajo actual::
pt_br: Uma vez que tenha terminado de olhar o conteúdo do seu "patch", pressione a tecla ``q`` para retornar a linha de comando. Se o conteúdo do "patch" estiver ok, pode rodar o seguinte comando para alvar o arquivo de "patch" no seu diretório de trabalho corrente.

source: You should now have a file in the root Django directory called ``24788.diff``. This patch file contains all your changes and should look this:
es: Usted debería ahora tener un archivo en el directorio principal de Django llamado ``24788.diff``. Este archivo de parche contiene todas sus modificaciones y debería verse así:
pt_br: Agora você deve ter um arquivo chamado ``24788.diff`` no diretório raiz do Django. Este arquivo de patch contém todas as suas modificações e deve se assemelhar a isto:

source: So what do I do next?
es: Entonces, ¿qué debo hacer ahora?
pt_br: Então, o que faço a seguir?

source: Congratulations, you've generated your very first Django patch! Now that you've got that under your belt, you can put those skills to good use by helping to improve Django's codebase. Generating patches and attaching them to Trac tickets is useful, however, since we are using git - adopting a more :doc:`git oriented workflow </internals/contributing/writing-code/working-with-git>` is recommended.
es: ¡Felicidades, usted ha creado su primer parche en Django! Ahora que ha dominado eso, puede darle un buen uso a esas habilidades ayudando a mejorar la base de código de Django. Crear parches y adjuntarlos a las incidencias de Trac es útil, sin embargo, ya que estamos utilizando git, se recomienda la adopción de un `flujo de trabajo más orientado a git: doc: </internals/contributing/writing-code/working-with-git>`.
pt_br: Parabéns, você gerou seu primeiro patch do Django! Agora que você adquiriu esta experiência você pode colocar essas habilidades em prática ajudando a melhorar a base de código do Django. Gerar patches e anexá-los a tíquetes do Trac é útil, no entanto, como estamos utilizando git - adotar um :doc:`fluxo de trabalho orientado a git </internals/contributing/writing-code/working-with-git>` é mais recomendável.

source: Since we never committed our changes locally, perform the following to get your git branch back to a good starting point:
es: Ya que nunca comprometimos nuestros cambios a nivel local, realice lo siguiente para devolver su git branch a un buen punto de partida ::
pt_br: Visto que nós nunca fizemos commit das nossas modificações locais, execute o seguinte para ter seu branch do git de volta a um bom ponto de partida:

source: More information for new contributors
es: Más información para los nuevos colaboradores
pt_br: Mais informações para novos contribuidores

source: Before you get too into writing patches for Django, there's a little more information on contributing that you should probably take a look at:
es: Antes de dedicarse también a escribir parches para Django, hay algo más de información sobre cómo contribuir que probablemente debería ver:
pt_br: Antes que você mergulhe na escrita de patches para o Django há mais algumas informações sobre contribuição que você provavelmente deveria dar uma olhada:

source: You should make sure to read Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`. It covers Trac etiquette, how to claim tickets for yourself, expected coding style for patches, and many other important details.
es: Debe asegurarse de leer la documentación de Django sobre: doc: `solicitar incidencias y proponer parches </internals/contributing/writing-code/submitting-patches>`.Este incluye la etiqueta de Trac, cómo solicitar incidencias por sí mismo, el estilo de codificación prevista para parches y muchos otros detalles importantes.
pt_br: Você deve certificar-se de ler a documentação do Django em :doc:`reinvidicando tickets e enviando patches </internals/contributing/writing-code/submitting-patches>`. Ela abrange etiqueta Trac, como reivindicar bilhetes para si mesmo, estilo de codificação prevista para patches, e muitos outros detalhes importantes.

source: First time contributors should also read Django's :doc:`documentation for first time contributors</internals/contributing/new-contributors/>`. It has lots of good advice for those of us who are new to helping out with Django.
es: Las personas que colaboran por primera vez también deben leer el doc de Django:`la documentación para los que colaboran por primera vez </internals/contributing/new-contributors/>`. Tiene muchos buenos consejos para aquellos de nosotros que somos nuevos colaborando con Django.
pt_br: Os contribuidores de primeira viagem devem ler o :doc:`documentação sobre contribuidores de primeira viagem</internals/contributing/new-contributors/>`. Ele tem muitos bons conselhos para aqueles que são novos para ajudar com Django.

source: After those, if you're still hungry for more information about contributing, you can always browse through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`. It contains a ton of useful information and should be your first source for answering any questions you might have.
es: Después de ellos, si todavía quieres más información sobre cómo contribuir, siempre se puede navegar por el resto de: doc: `la documentación de Django sobre cómo contribuir </internals/contributing/index> `. Este contiene un montón de información útil y debe ser tu primera fuente para responder a cualquier pregunta que puedas tener.
pt_br: Depois disso, se você ainda estiver ansioso para obter mais informações sobre como contribuir, você sempre pode navegar pelo resto da :doc:`documentação do Django em contribuição </internals/contributing/index>`. Ele contém um monte de informações úteis e deve ser sua primeira fonte para responder quaisquer perguntas que você possa ter.

source: Finding your first real ticket
es: Encontrando su primera incidencia real
pt_br: Encontrando o seu primeiro ticket

source: Once you've looked through some of that information, you'll be ready to go out and find a ticket of your own to write a patch for. Pay special attention to tickets with the "easy pickings" criterion. These tickets are often much simpler in nature and are great for first time contributors. Once you're familiar with contributing to Django, you can move on to writing patches for more difficult and complicated tickets.
es: Una vez que haya revisado parte de esa información, estarás listo para salir y encontrar una incidencia a la que escribirle un parche. Preste especial atención a las incidencias con el criterio de "presa fácil". Estas incidencias son a menudo de carácter mucho más simples y son geniales para los que colaboran por primera vez. Una vez que estés familiarizado con como contribuir con Django, puedes pasar a escribir parches para las incidencias más difíciles y complicadas.
pt_br: Uma vez que tenha dado uma olhada nessa documentação, você estará pronto para ir procurar um ticket para escrever um "patch". Preste especial atenção aos tickets marcados com o critério "easy pickings". Estes tickets são em geral de natureza simples e bons para novos contribuidores. Uma vez que estiver familiarizado com contribuir para o Django, você pode ir adiante escrevendo "patches" para tickets mais difíceis e complicados.

source: If you just want to get started already (and nobody would blame you!), try taking a look at the list of `easy tickets that need patches`__ and the `easy tickets that have patches which need improvement`__. If you're familiar with writing tests, you can also look at the list of `easy tickets that need tests`__. Just remember to follow the guidelines about claiming tickets that were mentioned in the link to Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`.
es: Si lo que desea es empezar ya (¡Y nadie lo culparía!), trate de mirar la lista de `las incidencias sencillas que necesitan parches`__ y `las incidencias sencillas que tienen parches que necesitan mejoras`__. Si se siente cómodo escribiendo pruebas también puede ver la lista de 'incidencias sencillas que necesitan pruebas`__. Sólo recuerde seguir las directrices sobre la solicitud de incidencias que se mencionaron en el enlace a la documentación de Django sobre: doc: `solicitar incidencias y proponer parches </internals/contributing/writing-code/submitting-patches> `.
pt_br: Se você já quer começar agora (e ninguém iria culpá-lo!), tente dar uma olhada na lista de `tickets fáceis que precisam de patches`__ e os `tickets fáceis que têm patches que precisam de melhorias`__. Se você estiver familiarizado com a escrita de testes, você também pode olhar para a lista de `tickets simples que precisam de testes`__. Apenas lembre-se de seguir as orientações sobre a reivindicação de bilhetes que foram mencionados no link para a documentação do Django em :doc:`reivindicar tickets e submeter patches </internals/contributing/writing-code/submitting-patches>`.

source: What's next?
es: ¿Qué sigue?
pt_br: E agora?

source: After a ticket has a patch, it needs to be reviewed by a second set of eyes. After uploading a patch or submitting a pull request, be sure to update the ticket metadata by setting the flags on the ticket to say "has patch", "doesn't need tests", etc, so others can find it for review. Contributing doesn't necessarily always mean writing a patch from scratch. Reviewing existing patches is also a very helpful contribution. See :doc:`/internals/contributing/triaging-tickets` for details.
es: Después de que una incidencia tiene un parche, necesita ser revisada por un segundo par de ojos. Después de subir un parche o enviar una pull request, asegúrese de actualizar los metadatos de la incidencia mediante el establecimiento de flags en la incidencia para decir "tiene parche", "no necesita pruebas", etc, para que otros puedan encontrarla para la revisión. Contribuir no necesariamente siempre significa escribir un parche desde cero. Revisar parches existentes es también una contribución muy útil. Consulte: doc:`/internals/contributing/triaging-tickets` para más detalles.
pt_br: Depois de um ticket ter um "patch", é necessário que este seja revisado por um segundo olho. Depois de fazer o upload de um patch ou submeter um "pull request", tenha certeza de atualizar o metadado do ticket para "has patch", "doesn't need tests", etc, então outros podem econtrá-lo para revisar. Contribuir nem sempre quer dizer escrever um "patch" do início. Revisar "patches" existentes é também uma contribuição que ajuda muito. Veja :doc:`/internals/contributing/triaging-tickets` para detalhes.

source: Getting started
es: Empezando
pt_br: Introdução

source: New to Django? Or to Web development in general? Well, you came to the right place: read this material to quickly get up and running.
es: ¿Eres nuevo en Django o en el desarrollo Web en general? Bueno, has venido al lugar indicado: lee este material para ponerte en marcha rápidamente.
pt_br: Você é novo no Django? Ou no desenvolvimento Web em geral? Bem, você veio ao lugar certo: leia este material para começar o quanto antes.

source: If you're new to Python_, you might want to start by getting an idea of what the language is like. Django is 100% Python, so if you've got minimal comfort with Python you'll probably get a lot more out of Django.
es: Si es nuevo en Python, es posible que desee empezar por tener una idea de cómo es el lenguaje. Django es 100% Python, así que si tiene la comodidad mínima con Python probablemente obtendrá mucho más de Django.
pt_br: Se você não conhece Python_, você pode querer começar entendendo como a linguagem é. O Django é 100% Python, por isso, se você se sente pelo menos um pouco confortável com Python, você provavelmente irá obter muito mais do Django.

source: If you're new to programming entirely, you might want to start with this `list of Python resources for non-programmers`_
es: Si eres totalmente nuevo en la programación, es posible que desee comenzar con esta `lista de recursos de Python para los que no son programadores.
pt_br: Se você não conhece nada de programação, você pode querer começar com com a `lista de recursos sobre Python para não-programadores`_

source: If you already know a few other languages and want to get up to speed with Python quickly, we recommend `Dive Into Python`_. If that's not quite your style, there are many other `books about Python`_.
es: Si ya conoce algunos otros lenguajes y quiere ponerse al día con Python rápidamente, recomendamos `Sumérgete en Python`. Si ese no es del todo su estilo, hay muchos otros `libros sobre Python`_.
pt_br: Se você já conhece alguma outra linguagem e gostaria de aprender Python rapidamente, recomendamos o livro `Dive Into Python`_. Se ele não for muito o seu estilo, existem alguns outros `livros sobre Python`_.

source: Quick install guide
es: Guía de instalación rápida
pt_br: Guia de instalação rápida

source: Before you can use Django, you'll need to get it installed. We have a :doc:`complete installation guide </topics/install>` that covers all the possibilities; this guide will guide you to a simple, minimal installation that'll work while you walk through the introduction.
es: Antes de que pueda utilizar Django, necesitará instalarlo. Tenemos un: doc: manual de instalación completo </topics/install>` que cubre todas las posibilidades; este manual le orientará a una instalación mínima y sencilla y funcionará mientras lo guía por la introducción.
pt_br: Antes que você possa usar o Django, você precisará dele instalado. Temos o :doc:`guia de instalação completo </topics/install>` que mostra todas as possibilidades. Este guia irá orientá-lo para uma instalação mínima e simples que será funcional enquanto você caminha pela introdução.

source: Install Python
es: Instale Python
pt_br: Instalando Python

source: Being a Python Web framework, Django requires Python. See :ref:`faq-python-version-support` for details. Python includes a lightweight database called SQLite_ so you won't need to set up a database just yet.
es: Al ser un framework web de Python, Django requiere Python. Consulte: ref: `faq-python-version-support` para más detalles. Python contiene una base de datos ligera llamada SQLite_ por lo que no tendrá que crear una base de datos por el momento.
pt_br: Sendo um framework Web Python, Django requer Python. Veja :ref:`faq-python-version-support` para detalhes. Python inclui um banco de dados leve chamado SQLite_ então você não precisa configurar um banco de dados agora.

source: Get the latest version of Python at https://www.python.org/download/ or with your operating system's package manager.
es: Obtenga la última versión de Python en https://www.python.org/download/ o con el administrador de paquetes de su sistema operativo.
pt_br: Baixe a ultima versão do Python em https://www.python.org/download/ ou no gerenciador de pacote do seu sistema operacional.

source: Django on Jython
es: Django sobre Jython
pt_br: Django no Jython

source: If you use Jython_ (a Python implementation for the Java platform), you'll need to follow a few additional steps. See :doc:`/howto/jython` for details.
es: Si utiliza Jython_ (una implementación de Python para la plataforma Java), tendrá que seguir unos pasos adicionales. Consulte: doc: `/ howto / jython` para más detalles.
pt_br: Se você usa o Jython_ (uma implementação do Python para a plataforma Java), você precisa seguir alguns passos adicionais. Veja :doc:`/howto/jython` para maiores informações.

source: You can verify that Python is installed by typing ``python`` from your shell; you should see something like::
es: Puede comprobar que Python está instalado escribiendo `` python`` desde su shell; debe ver algo como::
pt_br: Você pode verificar se o Python está instalado digitando ``python`` no shell, você deve ver algo como::

source: Set up a database
es: Cree una base de datos
pt_br: Configure um banco de dados

source: This step is only necessary if you'd like to work with a "large" database engine like PostgreSQL, MySQL, or Oracle. To install such a database, consult the :ref:`database installation information <database-installation>`.
es: Este paso sólo es necesario si desea trabajar con un motor de base de datos "grande" como PostgreSQL, MySQL u Oracle. Para instalar una base de datos, consulte la: ref: `información sobre la instalación de bases de datos <database-installation> `.
pt_br: Esta etapa só é necessária se você deseja trabalhar com um motor "maior" de banco de dados como PostgreSQL, MySQL ou Oracle. Para instalar algum desses bancos de dados, consulte as :ref:`informações sobre a instalação do banco de dados <database-installation>`.

source: Remove any old versions of Django
es: Desinstale las versiones anteriores de Django
pt_br: Remova qualquer versão antiga do Django
