Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: So you've read all the :doc:`introductory material </intro/index>` and have decided you'd like to keep using Django. We've only just scratched the surface with this intro (in fact, if you've read every single word, you've read about 5% of the overall documentation).
es: De modo que usted ha leído todo el: doc: `material introductorio </intro/index> ` y ha decidido que le gustaría seguir usando Django. Sólo hemos arañado la superficie con esta introducción (de hecho, si usted ha leído cada palabra, usted ha leído un 5% de la totalidad de la documentación).
pt_br: Então você leu todo o :doc:`material introdutório </intro/index>` e decidiu que você gostaria de continuar a usar Django. Nós apenas arranhamos a superfície nesta introdução (de fato, se você leu cada palavra, você leu aproximadamente 5% de toda a documentação).

source: So what's next?
es: Ahora ¿Qué sigue?
pt_br: E agora?

source: Well, we've always been big fans of learning by doing. At this point you should know enough to start a project of your own and start fooling around. As you need to learn new tricks, come back to the documentation.
es: Bueno, siempre hemos sido grandes fans de aprender haciendo. En este punto, usted debe saber lo suficiente como para iniciar un proyecto por su cuenta y empezar a divertirse. Como usted necesita aprender nuevos trucos, vuelva a la documentación.
pt_br: Bem, nós sempre fomos muito fãs de aprender fazendo. Neste ponto você deve saber o bastante para iniciar um projeto próprio e começar a brincar com ele. Com você precisando aprender novos truques, volte para a documentação.

source: We've put a lot of effort into making Django's documentation useful, easy to read and as complete as possible. The rest of this document explains more about how the documentation works so that you can get the most out of it.
es: Hemos puesto un gran esfuerzo en hacer que la documentación de Django sea útil, fácil de leer y tan completa como sea posible. El resto de este documento explica más sobre cómo funciona la documentación para que pueda sacar el máximo provecho de ella.
pt_br: Nós colocamos muito esforço em fazer a documentação do Django útil, fácil de ler e o mais completa possível. O resto da documentação explica mais sobre como a documentação funciona para que você possa usar o melhor dela.

source: (Yes, this is documentation about documentation. Rest assured we have no plans to write a document about how to read the document about documentation.)
es: (Sí, se trata de documentación sobre la documentación. Tenga la seguridad de que no tenemos planes de escribir un documento de cómo leer el documento sobre la documentación.)
pt_br: (Sim, isto é documentação sobre a documentação. Esteja certo de que nós não temos planos de escrever um documento sobre como ler a documentação sobre a documentação.)

source: Finding documentation
es: Buscando documentación
pt_br: Encontrar documentação

source: Django's got a *lot* of documentation -- almost 450,000 words and counting -- so finding what you need can sometimes be tricky. A few good places to start are the :ref:`search` and the :ref:`genindex`.
es: Django tiene mucha documentación, casi 450,000 mil palabras y contando - por lo que encontrar lo que necesita a veces puede ser complicado. Algunos buenos lugares para empezar son la: ref: `búsqueda` y el: ref:` genindex`.
pt_br: Django tem um *monte* de documentação -- quase 450,000 e contando -- então encontrar o que você precisa pode ser um pouco complicado. Alguns bons lugares para começar são em :ref:`search` e :ref:`genindex`.

source: Or you can just browse around!
es: o ¡Simplemente usted puede echar un vistazo!
pt_br: Ou você pode simplesmente navegar por ai!

source: How the documentation is organized
es: Cómo está organizada la documentación
pt_br: Como a documentação é organizada

source: Django's main documentation is broken up into "chunks" designed to fill different needs:
es: La documentación principal de Django se divide en "trozos" diseñados para atender los diferentes requerimientos:
pt_br: A documentação principal do Django é dividida em dois "pedaços" desenhada para diferentes necessidades:

source: The :doc:`introductory material </intro/index>` is designed for people new to Django -- or to Web development in general. It doesn't cover anything in depth, but instead gives a high-level overview of how developing in Django "feels".
es: El: doc: `material introductorio </intro/index> ` está diseñado para los principiantes en Django en el desarrollo web en general. No trata nada en profundidad, sino que da una introducción de alto nivel de cómo desarrollar en Django "feels".
pt_br: O :doc:`material introdutório </intro/index>` é desenhado para pessoas novas ao Django -- ou para desenvolvimento web em geral. Ela não cobre nada profundamente, mas dá uma visão abstraida de como é o "sentimento" de desenvolver em Django.

source: The :doc:`topic guides </topics/index>`, on the other hand, dive deep into individual parts of Django. There are complete guides to Django's :doc:`model system </topics/db/index>`, :doc:`template engine </topics/templates>`, :doc:`forms framework </topics/forms/index>`, and much more.
es: Por otro lado, las: doc: `guías temáticas </topics/index> ` profundizan en las secciones individuales de Django. Hay guías completas para el :doc: sistema de modelos de Django </topics/db/index> `,: doc:` motor de plantillas </topics/templates> `,: doc:`framework de formularios </topics/forms/index> ` y mucho más.
pt_br: Os :doc:`tópicos guias </topics/index>`, em outra mão, se aprofundam em partes individuais do Django. Existem guias completos do :doc:`sistema de modelos </topics/db/index>` do Django, :doc:`motor de template </topics/templates>`, :doc:`formulários do framework </topics/forms/index>`, e muito mais.

source: This is probably where you'll want to spend most of your time; if you work your way through these guides you should come out knowing pretty much everything there is to know about Django.
es: Aquí es probablemente donde usted querrá pasar la mayor parte de su tiempo; si usted avanza en el estudio de estas guías debe salir sabiendo casi todo lo que hay que saber acerca de Django.
pt_br: Aqui é provavelmente onde você vai querer gastar a maior parte do seu tempo; se você seguir os guias, você vai aprender tudo que existe sobre Django.

source: Web development is often broad, not deep -- problems span many domains. We've written a set of :doc:`how-to guides </howto/index>` that answer common "How do I ...?" questions. Here you'll find information about :doc:`generating PDFs with Django </howto/outputting-pdf>`, :doc:`writing custom template tags </howto/custom-template-tags>`, and more.
es: El desarrollo web suele ser amplio, pero no profundo; losproblemas abarcan muchos ámbitos. Hemos escrito un conjunto de: doc: `guías de cómo hacerlo </howto/index> ` que responden las preguntas comúnes " ¿Cómo puedo ...?". Aquí encontrará información sobre: ​​doc: `Crear PDFs con Django </howto/outputting-pdf> `,: Doc:` escribir etiquetas de plantilla personalizadas </howto/custom-template-tags> `, y más.
pt_br: Desenvolvimento web normalmente é amplo, não profundo -- problemas aparecem em múltiplos domínios. Nós escrevemos um conjunto de :doc:`guias how-to </howto/index>` que respondem questões como "Como eu faço ....?". Aqui você vai encontrar informação sobre :doc:`gerando PDFs com Django </howto/outputting-pdf>`, :doc:`escrevendo tags de templates customizadas </howto/custom-template-tags>`, e mais.

source: Answers to really common questions can also be found in the :doc:`FAQ </faq/index>`.
es: Respuestas a preguntas muy comunes también se pueden encontrar en el: doc:`FAQ </faq/index>`.
pt_br: Respostas para questões usuais podem também ser encontradas no :doc:`FAQ </faq/index>`.

source: The guides and how-to's don't cover every single class, function, and method available in Django -- that would be overwhelming when you're trying to learn. Instead, details about individual classes, functions, methods, and modules are kept in the :doc:`reference </ref/index>`. This is where you'll turn to find the details of a particular function or whatever you need.
es: Las guías y cómos no abarcan cada clase, función y método disponible en Django, eso sería abrumador cuando usted está tratando de aprender. En su lugar, la información sobre las clases, funciones, métodos y módulos individuales se guardan en la: doc: `referencia </ref/index> `. Aquí es donde buscará la información sobre una función en particular o lo que usted necesite.
pt_br: Os guias e how-to's não cobrem cada uma das classes, funções e métodos disponíveis no Django -- isto seria informação demais enquanto vocês está tentando aprender. Ao invés, detalhes sobre as classes individuais, funções, métodos e módulos são mantidos na :doc:`referência </ref/index>`. Aqui é onde você vai encontrar detalhes de uma função particular ou qualquer coisa que você precise.

source: If you are interested in deploying a project for public use, our docs have :doc:`several guides</howto/deployment/index>` for various deployment setups as well as a :doc:`deployment checklist</howto/deployment/checklist>` for some things you'll need to think about.
es: Si usted está interesado en la implementación de un proyecto para el uso público, nuestros documentos tienen: doc: `varias guías </howto/deployment/index> ` para diversas configuraciones de implementación, así como una : doc:` lista de implementación </howto/deployment/checklist> ` para algunas cosas que usted tendrá que considerar.
pt_br: Se você está interessado em fazer o deploy de um projeto para uso público, nossa doc tem :doc:`diversos guias </howto/deployment/index>` para várias diferentes configurações de deploy assim como a :doc:`checklist de deploy </howto/deployment/checklist>` para algumas coisas que você vai precisar pensar.

source: Finally, there's some "specialized" documentation not usually relevant to most developers. This includes the :doc:`release notes </releases/index>` and :doc:`internals documentation </internals/index>` for those who want to add code to Django itself, and a :doc:`few other things that simply don't fit elsewhere </misc/index>`.
es: Por último, hay documentación "especializada" que no suele ser relevante para la mayoría de los desarrolladores. Esto incluye las: doc: `notas de la versión </releases/index> ` y la : doc:` documentación de los internos </internals/index> ` para aquellos que quieren añadir código a Django, y : doc:` otras cosas que simplemente no se ajustan en otros lugares </misc/index> `.
pt_br: Finalmente, existe alguma documentação "especializada" não normalmente relevante para a maioria dos desenvolvedores. Isto inclui o :doc:`notas da versão </releases/index>` e :doc:`documentação interna </internals/index>` para aquele que querem adicionar código ao Django em si, e a :doc:`algumas outras coisas que simplesmente não cabem em outros lugares </misc/index>`.

source: How documentation is updated
es: Cómo se actualiza la documentación
pt_br: Como a documentação é atualizada

source: Just as the Django code base is developed and improved on a daily basis, our documentation is consistently improving. We improve documentation for several reasons:
es: Así como el código base de Django se desarrolla y mejora día a día, nuestra documentación está mejorando constantemente. Mejoramos la documentación por varias razones:
pt_br: Assim como a base de código do Django é desenvolvida e melhorada em base diária, a nossa documentação está melhorando consistentemente. Nós melhoramos a documentação por várias razões:

source: To make content fixes, such as grammar/typo corrections.
es: Para hacer correcciones de contenido, como correcciones gramaticales.
pt_br: Para fazer correções do conteúdo, como correções gramaticais.

source: To add information and/or examples to existing sections that need to be expanded.
es: Para añadir información y / o ejemplos a las secciones existentes que necesitan ser ampliadas.
pt_br: Para adicionar informação e/ou exemplo para seções existentes que precisam ser expandidas.

source: To document Django features that aren't yet documented. (The list of such features is shrinking but exists nonetheless.)
es: Para documentar las características de Django que aún no están documentadas. (La lista de dichas características se reduce, sin embargo, existe a pesar de ello.)
pt_br: Para documentar funcionalidades que ainda não foram documentadas (a lista de tais funcionalidades está encolhendo, mas ainda existe).

source: To add documentation for new features as new features get added, or as Django APIs or behaviors change.
es: Para agregar la documentación de las nuevas características a medida que estas se añaden o cuando cambian las APIs de Django o los comportamientos.
pt_br: Para adicionar documentação de novas funcionalidades, logo que estas são adicionadas, ou se o comportamento de uma API do Django mudar.

source: Django's documentation is kept in the same source control system as its code. It lives in the `docs`_ directory of our Git repository. Each document online is a separate text file in the repository.
es: La documentación de Django se guarda en el mismo sistema de gestión de código fuente como su código. Está en el directorio `docs` de nuestro repositorio Git. Cada documento en línea es un archivo de texto separado en el repositorio.
pt_br: A documentação do Django é mantida no mesmo controle de versão que o seu código. Ela fica no diretório `docs`_ no nosso repositório. Cada documento online é separado em um arquivo de texto no repositório.

source: Where to get it
es: Dónde conseguirlo
pt_br: Onde obter isso

source: You can read Django documentation in several ways. They are, in order of preference:
es: Usted puede leer la documentación de Django de varias maneras. Ellos son, en orden de preferencia:
pt_br: Você pode ler a documentação Django em várias formas. Eles estão, em ordem de preferência:

source: On the Web
es: En la Web
pt_br: Na Web

source: The most recent version of the Django documentation lives at https://docs.djangoproject.com/en/dev/. These HTML pages are generated automatically from the text files in source control. That means they reflect the "latest and greatest" in Django -- they include the very latest corrections and additions, and they discuss the latest Django features, which may only be available to users of the Django development version. (See "Differences between versions" below.)
es: La versión más reciente de la documentación de Django se encuentra en https://docs.djangoproject.com/en/dev/. Estas páginas HTML se generan automáticamente a partir de los archivos de texto en el control de código fuente. Eso significa que muestran lo "último y lo mejor" de Django, ellas incluyen las últimas correcciones y adiciones, y abordan las últimas características de Django que sólo pueden estar disponibles para los usuarios de la versión de desarrollo de Django. (Consulte "Las diferencias entre las versiones" más a continuación.)
pt_br: A mais recente versão da documentação do Django fica em https://docs.djangoproject.com/en/dev/. Estas páginas HTML são geradas automaticamente com os arquivos no controle de versão. Isso significa que eles refletem o "último e o melhor" no Django -- eles incluem cada última correção e adição, e eles explicam os últimos aspectos do Django, que podem estar disponíveis apenas na versão em desenvolvimento do Django. (Veja as "Diferenças entre versões" abaixo.)

source: We encourage you to help improve the docs by submitting changes, corrections and suggestions in the `ticket system`_. The Django developers actively monitor the ticket system and use your feedback to improve the documentation for everybody.
es: Le animamos a ayudar a mejorar la documentación mediante la presentación de cambios, correcciones y sugerencias en el `sistema de reportes de incidencias`. Los desarrolladores de Django monitorean activamente el sistema de reportes de incidencias y utilizan sus comentarios y sugerencias para mejorar la documentación para todo el mundo.
pt_br: Nós lhe encorajamos a ajudar a melhorar a doc enviando as modificações, correções e sugestões no `sistema de tickets`_. Os desenvolvedores Django ativamente monitoram o sistema de Tickets e usam o seu feedback para melhorar a documentação todo mundo.

source: Note, however, that tickets should explicitly relate to the documentation, rather than asking broad tech-support questions. If you need help with your particular Django setup, try the |django-users| mailing list or the `#django IRC channel`_ instead.
es: Sin embargo, tenga en cuenta que las incidencias deberían estar relacionadas expresamente con la documentación, en lugar de hacer preguntas generales de soporte técnico. Si usted necesita ayuda con su configuración particular de Django, pruebe en su lugar la lista de correos de los |usuarios de django| o en el canal `#django ​​IRC `.
pt_br: Note, entretanto, que os tickets devem ser explicitamente relacionados a documentação, ao invés de questões amplas de de suporte. Se você precisa de ajuda com uma configuração de Django particular, tente a lista de e-mails |django-users| ou o canal IRC `#django`_ ao invés.

source: In plain text
es: En texto sin formato
pt_br: Em texto plano

source: For offline reading, or just for convenience, you can read the Django documentation in plain text.
es: Usted puede leer la documentación de Django en texto plano, para su lectura sin conexión a la red o simplemente por comodidad.
pt_br: Para uma leitura offline, ou somente para sua conveniência, você pode ler a documentação Django em arquivo texto.

source: If you're using an official release of Django, note that the zipped package (tarball) of the code includes a ``docs/`` directory, which contains all the documentation for that release.
es: Si estás usando una versión oficial de Django, tenga en cuenta que el paquete comprimido (tarball) del código incluye un directorio ``docs/`` que contiene toda la documentación de esa versión.
pt_br: Se você está usando uma versão oficial do Django, note que no arquivo comprimido (tarball) do código é incluido o diretório ``docs/``, que contem toda a documentação da versão.

source: If you're using the development version of Django (aka "trunk"), note that the ``docs/`` directory contains all of the documentation. You can update your Git checkout to get the latest changes.
es: Si está utilizando la versión de desarrollo de Django (también conocida como "tronco"), tenga en cuenta que el directorio ``docs/`` contiene toda la documentación. Puede actualizar su git checkout para recibir las últimas novedades.
pt_br: Se você está usando a versão de desenvolvimento do Django (aka "trunk"), note que o diretório ``docs/`` contem toda a documentação. Você pode atualizar seu git para pegar as últimas mudanças.

source: One low-tech way of taking advantage of the text documentation is by using the Unix ``grep`` utility to search for a phrase in all of the documentation. For example, this will show you each mention of the phrase "max_length" in any Django document:
es: Una forma antigua de aprovechar la documentación de textos es mediante el uso de la utilidad ``grep`` de Unix para buscar una expresión en toda la documentación. Por ejemplo, esta le mostrará cada referencia de la expresión "max_length" en cualquier documento de Django:
pt_br: Um maneira não tecnológica de tomar vantagem sobre a documentação em texto é usando o utilitário ``grep`` Unix para buscar por frases em toda a documentação. Por exemplo, isto irá lhe mostrar cada menção da frase "max_length" em qualquer documento Django:

source: As HTML, locally
es: Como HTML, localmente
pt_br: Como HTML, localmente

source: You can get a local copy of the HTML documentation following a few easy steps:
es: Usted puede obtener una copia local de la documentación HTML siguiendo unos sencillos pasos:
pt_br: Você pode obter uma cópia local da documentação HTML seguindo estes passos fáceis:

source: Django's documentation uses a system called Sphinx__ to convert from plain text to HTML. You'll need to install Sphinx by either downloading and installing the package from the Sphinx website, or with ``pip``:
es: La documentación de Django utiliza un sistema llamado Sphinx para convertir el texto plano en HTML. Usted tendrá que instalar Sphinx bien sea descargando e instalando el paquete desde el sitio web de Sphinx o con `` pip``:
pt_br: A documentação do Django usa um sistema chamado Sphinx__, para converter a partir de um texto simples para HTML você vai precisar instalar Sphinx por qualquer download e instalação do pacote através do site oficial do Sphinx, ou pelo ``pip``:

source: Then, just use the included ``Makefile`` to turn the documentation into HTML:
es: A continuación, sólo tiene que utilizar lo que se incluyó en `` Makefile`` para convertir la documentación en HTML:
pt_br: Então, apenas use o ``Makefile`` incluso para transformar a documentação em HTML:

source: You'll need `GNU Make`__ installed for this.
es: Usted tendrá que instalar `GNU Make`__ para esto.
pt_br: Você precisará do `GNU Make`__ instalado para isso.

source: If you're on Windows you can alternatively use the included batch file:
es: Si está en Windows puede utilizar alternativamente el archivo batch incluido
pt_br: Se você estiver no Window, você pode, alternativamente, usar o arquivo batch:

source: The HTML documentation will be placed in ``docs/_build/html``.
es: La documentación HTML se situará en '' docs/_build/html ''.
pt_br: A documentação em HTML será colocado em ``docs/_build/html``.

source: Generation of the Django documentation will work with Sphinx version 0.6 or newer, but we recommend going straight to Sphinx 1.0.2 or newer.
es: La generación de la documentación de Django funcionará con la versión 0.6 de Sphinx o con versiones más recientes, pero se recomienda ir directamente a la versión 1.0.2 de Sphinx o a versiones más recientes.
pt_br: A geração da documentação do Django funcionará com as versões 0.6 ou mais novas do Sphinx, mas recomendamos ir direto para a versão 1.0.2 ou mais recente.

source: Differences between versions
es: Diferencias entre versiones
pt_br: Diferenças entre versões

source: As previously mentioned, the text documentation in our Git repository contains the "latest and greatest" changes and additions. These changes often include documentation of new features added in the Django development version -- the Git ("trunk") version of Django. For that reason, it's worth pointing out our policy on keeping straight the documentation for various versions of the framework.
es: Como se mencionó anteriormente, la documentación de textos en nuestro repositorio Git contiene los "últimos y los mejores" cambios y adiciones. Estos cambios suelen incluir la documentación de las nuevas características que se añaden en la versión de desarrollo de Django; la versión Git ("tronco") de Django. Por esa razón, vale la pena señalar nuestra política de continuar la documentación para distintas versiones del framework.
pt_br: Como já mencionado anteriormente, o texto da documentação em nosso repositório Git contém as "últimas e melhores" mudanças e adições. Estas mudanças geralmente incluem a documentação de novos aspectos adicionados na versão de desenvolvimento do Django -- a versão Git ("trunk") do Django. Por esta razão, é importante informar que a nossa política de manter documentação correta para varias versões do framework.

source: We follow this policy:
es: Seguimos esta política:
pt_br: Nós seguimos esta política:
