Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: Create a ``django-polls/LICENSE`` file. Choosing a license is beyond the scope of this tutorial, but suffice it to say that code released publicly without a license is *useless*. Django and many Django-compatible apps are distributed under the BSD license; however, you're free to pick your own license. Just be aware that your licensing choice will affect who is able to use your code.
es: Cree un archivo ``django-polls/LICENSE``. Elegir una licencia está fuera del alcance de este tutorial, pero basta con señalar que el código liberado públicamente sin ninguna licencia es inútil. Django y muchas aplicaciones compatibles con Django se distribuyen bajo la licencia BSD, sin embargo, usted es libre de elegir su propia licencia. Sólo tenga en cuenta que la elección de su licencia repercutirá sobre quién podrá utilizar su código.
pt_br: Crie um arquivo ``django-polls/LICENSE``. Escolher uma licença está fora do escopo deste tutorial, mas é suficiente dizer que código distribuído publicamente sem uma licença é *inútil*. Djando e muitas aplicações compatíveis com o Django são distribuídas sob a licença BSD; no entanto, você é livre para escolher sua própria licença. Apenas esteja ciente que a escolha da sua licença afetará quem pode usar seu código.

source: Next we'll create a ``setup.py`` file which provides details about how to build and install the app. A full explanation of this file is beyond the scope of this tutorial, but the `setuptools docs <https://pythonhosted.org/setuptools/setuptools.html>`_ have a good explanation. Create a file ``django-polls/setup.py`` with the following contents:
es: A continuación crearemos un archivo ``setup.py`` que proporciona información detallada sobre cómo crear e instalar la aplicación. Una explicación exhaustiva de este archivo esta fuera del alcance de este tutorial, pero `los documentos setuptools <https://pythonhosted.org/setuptools/setuptools.html>`_ tienen una buena explicación. Cree un archivo ``django-polls/setup.py`` con el siguiente contenido:
pt_br: Próximo criaremos o arquivo ``setup.py`` o qual fornece detalhes de como instalar ou fazer o build da app. A explicação completa sobre este arquivo está além do escopo deste tutorial, mas o `setuptools docs <https://pythonhosted.org/setuptools/setuptools.html>`_ tem uma boa explicação .Crie o arquivo ``django-polls/setup.py`` com o seguinte conteúdo:

source: Only Python modules and packages are included in the package by default. To include additional files, we'll need to create a ``MANIFEST.in`` file. The setuptools docs referred to in the previous step discuss this file in more details. To include the templates, the ``README.rst`` and our ``LICENSE`` file, create a file ``django-polls/MANIFEST.in`` with the following contents:
es: Solo se incluyen los módulos y paquetes de Python en el paquete de forma predeterminada. Para incluir archivos adicionales, tendremos que crear un archivo ``MANIFEST.in``. Los documentos setuptools referidos en el paso anterior abordan este archivo de forma detallada. Para incluir las plantillas, el ``README.rst`` y nuestro archivo ``LICENSE``, cree un archivo ``django-polls/MANIFEST.in`` con el siguiente contenido:
pt_br: Por padrão, apenas módulos e pacotes Python são incluídos no pacote. Para incluir arquivos adicionais, precisaremos criar um arquivo ``MANIFEST.in``. A documentação do setuptools citada no passo anterior, fala deste arquivo em mais detalhes. Para incluir o templates, o ``README.rst`` e nosso arquivo ``LICENSE``, crie um arquivo ``django-polls/MANIFEST.in`` com o seguinte conteúdo:

source: It's optional, but recommended, to include detailed documentation with your app. Create an empty directory ``django-polls/docs`` for future documentation. Add an additional line to ``django-polls/MANIFEST.in``::
es: Es opcional pero se recomienda incluir documentación detallada con su aplicación. Cree un directorio ``django-polls/docs`` vacío para la futura documentación. Agregue una línea adicional al archivo ``django-polls/MANIFEST.in``::
pt_br: É opcional, mas recomendado, incluir uma documentação detalhada com sua aplicação. Crie um diretório ``django-polls/docs`` vazio, para futura documentação. Adicione uma linha a mais ao

source: Note that the ``docs`` directory won't be included in your package unless you add some files to it. Many Django apps also provide their documentation online through sites like `readthedocs.org <https://readthedocs.org>`_.
es: Tenga en cuenta que el directorio ``docs`` no se incluirá en su paquete a menos que usted agregue algunos archivos a este. Muchas aplicaciones Django proporcionan también su documentación online a través de sitios como `readthedocs.org <https://readthedocs.org>`_.
pt_br: Note que o diretório ``docs`` não será incluido no seu pacote a menos que você adicione alguns arquivos para ele. Muitas aplicações Django fornecem sua documentação online através de sites como

source: Try building your package with ``python setup.py sdist`` (run from inside ``django-polls``). This creates a directory called ``dist`` and builds your new package, ``django-polls-0.1.tar.gz``.
es: Intente crear su paquete con ``python setup.py sdist`` (ejecute desde dentro de ``django-polls``). Esto crea un directorio llamado ``dist`` y crea su nuevo paquete, ``django-polls-0.1.tar.gz``.
pt_br: Tente criar seu pacote com ``python setup.py sdist`` (execute dentro do diretório ``django-polls``). Esse comando cria um diretório chamado ``dist`` e cria seu novo pacote,

source: For more information on packaging, see Python's `Tutorial on Packaging and Distributing Projects <https://packaging.python.org/en/latest/distributing.html>`_.
es: Para obtener más información sobre cómo empaquetar, vea `El tutorial de Python sobre cómo empaquetar y distribuir proyectos <https://packaging.python.org/en/latest/distributing.html> ` _.
pt_br: Para mais informações sobre empacotamento, veja `Tutorial Python sobre Empacotamento e Distribuição de Projetos <https://packaging.python.org/en/latest/distributing.html>`_.

source: Using your own package
es: Usando su propio paquete
pt_br: Utilizando o seu próprio pacote

source: Since we moved the ``polls`` directory out of the project, it's no longer working. We'll now fix this by installing our new ``django-polls`` package.
es: Dado que movimos el directorio ``polls`` fuera del proyecto, ya no funciona. Vamos a solucionar esto mediante la instalación de nuestro nuevo paquete ``django-polls``.
pt_br: Uma vez que movemos o diretório ``polls`` para fora do projeto, ele não funciona mais. Vamos consertar isso agora ao instalar nosso novo pacote ``django-polls``.

source: Installing as a user library
es: Instalando como un usuario de biblioteca
pt_br: Instalando uma biblioteca de usuário

source: The following steps install ``django-polls`` as a user library. Per-user installs have a lot of advantages over installing the package system-wide, such as being usable on systems where you don't have administrator access as well as preventing the package from affecting system services and other users of the machine.
es: Los siguientes pasos instalan ``django-polls``como un usuario de biblioteca. Per-user installs tiene muchas ventajas con respecto a instalar todo el sistema de paquetes, tal como estar disponible para usar en sistemas donde no tienes acceso de administrador así como impedir que el paquete afecte los servicios del sistema y a otros usuarios de la computadora.
pt_br: Os passos a seguir instalam ``django-polls`` como uma biblioteca do usuário. Instalação por usuário tem uma série de vantagens sobre a instalação do pacote em todo o sistema, tais como ser utilizável em sistemas onde você não tem acesso de administrador, bem como prevenir o pacote de afetar serviços do sistema e outros usuários da máquina.

source: Note that per-user installations can still affect the behavior of system tools that run as that user, so ``virtualenv`` is a more robust solution (see below).
es: Tenga en cuenta que las instalaciones por usuario todavía pueden afectar el comportamiento de las herramientas del sistema que el usuario ejecutará, por lo que ``virtualenv`` es una solución más confiable (vea a continuación).
pt_br: Note que instalações por usuário pode ainda afetar o comportamento de ferramentas do sistema que são executados com esse usuário, então ``virtualenv`` é uma solução mais robusta (veja abaixo):

source: To install the package, use pip (you already :ref:`installed it <installing-reusable-apps-prerequisites>`, right?)::
es: Para instalar el paquete, use pip (ya lo instaló :ref:` <installing-reusable-apps-prerequisites>`), ¿cierto?::
pt_br: Para instalar o pacote, use o pip (você já :ref:`instalou isso <installing-reusable-apps-prerequisites>`, certo?)::

source: With luck, your Django project should now work correctly again. Run the server again to confirm this.
es: Con suerte, su proyecto Django ahora debería funcionar de nuevo correctamente. Ejecute el servidor de nuevo para confirmar esto.
pt_br: Com sorte, seu projeto Django deverá agora funcionar corretamente de novo. Inicie o servidor novamente para confirmar.

source: To uninstall the package, use pip::
es: Para desinstalar el paquete, utilice pip ::
pt_br: Para desinstalar o pacote, use o pip::

source: Publishing your app
es: Editando su aplicación
pt_br: Publicando sua aplicação

source: Now that we've packaged and tested ``django-polls``, it's ready to share with the world! If this wasn't just an example, you could now:
es: Ahora que hemos envasados ​​y probado `` django-polls``, está listo para compartir con el mundo! Si esto no era más que un ejemplo, usted ahora podría:
pt_br: Agora que nós empacotamos e testamos ``django-polls``, ele está pronto para ser compartilhado com o mundo! Se isso não foi apenas um exemplo, você pode agora:

source: Email the package to a friend.
es: Enviar por correo electrónico el paquete a un amigo.
pt_br: Enviar o pacote por email para um amigo.

source: Upload the package on your website.
es: Subir el paquete en su sitio web.
pt_br: Enviar o pacote para seu site.

source: Post the package on a public repository, such as `the Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ has `a good tutorial <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ for doing this.
es: Publique el paquete en un repositorio público, tal como `el índice de paquetes Python (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ tiene un buen tutorial para hacerlo <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_.
pt_br: Postar o pacote em um repositório público, por exemplo, o `Python Package Index (PyPI)`_. No `packaging.python.org <https://packaging.python.org>`_ há `um bom tutorial<https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ para você fazer isso.

source: Installing Python packages with virtualenv
es: Instalando los paquetes Python con virtualenv
pt_br: Instalando pacotes Python com virtualenv

source: Earlier, we installed the polls app as a user library. This has some disadvantages:
es: Anteriormente, instalamos la aplicación encuestas como una biblioteca de usuario. Esto presenta algunas desventajas:
pt_br: Anteriormente, nós instalamos nosso app de votação como uma biblioteca de usuário. Isso tem algumas desvantagens:

source: Modifying the user libraries can affect other Python software on your system.
es: Modificar las bibliotecas de usuario puede afectar a otro programa Python en su sistema.
pt_br: Modificar as bibliotecas de usuário pode afetar outros softwares em Python do seu sistema.

source: You won't be able to run multiple versions of this package (or others with the same name).
es: Usted no podrá ejecutar distintas versiones de este paquete (u otros con el mismo nombre).
pt_br: Você não poderá rodar versões diferentes do seu pacote (ou outros pacotes com o mesmo nome).

source: Typically, these situations only arise once you're maintaining several Django projects. When they do, the best solution is to use `virtualenv <http://www.virtualenv.org/>`_. This tool allows you to maintain multiple isolated Python environments, each with its own copy of the libraries and package namespace.
es: Por lo general, estas situaciones solo se presentan una vez que estés manteniendo varios proyectos Django. Cuando ellos lo hacen, la mejor solución es usar `virtualenv <http://www.virtualenv.org/>`_. Esta herramienta te permite mantener múltiples entornos Python aislados, cada uno con su propia copia de las bibliotecas y del espacio de nombres de paquetes.
pt_br: Tipicamente, essas situações apenas aparecem quando você está mantendo muitos projetos em Django. Quando isso acontece, a melhor solução é utilizar `virtualenv <http://www.virtualenv.org/>`_. Essa ferramenta permite que você mantenha vários ambientes de Python isolados, cada um com sua própria cópia de bibliotecas e namespace de pacotes.

source: Writing your first Django app, part 1
es: Escribiendo su primera aplicación en Django, parte 1
pt_br: Escrevendo seu primeiro app Django, parte 1

source: Let's learn by example.
es: Aprendamos con el ejemplo.
pt_br: Vamos aprender por um exemplo.

source: Throughout this tutorial, we'll walk you through the creation of a basic poll application.
es: A través de este tutorial le mostraremos cómo crear una aplicación encuesta básica.
pt_br: Através deste tutorial, nós vamos caminhar através da criação de uma aplicação básica de enquetes.

source: It'll consist of two parts:
es: Consistirá de dos partes:
pt_br: Ela irá consistir de duas partes:

source: A public site that lets people view polls and vote in them.
es: Un sitio público que le permite a las personas ver encuestas y votar en ellas.
pt_br: Uma página pública que permitirá que pessoas vejam as enquetes e votem nelas.

source: An admin site that lets you add, change, and delete polls.
es: Un sitio administrativo que le permite añadir, modificar y borrar encuestas.
pt_br: Um site de administração que permite adicionar, alterar e deletar enquetes.

source: We'll assume you have :doc:`Django installed </intro/install>` already. You can tell Django is installed and which version by running the following command:
es: Asumiremos que :doc:` ya ha instalado Django </intro/install>`.Puede indicar que Django está instalado y cuál versión ejecutando el siguiente comando:
pt_br: Vamos assumir que você já tem o :doc:`Django instalado </intro/install>`. Você pode verificar se o Django está instalado e qual versão está rodando executando o seguinte comando:

source: If Django is installed, you should see the version of your installation. If it isn't, you'll get an error telling "No module named django".
es: Si Django está instalado, debe ver la versión de su instalación. Si no es así, obtendrá un error indicando que "No existe el módulo llamado Django".
pt_br: Se o Django estiver instalado, você verá a versão de suas instalçaõ. Se não estiver, você receberá uma mensagem de erro dizendo "No module named django".

source: This tutorial is written for Django |version| and Python 3.4 or later. If the Django version doesn't match, you can refer to the tutorial for your version of Django by using the version switcher at the bottom right corner of this page, or update Django to the newest version. If you are still using Python 2.7, you will need to adjust the code samples slightly, as described in comments.
es: Este tutorial está escrito para la versión Django y Python 3.4 o versiones posteriores. Si la versión de Django no coincide, puede consultar el tutorial para su versión de Django usando el conmutador de versión que se encuentra en la esquina inferior derecha de esta página, o actualizar Django a la versión más reciente. Si todavía está utilizando Python 2.7, tendrá que ajustar las muestras de código un poco, como se describe en los comentarios.
pt_br: Este tutorial é escrito para Django |version| e Python 3.4 ou superior. Se a versão do Django não é a mesma, você referenciar o tutorial par sua versão de Django usando o alterador de versão no canto inferior direito desta página, ou atualizar o Django para a versão mais nova. Se ainda estiver usando python 2.7, é necessário fazer pequenos ajustes nos exemplos de código, como descrito nos comentários.

source: See :doc:`How to install Django </topics/install>` for advice on how to remove older versions of Django and install a newer one.
es: Consulte :doc: `Cómo instalar Django </topics/install>` para obtener información sobre cómo desinstalar versiones anteriores de Django e instalar una versión más reciente.
pt_br: Veja :doc:`Como instalar o Django </topics/install>` para recomendação sobre como remover versões antigas do Django e instar uma mais recente.

source: If you're having trouble going through this tutorial, please post a message to |django-users| or drop by `#django on irc.freenode.net <irc://irc.freenode.net/django>`_ to chat with other Django users who might be able to help.
es: Si tiene problemas leyendo este tutorial, por favor envíe un mensaje a django-users| o visite `#django on irc.freenode.net <irc://irc.freenode.net/django>`_ para chatear con otros usuarios de Django que puedan ayudar.
pt_br: Se você estiver tendo problemas no decorrer desse tutorial, por favor envie uma mensagem para |django-users| ou deixe-a em `#django-br on irc.freenode.net <irc://irc.freenode.net/django-br>`_ para bater-papo com outros usuários Django dispostos a ajudar.

source: Creating a project
es: Creando un proyecto
pt_br: Criando um projeto

source: If this is your first time using Django, you'll have to take care of some initial setup. Namely, you'll need to auto-generate some code that establishes a Django :term:`project` -- a collection of settings for an instance of Django, including database configuration, Django-specific options and application-specific settings.
es: Si esta es la primera vez que utiliza Django, tendrá que hacerse cargo de una configuración inicial. Concretamente, tendrá que autogenerar un código que establezca un :term: `proyecto` Django; un conjunto de ajustes para una instancia de Django, incluida la configuración de la base de datos, opciones específicas de Django y configuraciones específicas de la aplicación.
pt_br: Se esta é a primeira vez em que você está utilizando o Django, você terá que preocupar-se com algumas configurações iniciais. Isto é, você precisará auto-gerar um código para iniciar um :term:`projeto` Django -- uma coleção de configurações para uma instância do Django, incluindo configuração do banco de dados, opções específicas do Django e configurações específicas da aplicação.

source: From the command line, ``cd`` into a directory where you'd like to store your code, then run the following command:
es: Desde la línea de comandos, cámbiese a un directorio donde le gustaría almacenar su código, luego, ejecute el siguiente comando:
pt_br: A partir da linha de comando, ``cd`` para o diretório onde você gostaria de armazenar seu código, então execute o seguinte comando:

source: This will create a ``mysite`` directory in your current directory. If it didn't work, see :ref:`troubleshooting-django-admin`.
es: Esto creará un directorio ``mysite`` en su directorio actual. Si no funcionó, consulte :ref: `resolución de problemas del sitio administrativo Django`.
pt_br: Isto irá criar o diretório ``mysite`` no seu diretório atual. Se não funcionar, veja :ref:`troubleshooting-django-admin`.

source: You'll need to avoid naming projects after built-in Python or Django components. In particular, this means you should avoid using names like ``django`` (which will conflict with Django itself) or ``test`` (which conflicts with a built-in Python package).
es: Tendrá que evitar que el proyecto tenga el mismo nombre de algún componente integrado de Python o Django. En particular, esto quiere decir que debe evitar usar nombres como ``django`` (que entrará en conflicto con Django mismo) o “prueba” (que entrará en conflicto con un paquete interno de Python).
pt_br: Você precisará evitar dar nomes a projetos que remetam a componentes internos do Python ou do Django. Particularmente, isso significa que você deve evitar usar nomes como ``django`` (que irá conflitar com o próprio Django) ou ``test`` (que irá conflitar com um pacote interno do Python).

source: Where should this code live?
es: ¿Dónde debería estar este código?
pt_br: Onde esse código deveria existir?

source: If your background is in plain old PHP (with no use of modern frameworks), you're probably used to putting code under the Web server's document root (in a place such as ``/var/www``). With Django, you don't do that. It's not a good idea to put any of this Python code within your Web server's document root, because it risks the possibility that people may be able to view your code over the Web. That's not good for security.
es: Si su experiencia anterior es usando PHP (sin uso de frameworks modernos), probablemente esté acostumbrado a ubicar el código en la raíz de documentos del servidor Web (en un lugar como ``/var/www``). Con Django esto no es así. No es una buena idea poner algún código Python en el elemento raíz del documento del servidor Web porque existe la posibilidad de que personas puedan ver su código en la Web. Eso no es bueno en términos de seguridad.
pt_br: Se você tem experiência prévia em PHP (sem o uso de um framework moderno), você deve estar acostumado a colocar o código dentro do "document root" de seu servidor Web (em um lugar como ``/var/www``). Com o Django você não fará isto. Não é uma boa ideia colocar qualquer código Python no document root de seu servidor Web, porque existe o risco de pessoas conseguirem ver seu código através da Web. Isso não é bom para a segurança.

source: Put your code in some directory **outside** of the document root, such as :file:`/home/mycode`.
es: Introduzca su código en algún directorio fuera del elemento raíz del documento, como por ejemplo: archivo: `/home/mycode`.
pt_br: Coloque seu código em algum diretório **fora** do document root, como em :file:`/home/mycode`.

source: Let's look at what :djadmin:`startproject` created::
es: Veamos lo que creó: djadmin:` iniciar proyecto `::
pt_br: Vamos ver o que o :djadmin:`startproject` criou::

source: These files are:
es: Estos archivos son:
pt_br: Esses arquivos são:

source: The outer :file:`mysite/` root directory is just a container for your project. Its name doesn't matter to Django; you can rename it to anything you like.
es: : Archivo: El directorio raíz exterior `mysite/`solo es un contenedor de su proyecto. Su nombre no es relevante para Django; usted puede cambiarle el nombre a lo que quiera.
pt_br: O arquivo :file:`mysite/` exterior é apenas um contêiner para o seu projeto. Seu nome não importa para Django; você pode renomeá-lo para qualquer nome que você quiser.

source: :file:`manage.py`: A command-line utility that lets you interact with this Django project in various ways. You can read all the details about :file:`manage.py` in :doc:`/ref/django-admin`.
es: :Archivo: `manage.py`: Una utilidad de la línea de comandos que le permite interactuar con este proyecto Django de diferentes formas. Puede leer todos los detalles sobre :archivo:`manage.py` en el :doc: :`/ref/django-admin`.
pt_br: :file:`manage.py`: Um utilitário de linha de comando que permite a você interagir com esse projeto Django de várias maneiras. Você pode ler todos os detalhes sobre o :file:`manage.py` em :doc:`/ref/django-admin`.
