Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: The inner :file:`mysite/` directory is the actual Python package for your project. Its name is the Python package name you'll need to use to import anything inside it (e.g. ``mysite.urls``).
es: :Archivo: el directorio interior `mysite/` es el paquete verdadero de Python para su proyecto. Su nombre es el nombre del paquete de Python que usted tendrá que utilizar para importar todo dentro de este (por ejemplo, `` mysite.urls``).
pt_br: O arquivo :file:`mysite/` interior é o pacote Python para o seu projeto. Seu nome é o nome do pacote Python que você vai precisar usar para importar coisas do seu interior (por exemplo, ``mysite.urls``).

source: :file:`mysite/__init__.py`: An empty file that tells Python that this directory should be considered a Python package. (Read `more about packages`_ in the official Python docs if you're a Python beginner.)
es: :Archivo: `mysite/__init__.py`: Un archivo vacío que le indica a Python que este directorio debería ser considerado como un paquete Python (lea ` más sobre paquetes` en la documentación oficial de Python si eres principiante).
pt_br: :file:`mysite/__init__.py`: Um arquivo vazio que diz ao Python que esse diretório deve ser considerado como um pacote Python. (Leia `mais sobre pacotes`_ na documentação oficial do Python se você for iniciante em Python.)

source: :file:`mysite/settings.py`: Settings/configuration for this Django project. :doc:`/topics/settings` will tell you all about how settings work.
es: :Archivo: `mysite/settings.py`: Ajustes/configuración para este proyecto Django. :doc:`/topics/settings` le indicará todo sobre cómo funciona la configuración.
pt_br: :file:`mysite/settings.py`: Configurações para este projeto Django. :doc:`/topics/settings` Irá revelar para você tudo sobre o funcionamento do ``settings``.

source: :file:`mysite/urls.py`: The URL declarations for this Django project; a "table of contents" of your Django-powered site. You can read more about URLs in :doc:`/topics/http/urls`.
es: : Archivo: `mysite / urls.py`: Las declaraciones URL para este proyecto Django; una "tabla de contenidos" de su sitio basado en Django. Puede leer más sobre las URLs en: doc: `/topics/http/urls`.
pt_br: :file:`mysite/urls.py`: As declarações de URLs para este projeto Django; um "índice" de seu site movido a Django. Você pode ler mais sobre URLs em :doc:`/topics/http/urls`.

source: :file:`mysite/wsgi.py`: An entry-point for WSGI-compatible web servers to serve your project. See :doc:`/howto/deployment/wsgi/index` for more details.
es: : Archivo: `mysite / wsgi.py`: Un punto de acceso para los servidores web compatibles con WSGI para servir a su proyecto. Consulte :doc:`/howto/deployment/wsgi/index`para más detalles.
pt_br: :file:`mysite/wsgi.py`: Um ponto de integração para servidores WEB compatíveis com WSGI usado para servir seu projeto. Veja :doc:`/howto/deployment/wsgi/index` para mais detalhes.

source: The development server
es: El servidor de desarrollo
pt_br: O servidor de desenvolvimento

source: Let's verify your Django project works. Change into the outer :file:`mysite` directory, if you haven't already, and run the following commands:
es: Comprobemos que su proyecto Django funciona. Cámbiese al : file: directorio exterior `mysite`, si todavía no lo ha hecho, y ejecute los siguientes comandos:
pt_br: Vamos verificar se ele funciona. Vá para o diretório :file:`mysite`, se você ainda não estiver nele, e rode os seguintes comando:

source: You'll see the following output on the command line:
es: Verá el siguiente output en la línea de comandos:
pt_br: Você vera a seguinte saída na sua linha de comando:

source: Ignore the warning about unapplied database migrations for now; we'll deal with the database shortly.
es: Ignore por ahora la advertencia sobre las migraciones de bases de datos sin aplicar, nos ocuparemos de la base de datos dentro de poco.
pt_br: Por hora, ignore os avisos sobre as migrações do banco de dados não aplicadas; lidaremos com o banco de dados brevemente.

source: You've started the Django development server, a lightweight Web server written purely in Python. We've included this with Django so you can develop things rapidly, without having to deal with configuring a production server -- such as Apache -- until you're ready for production.
es: Usted ha iniciado el servidor en desarrollo de Django, un servidor web ligero escrito puramente en Python. Lo hemos incluido con Django para que pueda desarrollar cosas rápidamente sin tener que lidiar con la configuración de un servidor en producción, como Apache, hasta que esté listo para la producción.
pt_br: Você iniciou o servidor de desenvolvimento do Django, um servidor Web leve escrito puramente em Python. Nós incluímos ele com o Django, então você pode desenvolver coisas rapidamente, sem ter que lidar com a configuração de um servidor Web de produção -- como o Apache -- até que você esteja pronto para a produção.

source: Now's a good time to note: **don't** use this server in anything resembling a production environment. It's intended only for use while developing. (We're in the business of making Web frameworks, not Web servers.)
es: Ahora es un buen momento para tener en cuenta que: ** no ** debe utilizar este servidor en algo parecido a un entorno de producción. Está pensado sólo para usarse durante el desarrollo (nuestro trabajo es crear Web frameworks , no servidores web.)
pt_br: Agora é uma boa hora para notar: **não** use esse servidor em nada relacionado a um ambiente de produção. Seu objetivo é ser utilizado apenas durante o desenvolvimento. (Nós estamos na atividade de criação de frameworks Web, não de servidores Web.)

source: Now that the server's running, visit http://127.0.0.1:8000/ with your Web browser. You'll see a "Welcome to Django" page, in pleasant, light-blue pastel. It worked!
es: Ahora que el servidor está funcionando, visite http://127.0.0.1:8000/ con su navegador Web. Verá la página "Bienvenido a Django", en un agradable color azul pastel, ¡Funcionó!
pt_br: Agora que o servidor está rodando, visite http://127.0.0.1:8000/ com seu navegador Web. Você irá ver a página "Welcome to Django", em agradáveis tons de azul claro pastel. Funcionou!

source: Changing the port
es: Cambiando el puerto
pt_br: Alterando a porta

source: By default, the :djadmin:`runserver` command starts the development server on the internal IP at port 8000.
es: De forma predeterminada, el: djadmin: comando ` runserver` inicia el servidor de desarrollo en la IP interna en el puerto 8000.
pt_br: Por padrão, o comando :djadmin:``runserver`` inicia o servidor de desenvolvimento no IP interno na porta 8000.

source: If you want to change the server's port, pass it as a command-line argument. For instance, this command starts the server on port 8080:
es: Si desea cambiar el puerto del servidor, pásalo como un argumento de la línea de comandos. Por ejemplo, este comando inicia el servidor en el puerto 8080:
pt_br: Se você quer mudar a porta do servidor, passe ela como um argumento na linha de comando. Por exemplo, este comando iniciará o servidor na porta 8080:

source: If you want to change the server's IP, pass it along with the port. So to listen on all public IPs (useful if you want to show off your work on other computers on your network), use:
es: Si desea cambiar la IP del servidor, pasala junto con el puerto. Así que para que escuche en todas las IPs públicas (útil si quiere mostrar su trabajo en otros equipos de la red), utilice:
pt_br: Se você quer mudar o IP do servidor, passe-o junto com a porta. Para então escutar em todos os IPs públicos (útil se você quer mostrar seu trabalho em outros computadores), use:

source: Full docs for the development server can be found in the :djadmin:`runserver` reference.
es: Se pueden encontrar documentos completos para el servidor de desarrollo en la: djadmin: referencia del ` runserver`.
pt_br: A documentação completa para o servidor de desenvolvimento está na referência :djadmin:`runserver`.

source: Automatic reloading of :djadmin:`runserver`
es: Recarga automática del: djadmin: `runserver`
pt_br: Releitura automática de :djadmin:`runserver`

source: The development server automatically reloads Python code for each request as needed. You don't need to restart the server for code changes to take effect. However, some actions like adding files don't trigger a restart, so you'll have to restart the server in these cases.
es: El servidor de desarrollo recarga de forma automática el código Python para cada petición cuando sea necesario. No es necesario reiniciar el servidor para que los cambios de código surtan efecto. Sin embargo, algunas acciones como la adición de archivos no provoca un reinicio, por lo que tendrá que reiniciar el servidor en estos casos.
pt_br: O servidor de desenvolvimento recarrega o código Python para cada solicitação, conforme necessário. Você não precisa reiniciar o servidor para alterações de código tenham efeito. No entanto, algumas ações como a adição de arquivos não iniciam uma reinicialização, então você terá que reiniciar o servidor nestes casos.

source: Creating the Polls app
es: Creando la aplicación de encuestas
pt_br: Criando um aplicativo de votação

source: Now that your environment -- a "project" -- is set up, you're set to start doing work.
es: Ahora que su entorno, un "proyecto", se ha configurado, ya está listo para empezar a trabajar.
pt_br: Agora que seu ambiente -- um "projeto" -- está configurado, você está pronto para começar o trabalho.

source: Each application you write in Django consists of a Python package that follows a certain convention. Django comes with a utility that automatically generates the basic directory structure of an app, so you can focus on writing code rather than creating directories.
es: Cada aplicación que usted escribe en Django consiste en un paquete de Python que sigue una determinada convención. Django tiene una utilidad que genera automáticamente la estructura básica de directorios de una aplicación, por lo que usted puede centrarse en la escritura de código en lugar de crear directorios.
pt_br: Cada aplicação que você escreve no Django consiste de um pacote Python que segue uma certa convenção. O Django vem com um utilitário que gera automaticamente a estrutura básica de diretório de uma aplicação, então você pode se concentrar apenas em escrever código em vez de ficar criando diretórios.

source: Projects vs. apps
es: Proyectos vs. aplicaciones
pt_br: Projetos versus aplicações

source: What's the difference between a project and an app? An app is a Web application that does something -- e.g., a Weblog system, a database of public records or a simple poll app. A project is a collection of configuration and apps for a particular website. A project can contain multiple apps. An app can be in multiple projects.
es: ¿Cuál es la diferencia entre un proyecto y una aplicación? Una app es una aplicación web que hace algo, por ejemplo, un sistema de Weblog, una base de datos de registros públicos o una aplicación de encuesta simple. Un proyecto es un conjunto de configuraciones y aplicaciones para un sitio web determinado. Un proyecto puede contener aplicaciones múltiples. Una aplicación puede estar en varios proyectos.
pt_br: Qual é a diferença entre um projeto e um app? Um app é uma aplicação que faz alguma coisa, exemplo, um sistema de web blog, um banco de dados de registros públicos, ou uma simples aplicação de enquete. Um projeto é uma coleção de configurações e apps para um particular website. Um projeto pode conter múltiplos apps. Um app pode estar em múltiplos projetos.

source: Your apps can live anywhere on your `Python path`_. In this tutorial, we'll create our poll app right next to your :file:`manage.py` file so that it can be imported as its own top-level module, rather than a submodule of ``mysite``.
es: Sus aplicaciones se pueden ubicar en cualquier parte de su `ruta Python`. En este tutorial, vamos a crear nuestra aplicación de encuesta junto al: archivo: archivo `manage.py` para que pueda ser importado como su propio módulo de nivel superior, en lugar de un submódulo de` `mysite``.
pt_br: Suas aplicações podem viver em qualquer lugar no seu `Python path`_. Neste tutorial nós iremos criar nossa aplicação de enquete junto a seu aquivo :file:`manage.py` assim ela pode ser importada como seu próprio módulo, em vez de um sub-módulo de ``mysite``.

source: To create your app, make sure you're in the same directory as :file:`manage.py` and type this command:
es: Para crear su aplicación, asegúrese de que está en el mismo directorio que :archivo: `manage.py` y escriba este comando:
pt_br: Para criar sua aplicação, certifique-se de que esteja no mesmo diretório que :file:`manage.py` e digite o seguinte comando:

source: That'll create a directory :file:`polls`, which is laid out like this::
es: Eso va a crear un directorio: archivo: `polls` que se presenta así ::
pt_br: Que irá criar o diretório :file:`polls` com a seguinte estrutura::

source: This directory structure will house the poll application.
es: Esta estructura de directorios almacenará la aplicación encuesta.
pt_br: Esta estrutura de diretório irá abrigar a aplicação de enquete.

source: Write your first view
es: Escriba su primera vista
pt_br: Escreva sua primeira view

source: Let's write the first view. Open the file ``polls/views.py`` and put the following Python code in it:
es: Vamos a escribir la primera vista. Abra el archivo ``polls/views.py`` y ponga el siguiente código Python en ella:
pt_br: Hora de criar a primeira view. Abra o arquivo ``polls/views.py`` e ponha o seguinte código em Python dentro dele:

source: This is the simplest view possible in Django. To call the view, we need to map it to a URL - and for this we need a URLconf.
es: Esta es la vista más simple posible en Django. Para llamar la vista, tenemos que asignarla a una URL - y para ello necesitamos una URLconf.
pt_br: Esta é a view mais simples possível no Django. Para chamar a view, nós temos que mapear a URL - e por isto nós precisamos da URLconf;

source: To create a URLconf in the polls directory, create a file called ``urls.py``. Your app directory should now look like::
es: Para crear una URLconf en el directorio encuestas, cree un archivo llamado `` urls.py``. Su directorio de aplicación debe verse así ::
pt_br: Para criar uma URLconf no diretório polls, Crie uma aquivo chamado ``urls.py``. Agora seu diretório da aplicação deve ficar como::

source: In the ``polls/urls.py`` file include the following code:
es: Incluya el siguiente código en el archivo ``polls/urls.py``:
pt_br: No aquivo ``polls/urls.py`` inclua o seguinte código:

source: The next step is to point the root URLconf at the ``polls.urls`` module. In ``mysite/urls.py``, add an import for ``django.conf.urls.include`` and insert an :func:`~django.conf.urls.include` in the ``urlpatterns`` list, so you have:
es: El siguiente paso es señalar la URLconf raíz en el módulo `` polls.urls``. En `` mysite / urls.py``, añada un import para `` django.conf.urls.include`` e inserte una: func: `~ django.conf.urls.include` en la lista ``urlpatterns`` , así que tienes:
pt_br: O próximo passo, é apontar

source: When to use :func:`~django.conf.urls.include()`
pt_br: Quando usar :func:`~django.conf.urls.include()`

source: You should always use ``include()`` when you include other URL patterns. ``admin.site.urls`` is the only exception to this.
pt_br: Deve-se sempre usar ``include()`` quando incluir outros "patterns" de URLs. ``admin.site.urls`` é a única excessão a isso.

source: Doesn't match what you see?
es: ¿No coincide con lo que ves?
pt_br: Não coincide com o que você vê?

source: If you're seeing ``include(admin.site.urls)`` instead of just ``admin.site.urls``, you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
es: Si usted ve ``include(admin.site.urls)`` en lugar de solo ``admin.site.urls``, está usando probablemente una versión de Django que no coincide con la versión de este tutorial. Usted querrá ya sea cambiar a la versión anterior o a la versión más reciente de Django.
pt_br: Se estiver vendo ``include(admin.site.urls)`` ao invés de ``admin.site.urls``, provavelmente está usando uma versão do Django que não é a mesma do tutorial. Você irá querer trocar a versão do tutorial para uma anterior ou atualizar o Django para uma versão mais nova..

source: You have now wired an ``index`` view into the URLconf. Lets verify it's working, run the following command:
es: Usted ha enviado una vista “índice” a la URLconf. Comprobemos si funciona, ejecute el siguiente comando:
pt_br: Você agora tem uma view ``index`` no URLconf. Vamos verificar se está funcionando, execute o comando:

source: Go to http://localhost:8000/polls/ in your browser, and you should see the text "*Hello, world. You're at the polls index.*", which you defined in the ``index`` view.
es: Vaya a http://localhost:8000/polls/ en su navegador, y usted debería ver el texto "* Hola, mundo*.”. Usted está en el índice de encuestas que definió en la vista ``índice``.
pt_br: Acesse http://localhost:8000/polls/ no seu browser, e deverá ver o texto "*Hello, world. You're at the polls index.*", o qual foi definido na "view" `ìndex``.

source: The :func:`~django.conf.urls.url` function is passed four arguments, two required: ``regex`` and ``view``, and two optional: ``kwargs``, and ``name``. At this point, it's worth reviewing what these arguments are for.
es: La función: func: `~django.conf.urls.url` pasa cuatro argumentos, dos obligatorios: “expresión regular” y “vista”, y dos opcionales: ``kwargs`` y “nombre”. En este punto, vale la pena revisar para que sirven estos argumentos.
pt_br: São passados 4 argumentos para :func:`~django.conf.urls.url`, dois obrigatórios: ``regex`` e ``view``, e dois opcional: ``kwargs``, e ``name``. Neste ponto, vale a pela rever para que servem estes argumentos.

source: :func:`~django.conf.urls.url` argument: regex
es: :func: argumento `~django.conf.urls.url`: expresión regular
pt_br: Argumento :func:`~django.conf.urls.url`: regex

source: The term "regex" is a commonly used short form meaning "regular expression", which is a syntax for matching patterns in strings, or in this case, url patterns. Django starts at the first regular expression and makes its way down the list, comparing the requested URL against each regular expression until it finds one that matches.
es: El término “regex” es una abreviatura comúnmente usada que significa “expresión regular” que es una sintaxis de búsqueda de patrones en cadenas, o en este caso, patrones URL. Django comienza en la primera expresión regular y se abre camino en la lista, comparando la URL solicitada con cada expresión regular hasta que encuentra una que coincida.
pt_br: O termo "regex" é uma forma abreviada utilizada que significa "expressão regular", que é uma sintaxe para procurar por padrões correspondentes em strings, ou neste caso, padrões de URL. O Django começa pela primeira expressão regular e percorre para baixo na lista, comparando a URL requisitada contra cada expressão regular até encontrar um que corresponda.

source: Note that these regular expressions do not search GET and POST parameters, or the domain name. For example, in a request to ``https://www.example.com/myapp/``, the URLconf will look for ``myapp/``. In a request to ``https://www.example.com/myapp/?page=3``, the URLconf will also look for ``myapp/``.
es: Tenga en cuenta que estas expresiones regulares no buscan parámetros GET y POST o el nombre de dominio. Por ejemplo, en una petición a``https://www.example.com/myapp/``, la URLconf buscará ``myapp/``. En una petición a ``https://www.example.com/myapp/?page=3``, la URLconf también buscará ``myapp/``.
pt_br: Note que estas expressões regulares não buscam parâmetros do GET e POST , ou nomoe de domínio. Por exemplo, no request de ``https://www.example.com/myapp/``, o URLconf irá procurar por ``myapp/``. Em um request para ``https://www.example.com/myapp/?page=3``, o URLconf irá procurar também por ``myapp/``.

source: If you need help with regular expressions, see `Wikipedia's entry`_ and the documentation of the :mod:`re` module. Also, the O'Reilly book "Mastering Regular Expressions" by Jeffrey Friedl is fantastic. In practice, however, you don't need to be an expert on regular expressions, as you really only need to know how to capture simple patterns. In fact, complex regexes can have poor lookup performance, so you probably shouldn't rely on the full power of regexes.
es: Si necesita ayuda con las expresiones regulares, consulte la entrada de Wikipedia` y la documentación del :mod: módulo`re` Además, el libro O'Reilly “Dominando las expresiones regulares” por Jeffrey Friedl es fantástico. Sin embargo, en la práctica, no necesita ser un experto en expresiones regulares ya que tan solo necesita saber cómo recopilar patrones simples. De hecho, las expresiones regulares complejas pueden tener un bajo rendimiento de búsqueda por lo que no debe depender del pleno rendimiento de las expresiones regulares.
pt_br: Se precisar de ajuda com expressões regulares, veja `Wikipedia's entry`_ e da documentação do módulo :mod:`re`. Além disso, o livro da O'Reilly "Mastering Regular Expressions", do Jeffrey Friedl é fantástico. Na prática, no entanto, você não precisa ser um especialista em expressões regulares, como você realmente só precisa saber como capturar padrões simples. Na verdade, expressões regulares complexas pode ter mau desempenho de pesquisa, então você provavelmente não deve contar com o pleno poder de expressões regulares.

source: Finally, a performance note: these regular expressions are compiled the first time the URLconf module is loaded. They're super fast (as long as the lookups aren't too complex as noted above).
es: Por último, una nota de rendimiento: estas expresiones regulares se recopilan la primera vez que se carga el módulo URLconf. Son súper rápidas (siempre y cuando las búsquedas no sean demasiado complejas como se señaló anteriormente).
pt_br: Finalmente, uma nota de performance: essas expressões regulares são compiladas na primeira vez que o módulo URLconf é carregado. Elas são super rápidas(contanto que as pesquisas não sejam demasiadamente complexas como notado acima).

source: :func:`~django.conf.urls.url` argument: view
es: :func: argumento` ~django.conf.urls.url` : vista
pt_br: Argunmento :func:`~django.conf.urls.url`: view
