Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: es, pt_br

source: If you are upgrading your installation of Django from a previous version, you will need to :ref:`uninstall the old Django version before installing the new version <removing-old-versions-of-django>`.
es: Si está actualizando su instalación de Django desde una versión anterior, deberá: ref: `desinstalar la versión anterior de Django antes de instalar la nueva versión <removing-old-versions-of-django> `.
pt_br: Se você está atualizando sua instalação do Django a partir de uma versão anterior, você vai precisar :ref:`desinstalar a versão antiga do Django antes de instalar a nova versão <removing-old-versions-of-django>`.

source: Install Django
es: Instale Django
pt_br: Instalando Django

source: You've got three easy options to install Django:
es: Tiene tres opciones fáciles para instalar Django:
pt_br: Você possui três opções fáceis para instalar o Django:

source: Install a version of Django :doc:`provided by your operating system distribution </misc/distributions>`. This is the quickest option for those who have operating systems that distribute Django.
es: Instale una versión de Django: doc: `proporcionada por su sistema operativo de distribución </misc/distributions> `. Esta es la opción más rápida para aquellos que tienen sistemas operativos que distribuyen Django.
pt_br: Instale uma versão do Django :doc:`fornecido pela distribuição do seu sistema operacional </misc/distributions>`. Esta é a opção mais rápida para aqueles que têm sistemas operacionais que distribuem o Django.

source: :ref:`Install an official release <installing-official-release>`. This is the best approach for most users.
es: : ref: `Instale una versión oficial <installing-official-release> `. Este es el mejor modo para la mayoría de usuarios.
pt_br: :ref:`Instalar uma versão oficial <installing-official-release>`. Essa é a melhor abordagem para a maioria dos usuários.

source: :ref:`Install the latest development version <installing-development-version>`. This option is for enthusiasts who want the latest-and-greatest features and aren't afraid of running brand new code. You might encounter new bugs in the development version, but reporting them helps the development of Django. Also, releases of third-party packages are less likely to be compatible with the development version than with the latest stable release.
es: : ref: `Instale la última versión de desarrollo <installing-development-version> `. Esta opción es para los entusiastas que desean las últimas y mejores características y no tienen miedo de ejecutar un código novedoso. Usted puede encontrarse con nuevos errores en la versión de desarrollo, pero notificarlos ayuda al desarrollo de Django. Además, las versiones de paquetes de terceros tienen menos probabilidades de ser compatibles con la versión de desarrollo que con la última versión estable.
pt_br: :ref:`instale a última versão em desenvolvimento <installing-development-version>`. Esta opção é para os entusiastas que querem a última e melhores funcionalidades e não estão receosos de rodar um código todo novo. ë possível encontrar novos bugs na versão de desenvolvimento, e reportá-los ajuda no desenvolvimento do Django. Também, é menos provável que pacote de terceiros sejam compatíveis com a versão de desenvolvimento do que com a última versão estável.

source: Always refer to the documentation that corresponds to the version of Django you're using!
es: ¡Siempre consulte la documentación correspondiente a la versión de Django que está utilizando!
pt_br: Sempre consulte a documentação que corresponde à versão do Django que você esteja usando!

source: If you do either of the first two steps, keep an eye out for parts of the documentation marked **new in development version**. That phrase flags features that are only available in development versions of Django, and they likely won't work with an official release.
es: Si sigue uno de los dos primeros pasos, eche un vistazo a las partes de la documentación marcadas como ** nuevo en la versión de desarrollo **. Esa frase indica las características que sólo están disponibles en las versiones de desarrollo de Django, y probablemente no funcionarán con una versión oficial.
pt_br: Se você optou por uma das duas primeiras etapas, preste atenção nas partes da documentação marcadas com **novo na versão de desenvolvimento**. Essa frase sinaliza os recursos que só estão disponíveis nas versões de desenvolvimento do Djangp, esses recursos provavelmente não irão funcionar em uma versão oficial.

source: Verifying
es: Comprobando
pt_br: Verificando

source: To verify that Django can be seen by Python, type ``python`` from your shell. Then at the Python prompt, try to import Django:
es: Para comprobar que Django puede ser visto por Python, escriba `` python`` desde su shell. Luego en el prompt de Python, trate de importar Django:
pt_br: Para verificar se o Python consegue enxergar sua instalação do Django, digite ``python`` no shell. Em seguida, no prompt do Python, tente importar o Django:

source: You may have another version of Django installed.
es: Usted puede tener instalada otra versión de Django .
pt_br: Você pode ter uma outra versão do Django instalado.

source: That's it!
es: ¡Eso es todo!
pt_br: É isso aí!

source: That's it -- you can now :doc:`move onto the tutorial </intro/tutorial01>`.
es: Eso es todo - ahora puede: doc: `pasar al tutorial </intro/tutorial01> `.
pt_br: É isso aí - agora você pode :doc:`avançar para o tutorial </intro/tutorial01>`.

source: Django at a glance
es: Django de un vistazo
pt_br: Django em um relance

source: Because Django was developed in a fast-paced newsroom environment, it was designed to make common Web-development tasks fast and easy. Here's an informal overview of how to write a database-driven Web app with Django.
es: Debido a que Django fue desarrollado en un ambiente de sala de redacción de ritmo rápido, fue diseñado para hacer tareas comunes de desarrollo web de forma rápida y fácil. Aquí se incluye una introducción informal de cómo escribir con Django una aplicación web que utiliza una base de datos.
pt_br: Como o Django foi desenvolvido no ambiente movimentado de uma redação, ele foi desenhado para tornar as tarefas comuns do desenvolvimento Web rápidas e fáceis. Aqui está uma visão informal sobre como escrever uma aplicação Web dirigida a banco de dados com Django.

source: The goal of this document is to give you enough technical specifics to understand how Django works, but this isn't intended to be a tutorial or reference -- but we've got both! When you're ready to start a project, you can :doc:`start with the tutorial </intro/tutorial01>` or :doc:`dive right into more detailed documentation </topics/index>`.
es: El objetivo de este documento es darle suficiente información técnica para entender cómo funciona Django, pero no pretende ser un tutorial o referencia - ¡Aunque tenemos ambas cosas! Cuando esté listo para empezar un proyecto con Django, puede: doc: `comenzar con el tutorial </intro/tutorial01> ` o: doc:` ir directamente a la documentación más detallada </topics/index> `.
pt_br: O objetivo deste documento é dar a você as especificações técnicas necessárias para entender como o Django funciona, mas este texto não pretende ser um tutorial ou uma referência -- mas possuímos os dois! Quando você estiver pronto para iniciar um projeto, você pode :doc:`iniciar com o tutorial </intro/tutorial01>` ou :doc:`mergulhar direto em uma documentação mais detalhada </topics/index>`.

source: Design your model
es: Diseñe su modelo
pt_br: Projete o seu model

source: Although you can use Django without a database, it comes with an `object-relational mapper`_ in which you describe your database layout in Python code.
es: Aunque es posible usar Django sin una base de datos, Django cuenta con un `mapeador objeto-relacional`_ en el que es posible definir la estructura de la base de datos utilizando código Python.
pt_br: Embora você possa usar o Django sem um banco de dados, ele vem com um mapeador objeto-relacional no qual você descreve o layout da sua base de dados em código Python.

source: The :doc:`data-model syntax </topics/db/models>` offers many rich ways of representing your models -- so far, it's been solving many years' worth of database-schema problems. Here's a quick example:
es: La: doc: `sintaxis de modelo de datos </topics/db/models> ` ofrece muchas formas de representar sus modelos - hasta ahora, ha sido la solución durante muchos años de los problemas de esquemas de base de datos. Aquí hay un ejemplo rápido:
pt_br: A :doc:`sintaxe do modelo de dados </topics/db/models>` oferece muitas formas ricas de representar seus models -- portanto, ela está resolvendo cerca de dois anos de problemas de esquemas de base de dados. Aqui está um exemplo rápido::

source: Install it
es: Instálelo
pt_br: Instale-o

source: Next, run the Django command-line utility to create the database tables automatically:
es: A continuación ejecute la utilidad de la línea de comandos de Django para crear las tablas de base de datos de forma automática:
pt_br: Em seguida, rode o utilitário de linha de comando do Django para criar as tabelas da base de dados automaticamente:

source: The :djadmin:`migrate` command looks at all your available models and creates tables in your database for whichever tables don't already exist, as well as optionally providing :doc:`much richer schema control </topics/migrations>`.
es: El: djadmin: comando `migrate` analiza todos sus modelos disponibles y crea tablas en la base de datos en el caso de que todavía no existan, así como ofrece opcionalmente:doc: un control de esquema mucho más rico </topics/migrations>`.
pt_br: O comando :djadmin:``migrate` procura por todos os seus modelos disponíveis e cria as tabelas na sua base de dados caso as tabelas ainda não existam, bem como, opcionalmente, fornecendo :doc:`controle muito mais rico do seu esquema de dados </topics/migrations>`.

source: Enjoy the free API
es: Disfrute de la API sin restricciones
pt_br: Aproveite a API livre

source: With that, you've got a free, and rich, :doc:`Python API </topics/db/queries>` to access your data. The API is created on the fly, no code generation necessary:
es: Con esto, usted tiene una: doc: `API Python </topics/db/queries>` rica y sin restricciones para acceder a sus datos. La API se crea sobre la marcha y no es necesaria ninguna generación de códigos:
pt_br: Com ela você irá ter uma :doc:`API Python </topics/db/queries>` livre e rica para acessar seus dados. A API é criada em tempo de execução, nenhuma geração de código é necessária::

source: A dynamic admin interface: it's not just scaffolding -- it's the whole house
es: Una interfaz administrativa dinámica: no se trata sólo de andamios; es toda la casa
pt_br: Uma interface de administração dinâmica: não se trata apenas de andaimes - é toda a casa.

source: Once your models are defined, Django can automatically create a professional, production ready :doc:`administrative interface </ref/contrib/admin/index>` -- a website that lets authenticated users add, change and delete objects. It's as easy as registering your model in the admin site:
es: Una vez definidos sus modelos, Django puede crear automáticamente una :doc: `interfaz administrativa </ref/contrib/admin/index>` profesional y lista para la producción; un sitio Web que le permita a los usuarios autenticados añadir, modificar y eliminar objetos. Es tan fácil como registrar su modelo en el sitio administrativo.
pt_br: Uma vez que seu modelos estejam definidos, o Django pode automaticamente criar um website profissional e pronto para produção :doc:`administrative interface </ref/contrib/admin/index>` -- que deixe usuários adicionar, alterar e deletar objetos. Isso é fácil registrando seu modelo no "admin site".

source: The philosophy here is that your site is edited by a staff, or a client, or maybe just you -- and you don't want to have to deal with creating backend interfaces just to manage content.
es: La filosofía aquí es que su sitio es editado por un equipo, un cliente o tal vez sólo por usted , y usted no quiere tener que lidiar con la creación de interfaces backend sólo administrar el contenido.
pt_br: A filosofia aqui é que seu site é editado por uma equipe, ou um cliente, ou talvez apenas por você -- e você não quer ter que lidar com criação de interfaces backend apenas para gerenciar conteúdo.

source: One typical workflow in creating Django apps is to create models and get the admin sites up and running as fast as possible, so your staff (or clients) can start populating data. Then, develop the way data is presented to the public.
es: Un flujo de trabajo típico en la creación de aplicaciones Django es crear modelos y poner a funcionar los sitios administrativos lo más rápido posible, para que su personal (o clientes) puedan empezar a ingresar los datos y luego, perfeccionar la forma como los datos se presentan al público.
pt_br: Um workflow típico na criação de aplicações Django é criar os models e ter os sites administrativos rodando o mais rápido possível, assim sua equipe (ou cliente) poderá começar a inserir os dados. Em seguida, desenvolve-se a forma com que os dados serão apresentados ao público.

source: Design your URLs
es: Diseñe sus URLs
pt_br: Projete suas URLs

source: A clean, elegant URL scheme is an important detail in a high-quality Web application. Django encourages beautiful URL design and doesn't put any cruft in URLs, like ``.php`` or ``.asp``.
es: Un esquema de URL limpio y elegante es un detalle importante en una aplicación web de alta calidad. Django fomenta un diseño URL hermoso y no añade ningún cruft en las URLs, como ``.php`` `` o `` .asp``.
pt_br: Um esquema limpo e elegante de URLs é um detalhe importante em uma aplicação Web de alta qualidade. O Django encoraja o desenho de belíssimas URLs e não coloca nenhuma sujeira nelas, como ``.php`` ou ``.asp``.

source: To design URLs for an app, you create a Python module called a :doc:`URLconf </topics/http/urls>`. A table of contents for your app, it contains a simple mapping between URL patterns and Python callback functions. URLconfs also serve to decouple URLs from Python code.
es: Para diseñar las URLs de una aplicación, usted crea un módulo de Python llamado: doc: `URLconf </topics/http/urls> `. Una tabla de contenidos para su aplicación, contiene una sencilla correspondencia entre patrones URLs y las funciones callback de Python. URLconfs también sirven para separar las URLs del código Python.
pt_br: Para desenhar URLs para uma aplicação, você cria um módulo Python chamado :doc:`URLconf </topics/http/urls>`. Uma tabela de conteúdos para sua aplicação, contendo um mapeamento simples entre padrões de URL e funções Python. URLconfs também servem para desacoplar as URLs do código Python.

source: Here's what a URLconf might look like for the ``Reporter``/``Article`` example above:
es: Así es como una URLconf podría parecerle al ejemplo ``Reporter``/``Article`` que aparece arriba:
pt_br: Aqui está como um URLconf se aparentaria para o exemplo ``Reporter``/``Article`` acima::

source: The code above maps URLs, as simple `regular expressions`_, to the location of Python callback functions ("views"). The regular expressions use parenthesis to "capture" values from the URLs. When a user requests a page, Django runs through each pattern, in order, and stops at the first one that matches the requested URL. (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the regular expressions are compiled at load time.
es: El código anterior mapea las URLs, como 'expresiones regulares' simples, a la ubicación de las funciones callback de Python ("vistas"). Las expresiones regulares utilizan paréntesis para "capturar" los valores de las URLs. Cuando un usuario solicita una página, Django pasa por cada patrón, en orden, y se detiene en el primero que coincide con la URL solicitada. (Si ninguno de ellos coincide, Django llama un caso especial 404 vista). Esto es increíblemente rápido debido a que las expresiones regulares se compilan en tiempo de carga.
pt_br: O código acima mapeia URLs, como simples expressões regulares, para a localização das funções Python de retorno ("views"). As expressões regulares usam parênteses para "capturar" valores das URLs. Quando um usuário requisita uma página, o Django percorre cada padrão, em ordem, e para no primeiro que combina com a URL requisitada. (Se nenhum deles combinar o Django executa uma view especial de exceção 404.) Isso é incrivelmente rápido, porque as expressões regulares são compiladas em tempo de carregamento.

source: Once one of the regexes matches, Django imports and calls the given view, which is a simple Python function. Each view gets passed a request object -- which contains request metadata -- and the values captured in the regex.
es: Una vez que una de las expresiones regulares coincide, Django importa y llama la vista determinada, que es una función simple de Python. Cada vista transmite un objeto de consulta, que contiene metadatos de consulta y los valores capturados en la expresión regular.
pt_br: Uma vez que uma das expressões regulares case, o Django importa e chama a view indicada, que é uma simples função Python. Cada view recebe um objeto request -- que contém os metadados da requisição -- e os valores capturados na expressão regular.

source: For example, if a user requested the URL "/articles/2005/05/39323/", Django would call the function ``news.views.article_detail(request, '2005', '05', '39323')``.
es: Por ejemplo, si un usuario solicitara la URL "/articles/2005/05/39323/", Django llamaría la función ``news.views.article_detail(request, '2005', '05', '39323')``.
pt_br: Por exemplo, se um usuário requisitou a URL "/articles/2005/05/39323/", o Django deverá chamar a função ``mysite.views.article_detail(request, '2005', '05', '39323')``.

source: Write your views
es: Escriba sus vistas
pt_br: Escreva suas views

source: Each view is responsible for doing one of two things: Returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :class:`~django.http.Http404`. The rest is up to you.
es: Cada vista es responsable de hacer una de dos cosas: devolver un objeto: clase:`~django.http.HttpResponse` que contiene el contenido de la página solicitada, o lanzar una excepción como: clase:` ~ django.http.Http404` . El resto depende de ti.
pt_br: Cada view é responsável por fazer uma entre duas coisas: Retornar um objeto :class:`~django.http.HttpResponse` contendo o conteúdo para a página requisitada, ou levantar uma exceção como :class:`~django.http.Http404`. O resto é com você.

source: Generally, a view retrieves data according to the parameters, loads a template and renders the template with the retrieved data. Here's an example view for ``year_archive`` from above:
es: Generalmente, una vista recupera los datos de acuerdo con los parámetros, carga una plantilla y crea la plantilla con los datos recuperados. Aquí está una vista de ejemplo para el `` year_archive`` de arriba:
pt_br: Geralmente, uma view recupera dados de acordo com os parâmetros, carrega um template e renderiza o template com os dados recuperados. Aqui está uma view para o ``year_archive`` do exemplo acima::

source: This example uses Django's :doc:`template system </topics/templates>`, which has several powerful features but strives to stay simple enough for non-programmers to use.
es: Este ejemplo utiliza:doc:`el sistema de plantillas de Django </topics/templates>` que tiene varias características potentes, pero se esfuerza por mantenerse lo suficientemente simple como para que los que no son programadores lo puedan utilizar.
pt_br: Esse exemplo usa o :doc:`sistema de template </topics/templates>` do Django, o qual possui diversos recursos poderosos mas prima por permanecer simples o suficiente para que não-programadores possam usá-lo.

source: Design your templates
es: Diseñe sus plantillas
pt_br: Projete seus templates

source: The code above loads the ``news/year_archive.html`` template.
es: El código anterior carga la plantilla ``news/year_archive.html``.
pt_br: O código acima carrega o template ``news / year_archive.html``.

source: Django has a template search path, which allows you to minimize redundancy among templates. In your Django settings, you specify a list of directories to check for templates with :setting:`DIRS <TEMPLATES-DIRS>`. If a template doesn't exist in the first directory, it checks the second, and so on.
es: Django tiene una ruta de búsqueda de plantillas lo que le permite a usted minimizar la redundancia entre las plantillas. En su configuración de Django, usted especifica una lista de directorios para verificar si hay plantillas con: configuración: `DIRS <TEMPLATES-DIRS>`. Si una plantilla no existe en el primer directorio, verifica en el segundo y así sucesivamente.
pt_br: O Django tem um caminho de pesquisa para templates, o qual permite a você minimizar a redundância entre templates. Nas configurações do Django, você especifica uma lista de diretórios para procurar por templates :setting:`DIRS <TEMPLATES-DIRS>`. Se um template não existir no primeiro diretório, ele verifica o segundo e assim por diante.

source: Let's say the ``news/year_archive.html`` template was found. Here's what that might look like:
es: Digamos que se encontró la plantilla `news / year_archive.html``. Así es como podría verse:
pt_br: Vamos dizer que o template ``news/article_detail.html`` foi encontrado. Aqui está como ele deve se parecer:

source: Variables are surrounded by double-curly braces. ``{{ article.headline }}`` means "Output the value of the article's headline attribute." But dots aren't used only for attribute lookup. They also can do dictionary-key lookup, index lookup and function calls.
es: Las variables están rodeadas por llaves dobles. `` {{Article.headline}} '' significa “ Enviar los valores del atributo del título del artículo". Sin embargo, los puntos no sólo se utilizan para las operaciones de búsqueda de atributo. También pueden hacer consulta clave de diccionario, búsqueda de índice y llamadas a funciones.
pt_br: Variáveis são cercadas por chaves duplas. ``{{ article.headline }}`` que significa "retorne o valor do atributo headline do artigo", mas pontos não são usados apenas para acessar atributos: eles também podem acessar chaves de dicionários, acesar índices e chamar funções.

source: Note ``{{ article.pub_date|date:"F j, Y" }}`` uses a Unix-style "pipe" (the "|" character). This is called a template filter, and it's a way to filter the value of a variable. In this case, the date filter formats a Python datetime object in the given format (as found in PHP's date function).
es: Tenga en cuenta que ``{{ article.pub_date|date:"F j, Y" }}`` utiliza una "tubería" al estilo Unix (el carácter "|"). Esto se llama un filtro de plantilla, y es una manera de filtrar el valor de una variable. En este caso, el filtro de fecha formatea un objeto datetime de Python en el formato determinado (como se encuentra en la función de la fecha de PHP).
pt_br: Note que ``{{ article.pub_date|date:"F j, Y" }}`` usa um "pipe" no estilo Unix (o caractere "|"). Isso é chamado de filtro de template, e é uma forma de filtrar o valor de uma variável. Nesse caso, o filtro "date" formata um objeto Python datetime para um formato dado (como o encontrado na função date do PHP).
