Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: id, pl

source: We see a template system as a tool that controls presentation and presentation-related logic -- and that's it. The template system shouldn't support functionality that goes beyond this basic goal.
id: Kami melihat sistem cetakan sebagai alat yang mengendalikan penyajian dan penyajian-logika terhubung -- dan itu dia. Sistem cetakan jangan mendukung fungsi yang pergi melebihi sasaran dasar ini.
pl: Widzimy, że system szablonów jako narzędzie kontroli prezentacji i prezentacja zorientowana na logikę to jest to. System szablonów nie powinien wspierać funkcjonalności wykraczających poza ten cel.

source: Discourage redundancy
id: Mencegah pengulangan
pl: Porzuć redundancje

source: The majority of dynamic websites use some sort of common sitewide design -- a common header, footer, navigation bar, etc. The Django template system should make it easy to store those elements in a single place, eliminating duplicate code.
id: Kebanyakan dari situs jaringan dinamis menggunakan beberapa urutan rancangan situs lebar umum -- kepala umum, kaku, batang navigasi, dll. Sistem cetakan Django harus membuatnya mudah untuk menyimpan unsur tersebut dalam tempat tunggal, menghilangkan kode ganda.
pl: Wiele z dynamicznych stron internetowych używa pewnego wspólnego sposobu projektowania - np. nagłówek, stopka, belka nawigacyjna itp. System szablonów Django powinien sprawić łatwym magazynowanie elementów w jednym miejscu, eliminując duplikaty kodu.

source: This is the philosophy behind :ref:`template inheritance <template-inheritance>`.
id: Ini adalah filosoi dibelakang :ref:`warisan cetakan <template-inheritance>`.
pl: To jest filozofia przemawiająca za :ref:`template inheritance <template-inheritance>`.

source: Be decoupled from HTML
id: Dipisahkan dari HTML
pl: Bądź oddzielony od HTML

source: The template system shouldn't be designed so that it only outputs HTML. It should be equally good at generating other text-based formats, or just plain text.
id: Sistem cetakan jangan dirancang sehingga dia hanya mengeluarkan HTML. Dia harus sama bagus pada membangkitkan bentuk berbasis-teks, atau hanya teks polos.
pl: System szablonów nie powinien być projektowany tylko jako generator kodu HTML. Powinien być równie dobry w generowaniu innych formatów bazujących na tekście lub po prostu zwykłym tekście.

source: XML should not be used for template languages
id: XML jangan digunakan untuk cetakan bahasa
pl: XML nie powinien zostać użyty do języka szablonów.

source: Using an XML engine to parse templates introduces a whole new world of human error in editing templates -- and incurs an unacceptable level of overhead in template processing.
id: Menggunakan mesin XML untuk mengurai cetakan memperkenalkan seluruh dunia baru dari kesalahan manusia dalam menyunting cetakan -- dan membuat sebuah tingkatan tidak diterima dari kelebihan pengolahan cetakan.
pl: Użycie silnika XML do prasowania szablonów wprowadza nowy świat błędów ludzkich w edycji szablonów -- i stwarza nieakceptowalny poziom narzutu w przetwarzaniu szablonu

source: Assume designer competence
id: Menganggap kemampuan perancang
pl: Zakładaj kompetencje projektanta

source: The template system shouldn't be designed so that templates necessarily are displayed nicely in WYSIWYG editors such as Dreamweaver. That is too severe of a limitation and wouldn't allow the syntax to be as nice as it is. Django expects template authors are comfortable editing HTML directly.
id: Sistem cetakan jangan dirancang sehingga cetakan perlu ditampilkan di penyunting WYSIWYG seperti Dreamweaver. Yang terlalu parah pembatasan dan tidak akan mengizinkan sintaks menjadi sebaik itu. Django mengharapkan cetakan penulis nyaman menyunting HTML secara langsung.
pl: System szablonów nie powinien być zaprojektowany w taki sposób by szablony ładnie wyświetlały się w edytorach WYSIWYG takich jak Dreamweaver. To jest zbyt dużym ograniczeniem i uniemożliwiłoby składni bycie tak ładną jak jest teraz. Django oczekuje od twórców szablonu łatwości edytowania bezpośrednio HTMLa.

source: Treat whitespace obviously
id: Perlakukan spasi dengan jelas
pl: Traktuj białe znaki dosłownie

source: The template system shouldn't do magic things with whitespace. If a template includes whitespace, the system should treat the whitespace as it treats text -- just display it. Any whitespace that's not in a template tag should be displayed.
id: Sistem cetakan jangan melakukan hal magic dengan spasi. Jika cetakan menyertakan spasi, sistem harus memperlakukan spasi seperti dia memperlakukan teks -- tampilkan dia. Spasi apapun yang bukan berada di etiket cetakan harus ditampilkan.
pl: System szablonów nie powinien robić cudów z białymi znakami. Jeśli szablon zawiera biały znak, system powinien potraktować ten znak tak jak traktuje tekst - po prostu go wyświetlić. Każdy biały znak, który nie jest w znaczniku szablonu, powinien być wyświetlony.

source: Don't invent a programming language
id: Jangan menciptakan sebuah bahasa pemrograman
pl: Nie wymyślaj języka programowania

source: The goal is not to invent a programming language. The goal is to offer just enough programming-esque functionality, such as branching and looping, that is essential for making presentation-related decisions. The :ref:`Django Template Language (DTL) <template-language-intro>` aims to avoid advanced logic.
id: Sasarannya bukan untuk membuat bahasa pemrograman. Sasarannya adalah menawarkan cukup fungsi mirip-pemrograman, seperti percabangan dan perulangan, yang pada dasarnya utnuk membuat keputusan penyajian-terhubung. :ref:`Django Template Language (DTL) <template-language-intro>` bertujuan untuk menghindari logika lanjut.
pl: Celem jest to, by nie wymyślać języka programowania. Celem jest, by zaoferować na tyle programistyczno-podobnej funkcjonalności, takiej jak branching czy pętle, na ile jest to niezbędne do tworzenia decyzji związanych z prezentacją. :ref:`Django Template Language (DTL) <template-language-intro>` próbuje uniknąć zaawansowanej logiki.

source: The Django template system recognizes that templates are most often written by *designers*, not *programmers*, and therefore should not assume Python knowledge.
id: Sistem cetakan Django mengenali bahwa cetakan paling sering ditulis oleh *perancang*, bukan *pemrogram*, dan karena itu jangan mengangap pengetahuan Pyton.
pl: System szablonów Django rozpoznaje szablony częściej pisane przez projektantów a nie programistów. W związku z tym nie powinien przyjmować wiedzy o Pythonie.

source: Safety and security
id: Keselamatan dan keamanan
pl: Bezpieczeństwo i ochrona

source: The template system, out of the box, should forbid the inclusion of malicious code -- such as commands that delete database records.
id: Sistem cetakan, diluar kotak, harus melarang masuknya kode berbahaya -- seperti perintah yang menghapus rekaman basisdata.
pl: System szablonów, w oryginale, powinien zabraniać wstawiania złośliwego kodu - takiego jak komendy usuwające rekordy w bazie danych.

source: This is another reason the template system doesn't allow arbitrary Python code.
id: Ini adalah alasan lain sistem cetakan tidak mengizinkan sewenang-wenang kode Pyton.
pl: To kolejny powód, dla którego system szablonów nie zezwala na standardowy kod w Pythonie.

source: Extensibility
id: Diperpanjang
pl: Rozszerzalność

source: The template system should recognize that advanced template authors may want to extend its technology.
id: Sistem cetakan harus mengenali penulis cetakan lanjut mungkin ingin memperpanjang teknologinya.
pl: System szablonów powinien rozpoznawać że zaawansowani twórcy szablonów mogą chcieć rozszerzyć tę technologię.

source: This is the philosophy behind custom template tags and filters.
id: Ini adalah filosofi dibelakang etiket cetakan penyesuaian dan saringan.
pl: To jest filozofia stoją za wyspecjalizowanymi tagami szablonów i filtrami.

source: Views
id: View
pl: Widoki

source: Simplicity
id: Kemudahan
pl: Prostota

source: Writing a view should be as simple as writing a Python function. Developers shouldn't have to instantiate a class when a function will do.
id: Menulis tampilan harus semudah menulis fungsi Phyton. Pengembang jangan meng instantiate sebuah kelas ketika fungsi akan melakukannya.
pl: Pisanie widoku powinno być tak proste jak pisanie funkcji w Pythonie. Developerzy nie powinni być zmuszeni do tworzenia klasy, kiedy wystarczy tylko funkcja.

source: Use request objects
id: Gunakan obyek permintaan
pl: Używaj obiektów zapytań

source: Views should have access to a request object -- an object that stores metadata about the current request. The object should be passed directly to a view function, rather than the view function having to access the request data from a global variable. This makes it light, clean and easy to test views by passing in "fake" request objects.
id: Tampilan harus mempunyai akses untuk meminta obyek -- sebuah obyek yang menyimpan metadata tentang permintaan saat ini. Obyek harus melewati secara langsung ke fungsi tampilan, dari pada fungsi tampilan mempunyai akses permintaan data dari variabel global. Ini membuat cahaya, bersih dan mudah untuk dicoba tampilan dengan melewatkan permintaan "tiruan" obyek.
pl: Widoki powinny mieć dostęp do obiektów zapytań - obiektów, które przechowują metadane o obecnym zapytaniu. Obiekt powinien być przekazywany bezpośrednio do funkcji widoku, nie powinna ona musieć korzystać z danych zapytania przez globalną zmienną. To czyni testowanie widoków przez przekazywanie ‚fałszywych’ obiektów zapytań lekkim, łatwym i przyjemnym.

source: A view shouldn't care about which template system the developer uses -- or even whether a template system is used at all.
id: Sebuah tampilan jangan perduli tentang sistem cetakan mana pengembang gunakan -- atau bahkan apakah sistem cetakan digunakan sama sekali.
pl: Dla widoku nie powinno mieć znaczenia jakiego systemu szablonów używa developer - ani czy w ogóle używa jakiegoś systemu szablonów.

source: Differentiate between GET and POST
id: Membedakan diantara GET dan POST
pl: Różnice pomiędzy GET a POST

source: GET and POST are distinct; developers should explicitly use one or the other. The framework should make it easy to distinguish between GET and POST data.
id: GET dan POST berbeda; pengembang harus secara eksplisit menggunakan satu atau lainnya. Kerangka harus membuatnya mudah untuk membedakan diantara data GET dan POST.
pl: GET i POST są rozłączne; programiści powinni wprost użyć jednego lub drugiego. Framework powinien umożliwiać łatwe rozróżnienie między danymi pochodzącymi z GET lub POST.

source: Cache Framework
id: Kerangka Tembolok
pl: Framework Pamięci Podręcznej

source: The core goals of Django's :doc:`cache framework </topics/cache>` are:
id: Sasaran inti dari :doc:`kerangka tembolok </topics/cache>` Django adalah:
pl: Głównymi celami Django :doc:`cache framework </topics/cache>` są:

source: A cache should be as fast as possible. Hence, all framework code surrounding the cache backend should be kept to the absolute minimum, especially for ``get()`` operations.
id: Tembolok harus secepat mungkin. Oleh karena itu, semua kerangka kode dikelilingi backend tembolok harus menjaga minimal, khususnya untuk operasi ``get()``.
pl: Pamięć podręczna powinna być szybką jak tylko to możliwe. Stąd też, cały kod frameworka otaczający backend pamięci podręcznej powinien być ograniczony do absolutnego minimum, w szczególności w przypadku metody ``get()``

source: The cache API should provide a consistent interface across the different cache backends.
id: API tembolok harus menyediakan antarmuka tetap terhadap backend tembolok berbeda.
pl: API pamięci podręcznej powinno zapewniać spójny interfejs w zróżnicowanych pamięciach podręcznych backendów.

source: The cache API should be extensible at the application level based on the developer's needs (for example, see :ref:`cache_key_transformation`).
id: API tembolok harus dapat diperpanjang pada tingkatan aplikasi berdasarkan pada kebutuhan pengembang (sebagai contoh, lihat :ref:`cache_key_transformation`).
pl: API pamięci podręcznej powinno być rozszerzalne na poziomie aplikacji zależnie od potrzeb developera (dla przykładu, zobacz :ref:`cache_key_transformation`).

source: Third-party distributions of Django
id: Penyaluran Pihak-ketiga dari Django
pl: Dystrybucje Django od osób trzecich.

source: Many third-party distributors are now providing versions of Django integrated with their package-management systems. These can make installation and upgrading much easier for users of Django since the integration includes the ability to automatically install dependencies (like database adapters) that Django requires.
id: Banyak penyalur pihak-ketiga sekarang menyediakan versi Django terpadu dengan sistem pengelola-paket mereka. Ini dapat membuat pemasangan dan peningkatan lebih mudah untuk pengguna Django sejak perpaduan menyertakan kemampuan untuk otomatis memasang ketergantungan (seperti penyadur basisdata) yang Django butuhkan.
pl: Wiele osób trzecich dostarcza teraz wersje Django zintegrowane z ich systemami zarządzania pakietami. Mogą one ułatwić użytkownikom Django instalację i aktualizację, gdyż integracja zawiera możliwość automatycznej instalacji zależności (jak adaptery bazodanowe), których wymaga Django.

source: Typically, these packages are based on the latest stable release of Django, so if you want to use the development version of Django you'll need to follow the instructions for :ref:`installing the development version <installing-development-version>` from our Git repository.
id: Khususnya, paket ini berdasarkan pada terbitan stabil Django, jadi jika anda ingin menggunakan versi pengembangan Django anda akan butuh mengikuti perintah untuk :ref:`memasang versi pengembangan <installing-development-version>` dari gudang Git kami.
pl: Zazwyczaj, te pakiety oparte są o najnowsze stabilne wersje Django, więc jeśli chcesz używać wersji developerskiej Django, musisz postępować zgodnie z instrukcjami :ref:`installing the development version<installing-development-version> ` z naszego repozytorim Git.

source: If you're using Linux or a Unix installation, such as OpenSolaris, check with your distributor to see if they already package Django. If you're using a Linux distro and don't know how to find out if a package is available, then now is a good time to learn. The Django Wiki contains a list of `Third Party Distributions`_ to help you out.
id: Jika anda menggunakan pemasangan Linux atau Unix, seperti OpenSolaris, periksa dengan penyalur anda untuk melihat jika mereka sudah punya paket Django. Jika anda menggunakan distro Linux dan tidak tahu bagaimana menemukan sebuah peket yang tersedia, lalu sekarang waktu yang bagus untuk belajar. Django Wiki mengandung daftar dari `Penyalur Pihak ketiga`_ untuk membantu anda keluar.
pl: Jeśli używasz instalacji dla Linuxa lub Unixa, takich jak OpenSolaris, sprawdź u swojego dystrybutora czy zawierają one już pakiety Django. Jeśli używasz dystrybucji Linuxa i nie wiesz jak znaleźć informację, czy pakiet jest dostępny, to najlepszy czas by się tego nauczyć. Django Wiki zawiera listę `Third Party Distributions`_ by ci pomóc.

source: For distributors
id: Untuk penyalur
pl: Dla dystrybutorów

source: If you'd like to package Django for distribution, we'd be happy to help out! Please join the |django-developers| mailing list and introduce yourself.
id: Jika anda ingin memaketkan Django untuk penyaluran, kami akan senang membantu! Silahkan bergabung django-developers| daftar penyuratan dan perkenalkan diri anda.
pl: Jeśli chciałbyś pakiety Django do dystrybucji, z chęcią ci pomożemy! Proszę, dołącz do listy mailingowej |django-developers| i przedstaw się.

source: We also encourage all distributors to subscribe to the |django-announce| mailing list, which is a (very) low-traffic list for announcing new releases of Django and important bugfixes.
id: Kami juga mendorong semua penyalur utnuk berlangganan ke daftar penyuratan |django-announce|, yang daftar (sangat) lalu lintas rendah untuk mengumumkan terbitan baru Django dan perbaikan kesalahan penting.
pl: Dodatkowo zachęcamy wszystkich dystrybutorów aby zapisali się do listy mailingowej |django-announce|, która jest listą o (bardzo) małym ruchu dla ogłaszania nowych wydań Django i ważnych poprawek błedów.

source: Meta-documentation and miscellany
id: Dokumentasi-meta dan bunga rampai
pl: Meta-dokumentacja i rozmaitości

source: Documentation that we can't find a more organized place for. Like that drawer in your kitchen with the scissors, batteries, duct tape, and other junk.
id: Dokumentasi yang kami tidak dapat temukan lebih tempat terorganisir. Seperti laci di dapur anda dengan gunting, baterai, lakban, dan rongsokan lainnya.
pl: Dokumentacja dla której nie mogliśmy znaleźć lepiej zorganizowanego miejsca. Tak jak szuflada w twojej kuchni z nożyczkami, bateriami, taśmą i innymi śmieciami.
