Repository: 007gzs/django-docs-translations
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: id, pl

source: API stability
id: Keseimbangan API
pl: Stabilność API

source: Django promises API stability and forwards-compatibility since version 1.0. In a nutshell, this means that code you develop against a version of Django will continue to work with future releases. You may need to make minor changes when upgrading the version of Django your project uses: see the "Backwards incompatible changes" section of the :doc:`release note </releases/index>` for the version or versions to which you are upgrading.
id: Django menjanjikan kestabilan API dan kesesuaian-kedepan sejak versi 1.0. Dalam cangkang kacang, ini berarti bahwa kode anda kembangkan terhadap versi DJango akan tetap bekerja dengan terbitan akan datang. Anda butuh membuat perubahan kecil ketika meningkatkan versi Django dari proyek anda gunakan: lihat bagian "Perubahan ketidaksesuaian kebelakang" dari :doc:`catatan terbitan </releases/index>` untuk versi atau versi dimana anda tingkatkan.
pl: Django gwarantuje stabliność i kompatybilność wsteczną API od wersji 1.0. W skrócie, to znaczy, że kod, który pisałeś w jakiejś wersji Django będzie wciąż działał z przyszłymi wydaniami. Możesz musieć wprowadzić małe zmiany podczas upgrade'owania wersji Django, z której korzysta twój projekt: zobacz sekcje „Zmiany niekompatybilne wstecz” :doc:`notatek o wydaniach </releases/index>` dla wersji z której lub wersji z których się upgrade'ujesz.

source: What "stable" means
id: Apa "stabil" berarti
pl: Co oznacza "stabilny" (ang. stable)

source: In this context, stable means:
id: Daam konteks ini, stabil berarti:
pl: W tym kontekście, stabilny oznacza:

source: All the public APIs (everything in this documentation) will not be moved or renamed without providing backwards-compatible aliases.
id: Semua API umum (semuanya di dokumentasi ini) tidak akan dipindahkan atau dinamai kembali tanpa menyediakan alias belakang-sesuai.
pl: Wszystkie publiczne API (wszystkie są w tej dokumentacji) nie będą przeniesione ani nie zostaną zmienione ich nazwy bez dodanych wstecznie kompatybilnych aliasów.

source: If new features are added to these APIs -- which is quite possible -- they will not break or change the meaning of existing methods. In other words, "stable" does not (necessarily) mean "complete."
id: Jika fitur baru ini ditambahkan ke API ini -- yang sangat memungkinkan -- mereka akan tidak rusak atau merubah arti dari cara yang ada. Dengan kata lain, "stabil" tidak (perlu) berarti "lengkap."
pl: Jeśli do tych API zostaną dodane nowe elementy – co jest całkiem możliwe – nie złamią ani nie zmienią znaczenia istniejących metod. Innymi słowy „stabline” nie (koniecznie) zawsze znaczy „kompletne”.

source: If, for some reason, an API declared stable must be removed or replaced, it will be declared deprecated but will remain in the API for at least two feature releases. Warnings will be issued when the deprecated method is called.
id: Jika, untuk beberapa alasan, sebuah API dinyatakan stabil harus dipindahkan atau diganti, dia akan dinyatakan usang tetapi akan tetap berada di API unuk setidaknya dua fitur terbitan. Peringatan akan ditampilkan ketika cara usang dipanggil.
pl: Jeśli z jakiegoś powodu API określane jako stabilne musi zostać usunięte lub zmienione, zostanie oznaczone jako dezaprobowane, ale pozostanie w API w co najmniej dwóch kolejnych wydaniach. Przy wywołaniu dezaprobowanej metody wyświetlą się ostrzeżenia.

source: See :ref:`official-releases` for more details on how Django's version numbering scheme works, and how features will be deprecated.
id: Lihat :ref:`official-releases` utnuk lebih rinci bagaimana skema penomoran versi Django bekerja, dan bagaimana fitur akan diusangkan.
pl: Zobacz :ref:`official-releases` aby poznać więcej szczegółów o tym jak działa schemat numerowania wersji Django i kiedy funkcjonalności będą dezaprobowane.

source: We'll only break backwards compatibility of these APIs if a bug or security hole makes it completely unavoidable.
id: Kami hanya merusak kecocokan sebelumnya dari API ini jika sebuah lubang kesalahan atau keamanan membuatnya tidak dapat dihindari.
pl: Porzucimy kompatybilność wsteczną tego API tylko jeśli wystąpi błąd lub stworzy to nieuniknioną dziurę w bezpieczeństwie

source: Stable APIs
id: API Stabil
pl: Stabilne API

source: In general, everything covered in the documentation -- with the exception of anything in the :doc:`internals area </internals/index>` is considered stable.
id: Pada umumnya, semaunya dicakupi di dokumentasi -- dengan pengecualian dari apapun di :doc:`kawasan internal </internals/index>` adalah dianggap stabil.
pl: W ogólności, wszystko pokryte przez dokumentację -- z wyjątkiem czegokolwiek w :doc:`internals area</internals/index>` jest uważane za stabilne.

source: Exceptions
id: Pengecualian
pl: Wyjątki

source: There are a few exceptions to this stability and backwards-compatibility promise.
id: Ada beberapa pengecualian pada kestabilan ini dan janji kecocokan-belakang.
pl: Tutaj znajduje się kilka wyjątków co do stabilności i wstecznej zgodności.

source: Security fixes
id: Perbaikan keamanan
pl: Poprawki bezpieczeństwa

source: If we become aware of a security problem -- hopefully by someone following our :ref:`security reporting policy <reporting-security-issues>` -- we'll do everything necessary to fix it. This might mean breaking backwards compatibility; security trumps the compatibility guarantee.
id: Jika kami menjadi waspada dari masalah keamanan -- semoga oleh seseorang mengikuti :ref:`kebijakan pelaporan keamanan <reporting-security-issues>` kami -- kami akan melakukan apapun yang dibutuhkan untuk memperbaikinya. Ini mungkin berarti merusak kecocokan sebelumnya; keamanan mengalahkan jaminan kecocokan.
pl: Jeśli zauważymy problem bezpieczeństwa - w najlepszym przypadku za sprawą kogoś śledzą :ref:`security reporting policy<reporting-security-issues>` -- zrobimy wszystko co konieczne by to naprawić. To może znaczyć brak wstecznej kompatybilności; bezpieczeństwo jest ważniejsze od gwarancji kompatybilności.

source: APIs marked as internal
id: API ditandai sebagai internal
pl: API oznaczone jako wewnętrzne

source: Certain APIs are explicitly marked as "internal" in a couple of ways:
id: Beberapa API secara eksplisit ditandai sebagai "internal" dalam sepsang jalan:
pl: Niektóre API są wprost oznaczone jako "wewnętrzne" na kilka sposobów:

source: Some documentation refers to internals and mentions them as such. If the documentation says that something is internal, we reserve the right to change it.
id: Beberapa dokumentasi mengacu ke internal dan menyebutkan mereka seperti itu. Jika dokumentasi mengatakan sesuatu adalah internal, kami berhak untuk mengubahnya.
pl: Czasem dokumentacja odnosi się do elementów i oznacza je jako wewnętrzne. Jeśli dokumentacja mówi, że coś jest wewnętrzne, rezerwujemy prawo do zmiany tego

source: Functions, methods, and other objects prefixed by a leading underscore (``_``). This is the standard Python way of indicating that something is private; if any method starts with a single ``_``, it's an internal API.
id: Fungsi, cara, dan obyek lain diawali dengan dipimpin garis bawah (``_``). Ini adalah standar cara Phyton dari mengindikasikan bahwa sesuatu adalah private; jika cara apapun mulai dengan ``_`` tunggal, itu adalah sebuah API internal.
pl: Funkcje, metody i inne obiekty poprzedzone prefiksem podkreślenia (``_``). Jest to standard Pythona mówiący, że coś jest prywatne; jeśli każda metoda zaczyna się pojedynczym podkreśleniem `_`, to jest to wewnętrzne API.

source: Design philosophies
id: Filosofi rancangan
pl: Filozofie projektowe

source: This document explains some of the fundamental philosophies Django's developers have used in creating the framework. Its goal is to explain the past and guide the future.
id: Dokumen ini menjelaskan beberapa dari filosofi dasar pengembang Django yang telah digunakan dalam membuat kerangka. Tujuannya adalah menjelaskan yang lampau dan memandu masa akan datang.
pl: Ten dokument wyjaśnia podstawowe filozofie, którymi kierowali się deweloperzy Django podczas tworzenia frameworku. Celem jest wytłumaczenie przeszłości i pokierowanie przyszłością.

source: Overall
id: Keseluruhan
pl: Ogółem

source: Loose coupling
id: Kehilangan sambungan
pl: Luźne powiązanie

source: A fundamental goal of Django's stack is `loose coupling and tight cohesion`_. The various layers of the framework shouldn't "know" about each other unless absolutely necessary.
id: Sasaran dasar tumpukan Django adalah `kehilangan sambungan dan mengencangkan kepaduan`_. Bermacam lapisan dari kerangka jangan "mengetahui" tentang satu sama lain meskipun sangat butuh.
pl: Fundamentalną zasadą stosu Django jest `loose coupling and tight cohesion`_. Różnorodne warstwy frameworka nie powinny wiedzieć o innych więcej niż to absolutnie konieczne.

source: For example, the template system knows nothing about Web requests, the database layer knows nothing about data display and the view system doesn't care which template system a programmer uses.
id: Sebagai contoh, sistem cetakan tidak mengetahui tentang permintaan jaringan, lapisan basisdata tidak mengetahui tentang tampilan data dan layar sistem tidak perduli sistem cetakan mana yang pemrogram gunakan.
pl: Na przykład, szablon nie wie nic o żądaniu, warstwa bazy danych nie wie nic o wyświetlaniu danych a widok nie martwi się szablonem używanym przez programistę.

source: Although Django comes with a full stack for convenience, the pieces of the stack are independent of another wherever possible.
id: Meskipun Django datang dengan tumpukan penuh keyakinan, potongan dari tumpukan adalah berdiri sendiri dari lainnya sedapat mungkin.
pl: Jednakże Django przychodzi z pełnym zestawem dla wygody, a części zestawu są ze sobą niezależne gdzie tylko to możliwe.

source: Less code
id: Kode sedikit
pl: Mniej kodu

source: Django apps should use as little code as possible; they should lack boilerplate. Django should take full advantage of Python's dynamic capabilities, such as introspection.
id: Aplikasi Django harus menggunakan sedikit kode sebisa mungkin; mereka kekurangan boilerplate. Django harus mengambil keuntungan penuh dari kemampuan dinamis Phyton, seperti interospeksi.
pl: Aplikacje Django powinny używać tak mało kodu jak to możliwe. Django powinno w pełni wykorzystywać dynamiczne możliwości Pythona, tak jak w introspekcji.

source: Quick development
id: Pengembangan cepat
pl: Szybki rozwój

source: The point of a Web framework in the 21st century is to make the tedious aspects of Web development fast. Django should allow for incredibly quick Web development.
id: Titik dari kerangka Jaringan di abad 21 adalah membuat aspek membosankan dari pengembangan Jaringan cepat. Django harus mengizinkan untuk pengembangan luar biasa jaringan cepat.
pl: Najważniejszym punktem w frameworku 21-ego wieku jest szybkie wykonanie powtarzalnych aspektów tworzenia strony internetowej. Django powinno pozwolić na niesamowicie szybkie wytwarzanie oprogramowania.

source: Don't repeat yourself (DRY)
id: Jangan Ulangi Diri anda (JUDA)
pl: Nie powtarzaj się (DRY)

source: Every distinct concept and/or piece of data should live in one, and only one, place. Redundancy is bad. Normalization is good.
id: Setiap konsep berbeda dan/atau potongan data harus berada dalam satu, dan hanya satu, tempat. Pengulangan adalah buruk. Normalisasi adalah bagus.
pl: Każdy unikalny pomysł i/lub część danych powinny żyć w jednym i tylko jednym miejscu. Redundancja jest zła. Normalizacja jest dobra.

source: The framework, within reason, should deduce as much as possible from as little as possible.
id: Kerangka, dalam alasan, harus menyimpulkan sebanyak mungkin dari sekecil mungkin.
pl: Framework, w granicach rozsądku, powinien domyślić się ile to możliwe z możliwe małej ilości danych.

source: The `discussion of DRY on the Portland Pattern Repository`__
id: `obrolan DRY di Portland Pattern Repository`__
pl: 'Dyskusja o DRY w Portland Pattern Repository'

source: Explicit is better than implicit
id: Eksplisit lebih baik dari pada implisit
pl: Wprost jest lepiej niż nie wprost.

source: This is a core Python principle listed in :pep:`20`, and it means Django shouldn't do too much "magic." Magic shouldn't happen unless there's a really good reason for it. Magic is worth using only if it creates a huge convenience unattainable in other ways, and it isn't implemented in a way that confuses developers who are trying to learn how to use the feature.
id: Ini adalah prinsip inti Phyton terdaftar di :pep:`20`, dan itu berarti Django tidak harus melakukan banyak "magic." Magic jangan terjadi meskipun terdapat alasan sangat bagus. magic adalah berharga menggunakan jika dia membuat kenyamanan besar tidak terjangkau di jalan lain, dan dia tidak diterapkan di jalan yang membingungkan pengembang yang mencoba mempelajari bagaimana menggunakan fitur.
pl: To jest główna zasada Pythona zapisana w :pep:`20`, i oznacza że Django nie powinno wykonywać zbyt dużo "magii". Magia nie powinna się zdarzyć bez naprawdę dobrego powodu. Magia jest warta użycia tylko jeśli stworzy ogromną wygodę nieosiągalną w inny sposób i nie zostanie zaimplementowana w sposób, który będzie dezorientował programistów próbujących nauczyć się jak ją wykorzystać.

source: Consistency
id: Konsistensi
pl: Spójność

source: The framework should be consistent at all levels. Consistency applies to everything from low-level (the Python coding style used) to high-level (the "experience" of using Django).
id: Kerangka harus konsisten pada semua tingkatan. Konsistensi berlaku ke semua dari tingkatan-rendah (menggunakan gaya pengkodean Phyton) sampai tingkatan-tinggi ("pengalaman" menggunakan Django).
pl: Framework powinien być na spójny na każdym poziomie. Spójność dotyczy każdego poziomu od niskiego (używania stylu programowaniu w Pythonie) aż po wysoki (doświadczenie z używania Django).

source: Models
id: Model
pl: Modele

source: Fields shouldn't assume certain behaviors based solely on the name of the field. This requires too much knowledge of the system and is prone to errors. Instead, behaviors should be based on keyword arguments and, in some cases, on the type of the field.
id: Bidang jangan dianggap kebiasaan tertentu berdasarkan hanya pada nama bidang. Ini membutuhkan terlalu banyak pengetahuan dari sistem dan cenderung menjadi kesalahan. Malahan, kebiasaan harus berdasarkan pada argumen kata kunci dan, di beberapa kasus, pada jenis bidang.
pl: Pola nie powinny przyjmować pewnych zachowań bazując jedynie na nazwie pola. To wymaga zbyt dużo wiedzy o systemie i jest podatne na błędy. Natomiast, zachowania powinny bazować na kluczowych argumentach i, w niektórych przypadkach na typie pola.

source: Include all relevant domain logic
id: Sertakan semua ranah logika yang terhubung
pl: Uwzględnij całą istotną logikę domeny.

source: Models should encapsulate every aspect of an "object," following Martin Fowler's `Active Record`_ design pattern.
id: Model harus merangkum setiap aspek dari sebuah "obyek," mengikuti pola rancangan `Active Record`_ Fowler.
pl: Modele powinny hermetyzować każdy aspekt obiektu, zgodnie z wzorcem projektowym `Active Record`_, którego autorem jest Martin Fowler.

source: This is why both the data represented by a model and information about it (its human-readable name, options like default ordering, etc.) are defined in the model class; all the information needed to understand a given model should be stored *in* the model.
id: Ini mengapa kedua data dibawakan oleh model dan informasi mengenai dia (dia nama yang dapat dibaca manusia, pilihan seperti pengurutan awal, dll.) ditentukan di kelas model; semua informasi yang dibutuhkan untuk memahami model yang diberikan harus disimpan *di dalam* model.
pl: To jest powód dla którego dane zarówno reprezentowane przez model i informacje o nim (to jest nazwa czytelna dla człowieka, opcje jak np. domyślne sortowanie itp.) są trzymane w klasie modelu; wszystkie informacje potrzebne do zrozumienia danego modelu powinny być w nim przechowywane.

source: Database API
id: API Basisdata
pl: API Baz Danych

source: The core goals of the database API are:
id: Sasaran inti dari API basisdata adalah:
pl: Podstawowymi celami API baz danych są:

source: SQL efficiency
id: Efesiensi SQL
pl: Efektywność SQL

source: It should execute SQL statements as few times as possible, and it should optimize statements internally.
id: Dia harus menjalankan pernyataan SQL sedikit waktu mungkin, dan dia harus mengoptimalkan pernyataan secara internal.
pl: Powinno się wykonywać zapytanie SQL tak rzadko jak to możliwe, dodatkowo powinno się optymalizować zapytania wewnętrznie.

source: This is why developers need to call ``save()`` explicitly, rather than the framework saving things behind the scenes silently.
id: Ini adalah mengapa pengembang butuh memanggil ``save()`` secara eksplisit, dari pada kerangka menyimpan hal-hal dibelakang layar secara sembunyi.
pl: To jest powód dla którego programiści muszą odwołać się do ``save()`` wprost, a framework nie robi tego po cichu w tle.

source: This is also why the ``select_related()`` ``QuerySet`` method exists. It's an optional performance booster for the common case of selecting "every related object."
id: Ini juga mengapa cara ``select_related()`` ``QuerySet`` ada. Dia adalah sebauh pilihan pendorong penampilan untuk kasus umum dari memilih "setiap obyek terkaut."
pl: To jest dodatkowy powód dlaczego metody ``select_related()`` ``QuerySet`` istnieją. Jest to opcjonalne poprawienie wydajności dla częstych przypadków wybierania "każdego powiązanego obiektu".

source: Terse, powerful syntax
id: Terse, sintaks kuat
pl: Zwięzła, silna składnia.

source: The database API should allow rich, expressive statements in as little syntax as possible. It should not rely on importing other modules or helper objects.
id: API basisdata harus mengijinkan kaya, pernyataan ekspresif sebagai sintaks kecil sebisa mungkin. Itu harus tidak bergantung pada mengimpor modul lain atau obyek pembantu.
pl: Interfejs bazy danych API powinien udostępniać bogatą, wyrazistą składnię przy możliwie małych nakładzie kodu. Nie powinien polegać na importowaniu innych modułów lub pomocniczych obiektów.

source: Joins should be performed automatically, behind the scenes, when necessary.
id: Penggabungan harus dilakukan otomatis, dibelakang layar, ketika dibutuhkan.
pl: Połączenia tabel powinny być wykonywane automatycznie, w tle jeśli jest to konieczne.

source: Every object should be able to access every related object, systemwide. This access should work both ways.
id: Setiap obyek harus mampu mengakses setiap obyek terhubung, sistem lebar. Akses ini harus bekerja dikedua cara.
pl: Każdy obiekt powinien mieć dostęp do każdego obiektu z którym jest w relacji, w danym systemie. Ten dostęp powinien być obustronny.

source: Option to drop into raw SQL easily, when needed
id: Pilihan menjatuhkan kedalam SQL mentah dengan mudah, ketika dibutuhkan.
pl: Możliwość łatwego przełączenia się na surowy SQL, kiedy to konieczne.

source: The database API should realize it's a shortcut but not necessarily an end-all-be-all. The framework should make it easy to write custom SQL -- entire statements, or just custom ``WHERE`` clauses as custom parameters to API calls.
id: API basisdata harus menyadari jalan pintasnya tetapi tidak perlu akhir-semua-akan-semua. Kerangka harus membuatnya mudah untuk menulis SQL penyesuaian -- seluruh pernyataan, atau hanya klausa ``WHERE`` penyesuaian sebagai parameter penyesuaian ke pemanggilan API.
pl: API bazy danych powinno zauważać, że jest to skrót a niekoniecznie wszystko. Framework powinien ułatwiać pisanie spersonalizowanego SQL - całych formuł lub tylko własnych klauzuli ``WHERE`` jako własne parametry na wywołania API.

source: URL design
id: Rancangan URL
pl: Projekt URL

source: URLs in a Django app should not be coupled to the underlying Python code. Tying URLs to Python function names is a Bad And Ugly Thing.
id: URL di aplikasi Django tidak boleh bergandengan ke kode Phyton pokok. Mengikat URL ke nama fungsi Phyton adalah Hal Buruk Dan Jelek.
pl: URLe w aplikacji Django nie powinny być połączone z podstawowym kodem Pythona. Łączenie URLi wraz z nazwami funkcji Pythona nazywa się Złą i Brzydką Rzeczą.

source: Along these lines, the Django URL system should allow URLs for the same app to be different in different contexts. For example, one site may put stories at ``/stories/``, while another may use ``/news/``.
id: Bersama baris ini, sistem URL Django harus mengizinkan URL utnuk aplikasi sama menjadi berbeda di konteks berbeda. Sebagai contoh, satu situs mungkin menaruh cerita pada ``/stories/``, dimana lainnya mungkin menggunakan ``/news/``.
pl: Poza tym, system URL Django powinien pozwalać, by adresy URL tej samej aplikacji były różne w zależności od kontekstu. Na przykład, jedna strona może przechowywać historie w ``/stories/``, a inna może używać ``/news/``.

source: Infinite flexibility
id: Fleksibilitas tidak terbatas
pl: Nieskończona elastyczność

source: URLs should be as flexible as possible. Any conceivable URL design should be allowed.
id: URL harus sefleksibel mungkin. Apapun rancangan URL yang dipikirkan harus diizinkan.
pl: URLe powinny być elastyczne jak to tylko możliwe. Każdy wyobrażalny URL powinien być dostępny.

source: Encourage best practices
id: Mendorong praktik terbaik
pl: Zalecane najlepsze praktyki

source: The framework should make it just as easy (or even easier) for a developer to design pretty URLs than ugly ones.
id: Kerangka harus membuatnya semudah (atau bahkan lebih mudah) untuk pengembang merancang URL cantik daripada yang jelek.
pl: Framework powinien pozwalać programiście łatwo (albo nawet łatwiej) tworzyć ładne URLe niż brzydkie.

source: File extensions in Web-page URLs should be avoided.
id: Berkas tambahan di URL halaman-Jaringan harus dihindari.
pl: Rozszerzenia plików w URLu strony internetowej powinny być unikane.

source: Vignette-style commas in URLs deserve severe punishment.
id: Koma gaya Vignette dalam URL pantas hukuman berat.
pl: Przecinki w URLach zasługują na surową karę.

source: Definitive URLs
id: URL pasti
pl: Ostateczne URLe

source: Technically, ``foo.com/bar`` and ``foo.com/bar/`` are two different URLs, and search-engine robots (and some Web traffic-analyzing tools) would treat them as separate pages. Django should make an effort to "normalize" URLs so that search-engine robots don't get confused.
id: Secara teknis, ``foo.com/bar`` dan ``foo.com/bar/`` adalah dua URL berbeda, dan robot mesin-pencari (dan beberapa alat penganalisa lalu lintas Jaringan) akan emmperlakukan mereka sebagai halaman terpisah. Django harus membuat sebuah usaha untuk "menormalkan" URL sehingga robot mesin-pencari tidak bingung.
pl: W zasadzie, ``foo.com/bar`` i``foo.com/bar/`` są dwoma różnymi URLami, roboty wyszukiwarkowe (oraz niektore narzędzia analizujące ruch w sieci) mogłyby potraktować je jako oddzielne strony. Django powinno postarać się "normalizować" URLe aby roboty wyszukiwarkowe nie były zdezorientowane.

source: This is the reasoning behind the :setting:`APPEND_SLASH` setting.
id: Ini adalah alasan dibelakang pengaturan :setting:`APPEND_SLASH`.
pl: To uzasadnia używanie ustawienia :setting:`APPEND_SLASH`

source: Template system
id: Sistem cetakan
pl: System szablonów

source: Separate logic from presentation
id: Pisahkan logika dari penyajian
pl: Oddzielenie logiki od prezentacji
